{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "A Seaton Dream",
    "url": "/Hotel_Review-g155019-d285136-Reviews-A_Seaton_Dream-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "5.0",
      "reviewCount": 143
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "243 Seaton St",
      "addressLocality": "Toronto",
      "postalCode": "M5A 2T5",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/16/f5/e4/7b/the-west-wing-room-is.jpg?w=500&h=400&s=1"
  },
  "description": "Private bathrooms for all! Experience casual elegance in downtown Toronto. We have carefully planned the decor of our home, which has been completely renovated, to ensure you instantly feel relaxed and comfortable. Whether you are enjoying the garden patio, drifting off to sleep on our comfortable mattresses, or savouring a delicious hot breakfast, we look forward to making you feel at home every minute of your stay.",
  "featues": [
    "Free parking",
    "Free High Speed Internet (WiFi)",
    "Wifi",
    "Breakfast available",
    "Adults only",
    "Baggage storage",
    "Non-smoking hotel",
    "Air conditioning",
    "Flatscreen TV",
    "Non-smoking rooms",
    "Family rooms"
  ],
  "reviews": [
    {
      "title": "An Amazing Bed and Breakfast Experience in Toronto",
      "text": "By far the best B&B we have ever encountered. Jamie and Alan were so personable and gracious in welcoming us into their home, neighborhood and city .  They even provided curbside service!  The neighborhood was safe and felt like home. The healthy and tasty breakfast meals were tailored to our dietary needs and much appreciated! The home was immaculate and the beds were a sleeper's dream!  We won't hesitate to recommend A Seaton Dream to others.  It was truly a dream stay that we won't soon forget!",
      "rate": 5.0,
      "tripDate": " June 2023"
    },
    {
      "title": "Great place to stay",
      "text": "This B&B is the best one we hv ever stayed at . Jamie was the perfect host, very friendly and helpful , room was very clean , and comfortable, great breakfast , Jamie I will miss your poached eggs , and your company, Jamie was very helpful with information getting around this beautiful city, everything was in walking distance, Jamie told us the best places to go , and how to get there, the street that the B&B is on is quite with trees,  perfect. wonderful experience staying at A Seaton Dream B&B  I would definitely recommend this lovely B&B if I go bk to this city I wd definitely book with Jamie thank you Jamie for making our stay wonderful , real and joy",
      "rate": 5.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Loved our stay!",
      "text": "Jamie and Alan are wonderful hosts, super friendly, welcoming, and helpful. Our room was comfortable, clean, and had everything we needed including a cozy balcony. The breakfasts were delish and the coffee was flowing! We have dietary restrictions that Jamie was careful to accommodate. We felt safe and sound at the Seaton and highly recommend!",
      "rate": 5.0,
      "tripDate": " September 2022"
    },
    {
      "title": "You could do better than this B&B!",
      "text": "The positive points about this B&B are as follows:1.  The location in terms of distance from the city centre is good as it is only some 15 minutes walk to the Eaton Centre.2.  The hosts are friendly and the atmosphere in the B&B is relaxed.  It is more like staying with friends rather than a commercial deal.3.  The breakfasts are both wholesome and sufficent for most peoples needs.4.  It was not particulary expensive.The negative points are:1.  The area that the B&B is situated in, is not the most salobrious.  Indeed on arrival by taxi from the train station I started to wonder if the driver was heading in the wrong direction.  The problem with the area for those of a nervous disposition is that the B&B is situated in the east side of the city.  As with most big industrial or port cities the east side tended to be populated by the workers and consequently was generally last to receive any positive attention from the city authorities. Whilst I had no particular problem with the area I could see where others would be put off as there are a number of single mens hotels and homeless refuges in the area, though not in Seaton Street itself.  If you are concerned about walking in this type of area, this B&B is not for you!2.  Seaton Street and its immediate environs are situated in an area that is presently undergoing something of a renaissance.  The B&B itself is an old period house that sits in a quiet tree lined street with similar type properties on both sides of the street.  This is obviously an area that is now being populated by the better off of the city and there is clear evidence of significant renovation and redevelopment of the existing property in the area, but there is still away to go.3.  If you visit the home website for the B&B, I would warn that in its present form it substantially oversells the property, e.g.  the west wing is really just the large front room of the property and the rear garden and sauna is not really something to write home about.4.  Whilst friendly and easygoing the guys who own the property need to realise that if they wish to encourage guests, particularly women, to avail themselves of the kitchen facilities then they need to ensure that it is kept clean and tidy at all times.  I am afraid that used dishes and pans left in the sink and on the cooker does not leave a good impression.5.  They also have to realise that guests expect to have their towels changed, or at least be offered a change, on a daily basis and that rubbish bins in the room should also be emptied.  We found that this was not done, even though I would describe myself as being a fairly low maintenance type of guest.6.  The \"shared\" bathroom was right out of the 1960's, however the B&B is closed for renovations for four months and the rooms are to be fitted out with en-suite facilities so this issue should be resolved.In conclusion, I was disappointed with the overall standard of the accomodation on offer.  This was my first stop on a five city vacation to Canada, which I was visiting for the first time.  I am glad to say however that this negative experience was not repeated throughout the rest of my journey.",
      "rate": 2.0,
      "tripDate": " September 2006"
    },
    {
      "title": "Not Such a Seaton Dream",
      "text": "If your hosts are going to be out of town, triple check your reservations and then check again.We called this B&B at the last minute after arriving in Toronto and finding the B&B we'd originally booked on line to be one step above a run down SRO hotel.  After hearing of our dilemma, the innkeeper told us we could have a room for one night, that the next two nights, the B&B was booked.  We decided that one night was better than none and that we'd relax and then search for a place to stay for the remainder of our trip.By the time we had trudged over with our suitcases to \"A Seaton Dream\", the friend filling in for the owners greeted us with great news. She had called the owners, she said, and reached them on their way to the airport.  We could have their room the following two nights.  We slept well and headed off for our first full day in Toronto. At 6pm, while we were across town, my husband's cell phone rang. It was the temporary host from A Seaton Dream.  She said she had made a mistake, and the room we'd been promised was no longer available.  It had been booked all along by a \"regular client.\"  She said she'd tried to call earlier in the day (she had been calling our home phone number in the US!).Not to leave us in the lurch, the substitute host said she'd booked us a \"beautiful\" room at another B&B down the street. Not quite. The \"beautiful\" B&B room was as small as a postage stamp, with a shared bath and an AC unit that was struggling to be cool. The kindly, but frazzled owner warned us that it may be a noisy night since the rest of his B&B was occupied with 10 members of a family reunion.   Between a rock and a hard place, we accepted the downgrade and returned to fetch our luggage from A Seaton Dream. When we tried to speak in person with the substitute hostess, she treated us like some kind of homeless people from the neighborhood.  I was told to keep my voice down because of the other \"guests.\" When asked to explain how this mix-up happened, she became belligerent and refused to explain how she'd made this \"mistake\". We then asked to use the computer to try to search for a better room and were told we could not.  But, most importantly, this woman never apologized.  If she had shown some empathy for our situation, that would have gone a long, long way.  People make mistakes.  We get that.  But good people apologize for making a mistake that sends paying guests off in the early evening to a room she had obviously never seen.We are seasoned travelers and have never been treated so shabbily.  Perhaps the owners of A Seaton Dream ought to be more careful in whomever they choose to run their business while they are away.",
      "rate": 2.0,
      "tripDate": " August 2010"
    },
    {
      "title": "Wonderful B&B",
      "text": "This was a great B&B to stay in. We felt so welcomed by our hosts. The room was great, as well as the breakfast every morning.I had originally planned to stay in a hotel, and am glad I chose this option. It is a lovely, cozy house to come home to at the end of the day.Everything was clean and well cared for.We were able to walk downtown within minutes, or take a street car to major attractions.I would definitely recommend this place!",
      "rate": 5.0,
      "tripDate": " May 2006"
    },
    {
      "title": "Sweet Dreams on Seaton Street",
      "text": "Firstly let me start by thaking other people who have written reviews about this place, it was this that prompted me to book this B & B.Our hosts Alan & Jamie were great, Jamie is a good cook, and we looked forward to our beakfast everymorning, because everyday was something different.The room we had was at the front of the house and it was lovely, tastfully decorated, and spacious. Both of us usually find hotel beds uncomfortable after a couple of days.  The beds at this B & B were so comfortable, and we had a really good nights sleep everynight.Considering we were only a 20 minute walk from the City Centre (Well the Eaton Centre) it was also so very peaceful. I wasn't looking forward to having to share a bathroom, but as they said in the advertisement, it was not a problem, even when the house was fully booked, we still did not have to wait for anyone else to vacate it before we could use it.On the day we arrived Jamie gave a few pointers on where we might like to eat, and all the places he suggested were very good, be warned the portions are on the large sizeNothing was too much trouble for our hosts, and you can be sure my husband and I will be returning again.  They are going to be doing some work on the property adding ensuite bathrooms and then re-decorating, so can't wait.I am only sorry I did not take any photos of the property for others to see how nice it was, but i'm sure anyone who stays won't be disappointedWe were going to stay in one of the hotels by the waterfront, and I am so glad we didn't, we were right in the heart of the community",
      "rate": 5.0,
      "tripDate": " April 2006"
    },
    {
      "title": "Fantastic!",
      "text": "We stayed here for a fabulous week in August and Jamie and Alan were the perfect hosts.  Fantastic breakfasts (we didn't have the same one twice), beautiful bedrooms and garden.  They don't have any en-suite, but we had the downstairs room and the bathroom was right across the hall and we had sole use of it.  They were really helpful with any queries we had, in fact they couldn't do enough for us.  We would certainly stay here again.",
      "rate": 5.0,
      "tripDate": " August 2004"
    },
    {
      "title": "Loved the coziness of this B&B",
      "text": "Inn was warm, friendly and comfortable.  Host Jamie was most welcoming and helpful with information about the neighborhood, places to see, etc.",
      "rate": 4.0,
      "tripDate": " July 2011"
    },
    {
      "title": "Fantastic accomodation, once again!",
      "text": "It is always a happy dream to stay at the Seaton Dream.  Jamie is a most accomodating host who will take care of any situation - meal preferences, room, directions to attractions, restaurant advisory.  We have stayed here often and have never been disappointed with our accomodations or the friendliness of Jamie and Alan.  Cheers, gentlemen, we look forward to our next visit.",
      "rate": 5.0,
      "tripDate": " August 2011"
    },
    {
      "title": "Like coming home",
      "text": "As the female half of a middle-aged couple, who has lived most of her life in a rural environment, my heart sank as we drove up Parliament street towards the B & B. I needn't have worried; although some of the surrounding location is run-down, Seaton Street is not, & A Seaton Dream most definitely is not. Recently renovated and beautifully finished, it offered us everything we could have wished for. The room was clean, comfortable & spacious, offering a real retreat should we need it. (we were in \"the West Wing\"). Downstairs, Jamie's wonderful breakfasts were served in the lovely light airy sitting/dining room. These were truly an experience in themselves; beautifully presented, well-balanced, substantial & very tasty. And as for our hosts, they kindly & warmly welcomed us into their home, & doing everything possible to make our stay as pleasant as they could, going well out of their way to help out with any difficulties we had, (none of which were anything to do with our accommodation & therefore not their problem). We would not hesitate to recommend  A Seaton Dream to anyone, & it will most certainly  be our first choice if we are fortunate enough to return to Toronto.",
      "rate": 5.0,
      "tripDate": " September 2007"
    },
    {
      "title": "An unexpected little getaway",
      "text": "This was my first stay in a bed & breakfast and I can honestly say that it exceeded my expectations.  The house, located in a charming Victorian neighborhood, was recently refurbished and is in beautiful condition.  Our room was clean and very private (we had the lower level room). Jamie and Alan were very helpful as far as recommending places to see and in giving us easy directions. From the house, we were able to walk to all of the attractions/areas of the city that we wanted to see.  All of our requests were accomodated by Jamie and Alan. The breakfasts, which were different each morning of our stay, were absolutely delicious!  We will definitely return to A Seaton Dream when we once again visit the beautiful city of Toronto.",
      "rate": 5.0,
      "tripDate": " June 2007"
    },
    {
      "title": "A Dream of a B &B",
      "text": "Our trip to Toronto was all the better for staying at the excellent 'A Seaton Dream' in very pleasant Seaton Street. Don't you just love it when people running a place get it right!  Very tastefully decorated, this is a stylish yet incredibly homely b & b - an absolute breath of fresh air for those wanting to avoid the faceless, couldn't-care-less hotel chains.  Jamie & Alan are superb hosts; laid back but very efficient and quick to help with anything you need.  Breakfast truly delicious - and chatting to fellow guests, a very relaxed way to start the day. Without doubt, one of the friendliest and most interesting places we've ever stayed.  Highly recommended.",
      "rate": 5.0,
      "tripDate": " May 2007"
    },
    {
      "title": "Highly recommended!",
      "text": "Lovely room with a beautiful large balcony overlooking garden; Jamie is a great host and his breakfasts are imaginative, delicious and huge! It's next to Cabbeage Town, which is a lovely historic area with great restaurants. It's about 15 minutes on foot to the centre of town.",
      "rate": 5.0,
      "tripDate": " August 2015"
    },
    {
      "title": "B&B at its best!",
      "text": "Very friendly hosts,a cosy and absolutely clean room, quiet, overlooking the backyard with a nice personal porch,great breakfast,interesting other guests,located in a wonderful street with nice little wooden houses!Downtown Toronto just a stroll away.And at nights, a taxi back to Seaton Street is only 10 Dollars.VERY RECOMMENDABLE!",
      "rate": 5.0,
      "tripDate": " August 2014"
    },
    {
      "title": "A mixed bag",
      "text": "We chose this B & B based on the good reviews and beautiful photos. Upon arrival we were greeted by Jamie who showed us to our room, and asked about any dietary preferences to which my husband said he does not eat eggs. The first morning was an omelette - it was put down and Jamie was off before we had time to even realise what it was. We made several polite suggestions that he did not like eggs, to which Jamie did not appear to get. My husband again explained  he did not eat eggs when his plate was taken away. We figured everyone has those days, as the next morning we had pancakes so assumed the message was received. But for our third and final morning - another omelette (we had given up and were just interested in getting on with our day). We couldn't have been any more clearer without being rude, and thankfully my husbands was just a dietary preference and not an allergy. The food itself was nice - if you don't like eggs, I'd probably wear a sign on your head though. Although we found the hosts cordial and the accommodation nice, it was not a true B & B experience and did not match up to others we stayed at in Canada. The house had more the feel of a share house, not the welcoming atmosphere of a B & B. The hosts did make an effort with travel books and brochures, but could do more to interact with guests, especially at breakfast and to advise them of local attractions. We had very little conversation with the hosts, other than checking in and a few sentences with Jamie at breakfast as he put the plate down and hurried away. We have probably been very spoilt with other places we have stayed, and enjoy staying in B & B s for the interaction and knowledge you get from staying with locals. If we just wanted a nice room and breakfast, we'd stay in a hotel. On a positive, the room was nicely decorated and had a good street view and a jet tub (we stayed in the west wing). The outdoor courtyard was very pretty, and worth having a look at it. The room however, had no air-conditioning, and no window to open so the room was stuffy. Also, the in room safe did not work. The house is also well located to down town and has plenty of restaurants nearby. We wouldn't stay again, and our stay was rather average - but this may just be a matter of personal taste.",
      "rate": 3.0,
      "tripDate": " July 2012"
    },
    {
      "title": "A truly perfect stay!",
      "text": "After a smooth and uneventful journey into Toronto, I arrived at A Seaton Dream with a bit of trepidation as something always tends to go wrong when I travel. But those feelings were quickly squelched as I was greeted at the door by Alan and shown around the lovely B&B.I stayed in The Retreat - the basement room - for two nights. It is a large, comfortable, well-appointed, bright and super clean suite. It's the only room on that level, so if you're looking for a quiet, private area (perhaps to do some work like I was?), it's an ideal space. Jamie and Alan are amazing hosts - friendly, very easy to talk to, but not overbearing or pushy. (And as the previous reviews have all mentioned: Jamie's cooking skills are incredible! I definitely felt spoiled.) Alan gave me a great overview of the neighbourhood, including restaurant recommendations, area highlights and transportation information, so I was all set for my time in the city. I will definitely be staying at this B&B anytime I'm in Toronto, for business purposes or for a personal holiday!",
      "rate": 5.0,
      "tripDate": " September 2010"
    },
    {
      "title": "Warm and wonderful home",
      "text": "We spent three nites at A Seaton Dream and were so pleased.... Jamie and Alan were warm and wonderful hosts, welcoming us and the other guests into \"our home away from home\".  Jamie helped us with restaurant choices, directions, and advice as this was our first visit to Toronto.  The B & B is on a residential, tree-lined street with friendly neighbors in eclectic Cabbagetown, and is within walking distance of a number of prime Toronto areas and public transportation.  Everythng in the home is modern and clean, and Jamie's breakfasts were delicious and beautifully presented.  We very much enjoyed chatting with the other guests during breakfast., and Jamie soon learned what we all liked.... By the end of our stay, we felt we had made a friend.",
      "rate": 5.0,
      "tripDate": " June 2010"
    },
    {
      "title": "Jamie & Alan are the BEST!",
      "text": "There is just one thing to say: GO THERE!!!Our stay has been a real seaton dream!Gerald & Rudi / Vienna",
      "rate": 5.0,
      "tripDate": " June 2008"
    },
    {
      "title": "Perfect Hosts - Gorgeous House.",
      "text": "A Seaton Dream is without a doubt the nicest B & B you will find in Toronto. Hosts Jamie and Alan cook up fantastic breakfasts, give advice on where to go and what to see in Toronto and make you feel totally at home. Brilliant! I will definitely come again ;-)",
      "rate": 5.0,
      "tripDate": " October 2007"
    },
    {
      "title": "An oasis in the Big Smoke",
      "text": "Spent two nights, Alan was a perfect host (Jamie was away).  He was extremely welcoming and helpful (insisted on carrying our two heavy suitcases upstairs), gave us good advice on sightseeing and local restaurants - and can he cook a great breakfast!  Our room (West Wing) was charming and modernised (the house is 102 years old) , clean and well appointed.  Just a short walk to the city centre.  And a short walk to lots of great restaurants.  Check out The House of Parliament for upmarket pub-fare. Wouldn't hesitate to go back to A Seaton Dream and would definitely recommend.",
      "rate": 5.0,
      "tripDate": " September 2011"
    },
    {
      "title": "Great B&B, away from the crowds but close enough to Downtown",
      "text": "Pretty street with old houses, lots of parking. 5 minute walk to Cabbagetown main street, 20 minute walk to Dundas Square, 5 minutes to street car pick up. Cosy, well appointed rooms, only problem is loud people in the road below late at night. Wooden floors mean lower rooms can hear all movement above. Jamie was so friendly and helpful and breakfast was great.",
      "rate": 4.0,
      "tripDate": " September 2010"
    },
    {
      "title": "Simply the best service I have ever had in a hotel/B&B... just wonderful",
      "text": "I can honestly say this B&B was one of the highlights of our month long stay in Canada. Alan and Jamie are wonderful hosts and the house is immaculate, its refreshing to find hosts who are evidently so keen to make your stay memorable! The house is on a quiet, green street about 10 - 15 minutes walk from the centre of town - very practical for those wanting to explore the city and far enough away from the centre to avoid the hustle and bustle when you need to.The rooms we stayed in (the West Wing followed by the Retreat) were extremely comfortable and surprisingly spacious for a B&B. The West Wing in particular had a huge bathroom with a jacuzzi and a king-sized bed. Both were well air-conditioned, extremely welcome considering the heat wave, and had free wi-fi which was very useful to us on such a long stay in Canada. To be honest the Retreat (which we stayed in for the last three nights) was not as good a room as the West Wing, if only because it lacked the light and views from the street outside, but it was still a brilliant place to stay.What can I say about the hosts and the service - I think it's all captured in the title of this review. My partner and I felt after only a few days like we were staying with friends. Alan's cooking is sublime (although even I was challenged to finish some of the larger breakfasts!) and throughout our stay he went to inordinate effort to make us comfortable - even to the extent of going out specially to get gluten-free food for my girlfriend. Both Alan and Jamie were also able to offer advice about the city, good restaurants, how best to get around and the best places to visit  - invaluable as we wanted to experience as much of the city as possible during our stay.If it is any reflection on how much we enjoyed our stay here, the only downside to our visit was that Alan and Jamie had to leave (ironically going on holiday near where we lived in the UK) just before the end of our visit - although we were especially touched that they left a chilled bottle of wine just to apologise for any inconvinience (there was none Alan - Rosine was lovely!).I couldn't rate A Seaton Dream more highly. If you're travelling to Toronto and you can get a room - go here. We certainly will be on our next visit! Alan & Jamie thank you both for a wonderful stay.",
      "rate": 5.0,
      "tripDate": " August 2010"
    },
    {
      "title": "Alan and Jamie are super hosts",
      "text": "A Seaton Dream is a nice, clean, unpretentious B&B. We've stayed in a lot of B&Bs over the years and have experienced all kinds of hosts.  Alan and Jamie, the owners of A Seaton Dream, are fantastic, easy people who have created a very friendly environment in their home. They make things seem easy and never give you the feeling that anything is a bother.  Their brand of hospitality should be a model for other B&B owners.We stayed in the 'west wing', which is a nice, clean room at the front of the house ($159/night).  The photos on the website are accurate.  The space has been recently renovated so the floors and walls are pristine (not a speck of dirt anywhere).  The furnishings throughout the house have a simple and uncluttered feel to them.  They are not luxurious but I like the feel to the place:  simple and straightforward.   The west wing is a good sized room (but not a wing).  The en suite bathroom feels more luxurious as there is a huge jetted tub and lot of polished stone tile.   It's a good size bathroom.  I'd rate the linens are fair-to-average, nothing special. We liked the location and felt that it was great to stay in a real neighborhood.   It is not as central as staying downtown or in Yorkville, but we enjoyed it for something different.  Cabbagetown is not far away and is worth exploring.  As others have metioned, the house is located in an area that is \"in transition\" but we were not concerned.  This particular block of Seaton is adorable and is filled with early 20th century homes that have been renovated.   There is good transport to the downtown area by streetcar (just a block and a half away) or bus.  It's also easy enough to walk.  St. Lawrence Market is just 25 minutes by foot.  The streetcar will take you east to west toward the AGO or Chinatown.   Buses will take you toward Union Station.   If you have your own car, street parking is allowed, but you must buy a permit (available thru Jamie and Alan) for about $20 for the entire stay.   It was safe. I can't say enough good things about Alan and Jamie.  They do kind things that are above and beyond.  For example, they offered us free tickets to a film at the Toronto Filmfest (going price for rush seats = $40+).   We could not use them, but another couple did and were pleased as punch to participate in this event.  How many B&B hosts would do this?  The next morning we all reveled in hearing their story of going to the film fest.  It was priceless. Overall, we enjoyed this B&B very much.  There are many, many places to stay in Toronto, but we would return because of the hosts alone.",
      "rate": 4.0,
      "tripDate": " September 2010"
    },
    {
      "title": "What a great stay",
      "text": "We treated like old friends. Jamie prepares a wonderful breakfast.",
      "rate": 5.0,
      "tripDate": " October 2010"
    },
    {
      "title": "Very nice stay",
      "text": "We were in Toronto for a wedding and could only stay for two additional days but had a great time. There is a lot to see and we plan to return soon. Our three-night stay at the B&B was truly wonderful, with great breakfasts and comfortable nights.",
      "rate": 4.0,
      "tripDate": " November 2009"
    },
    {
      "title": "Great stay in Cabbagetown",
      "text": "After a full month in a condo in the King West area of Toronto, we had our final few days at A Seaton Dream in Toronto's Cabbagetown neighborhood. We could not have been happier with our stay, really. We stayed in the \"West Wing\" room, which was fantastic. It was so nice to have a comfy bed, excellent central air conditioning, speedy WiFi access, a gorgeous washroom, and hosts who not only cooked up a fantastic breakfast (okay, maybe just one of the hosts (Jamie) is responsible for that), but were also friendly, cheerful, and very helpful. But let's get back to the breakfast part of this bed & breakfast: Jamie is an excellent cook. Each of the three days there we were greeted with some very tasty and sizable meals. Hats off to him for his creativity and skill in the kitchen. Jamie and Alan both are excellent B&B hosts: neither too intrusive or aloof. They seem to have the perfect mix of being helpful and friendly, but still giving you your space and freedom in their home. This B&B is clean and comfortable throughout. Even though it's in an older Victorian-era home, the modern amenities abound. Clearly the guest rooms on the second floor (we never saw the other one in the basement) were recently renovated. The hardwood floors shine, the washrooms are spotless, and the linens were high quality. So after a month in Toronto we thought we would be chomping at the bit to go home while at A Seaton Dream. However, our stay there ended up being the best three days we had in Toronto. We highly recommend A Seaton Dream!",
      "rate": 5.0,
      "tripDate": " July 2010"
    },
    {
      "title": "Above and Beyond!!!",
      "text": "It's been about three months since our stay.  Alan and Jamie really went out of their way to make our stay fantastic.  We were in Toronto for the film festival and staying with friends, but decided to stay for two nights.  We liked it so much that we ended up staying for four more nights, and Alan and Jamie went out of their way (literally) to accommodate us for the rest of our stay.  Aside from the yummy breakfasts and awesome home, both had a lot of information which helped with planning our days.  The room we stayed in was newly renovated and nicely decorated.  One of the best things about A Seaton Dream is how breakfast really encourages the guests to get to know each other.  We met some great people and had some great laughs.We will definitely be returning!!!",
      "rate": 5.0,
      "tripDate": " September 2007"
    },
    {
      "title": "Sweetest Dreams Ever!!!",
      "text": "This is without a doubt one the best B&B's we've ever stayed in. My husband & I spent  2 nights there in the beginning of May 2010 in the West Wing. Jamie & Alan were just wonderful. They made us feel so at home. After spending a day walking around we arrived back at the house to find that both our hosts were in the living area having a chat & a few drinks with a friend of theirs & another guest. We then joined them & had a wonderful evening. You don't even need to leave the B&B to socialise :-) On top of this Jamie is a magician in the Kitchen!! The breakfasts are just fantastic!!! The house is very centrally located just minutes away from the street car or a 10-15 Minute walk to Dundas Square. The value for money is unbeatable. This house is a must for anyone travelling to Toronto. Normally I'd prefer to keep such great places a secret but that just wouldn't be fair :-) Thanks for making our first trip to Canada have a perfect start!!!",
      "rate": 5.0,
      "tripDate": " May 2010"
    },
    {
      "title": "Catch your \"dream\" to stay",
      "text": "You can call it, a swiss lady lost in Toronto for her first time in Canada, knocked on the not primarily supposed door and was be welcome by the owners although she hadn't a reservation. Take a cup of tea and we will find your B&B you reserved, what he said to me (but with no success, they never answered nor on e-mail, nor on phone). Well, I appreciated very much this great hospitality. The house is charming as the rooms, clean bathroom and one room has lovely terrace.The cost of the location seems to me very correct (what I can compare with european amenities).I appreciated very much the friendly hospitality, but most of all, sitting at the breakfast table in the morning and share the first cup of tea or coffee with other visitors, free to tell your stories or not. It's called \"faire connaissance\", simply for a short time.Thanks to Jamie and Alan.",
      "rate": 5.0,
      "tripDate": " June 2010"
    },
    {
      "title": "Gracious Hosts, Graceful Accommodations",
      "text": "A Seaton Dream is one of the finest B&Bs I have ever enjoyed. The property is very well appointed and features a garden oasis in the back yard. Despite being over a century old, the B&B has been renovated with impressive modern amenities. Yet, the house still retains the charm of yesteryear.Positives include:  - the wonderful host, Allan, who is gracious, warm, and charming. He was kind enough to give us extra time on the day of our departure- hearty gourmet breakfast was tummy-filling and perfect start to the day - the bathroom in our room, The West Wing, was outstanding. The sink and huge bathtub are stunning. Nice towels and lighting too, and we appreciated the tasteful built-in shampoo, conditioner, and body wash dispenser.- decor and aesthetics are first rate- location: Cabbaggetown is one of Toronto's oldest and most charming neighbourhoods. Seaton St is classic Cabbagetown; rows of Victorian era, wooden porch homes and townhouses on a quiet, tree-lined oasisNegatives include:-Noise bleed. This is an old house and not a hotel, so noise easily travels up through the walls and floors. We could easily hear conversations in the living room, and the stairwell is also noisy, due to the echoes off the lovely wooden floors. A floor runner would help alleviate some of this ambient noise. -Location: the B&B is actually located on the southwest fringe of Cabbagetown; meaning that it is bordered on the west by Regent Park, by the south by Moss Park, and by the north by St James Town, all primarily populated by low-income residents living in social housing. There are many homeless people congregating in these neighbourhoods. Guests from other large cities (Montreal, Chicago, New York, etc.) will barely blink an eye but I think it is important to honestly point out that the 15-minute walk from the B&B to Dundas Square/Yonge Street is quite dodgy, especially at night.  Overall this is an impressive B&B and I do certainly recommend it, despite some of the negatives I mentioned above. The highlights definitely outrank the lowlights and with good sense and the right planning you would be hard-pressed to find a better B&B in Toronto.",
      "rate": 4.0,
      "tripDate": " September 2011"
    },
    {
      "title": "A Wonderful Dream",
      "text": "This was our second time at A Seaton Dream and three years after our previous stay, we were delighted to see that everything was wonderfully the same.  A Seaton Dream is truly \"a home away from home\". Jamie and Alan could not be more welcoming, charming hosts, and will go way out of their way to help with whatever you may need. The rooms are spotless and comfortable, the breakfasts hearty and delicious. The location is another bonus -with a transport pass you can get anywhere easily. This is truly our must-stay place for Toronto.",
      "rate": 5.0,
      "tripDate": " July 2011"
    },
    {
      "title": "One of the best holidays we ever had and were sad to leave.",
      "text": "We received a warm welcome even though our plane was late arriving and from then on, we were looked after and made to feel at home and did not feel like strangers but friends.  The room (with the balcony) was lovely and relaxing.  Hearing the sound of the wind chimes in the back garden and the water feature trickling away enhanced this. The public transport is very close and a 15 min walk takes you to Dundas Square which is a hive of activity and the shopping mall (Eaton Centre).  From here you can access the tourist buses and buses, streetcars and metro.  Despite the closeness of this Seaton Avenue is a peaceful, tree-lined street in a residential area, so you feel less like a tourist and more like a visitor.  Breakfasts were a  highlight of the day, each one a work of art and cooked and served to a high standard by Jamie who is an excellent host, warm and caring - nothing was too much trouble even my husband's quirky food dislikes. It was especially sad to say goodbye to him on our last day.  Everything was clean and very tidy.  I would highly recommend this establishment - much better than an impersonal hotel where you are just a number!",
      "rate": 5.0,
      "tripDate": " June 2011"
    },
    {
      "title": "Good basic B & B",
      "text": "While this was a beautifully restored Victorian house, the neighborhood was \"emerging\" and the hosts need some polish.The immediate locale was fine but when we walked to the city center (which was convienient) we passed blocks of questionable areas.  Even though we are city folk (Philadelphia) we tooks cabs after dark and had I not been with my husband I wouldn't have been comfortable walking during daylight.Breakfasts were delicious and varied and more than 2 people could handle, but other amenities needed some polish.  Our trash wasn't always emtied and we had one low grade towel each for our 3 day stay.  I also felt intrusive having to find space in the refrigerator to place a bottle or 2 of water.",
      "rate": 3.0,
      "tripDate": " July 2007"
    },
    {
      "title": "Feels like I stayed with a friend",
      "text": "This a true bed and breakfast, in a quirky and unique historical neighborhood conveniently located close to many interesting areas in Toronto. The owner is a delight to be around, and really does cook a mean breakfast, like the other reviewers say. I highly recommend the berry pancakes.On a fussy note, if you have trouble sleeping unless you're in a pitch dark room, bring your sleeping mask. Other than that, the place is spotless, the jacuzzi in the West Wing bathroom is huge, and let's not forget the fish tank. Did I mention the place is feng shui'd out?Oh, and one last thing. If you are not really looking for a B&B, but instead want to have a 5-star luxury experience where you can ignore or be mean to the people who are servicing you, please stay at a hotel.",
      "rate": 4.0,
      "tripDate": " November 2010"
    },
    {
      "title": "LOVED IT & ENJOYED IT ALL THE WAY!",
      "text": "I had a hard time finding a hotel for the first weekend in March, and was SUPER lucky to find \"A seaton dream\" as an option.  How lucky I was.  Jamie and Alan are terrific people; their home couldn't be cleaner, the french- victorian rooms are precious with a touch of contemporary  fine taste. I travel on business globally at least once a month,  it was fantastic to enjoy Jamie's home made breakfast. Jamie and Alan go above and beyond to make their guests feel like they are home.  The last night I stayed in Toronto they treated me with a nice bottle of Argentinean wine and a great conversation.  Again they are outsanding nice people.I can't wait to go back.  I used to stay at The Drake, those days are gone, I won't stay anywheres else but at \"A Seaton Dream\" with my new friends Alan and Jamie.",
      "rate": 5.0,
      "tripDate": " March 2011"
    },
    {
      "title": "Outstanding Service, Beautiful Atmosphere!",
      "text": "A Seaton Dream was our first experience at a bed and breakfast. Not knowing what to expect, we were optimistic about our stay. Easy to locate downtown Toronto and close to the TTC we had no problem finding our way around. Jamie & Alan were great hosts! They made sure we had everything we needed and made us feel very welcome. Not only was our room quiet, clean and fully equipped with high speed internet, cable television and a beautiful shower, the breakfast in the morning was outstanding! I would recommend this place to anyone. Thanks again guys for the top notch service!",
      "rate": 5.0,
      "tripDate": " February 2011"
    },
    {
      "title": "Great breakfast",
      "text": "Lovely B&B - nice modern facilities, quiet street and a great breakfast. Thank you Alan for being such a lovely host with 2 great breakfasts, excellent local suggestion for dinner. Look forward to coming again.",
      "rate": 5.0,
      "tripDate": " September 2011"
    },
    {
      "title": "Perfect Accommodations!",
      "text": "If you're looking for an alternative to a stuffy hotel room than this is it! The Seaton Dream B&B was quiet, comfortable, and relaxing. The hosts were warm and inviting and accommodated all of our needs and offered helpful advice and assistance. They gave us maps and tips on things to see and do in the city. The complimentary breakfast was better and healthier than any hotel restaurant could've offered. The room was cozy and clean. The in-suite bathroom was beautiful and very clean!We will definitely come back to the Seaton Dream B&B next time we need accommodations in Toronto. Jenn and Mark (Ottawa)",
      "rate": 5.0,
      "tripDate": " February 2011"
    },
    {
      "title": "Had a great time and some very delicious breakfasts @ Seaton!",
      "text": "My wife and I decided to visit Toronto and we wanted to stay at a place where we would be comfortable as well as start each of the days of our visit with a good breakfast. A Seaton Dream delivered on both of these needs and we had a great time. Alan and Jamie were wonderful. We could not have gotten better treatment from them. They were extremely welcoming and they gave great advice as to where to eat in the neighborhood for local faire and also in recommending the MUST-SEE spots to visit in Toronto.Jamie is an incredibly good cook. The breakfasts we had were absolutely great.They are very accomodating and my wife and I could not have been happier at their bed and breakfast. It was certainly a welcome change from typical hotels and we recommend them whole-heartedly to anyone who will be staying in Toronto.Thanks again to Alan and Jamie for a wonderful time!",
      "rate": 4.0,
      "tripDate": " June 2008"
    }
  ]
}