{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Ada's Guesthouse",
    "url": "/Hotel_Review-g155019-d2225473-Reviews-Ada_s_Guesthouse-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.0",
      "reviewCount": 60
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "29 Linden St",
      "addressLocality": "Toronto",
      "postalCode": "M4Y 1V5",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-s/02/6f/c0/1b/ada-s-guesthouse.jpg?w=500&h=-1&s=1"
  },
  "description": "AWelcomeAda's Guesthouse is located in the central downtown area of Toronto, 2 minutes walk to Sherbourne Subway Station on the Bloor Subway line. We are a short walk to Church Street Village and Yonge & Bloor St. shopping.The whole house is air conditioned. Every room is with private ensuite bathroom. You can view photos of each room, and read what each offers, heredas Guesthouse is located in the downtown area of Toronto, 2 minutes walk to Sherbourne Station on the Bloor Subway line. We are a short walk to Church Street Village and Yonge & Bloor St. shopping.All rooms are clean and quiet with very comfortable furnishings.",
  "featues": [
    "Paid private parking on-site",
    "Free High Speed Internet (WiFi)",
    "Wifi",
    "Free breakfast",
    "Baggage storage",
    "Non-smoking hotel",
    "Laundry service",
    "Additional bathroom",
    "Desk",
    "Safe",
    "Seating area",
    "Microwave",
    "Refrigerator",
    "Bath / shower",
    "Complimentary toiletries",
    "Non-smoking rooms",
    "Suites",
    "Family rooms"
  ],
  "reviews": [
    {
      "title": "Comfortable central location",
      "text": "This is quite a difficult review to do as I was very disappointed on arrival, but please read on before dismissing this establishment.  The only literature I could find was that it had been recently renovated and the pictures looked lovely.  I also found out that it had only been just put on the market in November of last year and I couldn't find any reviews, so we decided to give it a chance.  I have to say that the property doesn't look much from the outside, although I expect they have concentrated on getting the rooms ready.  When we arrived the hall carpet was filthy which really coloured my view of the whole place, however, the manager did say that it was being replaced the following week so that should be all different by now.  The manager, Paul,  is a delight actually.  Very friendly and easy to approach.  He knows the area very well and has lived all over the world, you are sure to find common ground with him.The rooms were comfortable, but I would say the finishing touches had been rushed.  For example, the paintwork wasn't very good and the bathroom looked second hand (for a recently renovated place).  It was clean though.The guesthouse is very close to the gay village which has an excellent atmosphere and is great if you like sitting out in the evening for a meal or just a drink.  We didn't have a bad meal down there ( I think we tried 4 different places in all) and the service there was of exceptional standard.  There are plenty of different shops nearby too.  It is a quiet area and we felt very safe there.The only complaint we had, and this is actually not anything to do with Ada's Guesthouse, was the breakfast.  You get vouchers for breakfast at Eggtastic which is across the road.  There is a set (cooked) breakfast for the value of $7, this includes the tax.  So if you want to have a breakfast other than the one on the voucher you have to remember that you need to add tax on the menu price, which will take most of your options to over the $7.  We stayed for 6 nights and there's just no way we could eat that breakfast everyday.  We did have other things on the menu and paid the difference, but this confused the waitresses who over-charged us every single day.  They just couldn't seem to add up the bill and then deduct $14 (for two people).  So, watch this.  It might be worth mentioning to the guesthouse manager if you have a similar problem though, they might want to change the breakfast venue if it happens regularly.  Be aware too, that when you stray from the fixed menu, your coffee is then charged separately, bottomless cup, but still...Having said this,  we would probably stay there again as it was a nice area and it was easy to get to, well everywhere in Toronto.  I would probably ask for a reduction in price and sort my own breakfast out though (there is a fridge and microwave in every room). The bed was very comfortable, plenty of room for storage of suitcases and the sound-proofing was good.  On the whole, a decent place with some room for improvement which I am sure they will sort out, they'd only be open 6 weeks when we arrived, so I would say give it a chance.",
      "rate": 3.0,
      "tripDate": " July 2011"
    },
    {
      "title": "Not bad!",
      "text": "All in all this was a pretty average stay! We got a very good price so we can't be too unhappy with this place. The man who checked us in was very friendly, we saw him a couple of times outside and always said hi and asked how we were. The room was very basic and quite clean, it has everything you need really. The shower curtain did come down one day but someone came to fix it right away. TV and Internet signal were very good! It is located very close to sherbourne station which is convenient for transfer to and from the airport, but it is quite a long walk to the harbour front, around an hour walk!I must say that the pictures on the website are a lot lot nicer than the place is in real life, but like I said, the price was good for downtown Toronto and although basic, it does have everything you need!",
      "rate": 3.0,
      "tripDate": " January 2015"
    },
    {
      "title": "You get what you pay for, sort of.",
      "text": "While I expected to get the bare minimum here for such a low price, I expected a bit more in terms of cleanliness. There really was no assistance from the guesthouse. We were checked in and that was that, there is no front desk or customer assistance. We were supposed to get a free breakfast but if we can't get in touch with anyone at the house....you get the point. I've stayed at other hostels in private rooms in Toronto for slightly more but I would gladly pay $5 more per night for a decent bathroom that's clean (not full of hair that isn't mine) with a functioning shower head. Beware drivers, parking is NOT included either so you'll have to risk parking in the residential area without a permit or spend some cash for a parking garage.",
      "rate": 2.0,
      "tripDate": " May 2013"
    },
    {
      "title": "Extremely disappointing ",
      "text": "I decided to stay here based on previous reviews but I have to say, I think a lot of them were very misleading. This place offers a room with a bathroom that is close to the subway and those are the only positive things I can say about it. The main issue is the complete lack of cleanliness. There is mold on the bathroom ceiling, black marks all over the walls, a dirty shower curtain, stained carpet and the valence of the bathroom window is filthy. The worst part is it wouldn't even be that hard to fix (wash your walls and change the shower curtain???) but clearly the owners just don't take any pride in their property nor do they care about your comfort. Aside from that the shower alternated scalding hot and freezing cold water so that taking a shower was super unpleasant, the mattress was old and you could feel the springs, and there was only one little blanket on the bed and I was freezing the whole time. Extremely disappointing, worst place I've ever stayed in Canada by far.",
      "rate": 1.0,
      "tripDate": " May 2017"
    },
    {
      "title": "More Flophouse than Guesthouse",
      "text": "This place has a great location, but not enough of a benefit to justify the cost when for a few extra dollars you can stay at another hotel and actually have a clean room and maid service.  I had made the reservation on line based on the website, however when I arrived the website had obviously been done a long time ago because this place is in disrepair and filthy.  All I can add beyond the pictures posted that I took is that the manager/owner appears to be a retired person who just wants to get as much money out of this place as possible because he has not repaired the place and tried to overcharge me when I checked in.",
      "rate": 1.0,
      "tripDate": " May 2013"
    },
    {
      "title": "Great Toronto B&B",
      "text": "I have stayed at Ada's guest house twice while volunteering at TIFF. It is a great location and very close to the Sherbourne subway station.Each room has a full bathroom, fridge and microwave, and large TV. I had room 7 this year; last year had room 1 which was larger and on the ground floor. However the room upstairs was more than adequate. The bed was very comfortable and I appreciasted the WiFi.My only negative was the bathroom could have been cleaner but Norbert (manager) was most appologetic and planned to talk to the cleaners. The rest of the room was very clean.Next year I may pass on the breakfast offered at Eggsmart restaurant across the street as there is a No Frills grocery store close by and negotiate a lower price and ask for a coffee pot in the room. I love the quiet location, will be back next Film Festival!",
      "rate": 4.0,
      "tripDate": " September 2012"
    },
    {
      "title": "Bedbug found in room.",
      "text": "My husband and I stayed for 2 days.  Small cheap room, conveniently located. However we found a bedbug on our 2nd night. I’m a nurse and my husband is a community mental health worker so we are well aware of what they look like. We had to bag all our stuff and hot wash it before our next stop. We lost a day of our trip.  I requested a refund for 1 night and asked the manager to let me know the hotels action plan as bedbugs are a public health issue. I was told the owner would contact me, but after leaving 3 messages, I suspect that they have no plans to call me. If you stay there, it is at your own risk. I don’t think they are taking the proper steps to manage the problem.",
      "rate": 1.0,
      "tripDate": " April 2019"
    },
    {
      "title": "Cheap and cheerful",
      "text": "Guest house very close to the tube station and the supermarket is literally across the street.We got a triple room, top floor, very spacious with a kitchen and the third bed was in the living room so.. very good for privacy.",
      "rate": 4.0,
      "tripDate": " September 2018"
    },
    {
      "title": "The best place",
      "text": "I was visiting Toronto for two days and I found this place online. It's a small house with only a couple of rooms. The room was nice and clean also the bathroom was really nice although it was really small. It surprised me that the room has a with pullout couch that was really comfy and also clean. The bed wasn't as comfortable as it looked but still I got to sleep great. Also the neighborhood is really nice still downtown Toronto only 20 minutes walk from Royal Ontario Museum, TTC stations are even closer so it's a great place to stay at if you want to do the sightseeing in Toronto.I would recommend this place for younger people, couples or friends traveling to Toronto. And if I find myself visiting Toronto again, I'm sure I'm going to stay there again.",
      "rate": 5.0,
      "tripDate": " August 2017"
    },
    {
      "title": "noisy place",
      "text": "very basic accommodation, a single functioning TV channel, no coffeemaker, very poor soundproofing makes you hear all sorts of sounds and voices around the house- makes it impossible to relax and to go to sleep until everyone else calms down.",
      "rate": 2.0,
      "tripDate": " March 2016"
    },
    {
      "title": "Not bad!",
      "text": "We stayed here for 3 nights on a mini vacation to Toronto.  It was close to the subway, and in a part of town that we wanted to be in.  We only wanted a place to sleep at night, as we were busy sight-seeing during the day, and dining at night in nearby restaurants.  It is a very basic place to stay - no staff, no room service, no house keeping.  Bring your own toiletries, or buy them across the street at the variety store, as they don't provide.  I feel that the price was great for Toronto and enjoyed my stay.  The room was clean and the bed comfortable.  It's a quiet place, and suited our needs perfectly.  If you require things like housekeeping, this isn't the place for you.  If you just need a place to sleep in a quiet neighbourhood while you go about your business, then great! We walked at night and found nice places to eat, and took the subway during the day to see attractions.  It was perfect.",
      "rate": 4.0,
      "tripDate": " August 2015"
    },
    {
      "title": "Disappointing",
      "text": "The location is great. Very central and close to major Toronto attractions.I realize that for the price you cannot expect much in terms of comfort. The pictures of the rooms are very misleading and our \"tastefully decorated\" room was scarcely furnished, cold, dark, and uncomfortable. The TV didn't work properly and the air conditioning was way too cold. More concerning, the room and bathroom were poorly cleaned with ominous stains on the walls and foreign hair all over the bathroom. Furthermore, my reservation confirmation said that onsite parking is available and reservations are not required. However, upon arrival we learned that parking required reservations and was thus not available to us. After driving around the neighborhood for a little over an hour, we found a 24-hr garage a few blocks away that charged $18 per day, which needs to be factored into the costs of the room. Next time I'd pay $18 more for the room and find a place that offers on-site parking. This place is ok when you're traveling on a budget, but don't expect much and you won't be disappointed.",
      "rate": 2.0,
      "tripDate": " July 2014"
    },
    {
      "title": "Comfortable in Toronto",
      "text": "I stayed here a few months back and stumbled across it looking for a guesthouse or hostel to stay at. We rocked up in the early afternoon after a flight from New York and found the place walking from the train station relatively easily. We did have to wait a bit at the front door to be let in but only one person was showing people around 2 guesthouses (the other one was around the corner) but it wasn't too bad outside.The room was comfortable and the bathroom looked fairly new. The shower had good pressure. The bed was comfortable. My only issue was the curtains did let in a bit of light, either from the street lights or the sun early in the morning, but apart from that no issues.",
      "rate": 4.0,
      "tripDate": " September 2013"
    },
    {
      "title": "NYE in Toronto",
      "text": "Perfect place to stay a few nights in Toronto. Good price and good location. Not far away from the next subway station, few food places around and we had a really nice room: comfy double bed, nice couch, fridge, water cooker, tv, everxthing you need for a few days. Parking was available as well. I would go back. Just maybe in the summer next time bc this winter was just a little to chilly :D",
      "rate": 4.0,
      "tripDate": " January 2014"
    },
    {
      "title": "Little gem",
      "text": "Great location and great basic room in a fantastic neighborhood. All the staff were friendly and helpful and it delivered in all my expectations. Rooms are bijou but thats what I would expect for the price and location .I can highly recommend this guesthouse",
      "rate": 4.0,
      "tripDate": " August 2013"
    },
    {
      "title": "Good...",
      "text": "The hosts are friendly and welcoming. The rooms are clean. The breakfast is in a small \"restaurant\" near the house, the atmosphere there is not so nice (smartegg).",
      "rate": 3.0,
      "tripDate": " August 2011"
    },
    {
      "title": "gool location, will go again",
      "text": "I stayed at Ada's Guesthouse for 3 days after a 3 week trip to Ecuador & Galapagos.  I got the last room available, room no. 6. I just returned this evening and so here is the review. I stayed in room number 6. It is very, very small, but suited my purpose. I paid $72 per night and I am not complaining since I had my own bathroom - a plus! Prior to booking, I communicated via email and phone with Arthur. I was under the impression that this was a guesthouse that was not manned after hours and was worried about a delayed arrival at Pearson. Upon arrival, I called Paul, the manager. It turns out that he lives there so someone would be there upon my arrival. I think this should be made clearer so as to avoid any confusion and anxiety about late flight arrivals. I would agree with the previous reviewer about the breakfast. It is at Eggsmart (or something like that) and having eggs and omelettes of up to 3 to 4 eggs per sitting is not good for the system. I too opted for other options and seemed to have paid more than I should have. I did not tip her actually, so that is how they make the cash. I forgot to mention this to Paul, the manager as they should drop this service. I will have to write to Arthur about this as this is a negative to their overall service in my opinion. Nonetheless, I would return, only to a bigger room. The location is great and if you like to walk, you can walk all the way downtown to the Eaton Centre, CN tower, Yorkville, etc. The carpets are still a hit and miss and they should be replaced. The rooms are hastily painted as the previous reviewer stated. The bed is so comfy and the HD tv is fully channelled.  The location is great and safe. It is right in front of a new condo development and beside a school.I would return to a bigger room and if room 6 is the last room available would take it as well but only for a few days. The bonus is that the rooms all have a bathroom.",
      "rate": 5.0,
      "tripDate": " August 2011"
    },
    {
      "title": "6 night stay",
      "text": "Cheap and cheerful safe area right near metro 5 minute walk . Comfy enough room cleaned every other day . Check in was easy there is a phone outside and the owner arrived in less than 10 mins.  No noise at night pleasant",
      "rate": 3.0,
      "tripDate": " May 2019"
    },
    {
      "title": "Cheap guest house and definitely worth a stay!",
      "text": "Stayed here for four nights in total. Rooms are basic and not particularly clean overall, however liveable. They give you a microwave, mugs and a fridge meaning you can eat in the room also. Plenty of space. Beds comfortable and its peaceful so had a good nights sleep. Subway station is a two minute walk away - absolutely fantastic connections with a shop just round the corner also. The owner was lovely and kept to himself (which is usually a nice thing!). Expect what you pay for - but I personally believe what you get is fantastic for the price considering how costly Toronto is!",
      "rate": 4.0,
      "tripDate": " July 2018"
    },
    {
      "title": "Good location",
      "text": "I stayed here for 2 nights. Its more like a self check in check out service, but if you need something they are willing to help right away. The location is the best thing about it since its only one block away from Sherbourne station",
      "rate": 4.0,
      "tripDate": " July 2017"
    },
    {
      "title": "Good Price in a Good Location",
      "text": "Stayed here late July 2015 while in Toronto for a few days. The Outside of the building is not the most welcoming of facades on the street but once inside the decor of the building is fine. We were greeted by a friendly man who showed us to our room. We payed him then and then did not see him again. The room itself (Room 6) is TINY however perfectly adequate. We had two large suitcases with us which when put on the floor covered all the floor space leaving just enough room to open the door. Honestly none of this bothered me too much, the en-suite bathroom was very nice and clean the only downside is that it does be very dark in the shower once you pull across the shower curtain. The surrounding residential streets are very nice. Church Street, the Subway, and Younge Street are all easily accessible. Overall a good place to rest your head for a night or two but don't be expecting any luxuries.",
      "rate": 4.0,
      "tripDate": " July 2015"
    },
    {
      "title": "Diamond in the Rough!",
      "text": "We had a limited budget and no knowledge of Toronto at all.  Booked suite #1 online judging by the pictures and reviews.  Upon arrival, we thought we had been had...but don't let the exterior fool you.  We stayed in mid-March when everything looks grey and dirty.  The exterior could use a lick of paint, perhaps better signage as it's hard to tell when the building is at night. We were greeted by Norbert who was very friendly and hospitable. Our room was slightly cramped but nonetheless clean, comfortable and fully functional.  The bathroom was clean and bright...a tub would have been nice but the shower was large and roomy. I am not exactly sure what the purpose of the ankle height tap was in the shower but wasn't a problem. Just quirky! Free wifi. The cable was snowy on some channels but I wasn't there to watch tv.  It was fine. Another blanket or comforter would have been nice but the room was warm (Hot air furnace).  If you want a place to sleep and be comfortable, this is your best bet.  2 minute walk to Sherbourne subway station, Tim Hortons across the street, 24 hour convenience at end of street within view. Microwave and fridge in room.  It has what you need.  I would DEFINITELY stay here again.  You want the Hilton?  Then stay at the Hilton and pay 4 times as much for 25% more 'stuff'.  Say hi to Norbert for me. He was great.",
      "rate": 4.0,
      "tripDate": " March 2015"
    },
    {
      "title": "Very comfortable",
      "text": "This was a great place to stay while in Toronto. We had room 2 which a lot of people have written negatively about but we haven't found any issues. The bed is in a little nook but we find this cosy. The location is great as it is right near a subway, bank, shops etc. Definitely try out Mansion Keg if you are staying here! The owner is very nice, it took us a couple of minutes to work out we had to phone him on arrival ( phone and number are outside the front door). Would recommend for a short stay in Toronto.",
      "rate": 5.0,
      "tripDate": " March 2014"
    },
    {
      "title": "Good location but smelly and cramped",
      "text": "Ada's is easy to find and in a nice area, very close to a subway station.  On arrival we had to phone the owner but he arrived fairly promptly and was friendly.  Our room was tiny and had an unpleasant smell in it.  The bed sheets were clean but the bed was in such a narrow alcove we had to climb on from the bottom (no room either side).  The ensuite shower was ok.  There was an ancient tv in the room but nowhere comfortable to sit and watch it, other than the end of the bed.  I know that I could find a much better room for only a little bit more money.",
      "rate": 2.0,
      "tripDate": " September 2013"
    },
    {
      "title": "Low price compared to other b&b but not worthy",
      "text": "My husband and I, together with my parents, visited Toronto at the ending of May and stayed for 3 nights. We really chose Ada's Guesthouse because all the others were already booked, or were to expensive for us. The prices were fine, but here are our impressions.ARRIVAL AND PROPERTY:First of all, the building is very well situated, near a metro station and even you can walk along Bloor Street if you like and reach Bloor/Yonge pretty fast. Near you can find some places to have lunch/dinner, different prices and styles. However, the building was a bit disappointing: it seemed all the rooms were converted into bedrooms, no little common living-room, or small kitchen... In the outside, near the door, there is a telephone so when you arrive you can call the owner to give you the keys (because there is no front desk), but his cell phone was off and we had to wait like 20 minutes. The building has space to park in the backyard, but the cost is 10 CAD per night. The payment is done at the beginning and you don't see the owner again (just leave the key inside the bedroom when you leave). We expected a little of \"home warmth feeling\" in b&b accommodation. BEEDROOMS:We had bedrooms 2 and 6. They both are pretty small, but they were clean (average clean, we expected more). My husband and I stayed in 2. The furniture is very old, the bed was located in a small square corner, the linen were too small for the bed so when I turned while sleeping I accidentally took off the sheets from my poor husband. We had a rough blanket also too small and it was very cold in the room, so sleeping quality was not very good, taking all these into account. The bathroom is small but fine. The shower had a low situated second water tap, which we didn't noticed, and I hit my ankle (nothing serious, but annoying). The room has, however, a small fridge and microwave and a electric kettle, so you can maintain some food and even prepare a cup of tea (if you bring the tea).PROS AND CONS:The pros are: cheaper than other B&B/Guesthouses in Toronto, very good situation, near metro and restaurants.Cons are: small and old bedrooms, cleanliness fine but could be better, too cold in the bedrooms, the absolute lack of \"guesthouse/b&b feeling\".In case I come back to Toronto, it is not likely that I repeat our stay here, we concluded it would be better to pay a little more and get something better.",
      "rate": 2.0,
      "tripDate": " May 2013"
    },
    {
      "title": "Third stay!",
      "text": "This is my third stay. A series of appointments brought me to Toronto and I have now found my home away from home. My first stay is already posted (see August 2011 review).  My second stay was at the end of May in Suite 1. The room is large and sufficient for two people. This last stay, I had Suite 8, upstairs which is basically the entire third floor of the original house! The pictures on their website do not do it justice. It has a nice big hallway with mirror, a kitchen with an old Eaton’s full size refrigerator (can be noisy and goes on often), sink, microwave, table and two chairs. The living room has the original old brick fireplace (as does Suite 1 if I recall) which is not in use but nicely presented. A nice flat screen tv is affixed to the brick of the fireplace. All rooms have modern furniture (think IKEA). The living room has a sofa, two end chairs, a table, and an working table (with chair) where you can plug in your laptop or do some work. Also has large Toronto photos affixed to the walls. The bedroom also has a TV! What a bonus for late night movies/news! Large bed, two night tables, big closet and dresser. The bed did not have a duvet as pictured, but a blue blanket. I am not sure if they did this because it was the summer, but it was the same in May with Suite 1. The bathroom is a little small, just enough for one. There is a bathtub with a shower. The sink is a bizarre rectangle shape and you cannot bend your head down to wash your face etc. because you will hit the medicine cabinet which is placed too low. I used the shower to face wash. From the bedroom, there is a big balcony! Huge! It sits right atop the addition to the original house. You can get a good skyline view of the buildings in vicinity and if you peak to the right, you can get the needle view of the CN tower! There is a small table and two chairs. I also found in the large closet a sun umbrella and hooked that up to the balcony railings as there is lots of sun! A nice way to spend a summer evening!Suite 8 has three rooms, plus a balcony all at a great price! I stayed two weeks and negotiated a price and I also did not opt for the Eggsmart breakfast. You can stock yourself with morning brew at the Tim Horton’s, a 2 minute walk situated right across the Sherbourne subway or down the road at NO FRILLS. There is also a Shoppers Drug Mart to heal your weary feet after sightseeing. All is within walking distance to the major sites. Buy tokens to use the subway to save some money. The manager is Norbert and the owner is Arthur. Both are very personable and are on the scene always looking after the place. Since my last May visit, they have put up an iron fence at the front area, flower beds, temporarily laid out patio stones near the flower area to be eventually used as a gathering area (ie: put some chairs, etc. so I was told) an imitation stain glass for the front door area. Keep in mind, I was told that this house is 150 years old.The inside suites are nicely appointed, but those carpets that are in the inside need to go. Try to overlook that. I think that they may eventually get rid of them and go back to the original hardwood flooring. That would really add more pizzaz to the place. The place is VERY quiet! There is little ambience to it because they are all separate rooms and there is not a gathering place so to speak. There is WiFi, AC (so needed because of record breaking heat this summer) fully channelled tv’s and each room has its own bathroom. I do recommend this place and look forward to my next visit in the near future.",
      "rate": 5.0,
      "tripDate": " July 2012"
    },
    {
      "title": "not the room we booked",
      "text": "the location was good, but the room was tiny and not the room we had booked.  No desk, no safe, and NO AIR CONDITIONING. The advert shows a lounge but we never saw that and we were never told where it was.",
      "rate": 1.0,
      "tripDate": " October 2019"
    },
    {
      "title": "YOU GET WHAT YOU PAY FOR...OR LESS...",
      "text": "There may be some who would find this place charming - I was not on those travelers. The pictures found on Trip Advisor and Booking .com do not accurately describe the room in which I stayed.My booking was for a room with a queen bed. The listing also described getting a desk, sitting area and safe - not in my room. My uncomfortably small room had forced hot air which made it very stuff and overly warm (was able to crack open a window a couple of inches to allow some fresh air in). The queen mattress was of very poor quality as was the mattress pad. The sheets were a complete joke - they covered the top of the mattress and pulled down a whole whopping 3 inches!! So yes, they constantly came undone even from sitting on the bed. Three nights of uncomfortable, stuffy rest. Neither sink or tub had any kind of plug.Parking was the biggest hassle - supposed to have onsite parking - landlord said he'd have to pay someone to shovel - rather than take care of his property, sent me a block and a half away to use a public garage @ $25 CAD daily max rate! So much for private onsite parking!!If there was a plus, got fresh bath towels after two nights (oh yeah, no hand towel or washcloth!) and there is plenty of hot water. Overall, not a great experience here. 3 dots average rating is generous...",
      "rate": 3.0,
      "tripDate": " February 2019"
    },
    {
      "title": "Ok",
      "text": "As the city was full due to the hockey World Cup we have chosen this accommodation. That's the only reason.Anyway, it is good located, 5 minutes from the subway. The house looks very old, but inside it is okay. The room is small, but definitely clean. The owner was very friendly and uncomplicated. Wifi works perfect. For 10 CAD you get a parking space behind the house. For one night it was OK. Close to the subway are enough possibilities for breakfast.",
      "rate": 3.0,
      "tripDate": " September 2016"
    },
    {
      "title": "Basic but nice",
      "text": "Place is clean and basic and suited me fine. Room had queen bed and sofa bed. I stayed 9 nights. Amy and Gary were friendly and just a phone call away at Keppner Guest House down the road. Responded immediately. There is no 24 hour desk as in a hotel. But housekeeping does come in on alternate days and changes the towels and refills the toiletries. Location is great. 3 min walk from Sherbourne metro and 15 min walk from Yonge St. A few min from Bloor St. I was sightseeing the whole day and walked around quite a bit, so I found this place very convenient. Lots of eateries nearby. Microwave and fridge in room. $4 laundry - $2 for wash and $2 for dryer -in the basement.They organise trips to Niagara too.",
      "rate": 4.0,
      "tripDate": " September 2016"
    }
  ]
}