{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Algonquin House",
    "url": "/Hotel_Review-g155019-d3657900-Reviews-Algonquin_House-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "5.0",
      "reviewCount": 93
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "1 Algonquin Ave",
      "addressLocality": "Toronto",
      "postalCode": "M6R 1K6",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/06/4a/7c/44/petit-dejeuner.jpg?w=500&h=-1&s=1"
  },
  "description": "Algonquin House is a gracious renovated Edwardian house in beautiful High Park. Guests have the choice of a king bedroom with a fireplace, bay window and sitting area or a queen bedroom with an enclosed porch and sitting area. Both rooms have computers with internet access. A sitting room with a TV and fireplace as well as the English garden are available for guests' use. There is afternoon tea, morning coffee and a full breakfast with home baking. Cost of a room with a shared bathroom and full breakfast double occupancy is $112.00. Cost of a room with private bathroom and full breakfast, double occupancy is $135.00.",
  "featues": [
    "Free parking",
    "Free High Speed Internet (WiFi)",
    "Wifi",
    "Free breakfast",
    "Non-smoking hotel",
    "Air conditioning",
    "Non-smoking rooms"
  ],
  "reviews": [
    {
      "title": "No longer operating as a B&B",
      "text": "I tried to reserve a room via BBCanada.com in January 2020 and was advised by the owner that this place is no longer operating as a B&B. Lesson learned...check with establishment directly instead of using BBCanada.com.",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Great People and Great Services",
      "text": "Algonquin House caters to students.  It's clean and has exactly what students need and want.  A good alternative to apartment life.  The rooms are clean and it comes with full service.  The internet is a nice feature especially for students.  You pay one price and that's it.  The laundry facility is clean and priced right.  The upstairs kitchens are tidy so make a meal is not a problem.  The microwave and fridge it the room is helpful.",
      "rate": 4.0,
      "tripDate": " February 2020"
    },
    {
      "title": "One of a kind!",
      "text": "This is a very special place; Leora made me welcome from the start, and those breakfasts were luxurious. As this is the home of retired teachers, there were plenty of books around, nice bright lighting, and a sitting room with a chaise longue invitingly placed and windows on three sides. Of course, my purpose in TO  was not to read, but this was one excellent feature which makes me want to stay here on my next visit in 2020. Leora was generous too, for she let my sister join me for breakfast--they are both great ballet enthusiasts, and both still very active themselves (my sister going to ballet classes at least three times a week). Another link was that Leora and Mark were both descended from Jews settled near Minsk, whilst we are also of East European Jewish extraction.  Altogether a positive experience, and a place I would unreservedly recommend. Swanriver2016",
      "rate": 5.0,
      "tripDate": " August 2019"
    },
    {
      "title": "breakfast was the highlight",
      "text": "this b&b is ok, with the most amazing breakfasts - in fact the best of our trip!  nothing terrible to report. It's much further from the 'sights' of downtown Toronto than I thought, and we wandered a few streets away in search of dinner and found ourselves in not a great neighbourhood. The street the house is on is totally fine though and quiet, although it's pretty dark due to the big trees that line the streets- which also make the rooms of the house dark. The owner made nice touches with coffee and cake on arrival but we felt a tad intrusive at times as the only guests.",
      "rate": 3.0,
      "tripDate": " September 2015"
    },
    {
      "title": "I wish I had a bigger stomach!",
      "text": "Right after we arrived, we were served with lovely tea and apple pie. And the wonderful breakfast! We really wished we had a bigger stomach!  Lovely people, livery house.If would recommend here to all",
      "rate": 5.0,
      "tripDate": " September 2019"
    },
    {
      "title": "pleasant stay",
      "text": "very kind (short) stay at algonquin house: lovely welcome,  englsh tea at the room and very abundant, tastefull breakfastgood location very  close to a park in tornto, in a very quiet street two bedrooms, to my opinion equal in comfrot end size.",
      "rate": 4.0,
      "tripDate": " June 2019"
    },
    {
      "title": "Home away from home ",
      "text": "Algonquin House is a great alternative to a downtown hotel. Leora, the friendly hostess greeted us and set us up in our room with little adieu so we could go about our business in the city. She offered great advice and suggestions about things to do and places to eat. The breakfasts are sumptuous and the coffee really good. The neighborhood is very quiet and easily accessible by transit- a good walk from the UP Bloor Station or Dundas West subway station or the Roncesvalles Streetcar. I would happily return.",
      "rate": 4.0,
      "tripDate": " March 2018"
    },
    {
      "title": "An absolutely wonderful B&B",
      "text": "This is a beautiful heritage home in one of Toronto's more stately neighbourhoods.  The service was impeccable, and the breakfasts were generous and most delicious.  We loved this place.  The bed was comfortable and the room had plenty of space to spread around in.  The hostess was lovely.  The location was also great for people who like access to interesting neighborhoods, good walks, and transit, but want a quiet place to rest at night.",
      "rate": 5.0,
      "tripDate": " October 2017"
    },
    {
      "title": "Visit Toronto Like a Local",
      "text": "Algonquin House offers a lovely & gracious breakfast every day, and a sweet room.The hosts are genial, but not intrusive.It's easy in this neighborhood to feel like you are seeing this exciting city as a local would, because convenient bus stops & trolley routes are within this leafy enclave, near High Park in the Roncy Village. The main street of this neighborhood has a wonderful Polish restaurant, but also recommended are Thai, Italian & other ethnic theme restaurants. The hosts are longtime residents with great tips about everything, including day trips to theatre excursions and of course, the great Niagara Falls.The meals prepared include very special pancakes and eggs, exquisite homemade scones & sweet rolls, delectable fresh fruit salads & even a special occasions cake. It is impossible to praise high enough, the spot-on selections that seem to roll out of this kitchen effortlessly.",
      "rate": 5.0,
      "tripDate": " July 2016"
    },
    {
      "title": "Very pleasant stay",
      "text": "The B&B was situated next to a nice park in a quiet neighbourhood. Transit to downtown was easy to reach. A safe parking option just round the corner. The room was very comfortable with a nice porch (my favourite place) which is especially nice when travelling with a baby since you have an extra room. Our host was very friendly and provided an excellent breakfast.",
      "rate": 5.0,
      "tripDate": " August 2014"
    },
    {
      "title": "The epitomy of a lovely B&B",
      "text": "Algonquin House is a lovely old Toronto house near High Park with a wonderful and gracious hostess. The bedrooms are roomy and interesting, the shower great, the towels thick and thirsty, and the parking is off-street and just around the corner. The breakfasts are multi-course and wonderful - fruit, a main dish, scones or muffins, and bacon or sausage.  We asked for strong coffee and it was great. Little extras include a snack upon arrival, and coffee delivered outside the room 30 minutes before breakfast.  We were offered a choice of breakfast times and did not have to coincide with guests in the second room, a rare offering.The only downside may be the lack of air conditioning, though a good fan was provided.  On a hot day in June this was more than adequate to ensure a great sleep in the king bed.No doubt we will happily return.",
      "rate": 5.0,
      "tripDate": " June 2017"
    },
    {
      "title": "an excellent accomodation close to High Park",
      "text": "Algonquin House was a wonderful place to stay.  The room was very comfortable and pleasant.  We especially liked the sunroom off our bedroom.  The breakfasts were outstanding and different each morning.  We highly recommend Algonquin House.",
      "rate": 5.0,
      "tripDate": " April 2017"
    },
    {
      "title": "Breakfast...WOW!",
      "text": "I am so happy my mother and I chose the Algonquin House instead of a hotel. My mother and I stayed in library room which is spacious and super clean. The bed is comfy, the sun room is the perfect place to have morning coffee, and we even had cable to occupy our downtime. The bathroom is huge and was kept super clean for us. We were always welcomed to fresh, clean towels and wash cloths. Breakfast was phenomenal. We had homemade breakfast pastries along with a savory breakfast. Leora's mushroom crêpes are divine! We never left hungry for our daily excursions. Leora was super helpful, providing suggestions on places to eat in the area, advice about transportations, and cab/limo service to get back to the airport. I would recommend this place to anyone. It is conveniently located in Toronto and close to public transportation if you do not drive. The area is quiet and quite safe. If we are ever back in Toronto, definitely coming back here.",
      "rate": 5.0,
      "tripDate": " May 2017"
    },
    {
      "title": "DON'T JUST COME TO TORONTO.....STAY IN STYLE!",
      "text": "Trivago?.....forget about it! Why stay in a hotel.....Algonquin House is an experience.  Come to Toronto and for just a weekend, feel like a resident of the city.  You don't just get a terrific breakfast,  with a real comfy bed and solice....but you actually feel like you live in the city.  Steps away from Roncellvallas and the hustle and bustle of the community...you can visit a local bakery, shop for truly unique fashion from young, new stylists, eat a top notch burger for lunch, munch on world cheeses at the Cheese Boutique...it goes on. Ride the TTC!!  Never will you feel like a Torontonian in a hotel....you will always feel like a visitor.  Be a resident at Algonquin House.",
      "rate": 5.0,
      "tripDate": " March 2017"
    },
    {
      "title": "Great host and cosy bb",
      "text": "Leora, the owner was so helpful with everything, and made me feel like it was my own home. I would definitely go again next time I visit Toronto. I highly recommend this BB. Breakfasts were divine and something new every day. Bedroom was super clean. Central and quiet location.",
      "rate": 5.0,
      "tripDate": " December 2016"
    },
    {
      "title": "An excellent stay",
      "text": "A hidden gem.  From the moment Leora opened the door we felt welcomed into her beautiful home.  We were only in Toronto for one night, but the bed was extremely comfortable and the cheese souffle and muffins were delicious.  If there is ever a need to stay overnight in Toronto again we will have no hesitation in staying at Algonquin House.",
      "rate": 5.0,
      "tripDate": " November 2016"
    },
    {
      "title": "The best",
      "text": "We stayed four days at Algonquin House. The breakfasts are unbeatable and the accommodation is comfortable and spacious in an elegant house. The little unexpected extras were typical of Leora's thoughtful approach. Now our first choice for B&B in Toronto.",
      "rate": 5.0,
      "tripDate": " September 2016"
    },
    {
      "title": "Abbotsford",
      "text": "Be prepared for fine baking in the best of B&B tradition! A gracious and generous host responsive to dietary requirements. Comfortable accommodation in location easily accessible to public transportation.",
      "rate": 4.0,
      "tripDate": " September 2016"
    },
    {
      "title": "Algonquin House review",
      "text": "We have stayed at the Algonquin House several times because we thoroughly enjoy all aspects of this B & B. Either room to be chosen is clean, spacious and comfortable. A television has been added to both rooms for those who wish to watch it. The provided breakfast is always home made and delicious. Our hostess is always very gracious and accommodating. We have a choice of  staying a minimum of 1 day which is a very important choice for us. The only thing we missed this trip is that there was no A/C in the front room. A fan was provided but we don't like fans. Other than that, our stay was an excellent one.",
      "rate": 4.0,
      "tripDate": " September 2016"
    },
    {
      "title": "Another wonderful visit!",
      "text": "I feel absolutely at home when i stay at Algonquin House! The neighbourhood is quiet, tree-lined and yet also filled with delightful sounds. It is convenient to shops and restaurants too! Leora welcomes you with open arms and is there whenever you need her! The garden is a refuge and a relaxing seating arrangement beckons! Her breakfast is stellar...you literally are groaning...and it is all so delicious! I love having my tea tray outside my door!The rooms are tasteful and interesting with collections from all her varied tastes. The bed...divine! The bathroom is modern and yet maintains the character of this older home. You will want to return again and again.",
      "rate": 5.0,
      "tripDate": " September 2016"
    },
    {
      "title": "Bull's eye in Toronto",
      "text": "Leora and her family were very nice and welcoming. My friend and I got afternoon tea and home-baked cake on our day of arrival. Her house is situated in a quiet residential street (Parking on-site tricky, but she's got an agreement with the nearby curling club where we always found a spot), a nicely-ornamented looker in a street full of klinker lookers, and two gigantic maple trees in the frontyard. The room we stayed in large and with a super-comfortable king bed and beautiful wood and leather interior. The bathroom was large and provided everything one needed, from soaps and shampoos to a ton of towels in different sizes to choose from to a a tub! The toilet was separate. Everything was always clean and well-maintained.  Breakfast was wonderful and full of variety. Eggs, pancakes, fruits, home-baked loafs, bread, cereals, yoghurts... Everything was fresh and cooked to our wishes, and I looked forward to it each day, although the portions were a bit large for our European stomachs. However, we were provided with lunch bags, and so could take what we wanted to eat later with us, so no problem here. Leora also provided us with nice tips what to do in the city in general and in the neighborhood. (High Park / Roncesvalles Village)When I come to Toronto the next time - if in company or alone - I'll first call her!",
      "rate": 5.0,
      "tripDate": " October 2017"
    },
    {
      "title": "Algonquin House",
      "text": "4 of us enjoyed a delightful overnight stay in charming rooms with super comfortable beds, and beautiful linens. The breakfast feast and welcoming tea and home baked treats were beyond delicious! High Park and Roncesvalles are a short stroll away. We will return!",
      "rate": 5.0,
      "tripDate": " October 2017"
    },
    {
      "title": "Amazing as always!",
      "text": "The Algonquin House is a great place to stay that feels separate from the busy city life!  I hope that we are welcomed back in the very near future as this is our favourite place to stay!  Thank you so much for having us!",
      "rate": 5.0,
      "tripDate": " September 2017"
    },
    {
      "title": "Unbeatable hospitality",
      "text": "This was our second stay in this bed and Breakfast and I am please to report that it is just as fantastic as it was three years ago. As former B&B owners (recently retired) we have a pretty good idea of what people look for in a B&B. This one hits all the right buttons S follows:Superb hospitality. Leora will free you at the door in person and provides afternoon tea with home baked pastries and cakes. You will not have the rules book thrust into your face. Comfortable beds with high quality linens willl guarantee you a  comfortable nights sleep Thick and fluffy towels await you in your private bathroom. The breakfasts are stupendous in both quality and abundance. Granola, fruit, yogurt followed by home baked breads, hot entree dish will keep you free from hunger until dinner time. The location is very convenient being located only steps away from the trendy and vibrant Roncessvale district. Also you can be downtown Toronto in about twenty minutes on a number of public transportation modes.I cannot say enough about this charming B&B and would return again in a heartbeat.",
      "rate": 5.0,
      "tripDate": " September 2017"
    },
    {
      "title": "Robert/Lynne - Cornwall Ontario",
      "text": "Booked Algonquin House due to its location to Roncesvalles Ave. it is located in a lovely neighbourhood, well kept older homes and 5 minute walk from beautiful High Park and public transport. Although we didn't use it, it is convenient for anyone without a vehicle. The rooms are lovely, decorated beautifully, roomy and bright, we were greeted with pastries and a beverage when we arrived and asked our preference for breakfast. A pot of delicious tea was outside our room in the morning and we went downstairs to a most beautifully set table with yogurts, granola, scones, coffee, whipped cream and our choice of breakfast, peach pancakes, which were exquisite . Leora is an excellent host, her breakfasts ( next morning was home made corn bread and pecan covered French toast) are superb. This is a B&B I would recommend to anyone who wants to visit Toronto but also enjoy some green space within the city. We drove there without any issues and she has parking spaces  behind the B&B at a local curling club. 5 stars for Algonquin Hoise.",
      "rate": 5.0,
      "tripDate": " September 2017"
    },
    {
      "title": "The best bed and breakfast in Toronto",
      "text": "Over the last 3 decades, almost every year I have had the opportunity to be accommodated in many guesthouses in Ontario.By the warm welcome, the two comfortable rooms, as well as the copious and delicious breakfast of Leora, Algonquin House is for me and the people who accompanied me, the lodging that wins \"the golden palm\" among all those where we were accommodated.With French friends, a next stay at Leora is already scheduled for September 2017.",
      "rate": 5.0,
      "tripDate": " August 2017"
    },
    {
      "title": "Fantastic",
      "text": "We stay there for 2 night. Leora is fantastic, she gave us a lot of information and suggestion.The Hours is vero clean and it is in a very quite position and near public transport and not far from town center.Breakfast was superb!! I recommend it!!",
      "rate": 5.0,
      "tripDate": " August 2017"
    },
    {
      "title": "Great stay",
      "text": "We had a wonderful time in Leora's home. The breakfast options were fantastic, and she gave us cake to take out with us during the day. We found it easy to get downtown on the tram and our 5 year old enjoyed the play area in high park. Thank you for having us.",
      "rate": 5.0,
      "tripDate": " August 2017"
    },
    {
      "title": "Simply Superb",
      "text": "We've been fortunate to visit Toronto many times and simply stated, this is the very best quality lodging we've ever experienced.From culinary delights at breakfast to a very spacious room and comfortable bed to a wonderful and strategic location near downtown Toronto and very close to High Park....well, the Algonquin House truly is worthy of our highest rating.",
      "rate": 5.0,
      "tripDate": " July 2017"
    },
    {
      "title": "We found a hidden diamont!",
      "text": "After a lot of web research we finally found and booked this lovely B&B.What a great decision! Leora is really wonderful host: With helpful information for sights and public transport and whatever you might need some help with.The house an the rooms make you feel like home immediately and the biggest \"event\" is the breakfast every morning. I wont tell too much about it to keep the surprise - just sit down and enjoy :-))For better understanding: The booking option \"private bath\" does not mean an en-suite washroom: If you will book this option, the second room will simply not be offered to somebody else. That makes the bath \"yours private\".We really recommend this house, which is located in a nice neighborhood and you are relatively quick in downtown with the street car (tram).",
      "rate": 5.0,
      "tripDate": " June 2017"
    },
    {
      "title": "Failed to show",
      "text": "I use the online email booking option (very convenient), and my credit card is charged for $7 and I receive an email from BBCanada confirming my reservation.  I don't hear anything again.  So coming from my home and reassured that I have a place to stay for the night my husband and I drop off my son and dog at my mother's and head to meet some friends for lunch   I have prearranged for the friends to follow me to Algonquin house and then to wait as we check-in  so that we can go together to a hockey game at the Ricoh Coliseum for 5 pm.  We arrive at your house about 4 pm.  There's a very small sign saying we have the right address.  There's no indication where we should park, there's no answer at the door.  After 10  minutes I try calling.  After 10 more minutes I try calling again.  I can hear the phone ringing through your front door so I'm reassured that I have the right place.  We decide to park our car out front and head to the hockey game as we can't wait any longer.  I'm starting to feel very very anxious.  I ask my husband to email Algonquin house as my phone is almost dead now.  It's now 7 pm (3 hours after we first arrived) and still we haven't heard anything.  So I again ask my friends to drive us back to Algonquin house to see if someone is there to check us in.  No one is there so I book a room at the Howard Johnson on Roncesvalles and assume it's not happening.  I ask my friends to drive us to the hotel, ask them to wait again, park our car in the hotel parking lot and arrive 1 hour late for the party.",
      "rate": 1.0,
      "tripDate": " January 2014"
    },
    {
      "title": "Amazing Breakfast",
      "text": "The B&B is a beautiful and well-maintained 100 year-old house right next to High Park. The room was bright and comfortable, with a little sun room on the side. The food was incredible. For breakfast, we had coffee, granola, cinnamon rolls, bread, and cheese blintz; all of it was made at home by the owner. I highly recommend this place.",
      "rate": 5.0,
      "tripDate": " January 2013"
    },
    {
      "title": "A Gem!",
      "text": "Algonquin House is a bed & breakfast that surpassed my expectations: from the comfort and spaciousness of the room, its excellent location close to High Park and the airport, to the sumptuous breakfast Leora serves. I stayed in the Library Room, which is very well-equipped and has a lovely little side room in which to relax. It has great books, too! The bathroom was super-clean and spacious with a great shower/bath and an abundance of good quality towels. Leora is a very attentive host who anticipates one's needs very well. She also surprised me with coffee and delicious home-baked goods on arrival and again during the afternoon on the following day. The breakfast is one of the highlights when staying at Algonquin House. Fresh orange juice and very good coffee, baked scones or muffins, toasted ciabatta, a hot dish (I had a plum pancake served with bacon one day, on another day a cheese soufflé, for example), freshly cut fruit, as well as yogurt and granola - and all of these generously-sized! The linens and crockery, too, were wonderful. Also, the morning's newspaper lay ready for me at breakfast table - a nice touch. The house is close to many restaurants and little shops in Roncesvalles. It is also a 5 minute walk to the High Park entrance and about a 15-20 minute walk to Keele station. It is very easy to get from the airport to Algonquin House: simply take the Airport Rocket (Bus 900, I think) to Kipling station, get on the green line east to Keele station, and get off at Keele station.Highly recommended!",
      "rate": 5.0,
      "tripDate": " May 2019"
    },
    {
      "title": "excellent stay",
      "text": "the breakfast and the host were terrific. A great gem and warm welcome! the parking was very good and we could walk to a few nice restaurants and pubs. The streetcar was a nice experience to go see the Toronto must sees! cn tower. Ripleys aquarium, Eaton Centre and the path,underground.",
      "rate": 5.0,
      "tripDate": " December 2018"
    },
    {
      "title": "First stop on our trip",
      "text": "Warm welcome with wine and cheese. Nice large room. Leora made us very welcome. Breakfast that large and tasty didn’t need lunch. Even gave us muffins to take with us. Lovely location short walk to shops and restaurants. Not far from airport.",
      "rate": 5.0,
      "tripDate": " September 2018"
    },
    {
      "title": "Best B and B in Toronto, for sure!",
      "text": "We feel very fortunate to have stayed at the Algonquin House, a lovely heritage home located on a quiet street between High Park and the interesting shops of Roncesvalles Village. With public transit an easy walk away, the location suited our goal to explore Toronto highlights including the Blue Jays, the Toronto International Film Festival and Woodbine Race Track.      We occupied the spacious Fireplace Room on the second floor that included a king bed with comfortable bedding, a living room space with TV as well as windows looking out to the street. Leora, our hostess, made certain that there were treats, beverages, fresh fruit and even fresh baking to spoil us. The bathroom is shared with another room, although because we preferred a private bathroom, Leora closed that room during our one week stay.     Breakfast was served at 8:30 each morning in an elegant dining room with a dining table tastefully and colourfully decorated with fine china and lit candles. Leora spoiled us for sure as we started our days with a hearty breakfast that included several options including quiche, or scrambled eggs on toast, or fruit salad or oatmeal as well as fresh baking. Leora was super accommodating and generously offered options to enhance our stay.  Her sincerity in making our stay with her memorable was very much appreciated. All for a more than reasonable cost, we would recommend the Algonquin House to anyone heading to Toronto.",
      "rate": 5.0,
      "tripDate": " September 2018"
    },
    {
      "title": "relaxing business trip",
      "text": "I was on a business trip to Toronto and I originally booked a hotel, which was a bit far from the conference venue. Algonquin House was recommended to me, so after checking out the reviews on trip advisor, I decided to book a room for 7 nights. What made me decide was the breakfast menu :) Leora was a great host and she made sure that her guests felt comfortable during their stay. Breakfasts served were all homemade and she even provided a bag so that I can take some of the baked goodies with me. When I arrived, there was even a slice of cake and some cheese, cherries, and biscuits to welcome me. The house is located in Roncesvalles Village, a quaint neighbourhood with a lot of small shops and restaurants. The house is a 5-minute walk to the nearest streetcar stop and is a short walking distance to High Park.",
      "rate": 5.0,
      "tripDate": " July 2018"
    },
    {
      "title": "Best breakfast ever",
      "text": "We enjoyed a nice three-night-stay at the B&B. After a long trip from oversea we arrived in the late evening at Algonquin House. Leora, the host, welcomed us and showed us a lovely room with some little appetisers and a glass of wine - what a pleasure to have a short rest then in the Fireplace Room! The room was very nice, the shared bathroom well equipped with everything you need in the morning. And breakfast, how to say, we are still dreaming of the French Toast, mmmhhh!!!",
      "rate": 5.0,
      "tripDate": " June 2018"
    },
    {
      "title": "An Excellent Place to Stay in Toronto",
      "text": "This is a thank you to Leora, who was a gracious hostess and excellent cook. We greatly enjoyed our six day stay. The room was large and comfortable. Breakfast was a treat every morning, making it impossible not to over indulge. The location of the B&B was convenient to High Park, Roncesvalles shopping and public transport. I highly recommend Algonquin house as a place to stay in Toronto.",
      "rate": 5.0,
      "tripDate": " April 2018"
    },
    {
      "title": "Cozy place",
      "text": "We enjoyed the front room of this lovely old home.  Received wine, cheese and crackers upon arrival.  This place is a little dated but very cozy and clean. Our hostess was kind and friendly and made up a delicious breakfast.  It is walking distance to Roncesvale shopping area and High Park.  Very comfortable bed and tea and coffee available to make.  Very nice place.",
      "rate": 5.0,
      "tripDate": " December 2017"
    }
  ]
}