{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Alisa Guest Home",
    "url": "/Hotel_Review-g155019-d1950754-Reviews-Alisa_Guest_Home-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "1.5",
      "reviewCount": 8
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "12 Hopecrest Cres",
      "addressLocality": "Toronto",
      "postalCode": "M1K 2K4",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/13/1b/ec/2e/photo0jpg.jpg?w=500&h=400&s=1"
  },
  "description": null,
  "featues": [],
  "reviews": [
    {
      "title": "awful",
      "text": "this place is disgusting. Does not look like the pictures, it is tiny, dirty, smelly.You can not use the kitchen because the water in the sink does not go down, there aren't any kitchen utensils or plates....but the ad says it is furnished. The windows are broken, air comes in through them ( I was lucky because I was there in spring..I can not imagine going there in the winter). The manager told me there were towels but there were not.In the bathroom the sink leaks water. The floor was dirty, there were marks everywhere. don not spend your money on this terrible place.",
      "rate": 1.0,
      "tripDate": " May 2013"
    },
    {
      "title": "Absolutely bad place",
      "text": "I would not advise anybody living in this place. I had to wait three hours to get to the apartment which was a private property in a building. No sign of hotel. These guys are bunch of crooks. Do not get trapped. They stole money out of my credit card.",
      "rate": 1.0,
      "tripDate": " March 2013"
    },
    {
      "title": "A place I will not repeat",
      "text": "I do not go for luxurious or posh hotels but certain things I will never compromise - the place I stay at should be clean and should smell good, something I cannot say  about the Alisa guest house. Quite pricey for the quality offered.",
      "rate": 2.0,
      "tripDate": " March 2010"
    },
    {
      "title": "Absolutly dirty and unsafety!",
      "text": "The worst experience of our life. apartment absolutely unhealthy, dirty, unkempt and with broken things (all broken plugs, dirty sheets, curtains dirty, broken curtain rod, mold in the bathroom, shower curtain dirty, broken oven door, oven and stove covered with aluminum foil so you do not have to clean it, cutlery and dirty utensils). Nothing else to do the check in we had to disinfect the whole apartment and still the smells do not go away. There is a foul asphyxiating smell throughout the building. Besides being absolutely dirty they accused us of having damaged the carpet in the passageway very aggressively. We had a 5 day reservation and decided to lose our money and leave there (they do not return the money). We made the relevant claim to Booking and Alisa Guest House accuse us of having broken things, probably those that were already broken when entering the apartment. The area is full of junkies and is very dangerous but the worst of all is without doubt the staff of the apartments and the foul smell, to get in you have to cover your nose until you enter your apartment, and everything and that's how the smell comes in from outside to inside. We will do all that is in our hands so that health closes this business !!!",
      "rate": 1.0,
      "tripDate": " May 2019"
    },
    {
      "title": "One of the worst accommodation",
      "text": "Bad place ...we stayed only one night and we escaped to another hotel, but we paid a lot. Very dirty room, bad smell  and dust everywhere, sheets with hair, we asked to change them but it didn’t change much. Also all the electic plugs where broken , we said it but nothing was done, from there we took our bagages and we left that orrible place, they also did not refould anything. The zone was also very bad and unsafe.",
      "rate": 1.0,
      "tripDate": " June 2018"
    },
    {
      "title": "Location is good",
      "text": "We spend 3 1/2 weeks in a small 1 room apartment on 100 Pembroke Street. If you’re into luxury and cleaning is a must for you, this is not the place for you. However we were not expection much price and location considered. The location was realy great, on a quiet small street 700 meters from Dundas-Younge Square! We loved the location, being able to walk around to most of the spots + easy access to transport system. The apartment was neither clean nor completely dirty. There is no cleaning durring your stay, which didn’t bother us, but is good to know. The staff is friendly and helpfull. It was great to have a place to cook and a fridge when you’re staying as long as we did.Would definetly keep this place in mind for another budget friendly trip to Toronto ON. The experience and location is what makes this spot a worthy place to be, compared to other budget friendly options where you’ll have to eat all your meals out.",
      "rate": 2.0,
      "tripDate": " April 2018"
    },
    {
      "title": "Not attractive in any way!",
      "text": "They charge you $35 for an early check in. That aside, you have to pay a $250 refundable caution fee. Place was dirty, kitchenette very dirty with food residue on the very few utensils they provided. I had to clean up before I felt comfortable a bit. One pot, one frying pan, 2 glass cups, 2 mugs, 2 plates and 2 saucers...that was it. The kitchenette was so small, the fridge takes up a lot of space and covers up half of the sink so you can't stand comfortably to wash dishes or do anything. You have to lean in. The bathroom was so dirty, it took a while to actually be able to use it. Nobody replenished our toilet or towel supplies. We had to buy ours. The bed was so uncomfortable and the pillows so flat. There was hair all over the floor. The room, the elevator, EVERYWHERE... smelled of urine and cigarette smoke. House keeping is non-existent. There are lots of drug heads and homeless in the area too. I didn't feel to safe outside once it was evening. The pictures are a total scam as they don't show you the actual place. For the amount one pays to lodge, this is a total rip-off.",
      "rate": 1.0,
      "tripDate": " July 2017"
    },
    {
      "title": "We rent in Alisa Guest Home - 100 Pembroke Street, it was very nice for us",
      "text": "We rent in Alisa Guest Home - 100 Pembroke Street, M5A 3Z1 Toronto, CanadaIt was very nice for us, we liked the apartment and its conditions. We did the reserve using Booking.com and the site said that we will have pick up at the airport and we haven't it.",
      "rate": 4.0,
      "tripDate": " July 2016"
    }
  ]
}