{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "All Days House #3",
    "url": "/Hotel_Review-g155019-d658284-Reviews-All_Days_House_3-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.0",
      "reviewCount": 25
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "572 Sherbourne St",
      "addressLocality": "Toronto",
      "postalCode": "M4X 1L3",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-s/01/03/5d/15/in-the-kitchen.jpg?w=500&h=-1&s=1"
  },
  "description": null,
  "featues": [
    "Free High Speed Internet (WiFi)"
  ],
  "reviews": [
    {
      "title": "Location good - staff bad.",
      "text": "We arrived by car. The man at the reception said there was no private parking and instead sold us a multi-day ticket in the short-term parking zone in front of the hostel. But on the hostel bill he again charged and debited the private parking space not consumed. Emails for correction went unanswered. If you want to be permanently careful as a customer not to be overcharged, then you can book in this hostel. If you want to be treated as a guest, then you have to book another hostel or hotel.",
      "rate": 2.0,
      "tripDate": " August 2023"
    },
    {
      "title": "Close to subway and easy to find",
      "text": "I stayed there for only one night and booked for single private room. I arrived there early around 8.30 so The owner was not at the lobby yet. There was a phone outside to call the owner to let you into the hostel. He will give you the passcode to get in and leave your stuffs at the luggage room )which also has a passcode) because check in time is 2PM pnward. So, I freshen up a bit and then left my luggage in the luggage room and came back later at 1PM. The room was available so I went to the 2nd floor. The single private room was a bit smelly when I first walked in. So, I opened the window and also left the door open for about 30 mins and also turned on air con ( trying everyway to let all the smell out of my room). Every other things were ok like bathroom. I left early in the morning so I didn't get a chance to have breakfast. The internet was pretty good i would say. It's also easy to find because it closes to the subway. There are several coffee shops like Tims Horton, starbucks around the hostel. The owner was so so. Could not give advices to me i.g bus to attraction places but i did some homework before I travelled here so I didnt find it difficult and no need for his advices.",
      "rate": 4.0,
      "tripDate": " May 2012"
    },
    {
      "title": "OK",
      "text": "The room I stayed in was in the basement and thus was a little dark and it was also very hot (it was December). The room was clean enough and the bathroom was also clean. It is a place where you will be left alone.  It is nothing special but it is a good price and good location.",
      "rate": 3.0,
      "tripDate": " December 2012"
    },
    {
      "title": "I would not recommend this place, management is unprofessional and a liar.",
      "text": "Not worth it if you are with 3 or 4 people. You would pay the same for a hotel. Management lied to our face when we had physical proof. We had a reservation for a 3 twin bed ensuite and got 2 double bed ensuite. We came here really for the convenience of 3 beds as it was 3 of us travelling. If we arrived earlier we would have left and gone to the Holiday Inn as it was the same price and more centrally located Downtown. There are other hostels in downtown that have more professional service and have more integrity. But to be lied over the telephone while making the reservation and then being lied to our face, I would never come back nor recommend anyone this place. Also there is something sketch going on with the owner and the parking lot. He owes them money that is for sure because the parking attendant was insinuating it.",
      "rate": 1.0,
      "tripDate": " July 2011"
    },
    {
      "title": "worst management in the travel industry",
      "text": "Nobody is running the hostel - guest come in at all times and they are left waiting in the cold for 1/2 hour as the doors are locked. A complaint to the manager was met with hostility. The management is the worst I have ever seen for anyone in the hospitality industry",
      "rate": 1.0,
      "tripDate": " January 2011"
    },
    {
      "title": "Wouldn't recommend it",
      "text": "I booked a single room with a shared bathroom.  Disgusted when I saw my room. My suitcase just about fit into the room.  There was a grubby top blanket on my bed and the air conditioning wasn't on. Chewing gum stuck to the wall. I had booked into House #3 but was brought to a building next door which was twice as grubby as the first.  seriously wouldn't recommend it",
      "rate": 1.0,
      "tripDate": " August 2010"
    },
    {
      "title": "Very disappointed",
      "text": "My daughter has stayed here before and was pleased, so we chose it again for a weekend together in Toronto. Booked a private room for 2 days.  We arrived around 5 p.m.-called to have someone open the door- person who answered , Aram or Adam (?) said we had to come around the corner to another location due to a problem with our room.  The problem was, we couldn't understand him-his speech was heavily accented, and it took us 20 minutes of standing in the rain to get him to come out so we could see where to go.We got in, he said he had a room for us. So we go up the stairs, he opens the room door, there's someone else in the room!  It looked as though 3 twin beds had been put in, and this, he said, was our room.We refused, reminded him we had booked a private room, but he seemed completely clueless as to why we didn't want to share with this other person.  He then said he was checking the computer to see what else was available-couldn't find anything and didn't seem too concerned about it.He said he had called my home phone and asked for me, which my husband confirmed, but left no message. He said he sent me an email, but I was checking my mail several times daily on my way there, and nothing was sent.I can't rate the place on amenities,cleanliness, etc. since we never got in. We wound up going across the street to the Clarion (which was great, by the way) and spending extra money.A session of customer service is definitely needed with this guy.",
      "rate": 1.0,
      "tripDate": " August 2010"
    },
    {
      "title": "Loved the location",
      "text": "Besides being a cheap place, it's great, I mean, I stayed there for  only 3 nights but I can tell you it's a very cozy place. It has a clean kitchen available at any time of the day, free internet acces, there's only one computer but it's enough. Plus, the housekeeper is very nice and you can get into contact with him very easily. Plus it's very close to everything and in any case you need to move farther the metro station is just a few steps away.",
      "rate": 5.0,
      "tripDate": " June 2007"
    },
    {
      "title": "the best accommodation we had in Toronto, not in downtown",
      "text": "After staying 3 days downtown we moved to All Days and found a great place. Everything worked perfectly and the service at the reception was great. We could leave our luggage there until 10pm the day we left. Internet was great. Also free desktops available. Room was clean, quite small, but with a great bed and big television.Price was good value for what we got. The equipement and design was quite modern. If we come back to Toronto we stay there again and we would highly recommend it!",
      "rate": 5.0,
      "tripDate": " April 2011"
    },
    {
      "title": "Helpful staff. Affordable, clean, good location and some unexpected amenities.",
      "text": "We booked this hostel room for three people (my brothers and me).  I didn't get my hopes up too much, because I didn't expect a hostel to be as luxurious or as private as a hotel.  I was pleasantly surprised.The room was a good size for the very affordable price (affordable means all three of us stayed in one room, three nights, for about $300).  Although some rooms share a bathroom, we paid a little more for a private one.  We had two beds (decently comfortable), a desk, two comfortable lounge chairs, a dresser, a locked cupboard for our valuables, a fairly new glass-doored shower and a clean bathroom. Also, an alarm clock and a TV with a good amount of channels.There was also shared access to a kitchen (full stove range/oven, two refrigerators, sink, microwave and some cutlery), which would be great especially if you stayed for a week or more and wanted to buy groceries to save money.  There's a common TV area and two computers to use for free Internet access.  If you're downstairs the Wi-fi signal can be weak at times, but at least you don't have to pay for Internet use like at many hotels.Another nice feature is the access to phones in the common room.  One phone will let you call anywhere in North America for free and the other lets you call anywhere in Toronto (or whatever they consider a local call) for free.  The bed linens were very clean and we saw cleaning staff mopping and vacuuming the common areas on two different occasions over three days, so I'm not sure why others have claimed this place is so dirty.You are issued one key to your room and a private code to electronically open the front door to the building.  The tenants were all quiet and respectful, and no one kept us up at night with noise.Across the street is a little indoor shopping center that has things like a pharmacy, McDonald's, Goodwill, coffee and other conveniences/places to get snacks.  The hostel is located near Yonge (young) street and Bloor st., so it's pretty convenient and easy to catch a cab nearby and you're within a few blocks of several restaurants. Being from Michigan, we didn't know anything about the area, but it's definitely a good location for quick access to food, shopping, taxis, the subway and some pretty neighborhoods.  We never felt unsafe walking around that neighborhood at night.You don't get a free breakfast or coffee, but at the low prices you wouldn't expect that anyway.It's a good, clean, safe place to take a break and sleep, and you'll probably be out enjoying the city so much you won't care that it's not a 5-star hotel with a swimming pool, etc. My opinion is that you don't want to invest too much of your time or money at a hotel/motel/hostel during travel.  Get out and do things. If you keep your expectations reasonable, you'll find this to be a great place to stay.  If you prefer paying $200 a night for a huge bed, minibar, fitness center, concierge and swimming pool, then this place may be too basic for your tastes.",
      "rate": 5.0,
      "tripDate": " March 2011"
    },
    {
      "title": "Great Location next to the subway",
      "text": "Average cheap place.Regular room with cable TV and WI FIDecent shared bathroomNice shared kitchenSafe neighbourhood. You can find a convenience store, a drugstorel, some restaurants, a supermarket and a coffeeshop veru very close.Sherbourne subway station after a 1 minute walk, thats the best part of this place",
      "rate": 3.0,
      "tripDate": " October 2008"
    },
    {
      "title": "pretty average",
      "text": "The rooms on the top floor were roomy and light, also clean enough. The bathrooms were not clean and we booked (and paid for) what was advertised as an ensuite rom - only to find we were sharing the separate bathroom with 2 other rooms. The kitchen facilities generally were ok, but parts needed a good clean. Location wasn't bad, a long walk from downtown but easy access to transport. There didn't seem to be a manned reception of any kind. Up top on the third floor it was quiet enough (though a quiet season) but it looked as if the rooms on the ground floor would be pretty noisy.",
      "rate": 3.0,
      "tripDate": " February 2009"
    },
    {
      "title": "unless you like bedbugs, RUN FOR IT",
      "text": "Literally the most heinous place in the entirety of the GTA. To start, they charge a 25$ fee if you arrive late which is unheard of at similar establishments. Then, they do not honor the price you booked at but instead pull out some other number that was 200$ over what I agreed to pay. They also tried to lie and say they did not take Amex which they definitely do, thankfully, so their fraud department can deal with them. Then, the circus of horrors continues when you arrive at your room, where you find an A/C full of mold and linens that may have seen a washer when Harper was in office. At least you have the bedbugs to keep you company. The pillow was flatter than a sheet of 8x11.5. Besides that, the washroom is also generally awful, with a shower liner black with mold as well as a tub that is a cesspool of viral warts and athletes foot. This is all even more disappointing since this place has the potential to be spectacular if they cleaned up their act. They are a 2 min walk to the subway, close to a grocery, close to tons of restaurants, walkable and quiet. But until they get their s*** together, DO NOT STAY HERE. do not trust the prices they put. its a lie.",
      "rate": 1.0,
      "tripDate": " September 2022"
    },
    {
      "title": "great price for Toronto",
      "text": "I stayed in the All days two nights. It is close to the subway, in Downtown. The stuff was really nice and when I asked them, if it was possible to change room (the first one was next to the kitchen) it was no problem at all. I had a lot of questions and they explained everything patiently. (-: What i like about this place is; on the one hand you have the advantages of a hostel on the other hand you feel in your room like in a hotel.",
      "rate": 5.0,
      "tripDate": " August 2013"
    },
    {
      "title": "Feels more like a hotel, but convenient",
      "text": "This hostel has more of a hotel feel to it, except with the bonuses hostels usually have. To make it easy, I will just give you a list of pros and cons.Cons:- No fridge or microwave in the room- There was a GIGANTIC bug in our room, crawling alongside our baggage. Disgusting!- We book a twin room because there were no double rooms available, only to find out that the beds were French beds and we easily could have booked a single room for us.- There is not always someone at the front desk - it seemed to be a matter of luck whether or not someone was there to help out.- No room service during our stay, the room looked quite dirty after 5 nights (though it was clean when we checked in)- The vents of the air conditioning were under the bed, meaning we had to move the bed in order to properly cool down.- 5 dollars extra for doing laundry- No breakfast includedPros:- TV in the room- Private bathroom- Two fully equipped kitchens in the hostel with fridges to store stuff and microwaves for heating it up- Free and exceptionally fast wi-fi for a hostel- Very close to Bloor St. shopping district, around the corner from the subway- Air conditioning- Laundry room (see also cons)- Walking distance (5-10 mins) to 3 large supermarkets- Bookshelves and common room TV",
      "rate": 3.0,
      "tripDate": " August 2012"
    },
    {
      "title": "Nice Place To Stay",
      "text": "This guesthouse is very nice & a friendly place to stay. It has a communal area for TV and internet use, and is a very good location, minutes walk from the train station. The only gripe is the rooms are very small, and as this was part of a big trip, we only just managed to fit two suitcases in our room. Other than that, was very nice place to stay.",
      "rate": 3.0,
      "tripDate": " September 2011"
    },
    {
      "title": "Very helpful staff",
      "text": "I left my ipod at the hostel and they were extremely helpful in helping me to get it back. Thank you!",
      "rate": 5.0,
      "tripDate": " February 2012"
    },
    {
      "title": "Brilliant, inexpensive Toronto option",
      "text": "My partner and I usually stay at hotels, but we're travelling around North America at the moment and are finding accommodation in the big cities really expensive. I did a lot of research before deciding to book at All Days (Selby Street, off Sherbourne) but was still a bit apprehensive because of mixed online reviews. The hostel however, is clean, tidy, well appointed and well located. Definitely give it a go. Brilliant value for money and in our experience was well maintained. Head up the road onto Sherbourne to the grocery store though (much cheaper than the one across the road). Great location, near metro on Sherbourne, and easy walking to Yonge, Bloor etc. Even some cool tv and movie filming going on in the area. We were in a private room (44) which was clean, comfy and across the hall from the bathroom and kitchen - easy, clean and convenient.",
      "rate": 5.0,
      "tripDate": " September 2011"
    },
    {
      "title": "You don't forget ALLDAYS",
      "text": "I have been in alldays for six weeks with another friend. We were for studying English in Toronto and this place is excellent because is close Yonge St and also you can arrive any place quickly. Regarding the cleaning is perfect because everyday the hostel is cleaned up. About people who is working in Alldays is very friendly, kind and talkative, they help you when you need something and also they recommend you someplaces to visit. Kitchen and washroom are OK because the kitchen is cleaned and full equipment. There are a lot of washrooms so you don't have to wait for a long time. It's the best option to stay in Toronto because it's not expensive and it's good location!!  Thanks for all!!",
      "rate": 5.0,
      "tripDate": " August 2011"
    },
    {
      "title": "Fantastic",
      "text": "This was the best \"hostel\" type accommodation I stayed in throughout my 7 week trip of north America.It was clean, the owner was friendly, the kitchen was clean, the showers were hot and cleaned everyday, 2 minute walk away from the subway, the owner was easy to reach on a free phone 24/7, the kitchen was well equipped, free wifi, large tv with cable in room and there was a tim hortons, timothys, submarine, no name (supermarket) all within a 2 minute walk.FANTASTIC!!!!!",
      "rate": 5.0,
      "tripDate": " August 2010"
    },
    {
      "title": "You get what you pay for!",
      "text": "Stayed here for one night in June. To sum it up, I feel that we got our moneys worth! Arrived very early (about 8am due to an overnight bus journey) and turned up to the hostel to see if they could let us check in early. Have to use a phone outside the building to talk to the manager, and at first we wasn't too keen, but after a bit of polite persuasion he let us have a room early and was extremely helpful and accommodating. We had a private room in the building a couple of doors down (which we weren't too sure about at first) but it was actually fine. Nice little room. We used the laundry facilities which were perfect and found the manager to actually be very helpful throughout our short stay. Location is OK too. All in all I do feel that we got what we payed for and had a good nights sleep!",
      "rate": 4.0,
      "tripDate": " June 2010"
    },
    {
      "title": "Adequate. Room clean and quiet, but small. Dodgy neighborhood at night.",
      "text": "It does not seem to be staffed 24 hours a day...or if it is, you have to ring someone up and it will be at least 20 minutes before they arrived. Granted, I arrived late at night.It wasn't a problem for me. Also, they accept USD, without an extra charge, which is nice.A fellow will check you in with his laptop and get you a key to your room. You can ask for a receipt. Houses have security on them...you punch in a 4-digit code to enter a house.This is a group of several houses. It is about 2.5 blocks South of the listed intersection of Sherbourne & Bloor (which is the subway stop). It is directly across the street from 'Shoppers Drug Mart'.  More accurately, the intersection is at Sherbourne & Isabella (walk North on Sherbourne, it's on the left). This is important to know at night...it took me way too long to find it. I should have done the above research.If you search for the exact address on Google maps, you will get the correct idea.Also, it is quite far away from the nearest Airport Express shuttle bus drop-off at the Delta Chelsea hotel. Take a taxi from there to the hostel, don't walk it.Hostel is clean and quiet, but my room was very small. I had an private bathroom.The shower stall was small and I had to stoop to use it (I am 6foot+ tall).No problems with roaches or bedbugs.Nice color television with 2 French channels, 1 Russian, 1 British(?), and a few Canadian.My room had an exposed heating element about 2 foot long with curtains very near them.I was afraid that it would cause the curtains to ignite. I tucked the curtains into the window to avoid this.Overall, service is very basic. No one will clean your bathroom everyday and provide fresh towels. You get one thin towel, a regular bar of soap, and a roll of toilet paper.Kitchen was very nice, with 2 refrigerators in the basement, but I always ate out.Neighborhood is dodgy at night, with hookers, beggars, and various other dubious people about. Usually not a problem if you walk fast and ignore them. Women beware.No problem at all in the daytime.Getting out was easy. Just leave the key in the box.Take the subway (Sherbourne station) westwards to Islington subway station.Taxis will be there to take you to the airport. This will save you at least $20 on taxi fare.",
      "rate": 3.0,
      "tripDate": " April 2010"
    }
  ]
}