{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Ambassador Inn Downtown Toronto Bed and Breakfast",
    "url": "/Hotel_Review-g155019-d183052-Reviews-Ambassador_Inn_Downtown_Toronto_Bed_and_Breakfast-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.0",
      "reviewCount": 17
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "280 Jarvis St",
      "addressLocality": "Toronto",
      "postalCode": "M5B 2C5",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-s/00/14/50/6a/i-love-this-corner-of.jpg?w=500&h=400&s=1"
  },
  "description": "Ambassador Inn is one of the finest B&B boutique inns in downtown Toronto. It provides affordable accommodation with luxury, comfort and style. Situated in the heart of downtown's entertainment, tourist and business district, Ambassador Inn is surrounded by public transits, shopping, restaurants, theatres, galleries, museums, and many other attractions.",
  "featues": [
    "Internet"
  ],
  "reviews": [
    {
      "title": "Quiet and not expensive",
      "text": "I stayed at the Ambassador in June 2005 and had a very pleasant experience.  The room was immaculate, the breakfast was fine, and they had free computer access.  No, I didn't have a view of Lake Ontario, but I wasn't paying for that.  I found this a great place to stay if you need a clean, quiet place to crash after touring Toronto.  The staff was very cordial.  I would definitely stay there again.",
      "rate": 4.0,
      "tripDate": " June 2005"
    },
    {
      "title": "Good Experience",
      "text": "My partner and I stayed at the Ambassador Inn Bed & Breakfast for 5 nights following the Christmas Holiday. Although we had stayed at another bed & breakfast owned and operated by the same individual during 3 previous trips to Toronto, this was our first stay at the Ambassador Inn. The Ambassador Inn appears to be the owner's best property. Our med-priced room was very nice. The full breakfast was one of the best eaten. In addition, we received a brief and enjoyable history/culture lesson on Singapore from one of the hosts who is a China native. Other than some noise associated with guests checking in late one night, our overall experience at the Ambassador Inn was very good experience.",
      "rate": 4.0,
      "tripDate": null
    },
    {
      "title": "Nice but some room for improvement",
      "text": "We stayed at the Ambassador in last February.  The staff was very friendly and helpful.  Upon arrival due to some booking confusion, they kindly upgraded our room to one of the larger nicer rooms at the same discounted price (February appears to be the slow season).  The Ambassador Inn has been very expertly remodeled and the rooms are charming especially with the ceramic/stone tiled bathrooms and jacuzzis.  All in all, it was a very enjoyable experience which is why I rated it at 4 dots.  The rest of the review concerns why I did not rate it at 5 dots:Firstly, although discounted for the season the price struck me as somewhat high given the following lack of amenities that you might find elsewhere:1) There was no DVD/VCR player in the room.  Canada is a cold place in the winter and it snowed while we were there.  I had brought DVDs in expectation of potentially being snowed in.  Fortunately I also brought my own portable player that I use in Airports.2) There was no internal thermistat in the room (that I could find).  They do supply a heating unit that you can plug in for additional heat but even Motel 6 allows you to adjust the heat and air conditioning.  The room was neither too hot or too cold given the weather but it would have been much more of an issue in excessively hot or cold weather.3) Breakfast.  I would say that if you stick to the fruits, cereals, and croissants you'll be very satisfied.  As for French Toast and Pancakes, because of the friendliness of the staff I would give them an A for effort, but clearly IHOP they are not.On the positive side, the things I liked most about the Ambassador Inn are:1) Well remodeled and very clean2) Big Rooms available with nice bathrooms3) Convenient location (public transportation, restaurants, convenience shops)4) Friendly helpful staffThe Ambassador Inn is a nice place with a friendly staff that aims to please.  (Can't say that enough) For me, moreso than anything else, good service makes for an above average review-- thus I give it 4 stars (*)s.",
      "rate": 4.0,
      "tripDate": null
    },
    {
      "title": "Did we stay at the same B&B??",
      "text": "Okay...I'm not sure where everybody else stayed, but our experience was not that great.  First, the room was WAY over-priced.  Second, the breakfast was disgusting - I've never had greasier french toast in my life.  There were only two cereals to choose from and 3 croissants.  From the outside, the place looked like a dump - no visible signage...and why don't they accept Toronto residents?  There was nothing about this B&B that you could not get for the same or better price at a hotel.  In addition, we found the staff pushy and overbearing.  We were very disappointed.",
      "rate": 1.0,
      "tripDate": " June 2006"
    },
    {
      "title": "We Like Our Home Comfort at Ambassador Inn",
      "text": "We have stayed here three times so far.  What we like best is the homey feeling.  Every time we come back, it feels like home coming.  You will have to stay here to know what we are talking about.  Take a look at “our room” – Room #303.  Isn’t it cute?  By the way, Ambassador Inn’s room rates are from over $100 and up.  We love their honeymoon rooms with heart-shape double Jacuzzi tubs.  Even though they are over $300 per night, they could be over $800 easily in a downtown hotel.  Ambassador Inn is not cheap.  They have no reason to be cheap.  Their bedding sets are of the same superb quality as the ones we paid over $400 for.  Whether you choose to stay in a Bronze Room for lower cost or in a Platinum Stay for style, you get the best value for your money.",
      "rate": 5.0,
      "tripDate": " June 2006"
    },
    {
      "title": "Ambassador inn is my second home",
      "text": "I travelled and stayed in many B&B but staying here felt right at home.Your place is warm, Clean, (your B&B were the cleanest in Toronto) and very comfortable. Having internet access was an added benefit. We will miss the great breakfast, the friendly staff and we will definitely stay here whenever we come to Toronto. We will recommend our friends back home",
      "rate": 5.0,
      "tripDate": " April 2006"
    },
    {
      "title": "One of the Best B&Bs in Toronto",
      "text": "I have stayed in a number of B&Bs in the past a few years.  So far, I rank Ambassador Inn the best.  Its location is super central, its rooms are immaculately clean, its people are very friendly and charming.  Most of all, it is very stylish with home comfort, and it has class. Loved it.",
      "rate": 5.0,
      "tripDate": " March 2006"
    },
    {
      "title": "delightful stay",
      "text": "thank you very much for the delightful stay, lovely and quiet rooms. we enjoyed very much the peacefulness, hospitality and loved your wonderful breakfast.",
      "rate": 5.0,
      "tripDate": " July 2006"
    },
    {
      "title": "A horrible \"bed and breakfast\"",
      "text": "We stayed at the Ambassador Inn about 5 years ago- I wish I knew about this site then.  It is a terrible place and management is very dishonest in thier representation of it when advertising!  First of all, our room had a view of a brick wall and a garbage dumpster!!  Our \"breakfast\" was 2 tickets to a restaurant (deli-type) down a block and across the street from the Ambassador!  THe only breakfast type items were danish and fruit.  That place was so dirty we wouldn't even sit down in there to eat.  The staff advised us it would be \"nice' to walk to the Pantages Theater that night.  Wrong.  The walk was 45 minutes and thru some of the scariest, nastiest parts of Toronto there are.  When we returned that night around 12AM there was food dumped all over the sidewalk in front of the Inn.  This place was terrible. THe staff was rude and not helpful at all.  We spent one night there and left.  It was too nasty to stay any longer!",
      "rate": 1.0,
      "tripDate": " June 1999"
    },
    {
      "title": "Misleading advertising",
      "text": "Ambassador Inn, A Gardenview House and Jarvis House are all owned by the same people, they are all within the red light /gay district of Toronto, not necessarily \"the tourist district\" as they so nicely put it. Their web site implies that these three B&Bs are the best three in Toronto. While there are excellent B&Bs in Toronto, these are not,  unless all you want in a central place to put your head down and you don't care about the neighborhood. Do your homework folks -that's all I can say.",
      "rate": 1.0,
      "tripDate": null
    },
    {
      "title": "excellent service",
      "text": "Thank you very much for everything. we, group of janpanese really enjoyed your hospitality. Yes the japanese guide book is right, and all the guests here admire your staff friendliness and excellent service. We really could feel at home. We will certainly come back again.    sincerely   Nobue",
      "rate": 5.0,
      "tripDate": " April 2006"
    },
    {
      "title": "Loved it..",
      "text": "Stayed here in Dec.'05 around the x-mas hoilday. The place was clean and the room was wonderful. The location was safe, didnt have any problems at all! The staff was very kind also.. Annie is a lovely person, she kept our room nice and clean. I was here with my the love of my life and felt safe as could be. We shall be back soon in May'06. Good place to stay at a fair cost.",
      "rate": 5.0,
      "tripDate": " December 2005"
    },
    {
      "title": "Misleading and overpriced",
      "text": "The advertising is very misleading, this is a bargain basement place in a rather bad area with the bare minimum in room amenities. Unfortunately the price does not reflect the level. The use of the word \"luxurious\" is incorrect by anyone's standards. I had a sinking feeling as soon as I arrived--the front is run down with broken steps and there was graffiti on the outside of the building. The inside is not at all charming. I have a hard time believing some of the posted positive reviews of this place. To me, it was grim. There were flophouses in the immediate area with signs advertising $35/night on the windows. This place did not seem very different from the outside. The room door locks are simple little push buttons in the doorknobs; this is not enough security and left me feeling nervous given the neighborhood (many street people and other tough-looking types). There were shards of glass on the carpet under the window that made me wonder if it had been broken in the recent past. The saving features were (1) reasonably clean room and (2) comfortable bed. The noise from outside was low but the walls were thin and I was aware of every person walking up and down the hallway. I can't comment on the breakfast... the idea of instant coffee in a windowless basement was so unattractive  that I skipped. There are a lot of good cafes in Toronto and I needed to get away from this cheerless place!",
      "rate": 1.0,
      "tripDate": " May 2007"
    },
    {
      "title": "Cheating Place",
      "text": "I have never had nightmare until i stayed in Amabassador Inn.At  first sight,the house was like jail.It was simply built by  bricks,and there was a kind of bad smell when I got into the Inn. lots of  garbage men,drug dealers and hookers around that area,especially at night,and that makes you nervous every second.   The advertising is misleaded,and the photos of all the rooms were made by photoshops.That is why the rooms on the website were totally different from the reality.I felt i was cheated.   For booking the room,i had paid by my credit card before i got Toronto.When i arrived there without seeing the room,i decided to leave this place.It was really ridiculous that the owner told me I had to pay the cancellation penalty for one day fee.   This Inn was full of cheating.Don't stay there.",
      "rate": 1.0,
      "tripDate": " July 2007"
    },
    {
      "title": "Pretty grotty area",
      "text": "When I first called this B&B, they siad they had one B&B room left & as the film festival & some medical conferance was going on I had to reserve quick quick quick.I booked it, but when II got there, they said they were going to upgrade me to a nicer suite - which was cool of them, even though I was thinking, 'I thought you had no more rooms'.It's very expensive though - work was paying for it, so I wasn't too bothered. Breakfast area is dark & dingy & each night there would be 'ladies of the night' outside the place. It seemed pretty safe. I would recommend looking elsewhere, but if all came to all, you could stay here.",
      "rate": 2.0,
      "tripDate": " September 2006"
    },
    {
      "title": "Disappointing",
      "text": "From outside it looked cozy - inside is a different story. Breakfast room is in the cellar - therefore we preferred to breakfast external.  In the room was no controller for the AC - so it was noisy and too cold at night. Besides that, it was expensive - we moved to radisson waterfront at the same prize.",
      "rate": 2.0,
      "tripDate": " May 2008"
    },
    {
      "title": "Expensive but fantastic stay",
      "text": "I found this hotel through various websites and booked it blindly.  The accomodation wasn't cheap and cost quite a bit for the 2 weeks I stayed there (i'm sure you could book an upmarket hotel for the same price).  However, saying this the personal service we recieved was second to none.  It was brilliant - the staff were so attentative to our needs and always could answer our questions when we had them.  The service was very personal and the staff make this hotel very special.  The rooms were very clean, well looked after and we were also upgraded when we arrived as the hotel wasnt totally full.  It was very quiet here and very relaxing.  Breakfast was fantastic and all needs were met.Yes the area is not the best, but you are within the very centre of downtown toronto and this area does come with beggars and its fair share of unusual people.  This is of no fault of the hotel and is a general observation of the more affluent areas of Toronto.  If you don't want to deal with this then you'll have to stay further out of downtown Toronto as you'd get this problem anywhere.  Other points of interest:*The hotel will arrange tours to Niagara and other venues around Toronto.  They will also arrange any taxis you may need.*Walking to the Eaton Centre will take approximately 15 mins if strolling slowly!  The hotel is pretty much central for everything.",
      "rate": 4.0,
      "tripDate": " August 2007"
    }
  ]
}