{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Amsterdam Guest House",
    "url": "/Hotel_Review-g155019-d2299599-Reviews-Amsterdam_Guest_House-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.0",
      "reviewCount": 31
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "209 Carlton St",
      "addressLocality": "Toronto",
      "postalCode": "M5A 2K9",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0a/4b/a4/ed/reception-porch.jpg?w=500&h=400&s=1"
  },
  "description": null,
  "featues": [
    "Free internet",
    "Internet"
  ],
  "reviews": [
    {
      "title": "Cheap stay, close to downtown toronto",
      "text": "Friendly staff, most likely family owned. They let us park at the motel way ahead of check-in time, and leave it parked after check out for 10$ a day. The place had a weird vibe to it, sort of a nursing home dorm feel. Room had two single beds, when we asked for a room with a double bed the owner replied that we could join the two single beds, but we would have to return them to their original place when we leave. We did, only to find dirt, filth and jewelry (?) where the two beds were originaly placed. Wi fi range didn't reach our room, toilets were rarely clean (likely because the regular tenants never left the motel...) the upside is the location (recieving a 4/5 because of the bad neighborhood) and the cheap rate and parking. Also rooms were well equiped with cable tv, fan, fridge, coffee-maker and microwave.",
      "rate": 3.0,
      "tripDate": " September 2013"
    },
    {
      "title": "Welcoming management but sketchy atmosphere",
      "text": "Stayed two nights booked through a discount  travel site.  The front door is locked at all times but the manager came quickly when I rang. He and his wife  and 3 dogs live on the first floor. He kindly offered to help me in with my luggage. He immediately fixed the toilet when asked. At all times he was smiling, polite and helpful.The hesitations come from the structure itself.  Upon entering there was a strong odor of incense. There are strong smells of various sorts - some were 'perfume-like' and some were musty. Even though I think that smoking is banned in the house, I still smelt cigarette smoke - but this could have been from the backyard as I had the windows open in an attempt to lessen all the smells. This is an old, haphazardly-maintained, 'Victorian era', guest house. The walls and woodwork are marked and dingy. However, the carpet in my room was clean and looked newer than that elsewhere. There were only shears on my windows - no heavier drapes or shades. Even though I was on the 2nd floor, I could still see the windows of the neighbours so I've no doubt that they could see me in parts of the bedroom. I slept in the bed that could not be seen by the neighbours.  There was a large fridge (with freezer), free bottled water, coffee-maker, kettle, coffee, tea and chocolates, and a microwave and TV in my twin bed room.  The beds were soft but I still got a good nights rest (after I thoroughly scanned for bugs - and there were NONE in my room). The bed linens and towels were immaculately white and clean - and yet the comforter/bedspread was a bit marked. My bed was made up daily and the used towels removed but not replaced. (I had 4 towels to begin with for the two-nights so not a problem, really).There was a regular size bedroom closet with hangers and a large dresser as well as two night stands. But again, the inside of the drawers needed cleaning.There are two complete bathrooms on the 2nd floor to be shared by the guests - one for women and one for men. Both must be opened by key and have a bolt on the inside. The sink and tub were clean but the floor was marked and the small rugs in front of the sink and toilet were very soiled.  The inner liner of the shower had holes and needed replacing. There was a hold/grab bar in the shower. Guests must provide their own toiletries. There was no hairdryer (but I brought my own anyway and used it in my own room).  When sharing a bathroom, there is inevitably someone waiting. Luckily, no issues here in my stay as most seemed to be considerately brief in the shower.Although there is reportedly free Internet, a resident was sitting in the hall trying for better reception than his room - the manager came and helped on that too. I did not try to use the wireless.There are cheap diners and expensive restaurants within 10 min. or less walk as well as an eclectic mix of stores - from organic grocers to home hardware.  From 9pm-8am, street parking is free.  There is off-street parking offered by the guest house for $10/24 hrs. (good deal for downtown Toronto) - reserve in advance with the guesthouse.  There is excellent public transit just outside the door (streetcar that runs frequently).",
      "rate": 3.0,
      "tripDate": " September 2012"
    },
    {
      "title": "Didn't start well but ended well",
      "text": "We booked a room and when we arrived they said they were full. We were worried about finding another room. Then they said they had a condo nearby we could use. So we got an entire condo for the price of a room at the guest house! It was clean and close to restaurants and transportation. We were happy!",
      "rate": 4.0,
      "tripDate": " September 2013"
    },
    {
      "title": "Disgusted.",
      "text": "Arrived with a confirmed booking via booking.com on Saturday 13 December to be told that it was FULLY booked and that my confirmation meant nothing.  Was given a 20 CAD dollar bill and told to find antoher hotel. This meant that my friend and I who were only in Toronto for one night after a long drive from New York spent most of that evening going around finding a hotel.  Not responsible or efficient.  MY first review... felt that others needed to know before they book this and feel safe in the knowledge they will get a room once they arrive rather than a 20 CAD dollar billl and goodbye!",
      "rate": 1.0,
      "tripDate": " December 2014"
    },
    {
      "title": "Amazing Place",
      "text": "I really recomend this place! They are so nice and friendly, you can walk everywhere from there. Just 10 minutes to the center. The place is clean, big rooms with light, tv, clean bathroom. For sure me and my friend we will be back!",
      "rate": 5.0,
      "tripDate": " December 2014"
    },
    {
      "title": "Too Filthy For Me",
      "text": "Booked 2 'Twin' rooms with 2 single beds, 1 for us, and 1 for our teenagers. The rooms were on different floors. The kids were on the 3rd floor up a narrow steep set of stairs down a narrow hallway room #15. Our room was on the 2nd floor, #11. It's a twisty turny house, reminded me of the TenBoom house in Holland- may be why it's named \"Amsterdam Guest House\". These rooms were $75/night each which was much less than anything near downtown Toronto. Basic rooms: 2 single beds, night stands, dresser with TV, small fridge & microwave.Pros: cheap, basic, we survived.Cons: bathrooms were filthy (nasty), no clock, noisy fridge, creepy people in the house (probably long-term renters), homeless man lives outside in backyard.",
      "rate": 3.0,
      "tripDate": " March 2013"
    },
    {
      "title": "Worth for the price",
      "text": "It was a very good room in the 3rd floor. There is a shared bathroom in the 2nd floor, but I suggest you to use the bathroom on the 3rd floor. The staff was very good. I recommend you to stay there if you don't have a lot of money to spend, and don't want a shared room.",
      "rate": 3.0,
      "tripDate": " October 2012"
    },
    {
      "title": "Pleasantly surprised",
      "text": "I booked this in a hurry and only read reviews afterwards, some of which made me a bit anxious before we arrived. Our fears were unfounded. The manager greeted us promptly, was very friendly and helped carry my case up the stairs. She sent her mother around the back of the hotel to direct us to parking. Our room was clean and quiet and the bathroom was clean as well. It is very simple accomodation but then the price is so reasonable ( and parking was just $ 10) for Toronto that you can't complain. The area is a bit seedy but the streetcar runs right past their front door and takes you to the subway in five minutes...a very convenient downtown location. I'd go back again..",
      "rate": 3.0,
      "tripDate": " May 2013"
    },
    {
      "title": "Clean and Tidy",
      "text": "We stayed here for 2 nights in January and we were pleasantly suprised.  It was really clean and tidy, they provided tea, coffee, a microwave and towels/soap in the room which we were not expecting.  It was really warm inside which was nice too.  The management were never really about and we just posted our key through the door when we checked out.  When we did speak to the management they were friendly and very helpful.It is within walking distance of the city and the greyhound bus terminal and there are plenty of restaurants and cafes near by.  There is even a cheap supermarket to grab essentials about 2 mins away.We have booked to stay here again in March when visiting Toronto.",
      "rate": 4.0,
      "tripDate": " January 2013"
    },
    {
      "title": "A hidden gem",
      "text": "I say hidden by virtue of the fact they didn't appear on many of the searches I made for accommodation. Perhaps they should look to address that.This place is great though especially considering the low price.Very clean and cosy rooms with TV, Fridge, Coffee maker and even a Microwave (should you need one). Free Wifi is available throughout the building and there is a large balcony with a nice view of downtown. Staff were pleasant and helpful.The location is perhaps not ideal for anyone wanting to be right in the center but you're only a 15 minute walk from College subway station and the streetcar stops right outside and the local area is nice enough.If you're looking for a decent quality place to stay without wanting to spend too much you won't be disappointed by this place.",
      "rate": 4.0,
      "tripDate": " July 2012"
    },
    {
      "title": "Well placed, well priced, helpful staff",
      "text": "Stayed here for 3 days whilst experiencing Toronto for the first time - it proved to be a good base of operations, was well maintained and conveniently close to the streetcar stop.For around $10 a night we were able to park our rental car in the hotel's private (& fenced off) backyard, which we found useful and no trouble.The room was perfectly adequate for the price we paid - our room looked out onto the street and whilst the streetcars are frequent, the noise was not an issue.There was no ensuite with the room but there were shared bathrooms on each floor which were again adequately maintained - if there were any issues then the helpful staff were more than happy to help.I would definitely recommend the hotel - it may seem a little out of the way, but the streetcars get you to where you need to be quickly enough - Toronto is so vast & spreadout that you're always going to be far away from something!There are quite a few homeless people that you'll no doubt see roaming around - didn't have any issues with this though.The aircon in our room made things a little chilly - not too much of a problem except that there didn't seem to be an option to turn it off.",
      "rate": 4.0,
      "tripDate": " July 2015"
    },
    {
      "title": "Meets expectations for a budget guesthouse",
      "text": "The guesthouse is quiet and clean. Scott, the host, is a really nice guy and went out of his way to be helpful. The only issue we had was that the towels were not refreshed after use. Otherwise, it fulfils its requirements well for accommodation of its type. The aircon was great and very welcome in 35 degree heat!",
      "rate": 3.0,
      "tripDate": " July 2015"
    },
    {
      "title": "Just what you need...",
      "text": "Reasonable price for air conditioned rooms. Clean and tidy. Stayed for 4 nights. Comfortable beds. Great little guest house. Close enough to the centre (25min walk). Plenty of cabs pass there too. Far enough out of the city to be quiet too. Free wifi too!",
      "rate": 4.0,
      "tripDate": " June 2015"
    },
    {
      "title": "We had a nice stay",
      "text": "I'am from The Netherlands, so the name (Amsterdam...) feels like home to me haha. Very friendly staff. Location is good, near business district and shopping center. Cheap stay; room was ok. Area kinda creepy at night.",
      "rate": 4.0,
      "tripDate": " August 2013"
    },
    {
      "title": "An Odd Budget Guesthouse",
      "text": "This place is very well situated for a tourist to Toronto (which city I'm extremely familiar with, having lived there).  the guest house is an old Victorian house.  It's clean.  There's an elevator that seems to only work when one of the women running the place turns it on.  WiFi is spotty and I had to get them to reset it twice.  I was on the 3rd floor, and there are not 'house phones' so it was a lot of steps up and down.  The 3rd floor is blocked off from the 2-level second floor because--and I didn't know this until I got there--the 2nd floor is a permanent residence for elderly and infirm people.  If the Amsterdam was not kept as clean as it is, this arrangement wouldn't work.  The staff are nice.  My room large, 2 beds, large dresser and closet, desk, chair, fridge and TV, the usual.  There is a separate bathroom for this floor which has about 6 rooms.  If you are on a budget--and Toronto is an expensive city for hotels--this place could work for you.  But make no mistake--this isn't the Hilton and it's very plain and down to earth and reminds me of some of the low-rent places I've stayed traveling in Europe. The area is not dodgy but it's a mix of up and low-scale.   1/2 a block away is Parliament St.  Turn left you have great shops and restaurants.  Turn right and, not so great.",
      "rate": 3.0,
      "tripDate": " May 2013"
    },
    {
      "title": "Very nice place to stay",
      "text": "We had a great stay in this place. The staff were very helpful and nice. Its very clean and have a pleasant smell. The bed was very comfortable to sleep on. I just dont like the shared bathrooms but i think if you're staying here for a night or two it'll be okay. The price is very reasonable. I will definitely come back here!",
      "rate": 4.0,
      "tripDate": " August 2012"
    }
  ]
}