{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Annex Quest House",
    "url": "/Hotel_Review-g155019-d511119-Reviews-Annex_Quest_House-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.0",
      "reviewCount": 173
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "83 Spadina Rd",
      "addressLocality": "Toronto",
      "postalCode": "M5R 2T1",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-s/01/6a/74/ba/annex-quest-house.jpg?w=500&h=400&s=1"
  },
  "description": "Our ecologically friendly \"Vastu\" rooms were specially designed for a holistic, cozy, and hospitable experience for daily, weekly, and extended stays. All rooms have en-suite bathrooms, coffee-maker, mini-fridge, breakfast snacks, free wi-fi and cable TV. Parking and laundry are also available. It is conveniently located in midtown, a short walk to the Royal Ontario Museum, Casa Loma, University of Toronto, Fields Institute, George Brown College, Varsity Stadium, Queen's Park, Yorkville and Bloor Shopping. Steps from the Spadina North Subway, arrive at Downtown Theatres, the Roger's Centre, Air Canada Centre, Union Station and University Avenue in minutes. We are proud to offer a strictly non-smoking environment.",
  "featues": [
    "Free High Speed Internet (WiFi)",
    "Wifi",
    "Non-smoking hotel",
    "Laundry service",
    "Self-serve laundry",
    "Air conditioning",
    "Refrigerator",
    "Non-smoking rooms"
  ],
  "reviews": [
    {
      "title": "Okay but not too special",
      "text": "I was expecting a bit more from the web site, which proclaims that you will be pampered \"body, mind, and soul.\" Except for some nice smelling soap, that was about the extent of the pampering. The room was furnished interestingly, with walls painted a deep red/purple color, and some nice furniture pieces, but I found the bed to be really hard and for this reason would not return. Room was clean enough, but I found several long hair strands, one on the sheet, one in the tub, in the towels, and in the sink. The copper sink bowl was pretty, but impractical to use.There was a brew and go cup coffeemaker in the room, but when I went to use it, a roach crawled out. Since this is a guest house, not a B&B, no breakfast was served, but there are cafes nearby. When I came back to the inn the first night, granola bars and bottles of water had been left on a table in the hallway, which was a nice touch. I thought I would grab one of each in the morning. However, a noisy group left before me, and took every last one. The next night, none were put out. I was there for two nights and both mornings, very early, a pigeon was roosting and making lots of noise on the window air conditioner. In fact, it kept pecking the accordian fold in the space between the unit and the wall, trying to get in, which was very annoying.The owner checked me in, and I didn't find her too friendly, considering she was the owner and not just a staff person. Location is definitely convenient but I'd stay in a regular B&B and hope for a more comfortable bed the next time.",
      "rate": 3.0,
      "tripDate": " September 2005"
    },
    {
      "title": "Fantastic, Pleasurable and Individual, Superb.",
      "text": "I stayed at this amazing guest house in August, the room I had was a sub level room offered.  It was fantastic, completely original and extremely clean and tidy.  I had a bathroom included in my room, again this was super clean and tidy and cleaned for the duration of my stay.  The manager whom I dealt with was very organized and was able to meet my requirements.  I would definitely stay here again and would have no problem in recommending them to others.  I would also like to add that the location is fantastic, I arrived by greyhound bus and the guest house is about a 30 min walk from the main station or a $10 cab ride.  It is also superbly located for the trains/buses.  And very local to many restaurants.",
      "rate": 5.0,
      "tripDate": " August 2011"
    },
    {
      "title": "Very Accomodating!",
      "text": "This place was very accomodating! We enjoyed our stay and will be back.  The rooms were nice and clean. The location was great with it being so close to public transportation.",
      "rate": 5.0,
      "tripDate": " July 2011"
    },
    {
      "title": "DISAPPOITMENT",
      "text": "This place is nothing it touts itself to be!  The room was small, right on the road, so heavy traffic kept us from our sleep.  No other rooms to change to as this place only has double beds and one or two queen beds (for two).  There is NO breakfast as it is a bed and breakfast.  Protein bars, box juice and tiny boxes of raisens are surely not a breakfast.  We have stayed in B & Bs around the world and this by far is the worst we have stayed in.  What I would do next time?  I would make sure the room would not be on a busy street.  The Price was high for this three night stay.  We could have stayed in the Holiday Inn on Bloor St for $10 to $20 more per night and gone to Tim Hortons for a cheap breakfast.",
      "rate": 1.0,
      "tripDate": " September 2011"
    },
    {
      "title": "crappy dormitory with no name rice crispy bar breakfast",
      "text": "Terrible place. Not a b and b but a dingy dormitory with very small rooms, cable $5/day internet, no human presence. Friends must be writing the positive reviews. Would be overpriced at $40. Good location, very bad energy. Parking $7.",
      "rate": 1.0,
      "tripDate": " February 2011"
    },
    {
      "title": "What a dump!",
      "text": "This place had a strange smell.  It's on Spadina and it's not in the best part of town.  We were concerned for our car in the miniscule parking lot out back. There were I think 5 parking spots - way too few for the number of rooms.The photos on their Web site are postage-stamp size. You might ask yourself why.The corridors were dark and gloomy. Our room was dark and gloomy as well.  This was the kind of room you didn't want to walk around in with bare feet.I could go on and on and on, but you'd never get the picture.  I disliked this place so much I put up a blog about it. Plenty of pictures there!  We felt like we were really ripped off!See the blog at [--]",
      "rate": 1.0,
      "tripDate": " April 2008"
    },
    {
      "title": "Two nights in Toronto",
      "text": "On arrival we were met by a friendly member of staff and through our stay people we met who worked or owned the place were friendly and polite.The location is very handy for the Spadina subway and streetcar system which is accessed by the building next door. This covers virtually all of Toronto.Unfortunately we found the room facilities did not meet the needs of a traveller. The bed and cleanliness of the room was very good. The décor is nice and the ethos is good .The tired traveller requires more practical and physical needs in a room.1.A sensible sink (this was a trendy beaten copper raised bowl) preferably inside the bathroom with a drainage plug to hold water for washing and shaving. Think of the pure wastage of hot water constantly running for the sacrifice of a trendy looking bowl.2.A large practical mirror to use for shaving and all other uses.The tiny (1x2 foot inside a cupboard) mirror was much too inadequate I'm not sure how people who worry about hairstyles and make up would manage. More than one mirror would have been even better.3. There were only 3 hangers in the room. We had lots of items we wanted to hang up from creasing.If guests were pinching them make sure they are the type that can not be taken.4. When the room is facing on the sunny side in the daytime and towards the street with bright street lighting at night a slack Venetian blind is not enough. Proper drapes are needed. I could read a book at 4am and wear sunglasses in the room in the day.5. The air conditioning unit was badly needed. Our room was in the eaves of the house so was really hot. In preparation for our arrival it had not been turned on and it was like walking into a furnace. We found why it wasn't on when we switched it on ourselves. I think the bearings were worn and it was so loud we couldn't hear the TV above the noise.6.It was a nice idea putting the fridge in the room. I suggest it should standon a piece of insulation as it hummed loudly constantly on the wooden floor. It would have been nice if it had been stocked with some water and juice ready cooled to refresh a hot tired customer. A couple of drinking glasses in the room were needed but we had to manage with a toothbrush mug between us.We stayed at other places in Toronto that got things just right so probably wouldnt go back to this place again.We are very regular travellers all over the world and experienced everything from 5* to hostel and hope these comments are useful and constructive",
      "rate": 2.0,
      "tripDate": " July 2005"
    },
    {
      "title": "No frills but well done",
      "text": "I needed to be in Toronto for 2 weeks for business purposes, and so was looking for an inexpensive option to a traditional hotel.  The Annex Quest House was recommended by my colleague at the University of Toronto, and it fit the bill perfectly - it was extraordinarily inexpensive for a 2-week stay, and quite pleasant.  FIrst the warnings - this is definitely a  no-frills place.  No elevator - I had to walk-up to my 3rd floor room, which was tough with my bags but fine during the stay.  The room had a microwave and a tiny fridge into which I could barely fit a few single-serve beverage bottles and small fruit containers, but not much more.  The daily \"cleaning\" service amounted to folding the towels in the bathroom and making the bed, nothing else.  Owing to a bizarre Indian spiritual motif, the sink in the bathroom consisted of a copper pot with a drain at the bottom and no air vent hole, so if the drain was covered the water did not recede - a bit annoying while brushing teeth or washing my face.  Finally, the office was only open from 10-7 daily and nobody was there at all on my first full day there (a Sunday), so it was tough to find people and took me a while to register.  Having said that, though, it was almost perfect for my needs.  The room was spacious and though spartan, it was clean, easy to keep clean, and had free WiFi.  Although there were no junk machines, the staff put out free bottles of water, snacks, extra coffee, extra amenities, and other goodies in the hall such that guests could take as much as they wanted/ needed.  There was a laundry room with free detergent and dryer stuff.  The staff - when they were there, or even when not there and freely accessible by phone - were extraordinarily pleasant, helpful, knowledgeable, and at least in the case of one office attendant on the weekend, very well-educated and nice to talk to.  The best thing was the location - it was a two block walk to one of the main restaurant drags in Toronto, replete with every kind of Asian or Middle Eastern food that you might want, as well as more traditional fare, and supermarkets, mini-markets, a bread bakery, several coffee-shops, and lots of fresh fruit/ veggie stands.  It was awesome.  It is also a short walk to China town, Korea town, the Opera house, several museums, and the University of Toronto main campus, and for me a 30 minute walk to the Medical Center downtown.  ALthough I never used it, there is a small train station next door to the hotel and a bigger one (also a bus depot) two blocks away.  All this despite the fact that you're in the middle of a very pleasant residential neighborhood.  This, all in all, thumbs up.",
      "rate": 4.0,
      "tripDate": " July 2011"
    },
    {
      "title": "Perfect balance of price and amenities for my business trips to Toronto",
      "text": "I am in Toronto on a frequent and regular basis for both business and personal visits and need a place to stay that is both convenient as well as affordable. I own my own business and won't justify spending additional money on extra amenities that I don't have time to use. If I was traveling with my family on an occasional week or weekend and needed extra amenities I would gladly pay the extra dollars for my family's benefit.I am a man of simple needs and of high expectations. I expect the inn to be clean and it's impeccably clean. I expect it to be quiet and it's very quiet. I need internet and there's internet. I need parking and there's parking. I'm also grateful for the friendly staff that greets you with a smile as well as the refreshments like coffee, beverages and snacks that are replenished throughout the day. The inn is also literally on the other side of the driveway to the subway line. If my timing is right, I've made it to the entertainment district in 12 minutes via the subway. Having said that, with my frequency of business trips and even the occasional recreational visit to Toronto I would rather spend my money in an establishment where I feel I get an exceptional value. To me the Annex Quest House delivers just that. I've lost track of how many years I've been staying there. In my opinion, it's the best pound for pound accommodation value in Toronto.",
      "rate": 5.0,
      "tripDate": " September 2011"
    },
    {
      "title": "Enjoyed my stay in the Annex",
      "text": "I was traveling to Toronto solo and looking to stay somewhere Central.  The Annex Quest House met my needs.  I priced out hotels for my stay and this was definitely good value.  The location is outstanding, with a subway station right next door.  I rented a car so purchased on-site parking and for most of my stay, mine was the only car in the lot.  For the last weekend (during TIFF) the lot was full but the management had assigned stalls, which was appreciated.  The room was tastefully decorated (in the Vastu design) and clean.  It was small, with one chair and a folding table that you had to put up when you wanted to use it, but overall very comfortable.  There is a fridge, microwave, and coffee maker in the room.  I ran the air conditioning at night and had no trouble sleeping.  My room was on the third floor, which did involve a lot of stairs but the assistant manager carried my suitcase up.  I checked in on a holiday and it was no problem coordinating that.  Overall, it was a very pleasant stay.",
      "rate": 4.0,
      "tripDate": " September 2011"
    },
    {
      "title": "Friendly but unobtrusive; homely in a good way; great location.",
      "text": "Dion, the manager, is friendly and helpful but unobtrusive. Rooms are smallish but comfortable. Bathroom was especially small but totally functional and clean. Location is excellent for Toronto public transport, including subway, streetcars and buses; it's also very walkable to lots of great places including restaurants and attractions such as the Royal Ontario Museum. Possibly the best ice cream in Toronto is only two blocks away at Greg's. Prices are reasonable. In-room fridge + coffee maker and granola bars were welcome. There is some street noise, but, after all, this is on a major street very centrally located. This was a very pleasant place to stay.",
      "rate": 4.0,
      "tripDate": " May 2011"
    },
    {
      "title": "Clean, quirky, comfortable but not luxurious",
      "text": "Really friendly staff who cheerfully assisted with my every and varied needs!  The bed was very comfortable and as I had a room to the side the road noise did not keep me awake. I was puzzled at having a fridge (Always find these noisy) and a microwave in the room - but no crockery or cutlery so couldn't have used them. I'd have preferred the space to be used by a comfy chair. Nice to have free bottled water, health bars and juice - but the latter ran out and wasn't replaced in the time I stayed there. But neither did I ask.  Rooms are small, but very soothing to be in. Great position for the friendly and fascinating Annex area.",
      "rate": 4.0,
      "tripDate": " March 2011"
    },
    {
      "title": "I had the greatest time ever in Toronto",
      "text": "The Annex Quest House is situated next to a subway station (spadina) this was excellent because the metro in Toronto has an excellent schedule. I came at the hotel late at night without any problems. So, it has a great location. It is near the University of Toronto and Korea Town. The neiborhood is beautiful and safe. I took many walks. Dion, the manager, is an excellent person. He helped me a lot with everything I needed. The room was fine. Clean and confy bed and well decorated. It had a little fridge and coffee machine that I found very useful. The heat worked perfectly! I didn't like the fact that they charge you to use internet 5 dollars per day, but that was the only thing. Other hotels had free internet.",
      "rate": 4.0,
      "tripDate": " October 2010"
    },
    {
      "title": "One of a kind.",
      "text": "Very special place to stay. All the rooms are different and it is so relaxing and calm. Would highly recommend to friends. Friendly staff and very clean place.",
      "rate": 5.0,
      "tripDate": null
    },
    {
      "title": "Nice and simple place to stay, if your expectations are simple.",
      "text": "Nice house, well taken care of. The hosts of the office are very friendly, but make sure you announce your arrival time beforehand, because the office closes early (they'll make arrangements with you for the keys). The room I got was small, with a double bed, no desk, but provided a fridge and a microwave. Small bathroom but classy. Very clean. No breakfast. Great location: just by a subway station and close to Toronto University. Internet connection with a fee.",
      "rate": 4.0,
      "tripDate": " March 2011"
    },
    {
      "title": "Good idea, meager execution",
      "text": "My friend and I stayed at the Annex Quest house during the Toronto Film Festival.  We had somehow convinced ourselves that this was a B&B.  What we found was an inn with about 15 rooms and absolutely no breakfast.  The look of the rooms from the website is a clean Indian feel with warm colored walls and lovely tapestries.  The room we were given had this look, but the bed was poor.  The mattress was only about 4-5 inches thick with some mysterious springs or something making it lumpy.  The room was dimly lit and the tiny mirror above the sink had doors on it that basically closed it off.  I suppose this was ambiance, but for me I wondered if I had applied makeup appropriately or had toothpaste on me.  Finally, the room had a desk in it, but neither my friend at 6'2\" or little me at 5'6\" could properly sit at the desk to use our computer.  There were some nice touches.  Each day a snack bowl was filled for guests to treat themselves (mostly breakfast bars) and they kept a steady supply of bottled water.  The innkeepers seemed nice, but we rarely saw them, due to our itenerary.  Finally, the location is extremely convenient as it is next to a Subway station, but not a very busy one, so it is not loud.",
      "rate": 3.0,
      "tripDate": " September 2009"
    },
    {
      "title": "A great place to stay!",
      "text": "We stayed at the Annex Quest House for one week during the Toronto Film Festival. The inn was clean, quiet and next door to the subway station. Dion and the staff were friendly and helpful. The complimentary granola bars and bottled water were greatly appreciated! The bathroom was dimly lit and had one tiny mirror over the sink. A second, larger mirror in the room would be a welcomed addition. The neighborhood has a great student/bohemian feel and there are several restaurants within walking distance.",
      "rate": 5.0,
      "tripDate": " September 2007"
    },
    {
      "title": "Cozy and Comfortable",
      "text": "I heard about the AQH through a friend and booked a weekend in town for a conference. While the inn is small, my room was clean and cozy with wood floors and colorful tapestries. I had access to wireless from my room and a small fridge to keep food and drinks. The lobby contained no-charge drinks and healthy snacks that I could take to my room. I had a key that let me in to the building after hours and I felt like I had enough privacy from my fellow guests. All in all, this was a good experience for one that is used to staying in hotels. I would do it again and recommend it to anyone who may be looking for inexpensive and comfortable accommodations.",
      "rate": 5.0,
      "tripDate": " August 2007"
    },
    {
      "title": "A great stay at a great price.",
      "text": "I stayed at the Annex Quest House in Toronto for two weeks in late August, early September and was very pleased. Both manager and assistant were most helpful. The room was chic and comfortable. The mattress was firm but not hard, just the way I like it. Putting the attractive vessel sink outside the bathroom gave the room a larger visual space. The room was equipped with A/C, small fridge, microwave, coffee maker and coffee, TV, alarm clock and telephone. No charge for local calls! I was able to buy a one cent / minute international phone card with a local access number and call home to the US for practically nothing.I just came back from a trip to Italy where I spent a lot more money for the same amount of space with a lot less charm. My two week stay at the AQH in Toronto ran me just over $400 / week, and that included complimentary bottled water, snack bars and coffee. I highly recommend it and will definitely stay there again if I’m in Toronto.",
      "rate": 5.0,
      "tripDate": " August 2006"
    },
    {
      "title": "lovely, well located,good staff",
      "text": "We had a great experience at the Annex Quest house.  The room was simple, yet beautiful, clean and perfect for us.  The Annex Quest house is well located, close to interesting places, food and transportation.  The staff are helpful and friendly.   The only negative was the location of our room and the accompanying noise from the street traffic.    Colder evenings would mean a closed window and less noise.  I am booking there again as I write this review.",
      "rate": 4.0,
      "tripDate": " September 2011"
    },
    {
      "title": "A comfortable place to stay that quickly feels like home",
      "text": "The rooms are charming comfortable, spotlessly clean and quiet. Dion, the manager, is so thoughtful, kind and welcoming that I quickly came to feel at home. I will definitely be staying here the next time I am in Toronto.",
      "rate": 5.0,
      "tripDate": " March 2011"
    },
    {
      "title": "Relaxing",
      "text": "Small but nicely decorated rooms, friendly staff. Patio looks out over the backyard. The vastu theme promoted calm and quiet. Convenient to restaurants and the U of Toronto if you are staying in the Annex area. We would stay here again.",
      "rate": 4.0,
      "tripDate": " June 2011"
    },
    {
      "title": "Downtown Toronto Gem - a lovely stay at an equally lovely price.",
      "text": "I stayed at the Annex Quest House on the 4th floor in one of their bigger rooms.  The place is just lovely.  Dion is the manager during the week, and he is a sweet, helpful and yes, lovely.  It is right next door to the Subway.  Literally, but you don't hear anything.I knew going in that there was no breakfast provided; just some cold bars, juice and coffee.  Actually I was pleasantly surprised to find that the food was not just available at breakfast, but actually 24 hours a day.  In comparison to some much more expensive places I have stayed, the quality of the 'snacks' are far above average.The rooms are on the small side, but this is an older building.  I love the charm of the Vastu inspired design.  It was calming.  I love the blue rooms.  Dion tells me that some people like the green rooms.  There are red rooms too apparently.I understand by April 1 they will have wi-fi.  That is the only thing I missed on my stay.  I will be back once that is in place.I read some of the other reviews posted here, and it makes me wonder.  The place is as it advertises.  A modest room, with great transportation, some limited parking, and a cold breakfast.  The cleanliness and welcoming attitude of the staff are an added bonus.I highly recommend to single travelers or couples for a weekend retreat.",
      "rate": 5.0,
      "tripDate": " February 2011"
    },
    {
      "title": "Basic, but not as bad as some reviews suggest!",
      "text": "I only stayed here for a night-my first choice was booked out for the first night of my stay and it was the weekend of the G20 so ended up in Annex Quest House.  I was a bit concerned having read a good few suboptimal reviews here but was pleasantly surprised!It's not somewhere you feel very pampered but I don't think it's really what they're aiming for.  They say it's Vastu inspired.  It felt more like an upscale hostel in a way-but in a positive sense!The welcome was pleasant and I was shown to my room on the 3rd floor.   The girl who greeted me offered to help with my bag and gave me a quick tour as we went. I was glad I'd left my big suitcases in the B&B I was spending the rest of my time in-there was no way I could have taken them up the steep narrow staircase.  The room was pretty basic but open and spotless.  Firm queen bed, big dresser, some hooks on the wall and a tiny TV.  I liked having a coffee maker, microwave and fridge.  The bathroom was also spotless with a copper sink and small tub.  Tea, coffee and granola bars were provided in the room with more in the lobby downstairs.It's pretty much a self service experience.  No staff are on site after 7pm although there's an emergency number to ring.  There's no breakfast-extra granola bars and some oatmeal packets are left downstairs but they weren't replenished until I was almost ready to check out.  The location is good though at Spadina/Bloor and literally next door to the Spadina North subway station.  I managed to get free wifi but I think that was semi accidental.So, not the home from home of some B&Bs but spotless and convenient if you just want to do your own thing!",
      "rate": 3.0,
      "tripDate": " June 2010"
    },
    {
      "title": "A totally different experience",
      "text": "This is not a corporate kind of place.  This is a tiny, personal rooming house.  Rooms are decorated in a unique way with principles of an Indian design (Vastu?).  The sink in my room looked like a copper basin sitting on the counter.  I wondered momentarily if it was even hooked to a drain (it was).  I can't wait to go back.",
      "rate": 5.0,
      "tripDate": " March 2011"
    },
    {
      "title": "Staying here was the best decision I made",
      "text": "I chose this hotel because of its location and the ease with which I was able to communicate with them by email. From the onset, I was impressed with the email correspondence I had with the manager and I was able to ask questions about the room set up and the location. I was on a research trip that lasted for 3 weeks so it was important that  I would get a comfortable and friendly establishment and this certainly was the one. My room was on the 4th floor, in the corner. Very spacious, large bed, big window to the front, clean bathroom, a lovely writing desk with internet connection, worktop, fridge, coffee maker and microwave. The rooms are checked on a daily basis (garabage emptied and towels changed if requested) and cleaned on the weekend. There is plenty of complimentary bottled water downstairs as well as teas, coffees, cup-a-soup, granola bars and cookies. These are replenished daily. Toronto is a very busy city and I am happy that I did not choose a hotel on the main street (Bloor st) because the noise of traffic, ambulance, fire engines etc... is continuous. Traffic does not stop here. Instead this hotel is on the junction of Bloor and Spadina, 2 blocks from the main street and this is important if, like me, you dislike noise. There is an entrance to the subway next to the entrance of the hotel and the main subway station is on the junction of Boor/Spadina. I don't think there could have been a better location for my stay. From my hotel, I can walk to China Town, Korea Town, Younge street, the Royal Ontario Museum, the Royal Conservatory etc... Public transport is amazing in this city and very cheap so if you walk too far you could always come back by streetcar or subway which will get you very close to the hotel. One of the best perks of this establishment is the laundry facilities. In the basement, there is a laundry room with very clean washing machine and dryer ($3.25 for complete wash) that came in handy. The best aspect of this place is its calm and quiet \"aura\" and Incredibly helpful manager with lots of advice when needed and requested. I have no complaints and I'm full of praise for this place. I DO NOT RECOMMEND it for people travelling with children or for those who require constant attention such as room service and concierge-type services. There is no elevator but there are plenty of rooms on the ground floor.",
      "rate": 5.0,
      "tripDate": " December 2010"
    },
    {
      "title": "A lovely, Vastu-principle hotel located in Toronto's Annex.",
      "text": "If you want to stay in the Annex and enjoy small, unique hotels/guesthouses, you should consider this Vastu-designed hotel located on Spadina Road. I found it online and was intrigued by the design principles used in the hotel (search Vastu): my room was called Vayu, its design based on the element of air. The staff were lovely, the atmosphere comfortable and quiet. I was able to purchase high-speed Internet for the length of my stay. Tea, coffee, bottled water, and a variety of healthy snacks were always available free of charge. The hotel is in an older brick house located right beside the Spadina subway station, and it is a short walk from Bloor where there is a wonderful vegetarian restaurant (Fresh), a natural foods store (Noah's), and a variety of other shopping opportunities. It is also close to U of T, the ROM, and the Bata Shoe Museum. I have already recommended this hotel to a friend, who is planning her stay there in the middle of January.",
      "rate": 5.0,
      "tripDate": " December 2010"
    },
    {
      "title": "Quiet, Discreet Guest House, Convenient to everything",
      "text": "I have been staying at Annex Quest House for about four years now, for my monthly trips to Toronto.  It is convenient to the University and mid-town, and you can walk to the chic or funky neighborhoods a few minutes away on Bloor Street.  Right beside a subway station exit, it's convenient to downtown and only about an hour from Pearson Airport on public transit ($3 cash).  Rooms are small, done in smart Vastu style (pick your element), with cable TV, a small fridge and microwave, and coffee/tea/bottled water/snacks provided.  Platform beds are firm.The staff keep the rooms and hallways impeccably clean and well-maintained: you could eat off virtually any surface in the entire establishment.My only suggestion would be to make the Bell Datavalet free, but even at CA$5++/day, it's a bargain.",
      "rate": 5.0,
      "tripDate": " November 2010"
    },
    {
      "title": "great value, great location, neat place",
      "text": "neat opportunity to stay right in Torontoat a reasonable price at a place with some genuine charactera very nice change from the 'chain' hotels - tiny rooms, with neat East Indian themed decor it was noisy (you can hear the subway and traffic) but I just turned on the fanfor 'white noise' and that made it perfectly fineI would stay there solo again",
      "rate": 3.0,
      "tripDate": " April 2010"
    },
    {
      "title": "Great location plus Great service!",
      "text": "Was there for a week. This place is one of a kind. I was checked in by the manager and he was kind enough to show me several of the rooms available. Each room is decorated differently. Very unique and clean. Unlike hotels with same kind of bedspread and furniture. Understand that most of the furniture in the House was specially made.Location, location, location! Subway station is just beside the building and you do not get to hear or feel the train. Very quiet and relaxing place. Walking distance to grocery store and cafes and restaurants. Service was excellent! Bottles of water, fruit basket, and snacks for late night craving. A very nice touch! It was a wonderful trip. The Asian manager was very polite and friendly.A nice place to be in the city but not have the noise and crowd from the city.",
      "rate": 5.0,
      "tripDate": " October 2005"
    },
    {
      "title": "Very friendly service, great location!",
      "text": "It is definitely worth the value! The lady at the reception was very friendly, she even helped me carry my suitcase up to my room. The room was nice and clean, the location was also great. It is worth the value..",
      "rate": 4.0,
      "tripDate": " September 2011"
    },
    {
      "title": "Felt like home",
      "text": "The Annex Quest House is not a big fancy hotel but it is quaint and very comfortable. The location is great for anyone who wants to be near the heart of Toronto. The staff were friendly, cheerfull, and helpful. Our room was small but for a short stay it was very relaxing and brought a sense of home that I have not felt when staying in hotels. It is like a B&B but without the feeling that you are in someone else's home.We were surprised at how quiet the room was being it's located right on Spadina. Most importantly we found our room to be very clean. If you are looking for a all the amenities that a large hotel has then this is not the place for you. But I recommend it for anyone who is looking for a nice clean, quiet, place to unwind a and sleep while in Toronto. Also if you go on the balcony for a break late at night you will find the racoons to be friendly and entertaining.",
      "rate": 4.0,
      "tripDate": " September 2011"
    },
    {
      "title": "Very nice",
      "text": "Annex House is reasonable and conveniently located to the University of Toronto and the Bloor St. corridor in the Annex neighborhood of Toronto. The Spadina subway station is literally just out the front door. The room and bathroom were small, but very clean and nicely decorated. The only drawback was that the room facing the street was quite loud because of traffic -- I had to keep the AC on at night to provide some white noise. Free wi-fi was also nice.",
      "rate": 4.0,
      "tripDate": " September 2011"
    },
    {
      "title": "Character and Friendliness in Toronto",
      "text": "We stayed in Toronto on our way to and from a wedding in Niagara on the Lake. The experience of the Annex was superb with the friendliest and most hospitable of staff. As we had come from New Zealand and were very tired on arrival Dion, the manager, was so welcoming and helpful with directions before we arrived and hospitality after we had arrived. The rooms are cute and the location is so convenient. One downside was the noisy air-conditioning unit which was needed as the weather was very warm. Highly recommend this place for a stay in Toronto.",
      "rate": 4.0,
      "tripDate": " April 2011"
    },
    {
      "title": "clean, cosy and well managed",
      "text": "Room OK but a little on the small side. Clean and comfortable and the coffee machine and microwave were appreciated. Incredibly helpful manager who helped us out when we had a credit card crisis. Would certainly return.",
      "rate": 4.0,
      "tripDate": " July 2011"
    },
    {
      "title": "Simple and nicely decorated..",
      "text": "I stayed at Annex Quest last week and was happy with my experience. This is a boutique quest hse and do not have that big crowd...you will sense the privacy. It is also located near a subway station. This was my first visit to Canada and I was pleased that Dion Chan, the manager, helped me with my tour to niagara as well. The day trip to Niagara on the lake was fantastic!!. Thanks Dion for your help!",
      "rate": 3.0,
      "tripDate": " June 2011"
    },
    {
      "title": "Friendly and Great Vibe",
      "text": "A very nice place to stay, lovely location walking distance from the vibrant annex",
      "rate": 4.0,
      "tripDate": " June 2011"
    },
    {
      "title": "The price doesn't correspond with the quality‎",
      "text": "I stayed there for a week on the lower level (half level; below ground). I couldn't open the window in the whole week, because there was a very dirty flowerbed (without any flowers, of course, only garbage) and once I even saw a big rat there.So, the room was too closed and it smelled bad. I had a fan, which was nice but not enough to supply the lack of window.There is no breakfast, there is just some candy bars (which you can take free as much as you want, but again, that doesn't supply the lack of breakfast).There was a microwave in my room, but there wasn't any piece of cutlery nor plates.In addition, they didn't change the sheets in the whole week.I've been in worst places that this one, I'm just saying that the price doesn't match with the quality of the hotel.",
      "rate": 2.0,
      "tripDate": " August 2009"
    },
    {
      "title": "a disappointment",
      "text": "Althouth the staff was helpful and friendly, the main attraction of Annex Quest is its promoted design, based upon \"vastu\" principles (ancient Vedic architectural and interior design which is supposed to be good for the soul).  Unfortunately, this amounted to little more than a few plants, beveled corners, some quaint Indian furnishings and a few hanging tapestries.  There is NO guest lounge, the 'breakfast' of granola bars were sometimes not in the basket, my garden room was dark and musty, the walls were too thin allowing every sound nearby to be heard (including a woman next door who was practicing her speech in the middle of the night).  Not very comfortable nor good for my soul, I'm afraid.  Its location, right next to a subway station is okay, but it wasn't really worth staying here (especially the garden/basement rooms -- the ones above might have been nicer).",
      "rate": 2.0,
      "tripDate": " October 2008"
    },
    {
      "title": "A lot missing",
      "text": "We were looking forward to a couple of relaxing days in Toronto with our family and a reasonable and pleasant place at which to stay.The room was exceedingly small and dark.  We barely had enough room for our luggage and had to squeeze by the luggage to get into the bathroom.  There was one bar of soap over our two days, which we transferred from bathtub to sink frequently.This is the first time I have ever been to a b & b or hotel that did not have a hair dryer.  Upon calling the manager who lives off site, it was apparent that I would not have access to a hair dryer before I had to leave for the day.  One was provided for the second day.The towels weren't changed each day, nor were the coffee maker and cups washed.I guess for a minimalist who doesn't care about the above things, this place is fine, but for close to $200 for two days, we found it lacking.The location is the main selling point and if it had the other amenities, we would stay there again, but not given our first experience.",
      "rate": 2.0,
      "tripDate": " December 2008"
    }
  ]
}