{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Atlas Suites Toronto",
    "url": "/Hotel_Review-g155019-d10131857-Reviews-Atlas_Suites_Toronto-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "2.0",
      "reviewCount": 10
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "15 Iceboat Terr",
      "addressLocality": "Toronto",
      "postalCode": "M5V 4A5",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0d/73/c6/ea/photo0jpg.jpg?w=500&h=-1&s=1"
  },
  "description": null,
  "featues": [
    "Clothes dryer",
    "Washing machine",
    "Soundproof rooms",
    "Air conditioning",
    "Seating area",
    "Sofa",
    "Iron",
    "Coffee / tea maker",
    "Kitchenette",
    "Complimentary toiletries",
    "Wake-up service / alarm clock",
    "Microwave",
    "Refrigerator",
    "Kitchenware",
    "Hair dryer"
  ],
  "reviews": [
    {
      "title": "Thieves, irresponsible management endangering people lives unsafe place",
      "text": "they will charge your credit card a month before your arrival. they wont bother to send you the room number and how to access the building. they wont answer their phone and will not return your call or reply to ur e mails. My nephew was exposed to 30 prostitutes in front of the building when he arrived from the airport around midnight to check in. the apartment itself: broken furniture. My brother almost fall when he tried to sit on a broken chair. dirty floors. They will provide only one towel per person for the whole period of your stay (ours was 6 days). 1 30ml shampoo bottle and 1 30 ml shower gel for 3 people for six days. the curtains in the living room and the dining room are missing blinds. So you will be awake by 6:00 a.m when the sun rises. the rod of the curtain the bed room fell and hit my brother head in the bed room and he was hurt. mold in the bath room and leaking water from the toilet. the mattresses of the bed and the folding couch were very bad you feel the metal springs all over your body and wont be able to sleep. blinds were under the bed in the closets and above the kitchen cupboards. and sheets that are used for the dryer were stuck and covering part of  the air condition  ducts in the wall. Above all this the management did not bother to contact us or show up to deal with this unsafe situation. they were contacted by booking.com and they were lying all the time. As a result we left the property to another hotel after on night stay. the management refused to refund us the money we had paid for another 5 days and booking.com couldn't help in this regards. After our terrible insulting experience I felt that I need to warn people in order not to be victims to these thieves and criminals. they charged us 1709 Canadian $ for 6 days. they will also charge you a cleaning fee in advance and will add to it 13% tax. be careful dont be the next victim.",
      "rate": 1.0,
      "tripDate": " July 2017"
    },
    {
      "title": "Scam, Nasty, unsafe and",
      "text": "my vacation with my sister and nephew was ruined as a result of booking this scam property via booking.com. they charged us more than 1700 CA $ + cleaning fees and they taxed the cleaning fees. the property failed to provide room number and access info. We almost spent the night in the st. It was a nightmare my nephew 15 yearold was really afraid and was exposed to scences around the building that he shouldnot have seen in such age bc we were kicked out by the security person who addressed us as stupid for three times. We had to wait until my sister arrived from London and went to another location for Atlas Suits on Front St. When she arrived she contacted Booking.com who contacted the property around midnight and got the apt. number and how to access it. Our bad experience continued after entering the apt. Dirty floors, mold, fire hazard, broken and loose furniture, the curtain rod  in the bedroom fell and hit me on the head when I was trying to close it. missing blinds in the dining and living room, dryer sheet stuck on the ac ducts and more see the pics attached. the management is irresponsible after charging your credit card you wont hear from them and they wont returns your e mails or calls or even show up.Booking.com could not help we left after less than 24 hours and they refused to refund us. until now we are unable to communicate with the property and we lost our money.we decided to tell out story to help you not to be the next victim.",
      "rate": 1.0,
      "tripDate": " July 2017"
    },
    {
      "title": "Cheap and nasty",
      "text": "We found a kitchen with extremely basic cook wear and nasty crockery and cutlery! No serving dishes, prep knives, chopping board - not even a sponge or cloth! No hand towels in the apartment. The bathroom was dirty with very old bath towels and face cloths. Cheap toiletries and toilet roll. The shower curtain was stained orange at the bottom and the bath was grouting was vile! EVERY window had broken blinds and a previous guest had written \"Eww\" in the dirt on one window. The bed was so uncomfortable and squeaky - the springs at the side of the mattress making it sore to get in/out of bed. The furniture throughout the apartment is so cheap, marked and not fit for purpose. The washing machine dial is broken and so is the sliding access door to the washer. We arrived on a Friday and the Atlas Suites office would be closed until the Monday. We should have stayed until Tuesday but left early to book into a hotel for some \"actual\" luxury before our flights home. There are several scathing reviews about these apartments which, from personal experience, should be believed but they are often followed by \"excellent reviews\"? We won't stay here again and will certainly not recommend to anyone.",
      "rate": 2.0,
      "tripDate": " October 2016"
    },
    {
      "title": "Little things that (could've) matter",
      "text": "Spent a few nights here. Good location with easy access to public transportation. Small things could've improved our stay:1) the bed is creaky and the springs are failing, making it an effort to not end up rolling into one another in the center;2) there are no hand towels racks in the bathroom and, consequently, no hand towels either.3) there were no dish cloths or sponges in the kitchen4) poor paint job in the bathroom5) the last thing is not the fault of Atlas Suites, but of the construction crew. The floating wood floor wasn't installed properly and there are massive gaps at the end of many planks. Shoddy installation.",
      "rate": 3.0,
      "tripDate": " April 2016"
    },
    {
      "title": "Unsafe and dirty",
      "text": "Broken and loose and cheap furniture. Missing blinds, dirty floors un comfortable mattresses. The Worst management they don't care they don't return calls or e mails they don't bother to show up or make sure the apartment is suitable for rent or not. They ignore you after they charge ur credit card and take your money.And above all this you pay cleaning fees of 70$ + 13% tax. Don't book this nasty unsafe apartment.If you want to enjoy ur vacation don't fell in their trap.",
      "rate": 1.0,
      "tripDate": " July 2017"
    },
    {
      "title": "Hidden fees",
      "text": "If what we got was for the price they listed I wouldn't be disappointed. New building on College Street, clean suite, okay bed. But way too small to include the sofa they show in the photo of the suite. No closets. Thin walls. Android TV. They advertised $88 US on bnb but with the handling fee, taxes and $100 cleaning fee(?) it was $190/night. For that price this should have been much, much better.",
      "rate": 2.0,
      "tripDate": " December 2017"
    },
    {
      "title": "Memorable stay",
      "text": "Good, clean apartment with great view great location and all the facilities. Fully equipped kitchen clean linen and towels, Wifi very good and fast. Helpful and friendly staff  Highly recommend. It was a memorable stay will always stay here.",
      "rate": 5.0,
      "tripDate": " April 2016"
    },
    {
      "title": "No service ",
      "text": "Location is great and that's about it... Rude and unfriendly management, dirty, torn bedding, stains and scratches everywhere (including TV screen). Five days of no room service and good luck getting a second set of keys.P. S. Leaking electrical kettle",
      "rate": 2.0,
      "tripDate": " November 2018"
    }
  ]
}