{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Atlantis Suites - Toronto Furnished Apartment on York Street",
    "url": "/Hotel_Review-g155019-d11705522-Reviews-Atlantis_Suites_Toronto_Furnished_Apartment_on_York_Street-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.0",
      "reviewCount": 20
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "12 -14 York Street",
      "addressLocality": "Toronto",
      "postalCode": "M5J 0A9",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/15/1b/da/7f/20181017-173034-largejpg.jpg?w=500&h=-1&s=1"
  },
  "description": null,
  "featues": [
    "Free High Speed Internet (WiFi)",
    "Internet",
    "Clothes dryer",
    "Washing machine",
    "Air conditioning",
    "Desk",
    "Seating area",
    "Sofa",
    "Kitchenette",
    "Dishwasher",
    "Bath / shower",
    "Hair dryer",
    "Clothes rack",
    "Iron",
    "Microwave",
    "Refrigerator",
    "Kitchenware"
  ],
  "reviews": [
    {
      "title": "Trip to Toronto",
      "text": "We stayed here whilst visiting Toronto for a week. The apartment is in a great downtown location and it comes with everything we needed for our stay. The view from the place is also great, although being sat outside is quite noisy (fortunately the noise doesn't carry inside!). Dealing with Tina has been a breeze.",
      "rate": 5.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Great place",
      "text": "I had to book a room for an emergency. After emailing for info , I received a phone call from Elizabeth. She gave me the information I needed and   I booked a suite. The check in was flawless. The apartment was beautiful. Top notch and it has everything we needed. Will be going back but, next time for pleasure.",
      "rate": 5.0,
      "tripDate": " May 2020"
    },
    {
      "title": "clean apartment with amazing view",
      "text": "The view is really the best you can get and the apartment is quiet on the 50th floor, in a clean modern look, all white and silver. complete kitchen, everything there you can imagine - not one thing missing - which is rare. now I don't want to stay anywhere else in the future!",
      "rate": 5.0,
      "tripDate": " March 2017"
    },
    {
      "title": "Great location, convenient apartment with all amenities!",
      "text": "Wonderful location and good apartment with all amenities. We were met by Andrusia to show us the apartment around and all communication was very clear before we arrived. Just a few improvements like the huge stain on the bathroom floor, new shower curtain and a more powerful shower would be nice. All in all, good stay.",
      "rate": 4.0,
      "tripDate": " June 2018"
    },
    {
      "title": "DO NOT GIVE YOUR CREDIT CARD INFO!!!!",
      "text": "We stayed in apt U4209. I don't think you can pick your apt, but try to stay  away from this one. The owner's name is Tina. We made the mistake of giving our credit card information when we checked in. The owner charged our credit card $70 after we returned. I emailed her and asked the reason of this charge. No response! I called her and she said she would call me back. No calls! So, I reported it as fraud and cancelled my card. It was very unprofessional. She thinks that she can charge your card without any explanation.",
      "rate": 1.0,
      "tripDate": " July 2017"
    },
    {
      "title": "Shocking",
      "text": "Having been denied travel to Canada because of Covid, May 2020, I was offered a refund, £600, in the fall if I was able to wait, so I agreed.Having exchanged numerous emails prior to travel, I was surprised to then get no reply to any of my emails for Months up until January, when I called & the response was, sorry, we should have at least given you a credit note, so I'll check our emails & ring you back today!!!!!!Now 6 weeks later, no phone call or email & lots of dates are full, so obviously bookings still being taken, so beware.",
      "rate": 1.0,
      "tripDate": " May 2020"
    },
    {
      "title": "Home away from home, up in the sky",
      "text": "I selected this property because it is close to Union Station, and we were arriving after dark.  I had booked months in advance and was a bit mystified by the directions to enter the rear courtyard. Arriving at 14 York St, someone was going into the building and we followed. The security man was really unpleasant and gave the impression we were doing something underhand.  Very quickly, the young man from the apartments arrived to take us to apt 5806 and show us around. The apt had everything, and it was all in perfect condition. Kitchen, bathroom, sitting room and bedroom, Fantastic view from bedroom and sitting room. Plenty of cleaning materials, cutlery, crockery, etc. King bed with heaps of pillows. When I booked I thought it a bit expensive, but, considering the quality of the appointments, it is quite reasonable aa long as you don't want to have the rooms cleaned and made up each day.  No-one bothered us or checked on us for the four days we were there.  Would stay there again gladly (we used the courtyard entrance while we were there to avoid the nasty security man).There are 67 levels in the condo, but we didn't try to get to the roof because the views from level 58 were great.",
      "rate": 4.0,
      "tripDate": " October 2017"
    },
    {
      "title": "Unit 2502 Atlantis Suites on York",
      "text": "We were a group of 4 women on a Mother's Day trip to Toronto. I found this listing on expedia, but booked directly with Tina, who was very helpful and easy to get in touch with. The value for 4 of us was incredible! It was $325/night ($25/night for guest 3 and 4) and $100 for a cleaning fee. It was so nice to have the 2 bedrooms and bathrooms, kitchen and seating area. 4 of us in a regular hotel room would have been more expensive as well as cramped. The unit was very clean, the kitchen is equipped with Tassimo and kettle (coffee and tea included) as well as a few pots and pans which weren't used, as well as cups, plates, etc. There were only 4 towels in the unit, so we did wash a load for fresh towels. Washer and dryer and detergent included in unit. The queen beds were very comfortable. You will have some street noise, but it's more of a white noise until a loud vehicle goes by. Or the construction next door decides to jackhammer concrete at 8:00 am on Saturday. Having said that, the location can't be beat! Right across the street from Maple Leaf Square, which has an LCBO and Longo's supermarket. A block away from the ACC and 2 away from Rogers Centre and Ripley's aquarium. We will definitely book again when visiting Toronto!",
      "rate": 4.0,
      "tripDate": " May 2017"
    },
    {
      "title": "Nice View",
      "text": "This apartment was booked for four adults,( says sleeps four) but is very small and two are on a small uncomfortable sofa bed, which had not been made up and we had to request extra bedding for.  On arrival at (strictly 3.00pm) cleaners were still there and sheets and towels still in drier which we had to finished by us.Kitchen lacked basic tools for cooking and had to request further. Only 2 cups for 4 people. Comms was difficult but got done through our original booking contact.Shower was weak and luke warm, bath wouldn't empty and had to pull a lot of hair out of plug hole. No instructions given on rubbish disposal or recycling.  Very little room in main bedroom due to size for suitcases.Pre arrival a lot of paper work and talk about secuirty etc, however when there main doors were easily accessed by guests shadowing in, but no issues with security.Good washing machine and drier and soap powder was left behind. Dont look for Atlantis anywhere either when trying to locate, called something else. Good for 2 people, and had nice view of harbour.  Handy to shops and small supermaket and train station.",
      "rate": 3.0,
      "tripDate": " September 2019"
    },
    {
      "title": "Brilliant ",
      "text": "Fantastic condominium, clean and so comfortable, I felt like I was in my house, we went there at June, we were a family of four. The manager ( tina) was very corporate and helpful with us. The apartment was very well maintained and it has a modern cozy decoration with Quite comfortable bed. Regarding the Location; it is very easy to get to anywhere you want, it is 5 min walk to the bus your stops , CN tower, Union Stationand, and many restaurants, pharmacy, shopping malls, supermarkets and the attractions nearby in Toronto.",
      "rate": 5.0,
      "tripDate": " July 2019"
    },
    {
      "title": "Brilliant. Perfect location. October 2018",
      "text": "We stayed in 6012 on the 60th floor for 3 nights in October. We travelled from the UK and communication with Tina was brilliant.We were met in the lobby on time (Just need to message when close to ice2).Absolutely immaculate and spotlessly clean.Very short walk of 5 to 10 mins to union station, so if flying in, great easy location (use up express from airport at $12.95).Fantastic views.Great having a washer and dryer to sort laundry before our continued trip to Niagara and new York. No washer in a hotel room!",
      "rate": 5.0,
      "tripDate": " October 2018"
    },
    {
      "title": "Decent city centre accommodation",
      "text": "Our train was late and luckily for us a lady acting for Tina stayed until we got there and showed us everything that we needed in the apartment.We were here for 3 days and were allocated apartment 3905 which was perfect for our needs.A couple of the desk staff aren't particularly customer friendly but on the whole it was a good experience.If you need supplies, definitely shop at Lango's - across the road from the apartment - which has just about everything you could possibly need in food and drink!",
      "rate": 5.0,
      "tripDate": " June 2018"
    },
    {
      "title": "Pelican Furnished Condo",
      "text": "2 bedroom 2 bath furnished condo.  Sofa bed broken in living room and difficult check in.Condo clean and close to all sports venues, lots of sports bars and two blocks from the water front.  $1500.00 for 3 nights, worth it for a family of four adults instead of two individual rooms for 3 nights.",
      "rate": 3.0,
      "tripDate": " June 2018"
    },
    {
      "title": "Comfortable Apartment",
      "text": "We stayed in 2502, which was fairly comfortable. Pros: Great location, across the street from a grocery store, nice views. Tina was very responsive to emails. The furniture was in good condition.  Cons: 1) When we first arrived we called Maria who was responsible for checking us in, to ask about the entrance for parking but she had no idea what the name of the street was and just said that we should go in through the back of the building. This was very confusing, so it took us over an hour to drive around the area and eventually find parking. I suggest making sure the people responsible for receiving guests know the names of the streets around the building and are better prepared to provide directions, esp. considering some people are visiting Toronto for the first time and have been traveling for a long time. 2) There was mold in the shower curtain. 3) Warm tap water from the bathroom came out white, not clear. 4) The walls in the closets needs to be repainted.",
      "rate": 3.0,
      "tripDate": " May 2018"
    }
  ]
}