{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Atlas Suites - CN Tower & Convention Centre Toronto",
    "url": "/Hotel_Review-g155019-d9767195-Reviews-Atlas_Suites_CN_Tower_Convention_Centre_Toronto-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.5",
      "reviewCount": 56
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "300 Front St W",
      "addressLocality": "Toronto",
      "postalCode": "M5V 0E9",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0a/2e/3c/52/atlas-suites-cn-tower.jpg?w=500&h=-1&s=1"
  },
  "description": null,
  "featues": [
    "Free High Speed Internet (WiFi)",
    "Wifi",
    "Fitness Center with Gym / Workout Room",
    "Non-smoking hotel",
    "Clothes dryer",
    "Washing machine",
    "Air conditioning",
    "Seating area",
    "Sofa",
    "Clothes rack",
    "Kitchenette",
    "Dishwasher",
    "Bath / shower",
    "Complimentary toiletries",
    "Iron",
    "Wake-up service / alarm clock",
    "Microwave",
    "Refrigerator",
    "Kitchenware",
    "Hair dryer",
    "Non-smoking rooms",
    "Suites"
  ],
  "reviews": [
    {
      "title": "Be Warned",
      "text": "On booking this one gets the impression this is a hotel as this is a word used by Expedia on its website. On arrival we found that this is a rented apartment and at check in you are greeted by security staff who are not employed by Atlas. The picture of the room on the site is deceiving. We are a family of four. The room we booked was a suite for four persons with a double bed and a sofa bed. One of our kids slept length ways on a sofa and the other on a pad provided on the floor. However the room is so small you could not walk into the room one they were in there. We had booked the main tower (300 Front St) but were placed in a secondary tower behind which did not have any views.The wifi, tv, and washing facilities in the room were all very good. The kitchen had all the basic needs with cutlery etc.",
      "rate": 3.0,
      "tripDate": " August 2016"
    },
    {
      "title": "Great apartment but lacks back up service!",
      "text": "Firstly these apartment are NOT called Atlas suites but they are called 300 Front Street, because we drove past and had to circle the block. They are literally on the corner. Pull your car in on the road and one person go in and get fobs etc. As per last review these apartment need preapproval credit cards for the booking so if you don't have confirmation then you probably don't have an apartment! They take some money off before you arrive. Also beware make sure you book the car park before you arrive as I forgot and Toronto was extremely busy at the time of our holiday so we didn't get parking for the first 2 days. Having said that we found parking nearby in a car park. We stayed here and hired 2 apartment as we are a family of seven. We had an apartment for 5 and an apartment for 3. The staff in lobby are not Atlas suite staff so of course they aren't very interested in doing too much for short term let people. Anyway got our apartment on 29 and 30th floors. Fab views of CN towers. These apartment are in a wonderful location. Really super clean apartments and in a very safe area. Supermarket called Rabba 5 mins away open 24 hours a day. Supermarket quite expensive. Starbucks next door. Swimming pool is on a high floor with super views. It is an excellent pool with bbq facilities. Kept really clean. Gets very busy in evenings with people out to bbq and swim but it's a really super facility in the city. There was a really helpful man taking care of the pool area.The apartment is really wonderful.My problem was with the back up service or lack of? There are numerous cards placed around apart saying if you have any problem then contact us? I contacted them by email and no response so I telephoned and left a message on voice mail and no answer. I wanted to make sure I was using the washing machine correctly (it states do not use machine if you are unsure of instructions and there are no instructions?) also it is an apartment for 5 there are only bath towels and no smaller towels. There was no drinking glasses, no chopping board for bread, no chopping knives, no cloth for washing dishes and no drying cloth. We used the apartment mainly for breakfast but I didn't want to put on a washing machine after every breakfast but I couldn't wash dishes any other way. This might sound like small complaints but I do travel with children so it's necessary to wipe tables etc. Also this would not cost a lot to put right by Atlas suites so I really do think they should take note!!Let me say again really great apartment but they should be better at their follow up care!",
      "rate": 3.0,
      "tripDate": " July 2016"
    },
    {
      "title": "Great spot!",
      "text": "Great location!!!!! Right downtown so in the thick of it. Be mindful that in the main entrance - the staff are security and not receptionists so make sure you have the apartment room number and your name from your booking as it is not a hotel and will not accept just booking reference numbers or forms. Apartment was clean and tidy. The recreation floor is great and outdoor pool is great at night with fantastic views of he tower!",
      "rate": 4.0,
      "tripDate": " August 2017"
    },
    {
      "title": "Avoid",
      "text": "I had 2 apartments had been booked for ~3. Flew 9 hours to Toronto to find the rooms had been \"cancelled\" and were now unavailable. No direct contact from Atlas suites at any point and at the front desk of the building atlas they have no presence or staff on site. So if you do have issues they will not be there! They refused to talk to us on the phone to try and resolve leaving 6 of us trying to find accommodation on Starbucks WiFi at 7pm at night after a long flight. Disgusting service couldn't strongly advise enough to avoid unless you want to risk your accommodation not being available when you arrive. Shocking",
      "rate": 1.0,
      "tripDate": " July 2016"
    },
    {
      "title": "Don't be caught with this one !!",
      "text": "Booked two of these apartments for a family holiday on b*****g.com. No deposit required, pay on arrival. Arrived about one hour later than expected at the apartments to be told no booking for us despite having all the emails confirming the booking. Staff on site disinterested but at least they tried to contact the agent. Five minutes later we received an email cancelling the booking, no explanation given and no reason received. So having travelled from the UK we had no accommodation and no reason for cancellation. Suggest don't touch this with a barge pole.",
      "rate": 1.0,
      "tripDate": " July 2016"
    },
    {
      "title": "Dirty, small, horrible customer service, if I could give this place a lower mark, I would! *DO NOT WASTE YOUR MONEY*",
      "text": "My wife and son checked into unit 1219-300 Front Street West in late August 2016, to find that the suite was filthy and is disrepair, we didn’t realise just how dirty it was until bathing my 1 year old son, he was covered in dirt, the floors were absolutely disgusting, and had clearly not been washed for weeks or months, I have attached a picture I took using a swiffer (purchased at my own expense), to show you how dirty it was from just cleaning the small section shown in the picture. I had to use a whole packet to get the floor cleaned.Cupboards in the kitchen were hanging off, or had parts missing, the cheap Ikea furniture would be fine, except for the fact that some items have not been assembled properly and are hazardous (chair), and also, the mirror fell off the wall in the kitchen, and almost fell on my son.In addition, there were 2 hallway lights which were not working, which made it hard to see anything inside the closets at night. There were also a number of patch fixes where silver construction tape has been used to fix damaged areas, and the baby crib that was requested (twice), was not here upon our arrival, also, the air conditioning in the bedroom did not work, as the vent was covered in silver tape.I raised all of these concerns with the customer service team, using an email address I found in the suite, they took 2 days to respond, only after I keep chasing. When they did respond, it was to say that they had fixed the lights and sent a baby crib, none of the other issues were addressed in any way, and they stopped responding after that, despite another follow up from me. They did NOTHING to make our stay better and did not offer up any kind of apology or resolution for the substandard condition of the suite.For a cost $2,160.93, plus $189.25, I would expect significantly better and something that meets a minimum standard, in line with the pictures portrayed of 300 Front Street West, from their website. This suites is barely a bachelor, not the \"one bedroom\" suite they pitched it as.In summary, I would never use Altas Suites again, they are completely unprofessional and cowardly, in that way there treated us.If I can stop just one person giving their hard eared money to Atlas Suites, then this review has achieved something, which is more that I was able to achieve from Atlas suites in terms of customer service!",
      "rate": 1.0,
      "tripDate": " August 2016"
    },
    {
      "title": "Do NOT stay here",
      "text": "This place provided the worst experience. Elevators break down so often and property management does not seem to care. Only 1 of 3 elevators worked, resulting in a 10-15 minute wait to just take the elevator! Some folks were reduced to walking down the stairs.",
      "rate": 1.0,
      "tripDate": " May 2019"
    },
    {
      "title": "Disappointing",
      "text": "From moment arrived it was disappointing and un-welcoming. Every room confronted with signs saying 11am checkout if late $50 fine raising to $100 after the first hour.   Issues with lifts not working which caused long queues to get up and down from the suite Suite it's self was tired with dirty carpets walls and the shower was filthy. Paid top price for the suite and would expect to get top quality, unfortunately not the case. Regretted not booking a top quality hotel for less money.",
      "rate": 2.0,
      "tripDate": " October 2017"
    },
    {
      "title": "CN Tower",
      "text": "Fabulous views of Toronto.Glass floor and if your brave do the sky walk.It’s a must visit if you go to Toronto. Iconic building. You get a great view of Billy Bishop flights arriving. You can have a bite to eat in the restaurant.",
      "rate": 5.0,
      "tripDate": " October 2019"
    },
    {
      "title": "Not worth it ",
      "text": "The appartement is spacious but not as nice as the pictures. I couldn’t make the TV work and no one to contact. The place is run down balcony messy and no outdoor seating, blades missing from the blinds and cleaning very badly done. The good point is the location.",
      "rate": 2.0,
      "tripDate": " September 2019"
    },
    {
      "title": "Doesn't accommodate emergency changes in plans",
      "text": "I booked a business trip to stay in this Atlas Suites through Orbitz. In the meantime I had a family emergency and had to cancel the trip. Their cancellation penalty was 100% of the cost of the entire booking.I had not seen this policy, but it's absolutely ridiculous. The lack of flexibility underlies people without conscience in my opinion. Absolutely, do not book here.",
      "rate": 1.0,
      "tripDate": " November 2017"
    },
    {
      "title": "Great venue",
      "text": "Went to Fan expo on labour day weekend. Venue was awesome, wheelchair accessible washrooms great for hubby. Had one rude lady, a registered nurse for the facility named Mary, she was over the top rude!!! Otherwise great venue, centrally located. Food choices were good but a little pricey.",
      "rate": 4.0,
      "tripDate": " September 2017"
    },
    {
      "title": "Great stay",
      "text": "This is a fantastic place to stay if you want to be in the Entertainment District and if you want to be able to enjoy the view from an outdoor terrace/deck.  Not too many places can offer you an outdoor patio to soak in the view.  We were on the 37th floor of the building and the views were spectacular even if we were not on the CN tower side.  The rooftop pool is fantastic and it does have a perfect view of the Tower.  Right across the street from Roger's Center, CN Tower, Ripley's Aquarium, bus tours and not a far walk to Union Station.  The place itself was actually bigger and more spacious than I anticipated given it is in downtown Toronto.  We booked a three bedroom suite and all three bedrooms had Queen beds.  There were two bathrooms, one of which is connected to one of the bedrooms.  It was clean and well appointed.                                                                                                                         The only concern I had was that leading up to our trip, I could not get a hold of an agent either by the phone number they provided nor the email address provided.  It wasn't until two days before our departure that we finally received correspondence describing the check in process.  But at the end of it all, the process was simple.  But don't expect immediate correspondence even if you repeatedly try contacting them.",
      "rate": 4.0,
      "tripDate": " August 2017"
    },
    {
      "title": "Toronto vacation ",
      "text": "Centrally located, very clean and spacious apartment.. very well equipped. I enjoyed my stay .. had no issues at all. Customer service is very helpful and prompt. Well definitely come back.. highly recommend it.",
      "rate": 5.0,
      "tripDate": " July 2017"
    },
    {
      "title": "Great place to stay",
      "text": "We stayed here in April for a very low price. The view from the balcony is amazing. Rooms are clean and fully equipped (two bedrooms and two bathrooms). Unfortunately, the air condition cannot be turned off, so the ventilation is a bit disturbing and there is always a cold wind...",
      "rate": 5.0,
      "tripDate": " April 2017"
    },
    {
      "title": "good service",
      "text": "We booked a department in Toronto ,Atlas Suites  that was awesome,amazing luxury department with beautiful river view it was some thing beyond our thoughts very clean and nice it makes our journey amazing their prices are really reasonable good services were provided well furnished and amazing staff.I highly recommend it!!",
      "rate": 5.0,
      "tripDate": " March 2017"
    },
    {
      "title": "Clean, spacious, AMAZING views, cosmopolitan- more than we hoped for.",
      "text": "My husband booked this apartment for my 30th, i loved it!. The location is amazing, the views from the balcony were out of this world- i slept very little during my stay as i found it impossible to do so when the views were that incredible! spacious living area, kitchen area with dining table, closed off bedroom and large walk in wardrobe, very good amenities supplied like plates and cutlery, microwave, oven, hob, ironing board, iron, hair dryer etc- all you needed to bring was your clothing and toiletries. The location was great, it was around the corner from an amazing breakfast place called Cora's, we went there everyday for breakfast, King street for good restaurants and bars was nearby and queen street for amazing shops was also nearby, once you got to queen street, take a right and keep walking around 20 minutes and you find the Eaton centre, we also hired a car whilst we were there and so they had underground parking. oh and not to mention the fact that CN tower was literally on our doorstep, I cannot even describe - it was literally across the road! The only thing I would say is that for the ENTIRE duration of our stay which was a little over a week- no one came to clean the apartment or even empty the bins and if you have an issue with the apartment, the security/reception staff cannot really help you as the owners of the atlas suites are separate so when we had constant issues with the key fob to get in and out of the car park the reception staff couldn't really help. however with this said i WILL be 100% coming to stay in these apartments again- it was truly amazing.",
      "rate": 5.0,
      "tripDate": " October 2016"
    },
    {
      "title": "Best Location , Great Apartment - well equipped",
      "text": "Very nice apartment . we was 3 adults and the size of there apartment very good . kitchen appliances well equipped . very clean , great customer service , easy access for the amenities , definitely we will come back.",
      "rate": 5.0,
      "tripDate": " February 2017"
    },
    {
      "title": "Great location for TIFF",
      "text": "We came here for the Toronto film festival and was surprised that it was only about a 2-3 block walk the the main street of the festival.  We checked in very late and they had two people running the lobby area that was able to check us in.  We went up to our condo and it was a great space for two different couples and it had a great view.  We only used this condo for sleep and showering so we didn't really use all the amenities that this building offered but we did sneak a peek at the pool and gym which were all great looking.  Our rooms were fine but the other couple complained that there bed was not comfortable at all.  Unfortunately their shower handle was broken so they had difficulties turning it on and off.  We called the company to fix it and on the 2nd to the last day somebody came in and took the handle and never replaced it so we all had to share the same shower in the other bathroom which was very small.  Since we were a party with two couples we called the rental company to drop off a spare set of keys so we could all come and go as we please and they never did it so these two things were very disappointing but did not ruin our trip.  But with these two things I would have to say their customer service is not good at all.  I'd stay here again as long as one didn't need anything from the rental company as the front desk people are useless and they are also not very good as being a concierge.  And for those travelers who think that after check out they might be able to leave their luggage somewhere before departing please think again as they do not offer any services as a hotel.",
      "rate": 4.0,
      "tripDate": " September 2016"
    },
    {
      "title": "Impressive views",
      "text": "The first day we arrived we tried to do this bit it was overcast and there was a rep at the bottom letting you know that you wouldn't be able to see anything. Came back the next day and so glad we did. Views are very impressive!",
      "rate": 4.0,
      "tripDate": " September 2016"
    },
    {
      "title": "Great location, terrible suite",
      "text": "My husband and I stayed in a suite at the 300 Front Street property.Check in was quick and easy. The suite has an amazing location in the heart of downtown Toronto.The suite itself needs some serious upkeep.*The entire suite needed a thorough cleaning. The floors were covered in dust and hair.*The kitchen had no dish cloths or towels. For a full suite with a kitchen this is very unusual and inconvenient.*The bathroom had only two towels for a five night stay. Not terrible, but again it's strange.*Several burnt out lights including the bedroom lights.*Had some maintenance issues with bathroom. Called and emailed Atlas Suites several times but never heard back.*Elevators were out of order for most of our stay causing extremely long wait times to enter and leave. Walking up 30+ flights of stairs was the only other option.Despite the great location I would not use Atlas Suites again.",
      "rate": 1.0,
      "tripDate": " September 2017"
    },
    {
      "title": "Great place, gorgeous",
      "text": "Gorgeous place! Lives up to expectations this page gives, for sure. Super clean, polite staff, and feels very comfortable to stay in. You can tell they put a lot of pride in the space and ensure their customers are satisfied. Highly recommend :)",
      "rate": 5.0,
      "tripDate": " September 2016"
    },
    {
      "title": "Good find",
      "text": "I am a very frequent visitor to Toronto and always use to stay at a hotel but this time I stayed at Atlas suites and was very impressed with the facilities and and accommodation.the checkin procedure was very fast and efficient.The apartment was very clean and well supplied with clean towels and linen.the view from the apartment was just awesome.customer service was very helpful too.Atlas Suites is my top pick in Toronto now.",
      "rate": 5.0,
      "tripDate": " July 2016"
    },
    {
      "title": "Excellent value and location",
      "text": "I usually stay at one of the high end business hotels on Front street when visiting Toronto. This trip there happened to be a few events on around town and the hotel prices had doubled from the usual price. I found this executive rental by searching around the web and selected it from reading reviews.I will not use Air BnB as it creeps me having someone vacate their house for a couple of days so I can rent it, and find it even creepier to stay in a row in someones house. This condo is used for short term rentals and as far as the room goes its as good or better than any 5 star in town.Great location to get to the business and entertainment districts. Definite do again for me.",
      "rate": 5.0,
      "tripDate": " April 2016"
    },
    {
      "title": "Beware of 300 Front Street W, Toronto Canada - Suite 2406 Is Not An Eexcutive Condo/ Luxury Suite",
      "text": "I made a reservation through Expedia for an Executive Condo listed as \"Luxury Suite By CN Tower and Free Parking.\"   The address on the reservation is listed as 20 John Street, Toronto, Canada.  Prior to arrival I received a text message to pick up keys at 300 Front Street W, Toronto, Canada.   Only then did I find out that I would be staying at 300 Front Street W in Unit 2406.  I did not feel safe in Unit 2406.  The lock was difficult to lock and unlock.  The listing is deceptive, it is not an Executive Condo/Luxury Suite but a shabby unit.  It is a 1 bedroom, 1 bathroom unit.   The living area is small and has a  nasty, badly stained sofa, kitchenette, high table with bar stools for dining and a bed in one corner of the room separated by a curtain hanging from a bent curtain rod.  The corner bed is sunken in the middle and should be trashed.   While traveling I always bring disposable mattress covers, my own pillow protectors, cases, shams and towels.  The bathroom shower track is filthy and needs a good scrubbing.  The overflow piece in the sink kept falling out.   The bedroom mattress was filthy and looked as though someone had urinated on it.  The mattress was covered with a stained mattress pad to hide the stains.  The sheets on the bed were dingy so they along with the stained mattress pad  had to be washed with bleach.   I had to flip the mattress over [other side somewhat cleaner] and cover it with the bleached mattress pad, a sheet followed by the disposable mattress cover and a fresh set of laundered sheets.   The curtains in the bedroom were mismatched and didn't fit the window.   All the bedding for the 3 sleeping areas had to be laundered before going to bed.   The sofa was not a sofa bed but had a section that pulled out near the sofa cushions.  Very uncomfortable my Guest stated.  We had to cover it and the sofa cushions with one of the mattress covers because as stated earlier the sofa cushions looked nasty and were badly stained.  The vertical blinds had slats missing or broken so the window was not fully covered.  The listing boasts of a view of the CN Tower but unfortunately the view is spoiled by the awful vertical blinds.  The balcony needs to be swept.  I do not recommend Unit 2406 for females traveling alone, seniors or families.   Unit 2406 should be removed from all listings as the description of the unit is fraudulent.  I paid over $2100 US [2886.90 CD] for a 4 day stay and have tried in vain to contact the Host and Operations Manager to no avail.  I hope this review keeps someone else from getting scammed like I have been.  In the event the Host is compelled to contact me I will update this review.",
      "rate": 1.0,
      "tripDate": " June 2024"
    },
    {
      "title": "Dirty and in need of attention ",
      "text": "The view from our apartment was great. The location really convenient for CN Tower and Union Station. The apartment itself is good, but it is in dire need of a clean (grime in shower, basin - Windows thick with dirt etc). No knives, drying up cloths, dishwasher not working, lights not working.Management did not answer emails or calls.Hard to get key. Inadequate instructions on using apartment (use fob on pad in right of lobby to open entry door) - lock door with key on exit it is not a self locking door! Return key on time. One minute late and $50 fine.Do yourself a favour and book somewhere  who cares about your stay. Atlas should be out of business!",
      "rate": 1.0,
      "tripDate": " September 2018"
    },
    {
      "title": "Terrible service!!!",
      "text": "I booked the apartment the 14th of October 2017 for my week long trip to Toronto in June. I sent an email to get information about the apartment a week before the trip and it was never answered. I travelled all the way from Iceland and called Atlas Suites to get information on where to pick up the keys. The man who answered told me that they had already sold my apartment because I wasn’t answering any emails (that were never sent, I checked every email folder). So I and 3 other people with me, have travelled all the way to Canada just to be stranded in Toronto. I do not recommend!",
      "rate": 1.0,
      "tripDate": " June 2018"
    },
    {
      "title": "Filthy and terrible customer service",
      "text": "I booked this “hotel” as I thought it was attached to a hotel through booking.com. What a joke of a place. I emailed on a number of occasions asking for a travel cot. On the day we were traveling I got an email to say they couldn’t provide one, even though I had asked when booking. When we arrived there was no reception we had to collect the key a block away. We felt like we shouldn’t be there as it was a residential building and the security staff didn’t seem to approve of us being there. We were asked to leave the pool with our small children because we didn’t have wrist bands and when I emailed atlas suites looking for them I didn’t get a reply. We had to check out at 11am and had nowhere to leave our luggage. When we arrived at the airport we realized we had left our passports behind. I contact them immediately who said they would send someone over to meet our friend. It took that person almost an hour to get there which meant we missed our flight home. The apartment itself is extremely basic with very few utensils and the floors were filthy. I couldn’t let my toddler walk around in his feet. And there was no mop to clean it. The location of this apartment was the only good thing but I would never stay here again nor would I recommend it to anyone traveling to Toronto.",
      "rate": 1.0,
      "tripDate": " May 2018"
    },
    {
      "title": "Great Location, with a nice view",
      "text": "The suites here are very nice, the location is great, just across the street from the convention center.  There is a market just down the street where you can get almost anything.   Walking distance to King street where there are lots of restaurants.",
      "rate": 4.0,
      "tripDate": " March 2018"
    },
    {
      "title": "See Toronto",
      "text": "Hi this is a tallest tower in 🇨🇦 Canada I was go there with my family and near the tower aquarium both of the nice for kids and I like both of places in Frount of tower railway yards so many oldest rail bogies",
      "rate": 5.0,
      "tripDate": " June 2017"
    }
  ]
}