{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Backpackers on Dundas",
    "url": "/Hotel_Review-g155019-d1203412-Reviews-Backpackers_on_Dundas-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "1.5",
      "reviewCount": 32
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "On M5g 1R3-126 Chestnut St",
      "addressLocality": "Toronto",
      "postalCode": "M5G 1R3",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/04/07/23/60/reception-we-had-to-wake.jpg?w=500&h=400&s=1"
  },
  "description": null,
  "featues": [
    "Free High Speed Internet (WiFi)",
    "Wifi",
    "Airport transportation",
    "Laundry service",
    "Air conditioning",
    "Kitchenette"
  ],
  "reviews": [
    {
      "title": "Bed bugs",
      "text": "I stayed there and was bitten all over by bed bugs. Every other hostel and hotel was booked out that weekend so I had to stay. The manager just moved me to another bed and never cleaned the bed and let someone else sleep in it and wouldn't cover my doctor fees or medication- I would sleep in the park rather than stay there",
      "rate": 1.0,
      "tripDate": " June 2012"
    },
    {
      "title": "Horrible first night in Canada.",
      "text": "Oh do not stay there, Do not trust the manager. I arrived with a group of 12 scouts, at the Backpackers in downtown Toronto on a saturday evening at 8 pm in August. At arrival the manager told me he had given away our beds. I had reserved those beds weeks in advance. The manager told me he had sent an e-mail earlier that day, asking if we were coming. The day we were travelling from Iceland to Canada, Oh and the smell, it was dirty, and very small. The taxi driver we met the next day said we were indeed lucky not to be staying there at all. So the place has avery bad reputation with the ttaxi drivers in Toronto. I think that speeks for it self. You can imagine, trying to get accommodation elsewere in Toronto at Carabana festival. We ended up in Burlington, 45 min away from Toronto.",
      "rate": 1.0,
      "tripDate": " August 2013"
    },
    {
      "title": "Just don't do it!",
      "text": "When planning a trip to Toronto this seemed like a good cheap option. As it turns out that was not the case. To be fair I didn't have a chance to sleep in the beds or try out the shower but that was because they had given away the beds we had booked. We had a copy of emails that proved that we had booked beds but the \"manager\" of the place told us that he had sent us an email earlier that day asking us if we were coming to stay. We obviously didn't have a chance to respond to that email because we had spent the entire day traveling. The manager was very rude and didn't even consider helping us to find another place to stay. When I think back I'm very relieved that we had to find another place to stay because otherwise we would have stayed at this hostel for three nights. So a word of advice for those who are thinking about staying there, DON'T DO IT!",
      "rate": 1.0,
      "tripDate": " August 2013"
    },
    {
      "title": "Oh the smell, Oh the management",
      "text": "Travelling with a group, we booked three nights at this hostel a few weeks in advance, and later sent e-mails to confirm that we would be there on schedule. When we arrived we were informed that our beds had been given to other visitors. Supposedly the manager had sent us an e-mail while we were in mid-air three hours prior to our arrival which we would have had to answer immediately, otherwise he'd give the rooms to someone else, which he did. Well, we never got that e-mail, and besides, even if we had received it, this would still have been an outrageous act on behalf of the management.On top of it all, the reception wouldn't help us find new hotels, or solve the issue peacefully. In fact they were extremely rude and unhelpful. In the end, we were somewhat glad that we never stayed the night, since the place had a horrible smell of rotting flesh and strong detergent, the place was very dirty, electrical wiring hung loose from the walls, the staff was poorly trained and rude and the atmosphere was cold. No low price could make up for it. The only good thing about the place was the decent Arabian restaurant on the ground floor.Don't even consider Backpackers on Dundas.",
      "rate": 1.0,
      "tripDate": " August 2013"
    },
    {
      "title": "bed bugs, cold showers, rattling non-working air con",
      "text": "well, my title pretty much sums it up. During my 7 years of travel, I have stayed in over 50 hostels in 4 continents and I have to say this is the worst place I have stayed (and I've been to the bum end of Africa!)unwelcoming, unhelpful staff, freezing cold shower water. air conditioning units that dont let out any air, just rattle and shake the building, bed bugs, filthy kitchenette. I could go on forever.I just hope my review helps others visiting Toronto to avoid staying here. It really puts a dampener on your trip.",
      "rate": 1.0,
      "tripDate": " January 2012"
    },
    {
      "title": "Terrible",
      "text": "They locked me out and stole my luggage. Cockroaches everywhere. This is a scam do not go here. I was locked out and then preyed upon by the guy who worked there, all 6 men then claimed they owned it and do not like women.",
      "rate": 1.0,
      "tripDate": " November 2015"
    },
    {
      "title": "Avoid at all cost",
      "text": "This hostel is really the worst one I have ever stayed at.  I certainly do not recommend it to anyone; as cheap as it may be it is not worth it.ReceptionThe man did not really seem to know what he was doingReceipts are not systematically given and are makeshiftThere seems to be no registration number or any information on who actually operates this hostelWe were not provided with any keysBedroomDorm style (4 bunk beds, 8 people total)There were not enough hangers and the lockers are ridiculously smallOne of the beds we were given (we were three) was not even cleaned between staysThere was an overwhelming filthy smell and the carpets seemed like they had not been washed for a while.  Our room smelled of Marijuana on top of thatNo fresh air whatsoeverAmenitiesThe hostel can house more or less 18 persons, from what I saw, and there are two malfunctioning dirty showers and a small bathroom, which you share with a water heater.The kitchen is a pile of some cutlery, pots and pans with a simple countertop heater and no stove.No breakfast included or anything like thatDecent television roomAwful common room and internet stationsCommentsBasically, this place is a former office space converted to a hostel and is basically a dive.  We were not given keys and told the reception would be open, despite the signs stating otherwise.  When we returned there was no one there to open the door.  We had to bang on the door for 45 minutes until a guest opened up for us.There is no way to contact anyone responsible on the actual day.  No concept of customer service whatsoever.",
      "rate": 1.0,
      "tripDate": " June 2013"
    },
    {
      "title": "Awful place to stay",
      "text": "When i got here i didnt know what i had let myself in for. Place was so small you couldnt swing a cat. Given this i thought it was a new hostel just getting started so i will give it the benefit of the doubt. BIG MISTAKE.  There are bugs everywhere, you cant keep anything in the fridge as its full of all the long term stayers items, the dorms are so small you can barely move and the bed bugs had a great feast on me.  When i tried to tell the guy on the desk about the bed bugs he got so defensive and rude. Kept saying that every hostel has them (everyone i have stayed at doesnt). I also said about the bugs and his reply was someone brought them in their backpack and nothing they can do about it.I asked if i could speak to the manager and was told no as he is sleeping.I wouldnt stay here if you can avoid it the place is disgusting.  its that bad im spending the night at the airport rather than stay here one more night.",
      "rate": 1.0,
      "tripDate": " October 2015"
    },
    {
      "title": "awful way to end our stay in toronto",
      "text": "after spending 3 great nights at another hostel we had to endure 2 nights at this place for the end of our stay in Toronto. its very small, poorly run and lacks everything a hostel is in my eyes. zero atmosphere. it looks like its been set up by a group of teenagers (who lived there also) who have no clue how to run a hostel, zero people skills and if anything u seem an inconvenience them when u check in or ask questions as they have to stop watching films etc on there computers. the first sight u are greeted with is a big pile of smelly shoes as u have to take ur shoes of in the hostel. the bed linen that was given to us after the tiresome check in process was stained and very old. we were then shown our room which has badly damaged ceiling tiles smelt bad and had the worst blinds for a bedroom ever so the room at night was lit up like a xmas tree. the washroom facilities were small, dirty and shower cubicles were held together by tape in some. the water pressure was bad some times they worked sometimes the trickled out if that. the kitchen is none existent and consisted of a jam packed fridge of food so no room for ur stuff. overall this is the weirdest place I have ever stayed at, for these reasons and more I, think most people who were stayin in the hostel were stayin there long term and seemed a bit odd, much like the hostel. it was as if u were staying in a college kids dorm. if u have read this far I guess what im trying to say is..... just don't do it!!!",
      "rate": 1.0,
      "tripDate": " June 2014"
    },
    {
      "title": "Blah",
      "text": "I live in a suburb of Toronto but decided to spend the night in a hostel to work a late then very early shift for the Hot Docs film festival.  This hostel was the only one that had any space available the day-of.For $24 in the heart of Toronto, it was definitely OK.  Nothing exciting by any means.  Lockers were way too small and the location is not an interesting one but it is well located between the business area, U of T and China Town.Staff was OK.  Hey, it saved me a couple of subway rides and getting up ridiculously early.  That is about all.",
      "rate": 2.0,
      "tripDate": " April 2013"
    },
    {
      "title": "You get what you pay for",
      "text": "This place is great if you're super laidback and just want a place to sleep and shower. It's definitely not worth more than the $35/night (or there abouts) you pay. Beds were fine, I liked that they provided bedding. The common areas were generally clean too. My main issues with the place were the amount of insects around and the terrible showers. I hadn't had an problem with the bugs until I went to use the microwave for the first time, only to find that there were a number of them crawling around inside it. This was before and after use, when I had thought I'd gotten rid of them. The other issue was the showers which shouldn't be even be given the title. The pressure was so poor in one shower that the water was merely a dribble. This made it very difficult to wash properly. It should be noted that during our stay the owners were in making alterations after poor reviews, so it is positive that they are willing to make improvements.",
      "rate": 2.0,
      "tripDate": " June 2016"
    },
    {
      "title": "Good location but don't like the bathroom.",
      "text": "Both sexes share the same bathroom. Shower and pee area separated although they have 1 combined. Too many people sharing the bathrooms and so, you need to wait. Sink is too tiny. No place to hang clothes in shower room. No free breakfast.",
      "rate": 3.0,
      "tripDate": " July 2011"
    },
    {
      "title": "Cockroaches, dirty, and uncomfortable.",
      "text": "I would not recommend this place to anyone - it's dirty, it's uncomfortable, and there are cockroaches - even though it's a good location and cheap, it's NOT worth it. There are cockroaches everywhere - all over the bathroom, in the kitchen - in broad daylight, with people around. I would hate to think how many come out at night. The showers had hair all in them, kitchen was dirty, fridge was very dirty, the top bunks squeak and sway, things are broken, the kitchen facilities are very limited, it was awful. We left for the HI hostel and had a much better night.",
      "rate": 1.0,
      "tripDate": " December 2017"
    },
    {
      "title": "DON'T SPEND YOUR MONEY HERE",
      "text": "I would never stay here again. It was dirty, there were bugs in the bathroom.  They make you take off your shoes as soon as you open their door so you're forced to walk around the common areas without shoes - and yes, the floors are filthy! The staff was incredibly unfriendly! They were the most un-hospitable people I've ever seen in this industry, they should not be working in hospitality. Seems like some of the staff just live there as well. One female staff member is currently hogging one of the beds in the all female dorm, which takes away that bed for a female traveler who would be more comfortable in the female dorm. On top of that she isn't professional whatsoever, doing yoga on the floor of the bedroom and the kitchen, not saying a word to anyone. There was an argument the first night I arrived that broke out between two people and the guy at the front desk is just silently watching, doesn't do a damn thing. The beds suck, they have no amenities like most hostels - meaning that there is no small lamp by your bed & no outlets for the top bunk people. The entire hostel was overall disgusting and has extremely poor management. Spend more money to not stay here.",
      "rate": 1.0,
      "tripDate": " September 2017"
    },
    {
      "title": "What a dump",
      "text": "By far the worst place I've ever been, the main supervisor was the most rude man I've ever met, we had booked four beds in a mixed dorm and on arrival we were told that one of us were going to be put in a girl dorm. There was a tv room advertised but on arrival we were told we could not use it as a guy was sleeping there. We were also told by another guest that 11 of the people staying there were permanent residents, some of whom were clearly squatting and the staff either could not or would not move them on.To be fair two of the staff were really nice, an older guy and a blonde woman but the other guy, skinny with brown hair was an odious human being. We overheard him badmouthing us as if we were being unreasonable asking for what we had booked. The showers were infested with cockroaches. There were only 2 toilets between 30 guests. To conclude under no circumstances would I recommend staying in this godforsaken hellhole.",
      "rate": 1.0,
      "tripDate": " July 2017"
    },
    {
      "title": "What a joke of a hostel ",
      "text": "By far the worst hostel I've stayed in, paid for 4 rooms in one mixed dorm and on arrival we were told we were being separated with one in a girl dorm, due to over half the guests actually living there as there permanent home, only told on arrival that we weren't getting what we paid for, supervisor was the most unfriendly and most unhelpful person I've ever met, he was so rude, only two bathrooms for over 30 people, couldnt even use the communal TV room as they had a guy sleeping on the sofa due to lack of beds, absolute joke, would never go back there again, need a whole new revamp including staff",
      "rate": 2.0,
      "tripDate": " July 2017"
    },
    {
      "title": "Nice location",
      "text": "It's only 1 minute from Greyhound station, and not far from everything. Price might be a bit too high compared to the service you get. But it's clean, beds are comfortable, you get a little locker, and it is a good place to get in contact with people.",
      "rate": 4.0,
      "tripDate": " July 2010"
    },
    {
      "title": "Quality for money....NOT!",
      "text": "I'm no princess, i've been to hostels with bed bugs but it was very cheap so you can understand.I will give it to backpackers on dundas, it seemed clean and the internet was great. But a note if your going to stay, its a rip off for what you get. First off its an old office block that they have turned into a hostel. There are no openable windows so the place is always stuffy. I stayed for a week which was $160, the showers were ridiclous, the only setting was boiling or freezing, the 'full' kitchen is a lie, its a kitchenette..with no toaster or spoons. There is only space for 8 people to sit at the dining table..the hostel can hold 30 people, so be ready to eat standing. The staff have no idea what is going on or who is sleeping in their beds, almost every night they would question if someone had checked out if they weren't in their room and then nearly give the bed away to someone else, they have zero communication and booking system.  This place is more like a share house and an expensive one at that. I recommend you book to another hostel, Canadiana backpackers inn is great but they book out quick!",
      "rate": 2.0,
      "tripDate": " April 2010"
    },
    {
      "title": "I wish there was a 0 star option.",
      "text": "Gross hostel, wish I could give 0 stars. Dirty, loud, bad beds, bright at night. Overall terrible experience. Would feel safer and cleaner sleeping in a park, there would probably be less homeless people there too.",
      "rate": 1.0,
      "tripDate": " October 2016"
    },
    {
      "title": "Horrific!!",
      "text": "Stayed here for a few weeks while in toronto and had to be moved to a different room as i got bitten by bed bugs!! Staff didnt do anything to get rid of them.  Manager not very approciable. Bugs in the bathrooms and showers on floors and walls!  Very crampt rooms. Not much room to do any cooking.  Would rather sleep in a doorway instead of spending another night in this place! Also they have a habit of overbooking people. Not very organised!",
      "rate": 1.0,
      "tripDate": " July 2014"
    },
    {
      "title": "Its cheap for a reason!",
      "text": "All this place has going for it is its location. Stains on the floor, flat and uncomfortable pillows, thin blankets, horrible atmosphere. I would never ever recommend this place to anyone.",
      "rate": 1.0,
      "tripDate": " December 2011"
    },
    {
      "title": "Bed bug bites",
      "text": "Great location and friendly staff however i also got covered head to toe in bed bug bites. This has also meant i have had to wash every item of clothing and disinfect my suitcase. I would not stay at this place again until the bed bugs have been properly fumigated. Sometimes the beds are sprayed but this does not work as the place is infested. The place would make money if it was looked after. I am really gutted that i got bitten as it has now ruined my time in toronto. This is the reason why bed bugs are spread because owners like Michael cannot be bothered to fix the problem. Very disappointed! Do not stay here!",
      "rate": 2.0,
      "tripDate": " July 2011"
    },
    {
      "title": "bed bugs",
      "text": "the staff were very friendly and its an excellent location but the room i was in was full of bed bugs.i got bitten for 3 nights solid and had to clean the bed myself.when i eventually got a different bed they didnt even clean the bed and gave it to someother guy.when i spoke to the owner and asked him could he compensate me for my doctors bills cream medicene and tablets he said the hostel wasnt making any money-even tough it was booked out for the last week.my body is covered in bites and he didnt seem to care-he did say the beds are sprayed everyday,which i never seen.people have complained about the showers-always cold and no pressure and he said thats just the way it is. i would never go back there and was very disappointed over the way i was treated,not the staffs fault but the owner Michael",
      "rate": 1.0,
      "tripDate": " June 2011"
    },
    {
      "title": "The worst sleep I never had",
      "text": "Unless your backup backup plan has fallen through and you're shy of sleeping on the streets, do not stay here. The location is great!...And that's where the fun stops. Bugs are everywhere and it looks and feels very unsanitary. It needs a complete renovation, I don't know how they've managed to stay in business. It's extremely cramped and there is really no privacy. Every window in the place has blinds that are missing, leaving you completely exposed to the busy street below. Again, don't stay here. You were warned.",
      "rate": 1.0,
      "tripDate": " September 2015"
    },
    {
      "title": "Good place to stay in, if your needs are basic and you live on budget.",
      "text": "Staff there was fun, friendly, VERY respectful and helpful. Yes, it's very basic, but hello! Its only 32 bucks a night! If you need an \"atmosphere\", flowers, marble counter tops and a big bedroom - 5 star hotel is around the corner. I needed a bed to sleep on, shower, and a fridge and I got it. Dorms are gender divided. You can get laundry there as well and a small kitchen to cook in, they have clean towels on request and mattresses had NO bed bugs (they passed Pest Control in 2016). It was a very social fun place and I had a good laugh with other people that stayed there at the time of my stay. German, Australian, Italian tourists stayed there. Men tourists were very respectful, majority of people minded their own business. Again: the hostel meets basic needs for people in transit. Location is excellent a environment was friendly. P.S. there is a curfew, but if you need to come and leave at the time past that, they give you a key for a small deposit. So, GO THERE if you are in transit, need a safe place to stay and don't want to break a bank.",
      "rate": 4.0,
      "tripDate": " May 2016"
    },
    {
      "title": "Last resort type of hostel",
      "text": "The door staff was extremely unfriendly and unhelpful. Staff knew nothing of the area and welcomed us with an crappy attitude. We booked online, for two adults with one bed, which gave us the price of 38$. Due to a booking error through the website we used, we ended up paying an extra 30$ for two people to sleep in one bed. There were cockroaches in the washrooms. The beds were comfortable, however very loud. The fact that there were cockroaches wouldn't necessarily be an issue as we stayed for one night, and were happy to have a place to stay. What made it an issue was paying 68$ because the hostel doesn't operate the way their booking websites imply, and the utterly rude staff.",
      "rate": 1.0,
      "tripDate": " September 2017"
    }
  ]
}