{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Baldwin Village Inn",
    "url": "/Hotel_Review-g155019-d630451-Reviews-Baldwin_Village_Inn-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.5",
      "reviewCount": 95
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "9 Baldwin St",
      "addressLocality": "Toronto",
      "postalCode": "M5T 1L1",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/07/6c/f2/f2/baldwin-village-inn.jpg?w=500&h=-1&s=1"
  },
  "description": "We are a family owned and operated business, offering quality accommodations in the vibrant neighborhoods of downtown Toronto for over 25 years. With a variety of housing types, our location and clean and comfortable rooms can provide you with the right lodging for your stay. Our properties give guests the convenience of a city with the feel of a cozy home. The demand for affordable accommodations has led us to continue to expand our operations with a new 4th location opening up starting May 2015.",
  "featues": [
    "Free High Speed Internet (WiFi)",
    "Wifi",
    "Non-smoking hotel",
    "Air conditioning",
    "Non-smoking rooms"
  ],
  "reviews": [
    {
      "title": "B&B like visiting old friends in toronto",
      "text": "..very good situated in toronto in a street with a lot of scenic restaurants and shops nearby the kensington market. The hosts where very friendly and helpful. The breskfast was amazing and complete. A little problem was the shared bathroom, especially the one behind the kitchenroom on the groundfloor. You have to path all the other guests & the hosts having breakfast while you try to enter the bathroom without being seen and without speaking to anyone.The price is a little bit too high for this kind of shared bathroom acc.",
      "rate": 4.0,
      "tripDate": " August 2011"
    },
    {
      "title": "Great owners, great location",
      "text": "Roger and Tess made us feel like welcome guests in their home.  The Inn was in a great location, on a street with restaurants of all kinds, and within walking distance of the CN Tower, the waterfront and the ball park.  For me, the negatives were the temperature of the room -- very warm in August -- and the location of the shared bathroom.  In order to use the bathroom or the shower, you have to walk through the kitchen, where guests may be having breakfast.  A bit awkward.  Overall, a great stay -- highly recommend.",
      "rate": 4.0,
      "tripDate": " August 2011"
    },
    {
      "title": "Great value and location.",
      "text": "I must say, owners Roger, Tess and family were very nice.  Confused me a bit a first with parking, but finally directed me to a parking garage nearby.  The Inn is on a cool street with many nice restaurants.  We were able to walk to the CN tower from the Inn.Room was clean, but a little warm.  No TV in room, but one in common room.  WiFi worked.  The only awkward thing was the common baths were in the kitchen.  This meant you had to walk past the other guests the were eating breakfast with your change of clothes and toiletries.  Overall, we had a nice stay!",
      "rate": 4.0,
      "tripDate": " August 2011"
    },
    {
      "title": "stay away",
      "text": "i was attacked by the biggest bedbug i have ever seen which attached itself firmly to a part of my body that should remain unviolated.it was frankly disgusting. don't go there.",
      "rate": 1.0,
      "tripDate": " June 2010"
    },
    {
      "title": "racist hosts",
      "text": "The inn itself has great interior space and accommodations, plus it's right beside the Vegetarian Haven which is my favorite restaurant in Toronto.  The problem I had was I felt the hosts were nosy and bossy.  Roger kept on asking me about my shoe samples which he was overtly interested in and asked me about ten times to show him.  In the shoe business, it's not exactly in my interest to show a stranger samples before the styles actually come out.  His wife was the bossy one who started to give me orders like I was a child.  At breakfast I was subtly ignored over the other visitors.  Perhaps it's because I'm Chinese and they're Philippines they feel since I'm Asian I'm one of them and they don't need to impress me.  I feel they were sucking up to the Caucasians who were there and trying to make them feel sorry for them because they had to leave Philippines for Canada because Canada is such a better place to live in.  Needless to say, I went to stay at a B&B for comfort and enjoyment, not to have to put up with self-directed Asian racist treatment.",
      "rate": 2.0,
      "tripDate": " February 2008"
    },
    {
      "title": "Nice, quiet, but owners a little too interogating",
      "text": "It's always difficult to determine people's intentions, so I may be misunderstanding the owner's polite interest in my field of work. However, I felt a little \"worked over\" the details of the business of my field - to the point where I began to suspect that I was being dug for investment tips. So, are these owners just trying to be friendly & engaging or, are they being opportunistic in their access to some privileged information? I'm not sure.Anyway, house is clean, rooms are attractive & tastefully decorated. Also, bathrooms has plenty of warm water and breakfast was adequate.  The location is excellent: while being ideally located, the neighbourhood was sufficiently quiet enough to provide an undisturbed sleep.As all the other guests were Caucasian, I couldn't detect any \"sucking up\" as noted by the previous reviewer, but I would only note that I was a little uncomfortable with the owner's overt interest in my job industry, where I'm from and the business market therein.",
      "rate": 3.0,
      "tripDate": " April 2008"
    },
    {
      "title": "Nice, Clean and convenient",
      "text": "We stqyed there 4 nights and we cqme back again. Very closed to downtown Toronto, in a nice street full of life and different bars and restaurants. The b&b is clean and the owner can give you all the assistance you need regarding what s going on in Toronto. You  have free access on internet and phone; Breakfast good and w/many choices.Elisa & Biscotta",
      "rate": 4.0,
      "tripDate": " August 2011"
    },
    {
      "title": "Excellent hosts, great location inn, absolutely clean bedrooms and shared bathrooms.  Highly recommended.",
      "text": "Was very happy staying in this inn as the hosts (roger, tess, pia) were very welcoming and friendly.  The inn feels like a \"home\" away from home.  Even though it's shared bathrooms, but they are all very well kept, clean and tidy.  The rooms are also very clean and neat.  Very comfy bed.  No too stiffy, victorian kinda of decor.  Their Simple lines, well-lit atmosphere makes a stay super cozy. They also served very nice omelette for breakfast.  :)  (roger's specialty).  Highly recommended.  Location so good as many restaurants on the same street, makes it very convenient.  Very close to museums, chinatown, university of toronto.  There is also a laundrette on the same street.",
      "rate": 4.0,
      "tripDate": " May 2011"
    },
    {
      "title": "Baldwin Village is in a great area close to Chinatown & the city",
      "text": "We spent three nights here and were welcomed by our hosts Tess and Roger.  Our room was upstairs and the only negative aspect was that we shared the bathroom with two other couples however there were other facilities downstairs.  In the morning we had a substantial breakfast.  Nearby in Baldwin village were a variety of eating places and a laundromat.  On University Avenue was a convenient subway and nearby were other forms of transport.",
      "rate": 4.0,
      "tripDate": " May 2010"
    },
    {
      "title": "An enjoyable stay and great value for Toronto",
      "text": "We stayed here for two nights while having a getaway from kids and one of us was attending a meeting.  Tess and Roger and their daughter were very welcoming and attentive and genuinely interested in our travels and our needs.  The room was quiet despite being at the front of the building,  The bed was comfortable.  There was no wardrobe, but a chest of drawers -fine for a two night stay.  No TV in room -but one in a small sitting area.  The bathroom was close (down the hall), but very small and being shared by three or four rooms/guests -mostly not a problem, but may not suit everyone.  Breakfast was fabulous and eggs cooked to order were great.  Location is good -close to Queen St West and very close to AGO.",
      "rate": 4.0,
      "tripDate": " September 2010"
    },
    {
      "title": "Fabulous place to stay in downtown toronto",
      "text": "Baldwin village inn was amazing. The location was awesome for getting to Kensignton Market, Chinatown, Queen St. West, City Hall, King st West, etc. - all the key downtown spots for exploring Toronto. The B&B was located on a quiet, safe street and surrounded by quaint shops, cafes, and restaurants. Really great street. The b&b also has an awesome backyard private garden patio - great in the summer time. There is also a second floor deck with chairs. Great  hosts. Would love to stay here again!",
      "rate": 5.0,
      "tripDate": " July 2013"
    },
    {
      "title": "Great little place to stay!",
      "text": "We stayed with Roger and Tess this past week when in Toronto for Microsoft's Worldwide Partner Conference.  We wanted to be near everything but in a quieter location than the big hotels. We ended up in their smaller location over on Sullivan Street.  The rooms were great...spacious, nicely laid out and comfortable. There was great desk space too. Nice place to stay when in Toronto.",
      "rate": 5.0,
      "tripDate": " July 2012"
    },
    {
      "title": "A very good experience",
      "text": "The Baldwin Village Inn is a very good bed and breakfast. Roger and Pia made me feel welcome and were excellent hosts. The breakfast, though simple, was good. The room was basic. I hesitate to tell anyone about this place because there may not be a room for me next time. I certainly would stay there again.",
      "rate": 4.0,
      "tripDate": " October 2011"
    },
    {
      "title": "what a fun place to stay",
      "text": "A lovely place to stay, very comfortable room and quiet location so able to sleep really well. Tess, Roger & Pia were really friendly & welcoming. Lots of interesting places to eat close by and Roger has lots of suggestions as to various cafes & restuarants. A nice touch is the 24 hour availability of tea and coffee in the dining room (something we missed in other B&B in Canada). The only down side is the shared bathrooms. It was explained carefully to us on the day we arrived that the bath mat was to help stop other guests  eneter a flooded bathroom, sadly this message didn't seem to have got through to everyone and on 2 mornings we entered a very wet room. Not having en suite isn't a big issue if you are not on a tight timetable and other guests know the 'rules'.",
      "rate": 4.0,
      "tripDate": " October 2011"
    },
    {
      "title": "Absolutely Stay HERE!",
      "text": "We have now stayed twice at the same house and can highly recommend the property, the area and the absolute hospitality offered by the staff. This group of inns is quietly and professionally run by a small group of dedicated people. The house is clean, modernized and set up for your comfort. The price is excellent and the location divine! Stay here!",
      "rate": 5.0,
      "tripDate": " February 2017"
    },
    {
      "title": "The Best Location and Beautifully Kept",
      "text": "We stayed at Sullivan House during our stay. Roger was warm and welcoming upon arrival. Gave extremely clear instructions and made our check in effortless. The house was clean and well decorated with all the amenities you would expect. Finally the location is exceptional. We were able to walk to everything!",
      "rate": 5.0,
      "tripDate": " November 2016"
    },
    {
      "title": "Relaxing Oasis",
      "text": "Great stay! Location is a dream and the place is unfussy, spotless and super comfy. Excellent value all around. Hosts are amazing. Couldn't have asked for a better 2-night stay in this beautiful city.",
      "rate": 5.0,
      "tripDate": " July 2016"
    },
    {
      "title": "Excellent!",
      "text": "Good place, amazing hosts, good breakfast. Silence in the night and excellent for To share your experiences with other travelers. You can practice your english and can enjoy the best of Toronto because they are on excellent localization.",
      "rate": 5.0,
      "tripDate": " June 2016"
    },
    {
      "title": "Charm, comfort and appeal in abundance",
      "text": "I love staying at the Baldwin Village Inn. I stay there whenever I am in Toronto with my wife. It is my base away from home. I know that I will have a nutritious breakfast to start the day. I  have met interesting people and engaged in lively conversation at every breakfast. In the evening it is a place to park and relax after a busy day and get a good nights sleep.",
      "rate": 5.0,
      "tripDate": " April 2016"
    },
    {
      "title": "Perfect pied-à-Toronto",
      "text": "My elderly parents and I were called to Toronto on short notice to see my brother through the end stage of his illness. Our stay at the Baldwin Village Inn was a true gift during what was a difficult time. Highly recommend this B&B to anyone who is in town under similar circumstances, for location (proximal to the Toronto General Hospital and others, convenience store, grocery stores and top-rated/reasonably priced restaurant), ultracleanliness and amenities (free wi-fi, access to in-house laptop). Appreciated and unexpected extras were: the sensitivity, compassion and intelligence of hosts Roger and Tess, delicious breakfast and coffee, fascinating table conversation (and only if you felt up to it) modern and pretty urban decor. I now like to think of this gem of a B&B as my \"pied-à-Toronto\" and will make a point of trying to arrange accommodation there FIRST, the next time I am in town.",
      "rate": 5.0,
      "tripDate": " October 2015"
    },
    {
      "title": "Baldwin Village inn",
      "text": "This place is 15mins from downtown. Super clean, nicely located, the owners are super friendly and very helpful. If I ever come back to Toronto I will try to book a room here again.",
      "rate": 5.0,
      "tripDate": " May 2010"
    },
    {
      "title": "Aerie House is heavenly!",
      "text": "Stayed at Aerie House--took all 3 bedrooms for my group of 6 adults visiting Toronto for a special family event.  Absolutely beautiful, modern home on a safe street, walking distance to great nightlife, coffee and entertainment! The kitchen is equipped very well to cook meals (but lacks garbage disposal).  Backyard is soothing to sit in. This home and location makes me want to live in Toronto (only spring to fall though).Communicated with Roger who was very patient with all my questions and concerns. NOTE: 90% pictures on Tripadvisor is of Aerie House. There is a church next door which does not ring bells. Don't miss Dark Horse Coffee House--a <5min walk from house. If you cannot climb stairs, you should not consider Aerie House.",
      "rate": 5.0,
      "tripDate": " October 2016"
    },
    {
      "title": "A hidden gem . . .Centralized location, Great Price with Warm Hospitality",
      "text": "The owners (Roger & Tess) call this place an “Urban Inn,” which is describes it well.  You can’t get more urban than a city, but yet I felt like I was at home, in a peaceful residential setting. The owners have 3 properties; one B&B on Baldwin, and two extended stays on Sullivan.  We stayed at the Extended Stay at 4 Sullivan – it’s geared for those who will stay for an extended period of time, however, if available, they will allow you to book for a few nights.  No breakfast is included (their B&B on Baldwin Street includes breakfast).  All rooms at 4 Sullivan include their own private bathrooms (again the  B& B location has shared bathrooms).  I don’t like the idea of sharing a bathroom, so having a private bathroom was a must for me. We typically stay in hotel and resorts, and the occasionally  B&B.  We found this place, by chance, and felt very lucky it was still available for the holiday weekend.  We originally were looking to stay in a hotel, however since our trip was planned a week prior, and being a holiday weekend – most hotels were booked, except for the high end ones costing more than what we wanted to spend.  All said and done with taxes – we paid $141 (CAN.) a night – what a bargain! Location:The location is perfect for those who want to explore the city.  It’s very centralized and within walking distance to many of Toronto’s distinct neighborhoods. This was our first visit to Toronto, and wanting to explore as much as possible during our short 3 night stay, a centralized location was a must.  We walked everywhere, never once took a taxi or the subway, and saw a ton (and yes, our feet were killing us at the end). If needed, the streetcar and subway are easily accessible from this location. Chinatown, Baldwin Village, Kensington Market, Queen West are very close.  Also within walking distance is CN tower, King West, Younge & Dundas, Harborfront, St. Laurence Market, Distillery District and Little Italy. The house is located on a quiet residential street, and at times, I forgot I was in the city.  The house is very modern and contemporary, and decorated the same with a simple, clean minimalist feel-high ceilings and full of light.  We stayed on the second level.  There are two other rooms in the house, one below us - in the basement, and one above us on the third floor.  Each room has their own bathroom.  The room, (and the house) was very clean.  I felt safe in the neighborhood (and city).  Although the house is located on a residential street, you are a block away from Grange park, and a few blocks from Chinatown and Baldwin Street, which has a variety of restaurants.  HospitalityThe owners Roger and Tess and very nice, and accommodating.   We arrived later than expected due to traffic, and they were very accommodating and gave us exact instructions on how to get into the house.  The next morning we met them at their B& B on Baldwin to pay our bill, and they were pleasant to talk to, and were very helpful answering any questions we had on the city. Roger gave us a map and gave us a quick overview of the city, and his recommendations on sites and a suggested walking route to see the city. Although Roger & Tess are not present at 4 Sullivan, you know they are always available if needed.  You don’t feel like just a number when staying here. Our Room - Second FloorOur room was a decent size for two people.  It was small, but worked for us.  A queen bed, PLENTY of storage and closet space, along with a dresser, desk and TV. The bathroom also had plenty of storage space as well. and was equipped with a hairdryer, shampoo/condition/gel.  We had a view of the CN tower from our room.  Although it’s an extended stay, we had our towels replaced during the day, something I didn’t expect, which was nice.  MY ONLY COMPAINT -  each morning (sometimes very early 5:30-6:00 am), I could hear the guests upstairs walking around as the floor squeaked.  I’m a light sleeper, so it woke me up each morning, however my husband never heard it.  I don’t fault the owners, and one has to expect to hear noises at this is a house.  I’m sure the people above us where not aware of this.  My recommendation is if you are a light sleeper, request the top room which is on the third floor. Common AreaThere’s a common kitchen and living area, and outdoor patio.   Each room has their own marked shelf in the kitchen cabinet, and refrigerator for storage.  The kitchen is fully stocked with utensils and dishes, for cooking meals.  Although we didn’t cook, we found it very convenient to place any food or drinks we purchased during the day in the refrigerator.  Although coffee and tea are available,  we didn’t take advantage of it, as we found an amazing crepe place (Café Crepe) a few blocks down the street, that we walked to each morning.  The house was very quiet, and we only saw the other guests a few times, and they were very nice.  Most of the time we felt like we had the house to ourselves.  At the end of each day we sat outside patio in the backyard, which was very private.  Again, we almost forgot we were in the city.   ParkingParking wasn’t a problem. Tess explained how to obtain a temporary street parking permit online. This was simple, and we printed this out prior to our arrival. We found a close parking spot on the street about a house down, and left our car there the entire time.  It was about $20 for parking for our 3 nights.  If you stay at a hotel, you would pay at least $20 a day to park. For those of you who haven’t been to Toronto, I’d highly recommend it.  I wonder why I waited so long.  The city is very walkable, clean and friendly, with parks and green space scattered throughout.  I’ve never seen a city quite like it.  I would highly recommend staying 4 Sullivan, as the location is outstanding, the accommodations exceeded our expectations and the price is very affordable.  It really is the best kept secret, considering the location and the price.",
      "rate": 5.0,
      "tripDate": " August 2014"
    },
    {
      "title": "Family wedding",
      "text": "Our family from South Australia booked all the rooms for 9 nights in July whilst there for our son's wedding to a \" local girl\". It was fabulous on every level....large clean ,well set up bedrooms, tv lounge, beautiful al fresco area outside,large homely dining area for lengthy breakfasts.daily cleaning, an enormous selection of cafes and restaurants literally on the doorstep...even a laundromat 3 doors away.Tess, Roger,Pia and Holly were wonderful facilitators of this establishment.Wecertainly appreciated using the facilities one evening  for a BBQ wIth the inlaws ( who we'd never met) as they lived about 45 mins away.also, we held a bridal High Tea one afternoon for about 20 females.it was perfect for our needs.",
      "rate": 5.0,
      "tripDate": " July 2012"
    },
    {
      "title": "best b&b in town",
      "text": "I can't agree more with previous viewers - Tess and Roger have been most accommodating on my stay. I stayed there a few nights on my own and I have never felt more at home. Basically a \"home away from home\". The place is clean and quiet, and has restaurants lining the street also making it quite a convenient place to be staying.As to the reviewer on bed bugs - honestly sounds more like you had a case of crabs then anything.",
      "rate": 5.0,
      "tripDate": " July 2010"
    },
    {
      "title": "A fine introduction to Toronto",
      "text": "Being a Canadian who has lived for the past several years overseas, I have come across various hotels, motels, guesthouses and B&Bs. This B&B stands out. Previous to my arrival to Toronto, I was quite the weary traveller, however staying at Baldwin Street Inn, I was given a warm and genuine welcome by my down-to-earth hosts. The timing could not have been better as I really felt at home. I stayed in two rooms, one large room and one small one. It is worth paying the extra for the larger room as I was travelling with a lot of luggage and being of ample size myself, the extra space is worth it. The larger room that I had better privacy while the smaller one was near the public computer and at times could heat the clacking sounds of happy internet surfers. I would return to this B&B in a heart beat!. The location is ideal! To get a place in this neighbourhood at such fab prices is the tops. Take your time and explore the neighbourhood with its great coffee shops and restaurants.",
      "rate": 5.0,
      "tripDate": " July 2010"
    },
    {
      "title": "Comfy bed  and breakfast",
      "text": "Immaculately clean and comfy B&B. Fresh white sheets with fluffy comforters on great beds. My son and I stayed here on a quick overnight while visiting U of Toronto.  The owner greeted me in the morning from the communal table in the small dining area. He was incredibly welcoming and was good at introducing the other guests, all of whom were interesting (one guest stays every month when she comes to work in the city).  Breakfast was simple breads, cheeses, fruit and cereal, and the owner offered to make any kind of eggs I wanted.  WiFi worked perfectly and there was a nice desk to use in my room to get some work done and make some calls. We were able to leave our bags at the Inn after we had checked out and pick them up later in the day. Amazing rates and convenient location. Note that based on posted picture I thought Inn would be on quaint residential street. It is actually on a street filled with restaurants and little shops, but the Inn was very quiet.  Would definitely stay here again and highly recommend it.",
      "rate": 5.0,
      "tripDate": " April 2018"
    },
    {
      "title": "Good experience",
      "text": "We stayed here for 3 nights in June 2016. It was a nice B&B, located in Chinatown. It was our first experience sharing the bathroom with other guest. It was regular, large enough rooms, clean bathroom. However, there was one day the toilet clogged, but it was soon fixed.The breakfast was good, freshly made.It was a good area for Chinatown and Asian cuisine, close to public transport, and several restaurants. There is an ice cream store besides it, with very different flavors one has to try (I promised to myself never eat Durian again though).",
      "rate": 4.0,
      "tripDate": " June 2016"
    },
    {
      "title": "Home away from home",
      "text": "A great place to stay close to the Art Gallery of Ontario. We had the smallest room on the first floor, but it was comfortable, with an excellent bed and a nice choice of pillows. The shared bathrooms were clean. Breakfast offered many choices including eggs made to order by our host, Roger. He made a point of introducing all the guests which made for very pleasant conversation. There are many restaurants within a block or two for a reasonably priced dinner. We will definitely be staying there again.",
      "rate": 5.0,
      "tripDate": " April 2016"
    },
    {
      "title": "Friendly and warm like always",
      "text": "We enjoyed our stay and the time we spend with Tess and Roger a lot. They are an amazing couple and they do an outstanding job. I can't wait to go back there again and have Roger make me another cheese omelette. Thank you...",
      "rate": 5.0,
      "tripDate": " August 2015"
    },
    {
      "title": "We read it is the best in its class and cannot disagree",
      "text": "We stayed in room 5 of the Baldwin Inn and were more than happy with our decision to stay there. The room was spacious, very clean and the bed was very comfy. From our window you could see the CN Tower, and the street was ideal for both evening food and drinks which was important as it rained a lot during our 2 days there! The inn also had a nice outdoor space which would be ideal in nicer weather. Owners Roger & Tess were friendly and helpful, breakfast was simple but nice and a good chance to chat to the other guests around the table. We felt safe and comfortable there, we travel by the mantra that your hotel is just a place to sleep (you are there to see the city after all), but this provided more, and at a good rate.",
      "rate": 4.0,
      "tripDate": " May 2009"
    },
    {
      "title": "decent digs",
      "text": "Easy and comfortable stay with considerate hosts.  Roger and Tess spared no effort to make everyone at ease in each other's presence, and certainly respected people's desire for privacy during the breakfasts. There seemed to be a lot of Europeans there, and the place had the feel of a European BB, or pensione.  The breakfast was generous, the rooms clean.  I felt the bathrooms and toilets might have been more carefully and regularly checked for cleanliness.  They were never unclean, but some guests perhaps were not entirely considerate in tidying up after themselves and this is easily dealt with by regular checks for cleanliness throughout the day.  I've stayed at 100's of B and B's in different countries and my experience at Baldwin will remain one of the most restful, friendly, and convenient in any given city.  Although Roger was curious about the work I was doing while I was in Toronto,  he was by absolutely no means nosy or invasive in his inquiries, nor was Tess.  They both kept a congenial distance from me when I was there, in fact I felt their interest in my reasons for being there were geared only to making my stay amongst the other guests more comfortable.Couldn't recommend the place more highly.Simon",
      "rate": 4.0,
      "tripDate": " August 2008"
    },
    {
      "title": "Friendly",
      "text": "I stay few days there. It was nice. Host family were so friendly. I could enjoy everday. There were many restaurants around there.2nd floor has balcony and we can see CN Tower.",
      "rate": 4.0,
      "tripDate": " August 2007"
    },
    {
      "title": "never disappointing",
      "text": "I have stayed in this lovely b&b many times (business, family, couple) and I have never been disappointed. The owner Roger is super-friendly and somehow manages to attract interesting guests from all over the world. Anyone who has had at least one breakfast in this b&b also knows that this is the house of the best cheese omelette in town :) Plus, the location is very nice, Baldwin street is the coziest street where you can stay in Toronto.",
      "rate": 5.0,
      "tripDate": " August 2011"
    },
    {
      "title": "Excellent!!! Would recommend to everyone!!!",
      "text": "Rojer is the warmest host!! Very kind, very welcoming, gave us maps, explained exactly where we should go. The house is warm, clean, there were many people from all around the world, some of them came for the second and third time. Breakfast was excellent!!!! Your style of omlette, many kinds of cheese, serials, breads, coffee, juice, just excellent!!!! There are two showers and two bathrooms which are always clean and available, there is a free Internet, the bed was very Cody and clean with white sheets, the house is warm and hospitality is just wonderful!!! And we have been there only for two nights!!! Recommended!!",
      "rate": 5.0,
      "tripDate": " April 2011"
    },
    {
      "title": "kinda ok but not totally",
      "text": "I stayed at the Baldwin over the third week of January 2014 .. and I was not intending to write a review but as I sit in another B/B in Quebec City at the moment I am having the motivation to type out my observations .. Where the Baldwin has an enjoyable easy going atmosphere it also goes at the expense of the quality, perhaps effort put in  .... The folks are truly friendly and welcoming but I think they are a bit overly satisfied with status quo which is kinda ok but not totally … Breakfast is passable but not inspiring .. the cooked egg option is real basic - the 'menu' presentation awful and kind of rudish, though perhaps intended as funny I believe. The bathroom situation is difficult .. there is only one tiny one on the top floor for several rooms (occupied by couples at times) and it just doesn't work overly well especially when couples 'save' spots for each other .. as happened with me .. and then of course you can't use the toilet when someone is having a shower unless you go downstairs through the breakfast room ..The bed is great, the room a bit sparse, no sense of colour/warmth .. My dresser drawers had lots of hairs in them and had to get it cleaned out, the waste basket had a glob of gum attached to the empty bag, the cleaning lady knew that and didn't think any of it  .. the blinds in room were troublesome etc .. All for $ 110 I believe I paid  .. too steep a price for that level of service. It has more of an 'upscale hostel' feel than a b/b in that sense. I get the casual feel and welcoming attitude, the more down to earth approach, all good, I used to live in communal houses and that is great .. but I didn't pay $100 per night there .. In this same vein the boundary issue with Roger .. he is open etc but not quite aware that a conversation needs permission from the other person when it goes into more questions etc especially so soon upon arrival .. Also whatever I told him and what I do does not have to be shared with every other guests that he introduces me later .. I don't consider that his prerogative.. although I am sure it is done innocently, kinda unaware.At the moment I am staying at a $ 80 B/B  in Quebec City .. it is equally very relaxed, friendly and homey but all detail is fully looked after, breakfast cooked and special dishes are fantastic, different every day, great Bodem coffee opposed to run of the mill grocery store stuff - Roger says it's premium but yes that gets printed on many coffees, there are truly better roasts and blends available everywhere now  …The Baldwin has great location yes and the heart's in the right place but I think they could certainly notch it up a few steps - currently sitting a bit much on laurels I think ..",
      "rate": 3.0,
      "tripDate": " January 2014"
    },
    {
      "title": "A HEAVENLY HOME AWAY FROM HOME FOR TRAVELLERS",
      "text": "Having travelled to Toronto on businesss monthly since 2005, I could not have been more delighted to finally find the Baldwin Village Inn during my trip to Toronto in March of 2010.  Since then, I have spent over 20 nights as a Baldwin guest during 3 different trips, and I am booked through to the end of this year for every upcoming month of my travels.  The hosts, Roger and Tess, have created a warm and welcoming sanctuary in the midst of one of the most beautiful neighbourhoods in the downtown area.  The quaint Victorian home, with 8 guest rooms and several bathrooms, exudes a tranquil, friendly, yet private atmosphere, from the moment of arrival onwards.  At breakfast-time, guests can enjoy conversations with fellow travellers from around the world, or they can find a more private time to dine, either before or after the others have their meal.  For the balance of the day, the house is very quiet and private, both inside and out.  There is a beautiful garden to enjoy out back and a nice porch and sitting area out front to rest upon and watch the comings and goings on the diverse and interesting street-front.  Fabulous restaurants abound -- there are over 30 restaurants in a one block radius from the Inn, most of which offer excellent food and great value!  Some have a prix fixe menu for just $25 for dinners that include an appetizer, then a dinner of steak, seafood, pasta, fish etc., followed by a homemade tasty dessert.  I rarely eat away from Baldwin Street during my visits, since it's nice to \"come  home to the Inn\" after my business day ends and then just walk to dinner.Truly, I have felt like an honoured guest on each visit.  In June, I was there for 14 nights, and my partner, who is Chinese, joined me that trip.  I am Caucasian and can absolutely say that our hosts welcomed both of us equally, as they do with one and all.  I saw two reviews below that were utterly unfair.  To call Roger and Tess racist is almost unbelievable, since they are so very friendlly and welcoming.  And to suggest that there are bugs in this home is just wrong.  I was there for an extended stay in June and I have never seen anything of the kind.  And since I am aware of that problem in large cities, I am always watching out for it.  I wouldn't be comfortable if there were any bugs at all, never mind bedbugs!!  The truth is that the cleanliness of the Inn is outstanding!In closing, I would say that I have stayed in B & B's all over North America, and although many are very pretty, often they do not private the balance of friendliness, privacy, value and homey-ness that I desire.  The Baldwin is the best value I have seen and the hosts are starting to feel like part of my extended family.  I should also add that there are several other regular guests who clearly enjoy the Baldwin as much as I do, and regularly congratulate themselves on finding such a nice place to come back to again and again.  Give yourself a treat and try the Baldwin Village Inn when you are next in Toronto!!!  And even if you're a resident Torontonian, it's a great place to stay for a downtown holiday.",
      "rate": 5.0,
      "tripDate": " June 2010"
    },
    {
      "title": "A Veritable Gem in Downtown Toronto",
      "text": "While the bulk of the reviews here are for the Baldwin Village inn, they do have a number of other properties close-by.My wife and I stayed two nights in early July at the Nest House on Sullivan Street. It's their newest property with three suites. No breakfast is offered here but all suites have in-suite bathrooms and access to the ground floor kitchen with designated spots for each suite in the fridge and cupboards. The kitchen has communal supplies of condiments and all necessary cooking items. The room was spacious and well-decorated with daily maid service. It had a flat screen TV (albeit limited channel selection) and WIFI. We planned to enjoy the Fringe Festival by walking to the various venues and seeing the local Toronto neighbourhoods so we got a two-day parking pass on-line at the City of Toronto site and were able to park the car right in front of the building and left it there throughout our stay. There are other paid parking lots near-by as well. Rates are competitive and Roger met us at the location to set up the password we needed to enter the building and give us the keys for our room. A lovely quiet stay and a place we will come back to for our future visits to Toronto.",
      "rate": 5.0,
      "tripDate": " July 2016"
    },
    {
      "title": "An excellent B&B",
      "text": "Toronto was the 4th stop (of 5) on a road trip through Eastern Canada. We stayed at all B&B's and I can certainly say this was the best! Roger and Tess are so welcoming and really made us feel at home. They are down to earth and wonderful hosts. The breakfasts were great. It was very go your own pace. There was a spread of bagels/toasts, fruit, cheese and spreads. Eggs were then cooked to order. Our room was one of the small rooms, but for the price and location it was a great value. It was extremely neat and clean. As was the entire house. There are three bathrooms that are shared among all the rooms (I believe 6 rooms). It was never a problem since it is really only about 2 rooms to a bathroom. The location is close to so many attractions. Walkable to almost everything. There are also streetcar and subway stops very nearby. Plenty of great options for restraurants so close by.I'd highly recommend a stay here, and if I ever go back to Toronto I'd certainly stay there again.",
      "rate": 5.0,
      "tripDate": " August 2010"
    },
    {
      "title": "Excellent alternative",
      "text": "It´s highly reccomendable. The rooms are confortable (there are not so big, but clean and the bed is great) and the hospitality of the host is valuable. He guides us in our way through Toronto. The location is good and peaceful, not so far from downtown, and near some good cheap restaurants.",
      "rate": 5.0,
      "tripDate": " June 2008"
    }
  ]
}