{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "bE SixFifty Hotel",
    "url": "/Hotel_Review-g155019-d6975703-Reviews-BE_SixFifty_Hotel-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.5",
      "reviewCount": 112
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "650 Bay St",
      "addressLocality": "Toronto",
      "postalCode": "M5G 1M8",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/09/8e/7f/81/be-sixfifty-hotel.jpg?w=500&h=-1&s=1"
  },
  "description": "Chic, stylish and modern. A three story walk-up boutique hotel located in the heart of the City! Steps to Dundas square, Eaton's Centre, theatres and more. Our rooms are small in size but BIG ON STYLE. Relax and re-charge in our stylish rooms with single, double or queen sized beds. All rooms are hypo-allergenic with luxurious linens, modern artwork and an iPad for you to use during your visit. Free Wifi and Netflix. Complimentary coffee and pastries in the morning. The perfect place while here to enjoy fine dining, shopping, theatres or simply visiting on business.",
  "featues": [
    "Free High Speed Internet (WiFi)",
    "Wifi",
    "Restaurant",
    "Pets Allowed ( Dog / Pet Friendly )",
    "Baggage storage",
    "Non-smoking hotel",
    "Dry cleaning",
    "Air conditioning",
    "Desk",
    "Wake-up service / alarm clock",
    "Flatscreen TV",
    "Bath / shower",
    "Complimentary toiletries",
    "Hair dryer",
    "Non-smoking rooms"
  ],
  "reviews": [
    {
      "title": "Very good experience!",
      "text": "Small rooms but everything that comes along with them is great. The rooms are done up nicely and the beds are comfy. We stayed here when I purposed to my fiancé and they treated us amazing. I wouldn't hesitate to stay here again and will book with them next time. Good location and friendly staff.",
      "rate": 4.0,
      "tripDate": " March 2016"
    },
    {
      "title": "Good hotel with some flaws",
      "text": "This hotel is in a great location with excellent, friendly staff. The good: the room was well decorated, with a comfortable bed and was (generally) quiet (more on this later). The continental breakfast and coffee was a plus. I knew these rooms were small. If you go with these expectations, you will not be disappointed. The not so good: I had requested a quiet room when I booked 2 months prior to my stay. Initially, I was given a room right by the entrance door to the hall. Not a quiet room at all. I was disappointed because I had made my booking months in advance. With travel and a time difference, I maybe slept 4 hours the first night here. On the plus side, the staff was super accommodating and was able to move me to a quieter room for the next two nights. The new room had less windows, so I was actually able to sleep and was further from the hallway entrance. The windows do not have black out curtains, so it can be frustrating when you are needing to sleep and can't. I am not bothered by street noise at all, but there is also street noise here. The bad: the rooms are not really laid out well for travellers. There is no place for the suitcase, very few hooks (2, to be precise, and one of them was broken in the room I stayed in). The toilet paper holder is weird, and at one point I ended up with a soggy roll as it flew off into the toilet. The internet connection is awful - I tried to FaceTime with my husband and the picture was super choppy and often frozen. They give you iPads, but if you can't even use them, what's the point. Finally, the bistro next store has strange hours - I was hoping for a small meal late at night on my first day in, and had to go venture out as there were no options.Bottom line: would I stay again? Maybe. If the Internet connection was better, definitely. With my husband? Maybe not. It's a perfect room for one. I did enjoy my stay overall. It just could have been better.",
      "rate": 3.0,
      "tripDate": " May 2015"
    },
    {
      "title": "Cute, cosy but very small",
      "text": "The good: excellent staff, friendly and helpful.  Nicely designed rooms with cotton bedding and great location in downtown Toronto.  Pet friendly too !The not so good: the rooms are minuscule.  Really. No elevator, no closets or things to hang your clothes on, no telephones (iPads), no black-out blinds so when morning comes, you wake with the sun.  I would not spend a week there unless it was a casual getaway and I only use the hotel to shower and sleep.  Oh, and we were told we had a Queen bed.  Oddly, it measured 54\" inches across which is double...",
      "rate": 3.0,
      "tripDate": " May 2015"
    },
    {
      "title": "Experienced World Traveller - Worst Experience Ever",
      "text": "I am an experienced traveller who has stayed everywhere from the shabbiest third world hostels to 5-star establishments. Never in my years of traveling have I been greeted with such apathetic unprofessionalism as I was at this establishment. Furthermore, I have never given a one-star review of a hotel for any reason...until now.I live down the street and had helped my father reserve a room at this establishment vis a vis a popular online 3rd party provider (not TripAdvisor). I arrived with him, presenting unequivocal documentation showing a confirmation number. When we arrived there was a girl who could not have been more than 19 years old who appeared to be the sole employee present at the hotel. When we showed up she was thoroughly confused by our presence and frozen like a deer-in-headlights. She mentioned that the manager did not leave her with a \"print-out\" of our reservation. However, she DID find our reservation in the system, but asked us to come back later so she could \"sort everything out\" (note: it was already 9pm).When we returned an hour later, she told us that the hotel was booked and they had no rooms for my 65-year old father. She explained that she had called the manager, but he had not returned her call (I do not believe this, as she was clearly coached to shoot us down). My father asked for compensation, assistance finding another room or for a room at one of their other two locations, but was again turned down. No apology, no compensation, nothing. They had our reservation but refused to honor it.The cherry on top is that as we were leaving, someone else came to check-in, and they gave him a room!!!! The only thing we can reason is that they didn't like the rate we were receiving from the 3rd party provider (which was pretty standard and still more than the hotel down the street) and gave away our room...the cowardly manager leaving his young employee to take the heat.Stay far far away from this hotel...and as a matter of fact, you should go to the Eaton Chelsea down the street. Much cheaper, much more professional, and you can be assured your room will actually be there once you arrive.This place should be out of business in the near future. You don't get very far treating people like that.",
      "rate": 1.0,
      "tripDate": " August 2015"
    },
    {
      "title": "Terrible Experience with Unprofessional Staff Member",
      "text": "Really liked the room and hotel.  Small, but cozy and clean.  However, the day after check out there was an extra $175 charge on my Visa.  When I called, I was told a coffee table book and blanket were missing from the room after check out.  I assured the staff member that I was not in the habit of stealing from hotels.  She was rude and apathetic.  Stating the items were missing and I have to pay.  That was it.It was only after I demanded to speak to the Manager, and wrote a nasty email, did I get another phone call stating they had made a mistake.  They forgot to check their inventory books.  Maybe they should have done that before charging a client's credit card and engaging in a verbal dispute.VERY UNPROFESSIONAL.  Also, no cable TV and Netflix worked intermittently.",
      "rate": 1.0,
      "tripDate": " June 2015"
    },
    {
      "title": "Nightmare Check-in",
      "text": "BE Six Fifty is a small “boutique” hotel located in downtown Toronto, right next to the Peter Gilgan Centre for Research and Learning (i.e. “Sick Kids”). The rooms in the hotel are very small, however they are new and clean. The reception and cleaning staff were friendly.I was in Toronto for work (a one-week conference). I arrived at the hotel Sunday evening for check-in around 4pm, confirmation email in hand (from 6 months ago). The hotel did not have my reservation on file! This is every traveler’s nightmare – you show up at a hotel with a “confirmed” reservation but there is no place for you to stay. Worse, Toronto’s downtown hotels were pretty well booked up, thanks to my conference and others. After several hours the hotel eventually managed to accommodate me, however they wanted to charge me 50% more than what was written on the original confirmation email. The hotel said that the price quote in the original botched reservation was an error and that I should pay “the actual rate”. After several email exchanges and a meeting with the manager, the hotel eventually reduced the price down to a level which was reasonably close to the original quoted price. Everything was finally settled by around 4pm on Monday, 24 hours after I first showed up for check-in.The lengthy and stressful 24-hour check-in process (especially the issue of the price) left a bad taste in my mouth. Unfortunately I would not recommend this hotel.",
      "rate": 2.0,
      "tripDate": " June 2015"
    },
    {
      "title": "Terrible experience!",
      "text": "It was my birthday & one of the most awful experiences of my life! The phone reservation was screwed  by their reservation person (to which they admitted later)  where we were only booked for one night instead of two as was anticipated. When we arrived we were told the room was to be ready by 3:00. By 4:30 we were still waiting. The next day we were out on an all day tour, we get a call saying we were only booked for one night & had to abandon our room. Housekeeping had to pack our belongings & we had to cut our tour short to come back.They did nothing to help us into another room, saying they were  full, nor did they try to find us another room at a different location. They were the most unfriendly, unhelpful, and obviously untrained staff we have ever encountered. They also refused to let me speak to a manager. I do not recommend this hotel!",
      "rate": 1.0,
      "tripDate": " August 2015"
    },
    {
      "title": "Extremely unprofessional staff",
      "text": "After staying one night in this hotel, storing luggage for the day, and returning to retrieve luggage before flying home, I was accused of theft. Not having adequate time to handle this matter in that moment and no manager on duty, I was reassured that a manager would be in contact with me the following day. In the elapsed time of 2 weeks, I have made numerous daily attempts to contact the hotel by phone and by email, always to be told \"there is no manager on duty but my message would be passed along\". My credit card has now been charged $550 without any justification or documentation from the hotel. My caution to anyone looking for accommodations in the downtown Toronto area is to avoid this hotel! I question the security of any personal belongings stored in the room while you are away. There was a blatant lack of customer service to resolve this issue in a professional and timely fashion, not only on the day of the incident but in the days and weeks following such a serious matter.",
      "rate": 1.0,
      "tripDate": " July 2015"
    },
    {
      "title": "TERRIBLE EXPERIENCE : The worst in Toronto",
      "text": "DO NOT STAY AT THIS HOTELTERRIBLE EXPERIENCE : The worst in TorontoIf you want to have a sleepless night and stay in a tiny prison cell-like room then this is the place for you. -walls are paper thin : I could hear EVERYTHING going on in the rooms on my entire floor (loud noises and screams from woman and man until 3 am), TV playing all night, there’s no privacy, terrible insulation... as well as the cleaning ladies waking everyone up at 7am-loud traffic noises all night from outside street (windows are also paper thin)-stuffy rooms and dirty washroom : found gunk and hairs from previous tenants -rooms are even smaller than listed and not accurately portrayed-NO elevators: had to drag my large suitcase up 3 floors with no help from staff. I called and emailed over a dozen times to speak with the \"manager\" Evan and he is nowhere to be found. He literally doesn’t care about his business or his clients. Large hotel chains help their customers right away -this is unacceptable. TRUST ME: Don’t bother with his hotel. I travel frequently for work and stay in about 40 hotels per year and this is by far the WORST!",
      "rate": 1.0,
      "tripDate": " October 2015"
    },
    {
      "title": "VERY small rooms, but trendy/updated",
      "text": "Let me start by saying I stayed here in 2014 and am just now submitting my review because I didn't know about TA back then and I am just now getting around to reviewing the hotels I've stayed. I knew what I was getting into when I booked this hotel - the rooms were small as they stated on the website, but updated and the finishing touches were what made this a great stay. I'm not kidding when I say small either - you literally had enough room on the side of the bed to walk to the bathroom and that was about it and the bed was pushed up against the wall into the corner.However, if you're staying in Toronto for the weekend, you're probably not spending the time stuck in your hotel room, you're out exploring and seeing the attractions. I was here for a photography workshop so I checked in at 3pm, met up with friends for dinner, went to the CN Tower, out for drinks and came back to sleep, then up early for the all day workshop. That evening I went to the aquarium, had a late dinner, then came back to the hotel to relax with free Netflix and one of the comfiest beds I ever slept in.The room was cute AF, and I loved the bear skin rug. The only thing that was a downer about the Be650 was that they did not have an elevator, and the stairs were steeper than most. Would absolutely stay here again!",
      "rate": 5.0,
      "tripDate": " May 2015"
    },
    {
      "title": "Near everything ",
      "text": "I was travelling Solo!  The room was clean and perfect for me.  The cab ride from Union Station is about 10 dollars.  The shopping area is within walking distance.  No food on premises which is ok since restaurants are near.  The employees are Uber helpful, too.  If you plan on taking a Cab from the establishment, double check the flat rate before getting in.  The Decor is fun and mod!",
      "rate": 4.0,
      "tripDate": " December 2017"
    },
    {
      "title": "Chic, urban boutique hotel. Great location!",
      "text": "Loved my 2-night stay at the bE SixFifty Hotel! Tiny rooms don't bother me: I was traveling alone and didn't need a lot of room. The reception staff is warm and friendly and they'll carry your bags upstairs for you (there is no elevator). The location is perfect if you don't need to stay in the downtown core - there's no shortage of restaurant and bar options nearby. I loved opening the windows at night to take in the city's energy as I slept. Would stay here again!",
      "rate": 5.0,
      "tripDate": " July 2017"
    },
    {
      "title": "$250 cash deposit required because of debit card",
      "text": "My company paid for 3 nights in advance and when I showed up, I was asked for $250 deposit (why?, I asked -  you cant even bill anything to your room?). I only had my debit card as the room was prepaid, and then I was told they could not bill the debit card for the deposit. So they sent me out on the streets at 12:30 am to get $250 cash out of an ATM machine. This was immediate \"3 strikes and you're out for me\". I did stay here for my purchased three days but won't return.It's too bad this ruined it for me - even though the room is as small as a dog kennel, the shoddy workmanship on the floors, and there is no real TV (\"Smart TV\" means \"no TV except what you can find to stream on our slow 802.11g wifi network being shared by 20 people\"), I was prepared to say the Manager was super-nice, and my meeting was at TSK, and you couldn't find a closer location (though the Chelsea is one block further and has no such debit card nonsense). But the cash deposit thing forever poisoned me on the place.If you do stay here, try the bubble-tea place across the street - they have really good Korean food cheap.",
      "rate": 2.0,
      "tripDate": " August 2017"
    },
    {
      "title": "Horrible",
      "text": "I have no idea why this hotel has so many good reviews. My husband and I had to switch hotels after the first night because it was so bad. The rooms are SO tiny that it made our stay uncomfortable. I had a TINY suitcase and I couldn't even open it up. There was absolutely no place to put our clothes or anything we brought. I literally put my clothes in the bathroom above the toilet and had to move the towels to under the sink. Temperature wise you either boil or freeze because the A/C unit is right beside the bed and blows on you. I do NOT recommend this hotel for couples or families. If you are a single person and don't mind sleeping in a walk-in closet sized room than book this place. Some hostels are bigger than this place. Do yourself a favour and book somewhere else so that you can be comfortable.",
      "rate": 1.0,
      "tripDate": " July 2017"
    },
    {
      "title": "Cutest Little Hotel",
      "text": "All in all, this was a great experience! Everyone was super friendly and helpful. The rooms are extremely small, which I expected, but really nicely done. It was pretty cool to have Netflix and an iPad to use. The washroom was gorgeous, too. The only thing I didn't like was the tacky LED light on the faucet, but that's just me. The breakfast wasn't outstanding, but I got free pastries, so no complaints.",
      "rate": 4.0,
      "tripDate": " February 2016"
    },
    {
      "title": "Tiny room, noisy AC",
      "text": "We were extremely disappointed with this hotel. Our double room was super small, which we are used to from New York, but there was even no space to put the soap next to the bathroom sink (you have to put it in the sink itself), no place to leave your toothbrush, hang your coat, etc. The hotel website does not advertise how ridiculously small the rooms are, although they charge market price for them. There were holes in the walls in both the room and the bathroom (looks like some fixtures were removed but the holes did not get repaired), there was no daylight coming in as the only window was facing a brick wall and was blacked out. We were staying at the hotel on a very cold night and had to have the AC/heater on, but it would turn on and off every minute (!) and the noise made it impossible for us to fall asleep. We decided to cut our stay by two nights and move to another hotel. The girl at the front desk was nice, but she had no idea how to handle the situation, did not offer any solution and told us to write our request for refund on a piece of paper for the manager, because she didn't know what to do and the manager was not around. We love boutique hotels and don't have very high standards, but this hotel was so terrible that we had to check out early!",
      "rate": 1.0,
      "tripDate": " February 2016"
    },
    {
      "title": "Modern looking hotel. LOVED it!",
      "text": "The hotel is extremely unique and modern, and although the room is extremely small, I still had one of the best experiences while staying there. The hotel staff was super helpful, everything was clean, and the location was very central. I was traveling very light, so didn't need a dresser or closet to hang my things; otherwise that would've been an issue as there's nothing but a couple of hooks to hang a jacket or something; but on the other hand you're given netflix and an iPad instead of cable and telephone, which I found to be very unique aspects of it. It was a great experience for me and would definitely stay there again if traveling by myself around Toronto.",
      "rate": 5.0,
      "tripDate": " July 2015"
    },
    {
      "title": "Very nice, unique hotel!",
      "text": "I had a very enjoyable stay at bE SixFifty. The room was small, but comfortable, modern, and well built and designed.  Lots of thought went in to making these small rooms work really well and look stunning. It is in a renovated older building, so there aren't concrete walls- I anticipated noise and brought earplugs, but in the end the noise was fine (and there were younger hockey-game-goers on my floor). All three of the staff members (2 at the front desk one at the cafe). I interacted with were exceptionally professional and polite.  The location is central. Complimentary breakfast and coffee was simple, but delicious.  Overall this was a very memorable stay in a one of a kind hotel in Toronto!",
      "rate": 5.0,
      "tripDate": " February 2016"
    },
    {
      "title": "Design over size",
      "text": "bE SixFifty Hotel serves as a perfect example of sacrificing space in exchange for location and design. Located steps away from many Toronto conveniences, this hotel is an excellent place for someone who is willing to forgo square footage for a clean, well-designed place with high-quality finishes. Did I mention the location?!In addition, the check-in process proved to be smooth and efficient, with friendly staff. The complimentary pastries and coffee served as a nice bonus!It is an excellent place to stay for someone travelling alone, or for couples. The space might (particularly in a double) not be the most suitable for a family.",
      "rate": 4.0,
      "tripDate": " December 2015"
    },
    {
      "title": "Know what to expect and you'll be happy",
      "text": "What should you expect?A small, compact room that has the essentials for a night's stay. Because of the size, the rooms don't include everything in it (eg. ironing board), but ask at the front desk and they'll happily provide it. Chic interior. Room was clean upon entry. Walls were thin.. not good for light sleepers. I woke up twice in the night, once to someone in another room hurling and the second time to a couple having an argument. A/C / heater unit is slightly noisy; windows have a screen that can be lowered to block out extra light. Breakfast could be improved. Giant pastries that felt like it came from the supermarket. Parked at the lot next door on an event night, let the guy know I was staying at the hotel and he charged $25 for parking valid until the next day. Location is perfect, next door to the Eaton Centre and Greyhound station. Good location that is easy to find for Uber and taxi drivers. I'd stay again for short stays (1-2 nights max).",
      "rate": 4.0,
      "tripDate": " November 2015"
    },
    {
      "title": "Very good if traveling alone, but cannot charge your gadgets",
      "text": "This is a hotel extremely well located in downtown toronto, for UofT or associated hospitals. Definitely a trendy hotel, with very cheerful, young staff. Size is extremely limited. There was only one useful power outlet in the room, not conveniently located to charge phone or iPad. What was more irritating was that the sliding door to the bathroom always bent the gadget connection pins when opened, if you did not remember to unplug them on the way in. Not very practical design overall. On the upside, wifi was much more useful than average, and included in the room rate. Overall, I would say that the hotel is convenient and fair quality/price.",
      "rate": 4.0,
      "tripDate": " May 2015"
    },
    {
      "title": "Good but small",
      "text": "It is lovely, bright and clean, but a small spot for a bigger person.  They held my luggage for me when I was at work, but they kept it in a stairwell that is accessible to the public. Bathroom is too tiny to be comfortable. Staff were friendly and lovely.",
      "rate": 4.0,
      "tripDate": " May 2015"
    },
    {
      "title": "Small but comfortable.",
      "text": "Loved this hotel. The staff are very friendly and helpful. Check in was quick and easy. No issues with room booking. Room was awesome. We had a queen bed on the third floor. The room was very warm when we arrived but the AC unit quickly cooled the room. Mattress was very comfy as were the pillows. Very nice bathroom, the shower was very hot, so just be careful. We didn't hear much street noise from our room, the occasional siren, but nothing that kept us up at night. Could slightly hear doors opening/closing in the hotel, but nothing awful, no slamming of doors, couldn't hear people. Breakfast was a light breakfast, pastries, coffee, tea etc. There is a complimentary iPad in the room so we were able to find lots of places to eat in the area (breakfast and dinner). The hotel is very close to shopping(pretty much around the corner), and about 20 minutes from Union station (walk). Will more than likely book again in the future.",
      "rate": 5.0,
      "tripDate": " April 2015"
    },
    {
      "title": "I Loved My Stay",
      "text": "I had read up on the reviews before deciding to stay here, so I was delighted when my stay was so wonderful. After reading some of the reviews, I had questioned whether this was the right spot for me, but I took a chance and I am happy I did. The staff were super friendly and accommodating. I felt like I was at a more private B&B over a hotel, which was is a welcomed atmosphere compared to some of my other Toronto stays. I was aware of the small size of the rooms and lack of hooks, etc according to other reviews. This didn't bother me at all. I did not find it to be an issue and was happy to fold my things up and store them in the drawers in the bottom of the bed. I practically emptied my suitcase and handed it to the front desk who happily stored it for me until I needed it again. The beds were super comfortable, and I never had any issues with the WiFi. I felt like was at home in a much nicer version of my own bedroom, watching Netflix - which is included with the room! The iPad and Skype were nice, modern touches as well. I wouldn't have minded some darker shades for the windows, but I can't really complain about it. When I felt I needed some extra space to get my work done, I was able to take it down to the cafe (which was closed to the public) and work from there all while drinking free coffee. The location can't be beat and the restaurants in the surrounding area were fantastic. I highly recommend the Indian restaurant \"Matagali\", which is just around the corner if you love some good Indian cuisine. All in all, I loved my stay and I would definitely recommend it.",
      "rate": 5.0,
      "tripDate": " March 2015"
    },
    {
      "title": "Read carefully the review and you will be pleased with your stay there",
      "text": "I read the reviews about this hotel prior to booked it so it is why I had a great stay. I have nothing to complain about because I knew what to expect before to get there.I stayed two nights there in a double bed room, however, even knowing what to except I wouldn't go back there. Not because of something wrong, but for me some features are necessary: elevator, space in the room... In fact, i was at the One King Street the two previous nights and did want to extend my stay. It seem that they were a conference of something because the One was totally full and the Westin as well, si I went to the BeSixFifty more by lack of options for the location that I wanted: in the downtown area.I will summarize the characteristics of this hotel:the room (309) was small as excepted. Very small: the bed is one side along the wall, so isn't extra room no whereThere is no elevator, but they gladly brought my big luggage in my room.No wardrobe, only two hooks in the bathroom to hang things onThe window doesn't open, but the A/C is super strong (I have it for 61F and it was perfect)I had a double room and was alone in it, I wouldn't have see myself with someone in this room as there wasn't any place to put two luggages in the room.No fridge, no coffee machine in the roomNetflix is include, nice plusNo iron in the room, you can have one at the front deskThe pillows are hard and there isn't soft ones.The location is on Bay Street which means that yes, you will hear the nightlife.The room isn't soundproof, so I hear the doors of the hall closing  during the night and people get in their room as well. You can hear the television from other room as well.Prior to my stay I read a review about the products in the bathroom and I found the comment strange, but it is true: it's a challenge to put out the shampoo out of his bottle and it's the same for all the products. The shower was nice there, I didn't have any problem with hot water.The staff are awesome, very nice, helpful and professional.Overall, my stay was let's say convenient.",
      "rate": 3.0,
      "tripDate": " March 2015"
    },
    {
      "title": "Be wary of iPad",
      "text": "I was charged $450 to replace the iPad that was in our room as the screen was found to be cracked, which is ridiculous because we never touched the iPad during our one night stay. I am also pretty sure it does not cost that much to replace the screen, even if I did accept that we might have cracked it. Very disappointed that we were shifted the blame from someone else's mishap. Why the iPad's are not put in protective cases when the floors are not carpeted is beyond me... so be careful! After calling the hotel manager several times, I was finally able to speak with him about the incident, where he did nothing to help, leaving me out $450.",
      "rate": 1.0,
      "tripDate": " December 2014"
    },
    {
      "title": "Nice Boutique Hotel near Eaton Centre",
      "text": "Best:LocationSmooth Check-inClean & nice roomComplimentary Breakfast - Very nice staff and great muffins and coffee.Worst:Rooms are very small in size. Not enough space to keep your bags if you are travelling with more than 1 bag. No place to hang your clothes.Power outlet were not available in my room so I need to take my laptop and phones to washroom to for chargingNo lifts so it will be a pain if you travelling with heavy luggageOverall a great place to stay if you are travelling light & want to be close to Downtown (Yonge & Dundas Square)",
      "rate": 4.0,
      "tripDate": " November 2014"
    },
    {
      "title": "Small boutique",
      "text": "The check-in was smooth and very quick, the clerk very courteous and helpful. It is a walk up hotel, but an easy climb up to the third floor. The rooms are very clean, comfortable bed, smart tv, but....the room we had (a queen room) was tiny. I accept that the reviews all note that the rooms are small but this is tiny. There are not even any hooks to hang a jacket, nothing to open up a suitcase on. You pretty much have to leave everything on the floor! I hung our jackets from the door closer. I am 6'-2\", 250 lbs, I could not fit in front of the bathroom sink, I had to stand sideways between the shower stall and the wall separating the washroom from the bedroom. Tiny. Continental breakfast was tasty in the morning, checkout was smooth - rooms are tiny!",
      "rate": 3.0,
      "tripDate": " November 2014"
    },
    {
      "title": "Great find, but ask for a rear room.",
      "text": "We recently stayed in this beautiful boutique hotel and have mixed reviews.  We loved the location of the hotel, style, cleanliness.  Staff were super friendly and helpful.  I would however recommend booking a room away from Bay Street.  We found Bay Street to be a little noisy for our liking, but what bothered us was the fact that there was no room blackout in the blinds.  The street lights kept our room illuminated all night.  We paid extra for a larger room - we loved the room - except that we slept with pillows over our heads to block out the street lights coming through the blinds.So we would definately return but be picky about the location of the room.  Something facing the back alley probably would have been much better.",
      "rate": 4.0,
      "tripDate": " September 2014"
    },
    {
      "title": "Good things come in little packages",
      "text": "This boutique hotel has it all.....great prices, excellent and friendly service, super location and above all, lots of style. It's a perfect stay if you are going to theatre and looking stay for a night or two. Although the rooms are very compact and short on storage, it offers everything you could need. The room was super clean and the bed deliciously comfortable. It 's a really nice change from the high priced, large hotel chains.",
      "rate": 5.0,
      "tripDate": " September 2014"
    },
    {
      "title": "Cute and comfortable",
      "text": "My wife and I stayed in Room 201 and loved it! Check in was easy, the room was small but lovely and the shower was awesome! No room to hang up clothes but we kept everything in our suitcase as it was only for 2 nights. The area is great and you can walk or take the subway everywhere. I would recommend this hotel and Sean at the desk was super helpful on where to go and where to eat.",
      "rate": 5.0,
      "tripDate": " July 2015"
    },
    {
      "title": "Terrible Service And Way Overrated!.",
      "text": "The room is tiny, cold and the staff rude and unfriendly. The \"free breakfast\" is a stale danish. They claim to accept pets, but don't.  I will be filing a complaint with the Better Business Bureau, regarding their horrible service. They are not even a registered business, with the government and they also claim to be privately owned. When I stayed there I had no heat during the night and they had the freaking air condition on, day and night, and they would not even transfer me to another room. Claim that they could give me an extra blanket, instead. The Male staff was extremely rude and even went through my personal belongings, in the room. Hello! very stupid move to make. Legal action is now pending against them. Do not rely on their free wifi, either, because the service is so bad. They have skype for you to make local calls and your calls will also be disconnected, because you will be off line most of the time. This was the most common problem that I had with their service. The interruptions during a regular telephone call, that went dead. Same if you use the internet. Mostly disruptions in the service.  The rooms are so tiny, it's ridiculous!. This is definitely NOT a hotel, or of hotel standards. Save your money and go somewhere else.",
      "rate": 1.0,
      "tripDate": " January 2015"
    },
    {
      "title": "Great Boutique Hotel",
      "text": "Great boutique hotel close to everything. Very European design, friendly staff and has everything you need. Small rooms but very cozy and inviting, clean and cozy. Breakfast was great at the cafe downstairs, tasty pastries and coffee/tea. Will stay here again!",
      "rate": 5.0,
      "tripDate": " November 2014"
    },
    {
      "title": "Boutique hotel, great location",
      "text": "Great location just one block north of the bus station, minutes to the Eaton Centre and about 15 minute walk to the major hospitals on University Ave. Rooms are tiny but functional with a European vibe. The i-pads and fresh apple in each room are a nice touch, but beds are smallish and there are no closets. Street noise can be an issue on the second floor. The continental breakfast is nice and the coffees and pastries are made on site. Close to many restaurants on Yonge street and Elm street. I stayed here on a promotional rate when the bigger nearby hotels were full and was quite pleased.",
      "rate": 4.0,
      "tripDate": " February 2016"
    },
    {
      "title": "Four night stay",
      "text": "This hotel is all about the location, which really is great. Just around the corner is Eaton center and Air Canada center is just a 15 min walk down Bay St. The staff is very friendly. The breakfeast consits of pastries, coffe/tea and fruits, which all are delicous but for a breakfeast I'd rather have something more substantial, but since it was free I can't complain. The rooms are nice but feels a bit cheap; the bed is far too short and not too comfortable, there is a draft from the window and the AC sounds like a 747 when you're sleeping so close to it. Earplug is a must.",
      "rate": 4.0,
      "tripDate": " March 2016"
    },
    {
      "title": "A Tiny Getaway",
      "text": "The rooms at this hotel are micro but the design/ location makes up for it. We only stayed one night. The room was clean and the Netflix on the TV was a huge plus. Cute cafe area to use after checkout. Complimentary pastries, coffee and fruit is served at the cafe for breakfast. Would stay again.",
      "rate": 4.0,
      "tripDate": " January 2016"
    },
    {
      "title": "Nice, trandy hotel",
      "text": "My husband had a business meeting in Toronto, so we had to spend one night in a hotel. This hotel was chosen for us by somebody else. It is very nice, clean, modern decor hotel. The room was cozy and comfortable. Lots of people reviewed the rooms as very small, but I found our room big enough for its purpose. It had a nice and clean shower with sliding frosted glass door, what I found very practical. I would definitely recommend this hotel for people who need nice, clean, affordable place to stay for couple of nights. It was a big plus that room had a heater/AC unit that guests can control themselves. Staff was extremely nice and friendly. Complimentary breakfast was a huge pastry of your choice and a coffee or tea. I liked it.",
      "rate": 4.0,
      "tripDate": " January 2016"
    },
    {
      "title": "Great location",
      "text": "I stayed for two nights in a single room.  The room as advertised is quite small,  but cosy and comfortable.  The street noise is blocked out but I found it noisy when other guests came in late at night.  I could hear them going up the stairs and opening and closing doors.  It is also a little pricey for the size of the rooms.  Internet and breakfast are included which is not common in downtown Toronto hotels.  The location is also great: close to the eaton centre and subway.  The reception staff is friendly.",
      "rate": 3.0,
      "tripDate": " May 2015"
    },
    {
      "title": "Right in the heart of Toronto",
      "text": "A small boutique hotel. Rooms are tight but great. I liked that they supply an Ipad as the way to communicate to front desk and operate the TV etc, and can Skype friends and family on the wifi....at no cost.The coffee shop next door is great for breakfast and cheaper than the one across the road",
      "rate": 4.0,
      "tripDate": " August 2015"
    },
    {
      "title": "Everything is wrong!!",
      "text": "Coming in from an all night drive. I sleep in the daytime and drive at night. Tried to check in at 12:30 and was told check in is not till 3pm. I explained I check out anywhere from 11 to 4 am. She said the were booked up. So I asked so no one has checked out yet?? Was told they all have late check out. Even if some left some rooms should be ready.  She was not authorized to release rooms till 3. It's a boutique hotel she said with small staff. So your telling me not one room is clean at 1230?  I don't need the room you blocked for me, I can take anyone.... No manager on duty.. So at three pm you will have every room cleaned at once ?? Not one person walked in and not one walked out while I waited till 235 when I was told housekeeping finally released my room.. TV is mounted way to low on the wall. Shower was poorly designed. You can not turn on the shower without getting in and feeling ice cold water till the warm water creeps upstairs. I said I sleep in the daytime and drive at night, well the remote shard is cool it's not blocking any light from outside. I will post a pic from 730 at night .... Why was a darker shade not ordered. Wall plugs for phones ?!? Well they are mounted on the floor and under the bed!! No phones but they give you an iPad to use with Skype.  Internet was extremely slow with 1-2 bars of service. Beds comfortable as it better be cause you have nothing else to sit on. Not even a spot to put luggage down. It's at the entry door on floor. Nothing to hang clothes but they will bring something if asked. Where U.S. Gonna put it!?!? Don't plan on doing any work because you don't have a desk. Over all the front desk gal should have just let me in. My room was not just cleaned, I never stayed in a hotel where they dried the shower down after cleaning does have glass walls and it was dry but the river stone rock was not the slightest wet from cleaning. With over 1000 workers in my filed we will not recommend this place to our travel agents.",
      "rate": 2.0,
      "tripDate": " June 2015"
    }
  ]
}