{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Best Western Plus Executive Inn",
    "url": "/Hotel_Review-g155019-d246962-Reviews-Best_Western_Plus_Executive_Inn-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.0",
      "reviewCount": 894
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "38 Estate Drive",
      "addressLocality": "Toronto",
      "postalCode": "M1H 2Z1",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/23/e4/dd/05/hotel-exterior.jpg?w=500&h=400&s=1"
  },
  "description": "At the Best Western Plus Executive Inn you're sure to find that little something extra. With our modern amenities and thoughtful design, the Best Western Plus Executive Inn will stand out among other hotels in Toronto,ON. For the business traveler, a spacious work desk and free internet access are included in all our guest rooms to ensure you don't miss a beat while you're away from the office. For extended stays, each room provides a convenient in-room mini fridge that is ideal for drinks and snacks. We also have an in-house fitness room, so you can keep up your workout routine while you're on the road. As always, the Best Western Plus Executive Inn will provide you with the superior customer service that you are used to at Best Western® Hotels & Resorts.",
  "featues": [
    "Free parking",
    "Free High Speed Internet (WiFi)",
    "Pool",
    "Fitness Center with Gym / Workout Room",
    "Free breakfast",
    "Kids stay free",
    "Business Center with Internet Access",
    "Conference facilities",
    "Electric vehicle charging station",
    "Parking",
    "Wifi",
    "Pool / beach towels",
    "Indoor pool",
    "Heated pool",
    "Sauna",
    "Breakfast available",
    "Breakfast buffet",
    "Vending machine",
    "Meeting rooms",
    "Spa",
    "Baggage storage",
    "Currency exchange",
    "Newspaper",
    "Non-smoking hotel",
    "Shared lounge / TV area",
    "24-hour check-in",
    "24-hour front desk",
    "Express check-in / check-out",
    "Laundry service",
    "Self-serve laundry",
    "Air conditioning",
    "Housekeeping",
    "Iron",
    "Coffee / tea maker",
    "Microwave",
    "Refrigerator",
    "Flatscreen TV",
    "Hair dryer",
    "Non-smoking rooms",
    "Family rooms"
  ],
  "reviews": [
    {
      "title": "Nice stay",
      "text": "I stayed at this hotel in July with my family and had to extend our stay which went smoothly with a good price considering the fact that no reservation was made earlier Being a member helped me to get a good price though.",
      "rate": 5.0,
      "tripDate": " July 2023"
    },
    {
      "title": "Hotel stay",
      "text": "I came to stay at this hotel because my daughter had an appt at a hospital nearby, the front desk staff were so incredible and their hospitality was exceptional. We had to wait for one of our guests to arrive, they offered us coffee and let us know where we could use a washroom while we waited. Also we offered to go to a nearby coffee shop to wait and they said just sit and wait in the lobby here. They went above and beyond to make our stay enjoyable.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Nice clean hotel",
      "text": "The hotel was very clean, the hot tub in the swimming pool area could use a cleaning (spewing ecru colored foam) but the room was spottless as was the breakfast area and the pool area.  Maids were very friendly as was all the staff.  I found the hotel expensive, but it is in Toronto, so I expected that.",
      "rate": 4.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Beware if you have allergies",
      "text": "I stayed there overnight for one night and when I booked I specifically asked for no chemicals to be used in the room prior to my stay as I have extreme allergies to fragrances.  They assured me that my room would be chemical free.  I also called a couple of days before my arrival to confirm that my room would be chemical free and,, again, was assured that my record stated that it be chemical free.  When I arrived, the room was highly fragranced, which is a nightmare for me.  Since someone from housekeeping was a couple of rooms down from mine, I asked her if they use plug-ins or something and she said no to the plug-ins but she had sprayed the room with something \"to make it smell nice\".  I told her that I expressly booked with no-chemical designation.  She said she did not see that on my record.  She then showed me another identical room that she had not sprayed yet and I told her that one was fine and went to the front desk and asked to be moved to the new room.  The gentleman I talked to was quick to let me move my belongings to the new room and I left to attend the event that i was in Toronto for.  When I arrived back to the room around midnight, it smelled like something had been sprayed in the room and it was horrible for me and made me quite ill.  Since it was midnight and I knew the hotel was fully booked and would not be able to move me, I endured the fragrance but was not well at all in the morning.  I sent a note to the hotel the next morning and also talked to someone at Customer Care.  I got a note back from the hotel that did not address my concerns and a week later, I am still waiting to hear back from Customer Care.In this day and age, when so many people are allergic to fragrances, sprays, chemicals, I do not understand why this is necessary.  I have always been able to count on Best Western, but not any more, it seems.",
      "rate": 1.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Nice hotel",
      "text": "The hotel was clean and the breakfast was great! The only issues I had was there was no one taking our garbage out and refilling our towels. They say b/c of Covid. But to go into someone’s room and take out the garbage and replace towels shouldn’t be harmful now. Just my thoughts!",
      "rate": 3.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Very good experience at this hotel!",
      "text": "My wife and I chose this hotel to stay at as it was partnered with the Ontario Science Centre.  We brought our grandson here for the weekend.  We received a twenty per cent discount at the Science Centre, showing our hotel reservation at the entrance.  The location was great as it was very close to Hwy 401 and easy to get there.  It is only fifteen minutes from the Science Centre and close to restaurants, although if you drive twenty minutes to Yonge Street you will find endless selections of restaurants!  The hotel was very clean, the staff were extremely friendly, the pool was very clean, and the hot buffet breakfast was incredibly good!!  The hotel also has available a level two charger which we used for our EV.  Upon departure on Sunday morning, the desk clerk gave our grandson a few treats - that made him even more happy.  It was a great over-all experience and would highly recommend this hotel.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Wonderful staff, breakfast, needs new flooring",
      "text": "Kindly greeted on check-in, my needs were well accomodated and the room was ready for my 2-night stay. Room is spacious, well fitted, but carpet stinks and is quite old, needing replacement (or better: no carpet at all). Bathroom was normal, but not 100% clean (found few hair in sink). Fridge in room was not working properly (hot inside) but did not really needed it. Coffee machine worked fine.Location is quite practical. Surroundings (businesses) are almost empty (for rent) and the nearby ancient hotel is now a homeless shelter (no issues as far as I've experienced, all is clean, civil and organized).Shower and bed were of good quality, sheets and pillows very comfy. Room A/C quite noisy and air didn't feel very clean (maybe because of the run-down carpet).Breakfast is worth not missing. Croissants, all kinds of bread, waffle machine, yogurth & juice choices, well presented and replenished all the time.Did not use swimming pool but people there seemed to have a good time.Parking was easy, parking lot was clean (though did not find a garbage bin outside).Check out was smooth and I got my invoice on my app immediately, no troubles.WARNING: Petrocanada gas station nearby had deffective pump charging without filling. Nobody there cared. Avoid.",
      "rate": 3.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Outstanding staff !!",
      "text": "I stayed at this property this week and was extremely impressed with the staff at this hotel !!Very warm, friendly and fast check in !! The room that I was provided had a king size bed and the room was huge !!!Room was extremely clean and was very impressed by the quality of lighting in the bathroom.The next morning, I had their complimentary breakfast, and what I have never seen before, was the kitchen team , would follow up with me and proactively offer my juice, fruit cup, etc , while I was sitting at my table.Very very nice touch and greatly appreciated!!!Never seen that before at a Best Western.Overall it was an excellent stay and their staff are outstanding!I would highly recommend.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Convenient to highway and Keg",
      "text": "Family of 5 stayed in one room... clean, very convenient to the Markham Road exit on the 401. Decent breakfast included. Elevator was a bit slow, but nothing to fuss about. Keg steakhouse is a 3-minute walk away (2 doors down the street)",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "They don't care",
      "text": "The front doors of the hotel had marks from a dirty cloth used to clean them.  The first room they put us in had broken curtain rod, telephone that didn't work, toilet that didn't flush properly and shower that didn't work properly.  The manager felt this was worth a $30 refund.",
      "rate": 1.0,
      "tripDate": " May 2022"
    },
    {
      "title": "Nice hotel",
      "text": "Nice hotel, clean, great breakfast, friendly staff. Enjoyed 3 nights there for our girls hockey tournament and won a Gold medal! Staff was very tolerant too, having a big team there.  Many hotels aren’t. Rooms were a bit warm but thankfully the thermostat was easy to use. Only complaint...  please don’t rudely call at 11:18am, tell us checkout is 11 and ask if we’re paying the  $75 late checkout fee, as we’re walking out the door.",
      "rate": 4.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Great place to stay for a family",
      "text": "Comfortable rooms, 2 adults and two teens, the internet was a little sketchy but generally good, free parking is a bonus and so is the included breakfast. Great coffee. Good food. Good service. This hotel is a great value, the breakfast was good",
      "rate": 5.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Overpriced motel",
      "text": "So it's not in the greatest location you could possibly find and the beds are okay pillows or somewhat fine room was cold dirty. No toilet paper or barely any should I say. also charged me for smoking in the room because I left my empty pack of cigarettes in the garbage but I kept going outside for cigarettes that's the crazy part",
      "rate": 1.0,
      "tripDate": " January 2024"
    },
    {
      "title": "Stay at the Best Western",
      "text": "Room was clean and ready for pickup time. Checkout was easy and convenient, I was able to call guest services from my room and leave the key in the room instead of waiting at the front desk which gave me more time to relax prior to an early morning meeting. Would definitely recommend this hotel and would visit again.",
      "rate": 5.0,
      "tripDate": " December 2022"
    },
    {
      "title": "Great people but issues with the pool",
      "text": "All the staff were wonderful, our only issue was the pool. The water was a little cooler then I think it needed to be and the hot tub was out of order. This was something that I even called before hand to ask about and was told everything was good to go. That was really disappointing, I would hope that they would have been a little more transparent on that. The pool area could definetely use a good clean as well, dirt build up along the walls of the pool were quite visible.",
      "rate": 3.0,
      "tripDate": " March 2023"
    },
    {
      "title": "Convenience & good value",
      "text": "Our usual accommodation with family was not available and this was an excellent stay for one night.  More expensive than we're used to for a non-vacation convenience stay but it seems all of the hotel prices have increased significantly since the pandemic.  This was a reasonable rate compared to competitors and included parking, wifi, an excellent breakfast and convenient access near the highway and commercial hub of Scarborough.",
      "rate": 5.0,
      "tripDate": " November 2023"
    },
    {
      "title": "might be western but not the best",
      "text": "Rooms require maintenance from plumbing to paint. Staff friendly. Tubs are slippery. The really nice heated mirror in the bathroom is lost in all that is sub-standard. There are recycling containers in rooms, but none in common areas that I noticed. Doesn't really matter as the housekeeping staff put mine in with the garbage.",
      "rate": 2.0,
      "tripDate": " December 2019"
    },
    {
      "title": "awesome stay",
      "text": "our room was ready early so we got an early check-in which in turn allowed us to explore the city a bit more instead of waiting around. they were very accommodating and very helpful. the lady at the front desk was amazing, and check out was effortless. id definitely stay again.",
      "rate": 5.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Bed bugs!",
      "text": "we stayed December 1st to 4th 2022 and i came home with 37 bites. at check out I told them and all they were concerned about was that I didn't tell everyone else there was a problem. I feel terrible that I didn't not yell it out before I left!! they said i would not be charged but then i received a phone call yesterday saying I was only being refunded for 1 night because I didn't tell them sooner well I had not clue that 3 bites from the first night was bed bugs so how was I supposed to say anything?!?! Clearly they were only concerned with making sure the current guests didn't find out about the bugs. once I was gone charged me anyway!  the room was also not clean",
      "rate": 1.0,
      "tripDate": " December 2022"
    },
    {
      "title": "Mediocre",
      "text": "The hotel lobby, elevator and parts of my bathroom were dirty. One elevator was stuck and buzzing loudly for the duration of my stay. The toilet in my room ran intermittently, non-stop. At check-in, the staff member told me that my request for a quiet room (not on the highway 401 side of the property) wasn't noted on my reservation. Strangely, I can see it myself when I log in to the Best Western site and view past reservations. Overall, for me, the property looked fine from outside, but was dingy and neglected on the inside.",
      "rate": 2.0,
      "tripDate": " October 2021"
    },
    {
      "title": "This hotel gives me a so-so feeling",
      "text": "There are no slippers, no toothbrushes, no toothpaste in this whole hotel. The hot water was not too hot. Secondly, the room was not clean. When I opened one of the refrigerators in the room, there was leftover food left by a guest.The overall feeling to me can only be said to be mediocre because two star hotels charge three or four star hotel service fees. And he didn't provide what was supposed to be there.The price of a two-star hotel is charged according to the standard of three or four stars, which should not be very, very expensive, and there are no necessary things to provide.",
      "rate": 2.0,
      "tripDate": " December 2021"
    },
    {
      "title": "Really nice hotel, great staff",
      "text": "We stayed here for 3 nights as part of a multi centre trip to Canada.The first impression was good with a smooth check in. We were given plenty of information about the hotel and its amenities before being directed to our room on the 3rd floor.The room was clean and well equipped with tea and coffee making facilities included (always a bonus). When we asked to have some extra coffee it was no problem whatsoever and provided very quickly.Despite being near a main road it was quiet in the room. The bed was comfortable and the bathroom was absolutely fine.Breakfast was provided with a good variety of continental items as well as a fantastic waffle maker. The staff on hand were super friendly and helpful.The swimming pool was very warm but it was fine and always quiet when we used it. The whirlpool was extremely hot and was really nice after a long day walking around Toronto. The sauna was also lovely and hot.We asked the receptionist to assist us with our booked transfer to Niagara Falls and nothing was too much trouble. Leah and her colleague (sadly she wasn’t wearing a badge so didn’t catch her name) sorted it out for us and gave us a map to direct us to which downtown hotel we were being picked up from.The hotel itself is about a 20 minute walk to McCowan subway station but it is on the flat so no problem at all. There are buses to the centre of Scarborough from the main road. There is also a nearby restaurant which was excellent as well as a petrol station to buy snacks from.We really enjoyed our stay here.",
      "rate": 5.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Didn't Clean The Room",
      "text": "I booked 3 rooms for our group, we were staying there so we could enjoy the city and the zoo.Upon arrival everything seemed fine, we were checked in by Mohammed, who was very friendly and fast.We got to our rooms, they appeared upon first glance to be fine.The one room had hairs in the bed, to the point that my Mother refused to sleep in it, and stripped the bed to sleep on some blankets from in our car.The second room was fine.The third room, our room, was fine until we got our kids dressed for bed and pulled out the sofa queen bed. Upon opening it it was absolutely obvious that it had never been made, I don't mean that there were not blankets, I mean that it had blankets that had quite obviously been slept it, including hair and sweat stains on the blankets, it also had a vape in the blankets.We called down and spoke with Mohammed who didn't really understand the issue, so we had him come up to the room and look, he offered to give us clean blankets so that we could change the bed, but we refused and our children were not interested in sleeping in the bed after seeing the state of it and the vape. He took photos to forward to his Manager and we requested to change rooms. He was apologetic and went downstairs to try and find us another room, he had us meet him on a lower floor that had some sort of party going on and was now a floor away from the rest of our family group. Finally, he found another room on the same floor for us, and dressing in pajamas, we had to pack up all our belongings, move to a new room, unpack, then finally go to bed.When we checked out, they acted like nothing had happened, and we asked to speak with the Manager, who was not in. So we spoke with the Supervisor who offered us $2 in reward points, and gave us a 6% discount... She told us that it was all she could do and we would hear from the Manager. We are at a week now and we've heard nothing from the Manager.In addition, none of the ice machines worked, and none of the vending machines worked. The breakfast in a morning was limited due to COVID restrictions, as was pool use, which is understandable, but their breakfast \"sausage\" was chopped up hotdogs, and anything other than cereal in a ziplock bag or eggs was hidden around a corner that you had to ask for, but it wasn't even possible to see it in order to ask for it.We are extremely unsatisfied with our experience and the customer service, apart from Mohammed who initially check us.",
      "rate": 1.0,
      "tripDate": " July 2021"
    },
    {
      "title": "Underwhelmed",
      "text": "The snacks available for purchase were an exercise in price gouging.There was a distinct smell of urine in the hallway.There seemed to be a lot of exterior noise.The room had no room darkening blinds/curtains.The complimentary breakfast was poor.",
      "rate": 2.0,
      "tripDate": " February 2021"
    },
    {
      "title": "Excellent accommodations",
      "text": "Exceptional customer service in all aspects of accommodations.  The staff at the front desk, the breakfast servers and the cleaning staff were always friendly, helpful and so professional.  The location of the hotel was superb with eating places close and yet nestled in a good location.  I would highly recomend this hotel to anyone who wants to be in a wonderful environment while away from home.",
      "rate": 5.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Dirty and Poor staffing at this location",
      "text": "I would not recommend this hotel at all. The room we received had stains all over the couch in the room, and the provided desk chair, as well as an odor of body fluids. We also had no desk lamp as it would not turn on. We asked to have a new bulb/ or lamp and were told no that they don't do that. That might have been for the best considering what we could see was dirty. When we went down for breakfast in the morning the eggs had hard spots in the and tasted like they sat out  already once and then re-heated and put out again. The second afternoon that we were there someone vomited in the elevator, with a wet floor gin covering it. The sign did not help the smell of the vomit, and was left like that until the following afternoon went it was then mopped all over the elevator. Like come on people do better !! When any issues were brought to the front desk for attention they simply replied no no sorry..... But they didn't do anything or care ! Oh and one more thing, my nephew bought a soup thing at the concession area and then asked for a spoon and was told no they don't have utensils for those items.... Then don't sell them !",
      "rate": 1.0,
      "tripDate": " February 2024"
    },
    {
      "title": "Quiet, comfortable hotel close to 401/Markham Road. ",
      "text": "I chose this hotel because it was the closest and most convenient one for my purposes. It was a little on the expensive side but that was my fault as I waited till last minute to book. Needless to say I was a little apprehensive about it as I had booked it only because I needed a place to stay and didn't have another option at the time. But I was pleasantly surprised. They let me check in late, my room was on the 4th floor, and big enough with an excellent view over the parking lot and Markham Road and the 401. In spite of its close proximity to these, I was not troubled by any noise. There was a microwave and fridge in the room which again was necessary for me, and the breakfast was absolutely amazing with every single option available that one could possibly think of. The only thing I would suggest improving is the breakfast seating area, as there wasn't much space. For me it was fine as I was by myself, but some couples and families had a problem finding seats to sit together. There is a gym and swimming pool but I didn't use them. Front desk is very very helpful. My booking was for two separate rooms as I couldn't get the same room for three nights but they changed it for me so I stayed in the same room. They also allowed me to check out late. Even though my first time staying here was because I didn't have a choice, I shall definitely stay here again, this time by choice, and I'll make sure I book well in advance to get a good rate.",
      "rate": 5.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Springs in the mattress",
      "text": "Checked into the BestWestern on Estate Drive in Scarborough. I booked the hotel, I was having major surgery. I live out of town. The staff was very friendly. Checked into the room. The beds looked very old and uncomfortable. I did a check of the cleanliness of the room. Pubic hair in the toilet. Make up all over the walls. I cleaned and wiped everything down. Thick dust on the head boards. The doors where covered in dirt. The worst night sleep. You could feel the springs thru the mattress. I had to be @ the hospital @ 6am. For day surgery. Unfortunately I could not deal with the hotel. When I checked out the next day. I did made the front desk aware of the discomfort of the mattresses and the pubic hair and cleanliness of the room. The response was”oh we’re so sorry you didn’t enjoy your stay” Do not waste your money here",
      "rate": 2.0,
      "tripDate": " October 2022"
    },
    {
      "title": "Good Stay, Friendly Staff",
      "text": "Check in was fast and easy but couldn't pre-register. Requested additional pillows/towels through the online form but that didn't work. Hot and cold breakfast was available and decent but wedges were a bit tough. Went to the aquarium and zoo and the Subway being so close made getting downtown Toronto a breeze while the hotel is only about 10m from the Zoo. Not a fancy hotel by any means but had everything we needed to for a nights sleep. Choose a Wed night stay as the cost was the cheapest regardless of hotel. Didn't get to the pool but it was open and would have been a great way for the kids to kill some time if needed. We like a medium firmness bed and we found it was a bit soft for our liking so if you like a really firm bed then this may not be the best place to stay.",
      "rate": 4.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Team event",
      "text": "Group rooms not together, pool not in operation, business centre not in operation, slow check in process.We were there for a team sports event.  When comparing hotel options a pool was a must for a group of 11-12 year old kids.  When the pool was out of service, it was disappointing that no discount was given to match non pool hotel options we had.The business centre not open for homework was annoying.hot breakfast was a decent hotel breakfastStaff was friendly",
      "rate": 1.0,
      "tripDate": " March 2022"
    }
  ]
}