{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Best Western Premier Toronto Airport Carlingview Hotel",
    "url": "/Hotel_Review-g155019-d1426161-Reviews-Best_Western_Premier_Toronto_Airport_Carlingview_Hotel-Toronto_Ontario.html",
    "priceRange": "$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.0",
      "reviewCount": 696
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "135 Carlingview Dr.",
      "addressLocality": "Toronto",
      "postalCode": "M9W 5E7",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/23/e4/dd/dc/hotel-exterior.jpg?w=500&h=400&s=1"
  },
  "description": "Best Western welcomes you to the Premier life. At the Best Western Premier Toronto Airport Carlingview Hotel, our biggest priority is leaving a lasting impression, long after you check out. You'll notice our Premier's distinct style the minute you walk in. Our elegant hotel offers the highest quality amenities and service, sure to win over even the most refined traveler's favor. Located in Toronto,ON the Premier lifestyle comes with a fully equipped fitness room for the active traveler, an exquisite on-site dining experience for the culinary aficionado, and ample amounts of meeting space suited to accommodate any large gathering.",
  "featues": [
    "Paid private parking on-site",
    "Free High Speed Internet (WiFi)",
    "Fitness Center with Gym / Workout Room",
    "Pool",
    "Bar / lounge",
    "Pets Allowed ( Dog / Pet Friendly )",
    "Free airport transportation",
    "Business Center with Internet Access",
    "Parking garage",
    "Wifi",
    "Sauna",
    "Hot tub",
    "Pool / beach towels",
    "Indoor pool",
    "Heated pool",
    "Coffee shop",
    "Restaurant",
    "Vending machine",
    "Free shuttle or taxi services",
    "Airport transportation",
    "Shuttle bus service",
    "Car hire",
    "Conference facilities",
    "Banquet room",
    "Meeting rooms",
    "Photo copier / fax In business center",
    "Baggage storage",
    "Non-smoking hotel",
    "Picnic area",
    "ATM on site",
    "24-hour check-in",
    "24-hour front desk",
    "Express check-in / check-out",
    "Dry cleaning",
    "Laundry service",
    "Blackout curtains",
    "Air conditioning",
    "Desk",
    "Housekeeping",
    "Microwave",
    "Flatscreen TV",
    "Sofa bed",
    "Walk-in shower",
    "Interconnected rooms available",
    "Room service",
    "Safe",
    "Sofa",
    "Telephone",
    "Wardrobe / closet",
    "Iron",
    "Laptop safe",
    "Wake-up service / alarm clock",
    "Refrigerator",
    "Bath / shower",
    "Complimentary toiletries",
    "Hair dryer",
    "Non-smoking rooms",
    "Family rooms"
  ],
  "reviews": [
    {
      "title": "One of few airport hotels with covered parking",
      "text": "We recently took a trip out of Toronto and needed an park n fly hotel.  Our travel agent suggested the BW Premier Carlingview.  We had never used this hotel before but she said we should give it a try.The hotel was very nice, quiet, had lots of amenities and a very good bar/restaurant.  What we appreciated the most though was the covered parking.  Any one leaving on a winter vacation knows the value of coming home and not having to clean off your car while not dressed properly.  The other major reason we loved this airport was the shuttle.  It is a 24 hour shuttle and it goes directly to the airport and does not stop to pick up others from additional hotels.  That is important when you have to be up at crazy hours and are in a hurry.  The price was very reasonable too so you really have no reason not to try BW Carlingview.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Great Holiday for  Fly Away Vacations",
      "text": "We have stayed here 3 times in 2020. We stay here every year as you can get your room, 1 to 2 weeks covered parking while you are away. They have a shuttle that takes you to and from the airport. They also have a restaurant on site which is only average but you can park your car, check in to your room and then go down with out having to go outside and eat. Makes every thing so much simply.",
      "rate": 4.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Very close to airport",
      "text": "The Best Western Carlingview is much closer to the airport than some other hotels, which can save a lot of time.  Traffic jams and bad weather can cause big delays if you're staying farther away.  The shuttle bus operates frequently, unlike other hotel buses that go every 2 hours.  The rooms are well soundproofed but there is a small amount of noise from the jets, which wasn't a problem.  This hotel is well organized and a great place to stay if you're using the airport.",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Excellent location, clean rooms but lack of amenities",
      "text": "The front desk check in, cleanliness, location, sleep quality and quality of the room were excellent as expected from Best Western brand. Where it differed was in value. Price per night was at high end compared to other hotels and offered far less amenities. Note that every Best Western is independently owned and operated. This particular location does not offer any continental breakfast and charges $3 for a very small cup of coffee in the lobby. There is limited parking and no outdoor parking if you have a larger vehicle. We chose this location for the Stay, Park & Fly package but they could not accommodate our vehicle.Tatiana the front desk person was able to quickly locate an alternative parking for us to try at the regular Airport Park & Fly lot and arranged for us to get a shuttle back to the hotel via the airport once we parked there.It did not appear that the gym or pool were available either but even if they were by the time we got the parking sorted out it was quite late and we had to be awake at 5 a.m. the next morning.If you don't have a larger vehicle and don't need any amenities this is a great place to stay. Only because the price we paid for the night was high and the amenities low I am rating VALUE as low on this chart. Otherwise the room was extremely clean and comfortable and staff very helpful and friendly.",
      "rate": 4.0,
      "tripDate": " December 2022"
    },
    {
      "title": "Clean, quick and close",
      "text": "I stayed here for business travel during COVID-19, during an extended overnight flight layover and it did the job. The hotel was clean, check-in was quick and it's less than a 5 minute Über ride from Terminal 3. My room faced the airport which meant I could hear the low rumble of aircraft taking off during the night but it wasn't that bad that it bothered me.There are two things I base a hotel recommendation on; a comfortable bed and a nice shower with excellent water pressure, and this hotel had both of those. The TV was also wall mounted and larger than most hotel room TV's, which I appreciated. The coffee maker used the pod system, so if you are staying here for an extended period, you could use your own pods or a refillable one. The coffee was quite good, but I can't remember the brand they use.Due to COVID, all their other services and ammenities like the free breakfast and the gym, were closed, so I'm unable to comment on any of those. I would stay here again without hesitation.",
      "rate": 5.0,
      "tripDate": " May 2020"
    },
    {
      "title": "Disappointed at price quote....",
      "text": "I have stayed at this hotel numerous times. It is immaculately clean, great service, & the restaurant on site provides delicious meals at reasonable prices. There's really no need to go off the property to eat. HOWEVER I recently called to get a quote for a room for 2 people, 1 night (park'n'fly package). The reservation I want is for December 23. Yes, that far in advance, as our vacation package has us booked for an outbound flight Dec. 24. I was advised by the woman on the desk that as of the time I called, the room was $X., which I thought to be very reasonable. HOWEVER, upon learning of the date I was wanting, I was quoted a ridiculously higher price. She said that they base the cost of the rooms on the number of guests at the time I want. To me, when I'm quoted a price today...then told it will be $ higher for when I want, you can be sure I'll stay elsewhere. The woman also suggested to me that I wait 'til the 1st week in October to see if the price quoted would be lower. At peak travel time during Christmas, nobody is going to wait that long to book a room. I therefore said \"no thank you, I'll go elsewhere\", which I have already booked. By the way, Best Western the \"elsewhere\" quoted me $150.00 +tax for a one night stay, & 1 week parking which is there park'n'fly package. I asked if the price would go up when the reservation was indeed needed & I was told that \"No, we quote you a price today, that's the price you get it for..it won't increase'.No thank you, Best Western. You've lost a loyal customer.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "The whole hotel stay was a mess",
      "text": "I was there for a 3 day quarantine. The whole thing was a disaster. First of all, they ended up charging me more the price I had reserved and when I tried to inquire, the front desk manager was very rude to me and telling me they are charging me to tip them without even my permission. The food itself was garbage. I had to order food delivered even after paying over $1000 for a 3 day hotel stay. They only provide 1 500ml of water per meal and you have to buy if you require more water or juice. Don’t book with them and go with another hotel.",
      "rate": 1.0,
      "tripDate": " May 2021"
    },
    {
      "title": "Convenient Location",
      "text": "When travelling in or out of Pearson Airport, this hotel presents the best value for long term parking. Most spots are covered for winter snowfall protection. Unfortunately, we got there late in the evening and had to park outside. That's on us, not the hotel.",
      "rate": 4.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Horrendous customer service!",
      "text": "I am totally disgusted the way my friend and I were treated on our recent stay at the above noted hotel. Since 2017, I have stayed at this property 5 times and never had an issue, however, my stay from14/9/2022-18/9/2022 was a nightmare. First our room was not cleaned once in the 4 day stay. Apparently you have to make an appointment at the front desk to have your room cleaned. Leaving the sign on the door for housekeeping is no longer sufficient enough and we were never told we had to make an appointment and no where in the room or on my reservation does it state you have to do this. After accidentally finding out about making an appointment, we did that on Saturday night by calling the front desk and again on Saturday  morning in person at the front desk and yet our room still never got serviced. Late Saturday night a hotel employee drooped a plastic bag off to our room containing towels, garbage bags and bed sheets. What an insult to me as a loyal customer! Tis hotel expected us to clean our own room. Is this the new norm with this hotel? Overcharge/ price gouge customers and expect us to clean our rooms, change garbage and bedding etc! I will NEVER use this hotel in the future and I am doubtful I will use The Best Western brand again. The management and some of the staff could use courses in customer service. I am appalled by the disrespectful treatment we received at this hotel. I rate this place ZERO!",
      "rate": 1.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Great Value for Money",
      "text": "We booked this hotel for one night at the last minute as we found out upon landing from our flight from the Caribbean, that our connecting flight to Halifax was cancelled due to winter storms in Atlantic Canada. The front desk was very accommodating and let us stay in the same room a second night when our new connection was delayed another 24 hrs again, even though they were completely booked from all the flight cancellations. The food in the bar was fantastic and the servers kept our beer mugs replenished regularly. We have stayed in BW’s all over the world and they have always been very comfortable but this one is the best with top notch service and updated rooms. We will choose this hotel again whenever we have future layovers in Toronto.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Excellent Hotel by the Airport",
      "text": "We stayed in this hotel following a short trip to Niagara Falls.  It was awesome!  The hotel and rooms were immaculate.  The beds were great and our sleep was amazing despite the landing planes.  We were able to use the gym and pool (with a sign up sheet) and the kids were thankful for that.  The hotel is minutes from Pearson Airport and you can jump on the highway and go anywhere.  The hotel staff were absolutely amazing and super-responsive!  They were so good, in fact, that we impromptu extended our stay by a night and hit up Canada's Wonderland the next day!  Would recommend!",
      "rate": 5.0,
      "tripDate": " August 2021"
    },
    {
      "title": "Clean, satisfactory amenities - pet friendly!",
      "text": "We had a need for an overnight stay in Toronto with our dog - and this hotel is pet friendly and near the vicinity of where we were going.  The room was fine - the floor a little sticky from disinfectant we assume- but ok.  We did need to pay a pet fee, but it was reasonable compared to some places.  Breakfast was not included but there is a Coffee Time nearby and also a Hooters offering some food options.",
      "rate": 4.0,
      "tripDate": " April 2023"
    },
    {
      "title": "Extra fees!",
      "text": "I booked this hotel for my mandatory quarantine, for me and my 5 year old..When i booked I specifically put 1 adult 1 child and made payment for everything but two days later i got an email with a extra charge of 75$ plus tax per night for my kid and 50$ service charge, I understand now with covid everything is different but i wish i knew that the costo of the hotel would be 350+ extra to what i had already payed for.. because that’s important info! Overall it was ok because I understand we have follow protocola and we are there just to wait for the test but with a 5 year old food can get boring anyway we left after a day no big issues the hotel was ok just not happy with the hidden fee even if you call and ask they will say no extra and everything is covered because i did call and ask still got the email saying please know you will be charged extra ! 75$ plus tax for the kid! Shuttle bus was more than 20 minutes but i guess is not that bad. Clean room enough food vending machine available everything ok 👍",
      "rate": 3.0,
      "tripDate": " July 2021"
    },
    {
      "title": "Nice Hotel",
      "text": "This was a nice, clean hotel. Close to the airport, with shuttle service. Our room was spacious and included a King sized bed, walk-in shower, mini fridge, and microwave. We were a bit worried about our quality of sleep, being so close to the airport but we slept very well and didn’t notice the noise of the planes taking off/landing. Our only issue was that both elevators weren’t working when we came in after dinner. There are no indoor staircases, which was odd. A staff member brought us up to our floor, using the staff elevator, so it wasn’t a big deal. Overall, I would recommend this hotel for anyone needing a place to stay, close to the airport. I should also add that the front desk staff were very friendly and welcoming.",
      "rate": 4.0,
      "tripDate": " September 2021"
    },
    {
      "title": "Gracious staff",
      "text": "Staff was especially welcoming and friendly. Our room was clean and dog friendly.But we caught this hotel at a bad time. There were two elevators for guests but one was not working when we arrived. Then the second one failed as well. The security people in the lobby helped guests to find the service elevator to go up but any guest on the fifth floor who had baggage and a child was left wondering how to go down. Signs would have helped them. The HVAC in our room did not work and neither did our coffee maker. Coffee in the lobby cost $3/cup.Despite being next to the airport rooms seemed well soundproofed.",
      "rate": 3.0,
      "tripDate": " October 2021"
    },
    {
      "title": "Great location and value for your stay near the airport",
      "text": "I like this location because it is close ( 1 block)  to an Enterprise car rental that is outside the airport. That way I can save hundreds on picking up a rental car. I fly in to Toronto , take the hotel shuttle over and then walk up to the Enterpise. If you arrive late there are 2 restaurants 2-3 blocks from the hotel, that are open til after 12am.",
      "rate": 5.0,
      "tripDate": " May 2022"
    },
    {
      "title": "Rude Desk Staff - Dirty Bed",
      "text": "I was disgusted with the stay. I called Friday to speak to the manager. Did not hear back. When I checked out Sunday we again asked to have a manager call me. As of mid day on Monday I haven’t heard from anyone. My bed had dirty sheets on it. When I called down she told me to wait until morning. After saying they was totally unacceptable and some back and forth I finally convinced them to find a way to send me some sheets. In which I the had to change in my own.  If they were short staffed I should have been offered a new room. Was locked out of my room regularly I had 4 additional keys by the time I checked out. None in which worked.  When systems were down on Saturday we waited an hour after saying our keys didn’t work and just needed into our room. Finally asking for someone with a master key to please just let us in!  Awful experience. I stay at the convention centre often for events. Will never ever stay here again and I was there on a Friends and family from the owner of another location!",
      "rate": 1.0,
      "tripDate": " May 2022"
    },
    {
      "title": "Very run down hotel- avoid",
      "text": "Very run down and outdated hotel. This is a 1 star hotel at best. It is supposed to be a Best Western Premier, it is the worst best western hotel I have stayed at. Room was very run down, hotel has a musty smell throughout, bed was not comfortable, breakfast was not included and restaurant breakfast was not restaurant quality food. I highly do not recommend.",
      "rate": 1.0,
      "tripDate": " October 2022"
    },
    {
      "title": "Late check out not guaranteed",
      "text": "Prior to making my reservation I called the hotel to enquire about a late check out. I was told to ask upon check in. Which I did, which was promptly refused. I had booked the hotel specifically for this reason, having a late flight the next day, so I was not happy at all.The room was fine, although I question the need to make guests pay for using the safe.The shower needs looking at, the spray goes all over the place. An easy fix, but obviously overlooked by housekeeping.There is no power outlet next to the bed, to the extend that the alarm provided by the hotel is not plugged in.Upon check-out (at 12, since I could have the late check out) I was charged for parking. While I understand this to be normal practice, I feel guests should be made aware - on the website as well as during check in.I was able to leave my bags at the hotel (no charge this time), I appreciate this.Overall, the staff was friendly.",
      "rate": 2.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Very Good",
      "text": "Nice hotel. Stayed here for 1 night after arriving at midnight form a flight. Just 7 min away from the airport. There is a shuttle service running every 30 min during the morning and every 1 hour during the evening. I believe that they should maintain a 30 min frequency all day long, as I had an evening flight and had to wait almost an hour for the next van to leave. Rooms are big and wifi service is quite fast. My room was clean as well as all the hotel common areas.",
      "rate": 4.0,
      "tripDate": " August 2022"
    },
    {
      "title": "A POOR SLEEP BUT A NICE PROPERTY NEVERTHELESS",
      "text": "The check in was efficient. Had to fill out a small form re the parked car. I was only in the room a scant 12 hours. Its colours are eclectic. My room overlooked the entrance area, catching the evening sun. The room temperature was set at a very pleasant 70F/21C. Had a large bed. It was, however, a poor sleep. Duvets and I just do not get along. Never tried the television. There was a closet which held a small safe, iron and ironing board. I did not use the microwave. The coffee maker was simple to use but the coffee itself rather weak. A little fridge could be found beneath the microwave. There were two comfortable chairs, one traditional, the other on wheels. Almost had to go downstairs re the wifi but it eventually connected and was fine thereafter. An ice bucket is another nice touch. The property is just five minutes from the airport. You pay a bit more for location [just over $212 Cdn included a parking fee]. It seemed rather busy but the floor was quiet. The bathroom was clean. I liked having actual toiletries. The shower was good. There were plenty of towels and a hair dryer. All in all, it is a nice property but I was not well rested before the flight.",
      "rate": 4.0,
      "tripDate": " May 2023"
    },
    {
      "title": "Friendly, inviting and excellent service",
      "text": "It was really nice to stay in a place that resembled the pictures they advertise on the Internet. I can’t say enough good things about my experience at this location. Highly recommend it! The staff goes out of their way to make you feel welcome and at home, the facilities are clean and inviting, and it was perfect location for myself and my husband to get to the airport and for my business meeting at the Congress centre.",
      "rate": 5.0,
      "tripDate": " November 2022"
    },
    {
      "title": "Management",
      "text": "Called hotel one week prior to be told on telephone that I could book a one night stay and pay the $12 nightly parking fee to leave my car at the hotel for duration of my 7 day trip.On checking in I was then told this was not possible and also told by the manager on the telephone that no one at the hotel would have told me it was ……. i.e. I was not being truthful.Awful treatment of a loyal customer.",
      "rate": 1.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Quarantine Stay Exceeded Expectations",
      "text": "The price was crazy of course, but a better value than the other hotels on the list.  The beds were comfortable and the staff was super helpful answering calls and helping out when they could.  Food was delivered cold and the air a bit stale with no windows that open, but I certainly felt welcome and not like a hostage.",
      "rate": 4.0,
      "tripDate": " April 2021"
    },
    {
      "title": "Quarantine",
      "text": "Firstly gouging guests for a ridiculous amount of money due to a mandatory quarantine regardless if you have to stay three days. Also serving fish as meals without given a choice.  In addition, tried doing something nice for an individual that was staying there as part of the quarantine by trying to send a bottle of white wine. Was told no white wine as we are in a pandemic.  We have been in this for over a year now and you would think they would have there sh’t together especially since they were assigned as a federal government quarantine hotel.  Shame on you Best Western for not giving individuals your best during these difficult times. Will never recommend you for a stay at this hotel.  Shame on you.",
      "rate": 1.0,
      "tripDate": " April 2021"
    },
    {
      "title": "Solid stay for a layover",
      "text": "Take the airport shuttle from the airport if that's how you are coming in to avoid the ridiculous minimum cost of taxis (it's only a ten minute drive and they charge more than forty bucks). The room is solid and clean, and desk staff SUPERB at dealing with your short stay. One of the best airport hotels I've been to in Canada period.",
      "rate": 3.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Pleasant staff, shuttle to airport",
      "text": "The staff is pleasant and helpful at this location.  Shuttle driver is helpful with bags and safe drive.  The cost is a bit high, but location is convenient near the airport and parking available reasonably",
      "rate": 4.0,
      "tripDate": " November 2022"
    },
    {
      "title": "Hotel is close to airport",
      "text": "Hotel is close to Airport, morning staff were friendly.Restaurant at this hotel had a good selection.Meeting room was comfortable and nicely laid out.Coffee in the lobby cost $2.00, and nice selection of snacks available at the front desk.",
      "rate": 4.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Best hotel stay I've had",
      "text": "Looking for a good price in Toronto for a 10 night stay was a stressful nightmare, but i managed to get a decent price at Best Western. Considering the price I paid, I wasnt really sure what to expect for a room. Yet when i checked in, I was greeted with a nice, big king sized room, fridge and microwave which was helpful for my long stay. The bathroom was alrger than what i expect from hotel bathrooms, ans the open half glass wall shower made showering breathable (as someone who overheats easily). The internet was surprisingly fast and all of the staff I saw during my stay was amazing. I ordered from the restaurant once, and the server on that night was just as friendly and helpful. I have never had such a good stay in a hotel before. Thank you thank you thank you for such a wonderful stay! I look forward to my next trip to Toronto. I'll be looking to book here first.",
      "rate": 5.0,
      "tripDate": " March 2024"
    },
    {
      "title": "Won’t stay again.",
      "text": "Staff were rude, beds were definitely a double not a queen, everything in the hotel was overpriced, water pressure in the shower was horrible, plug ins didn’t work in the room, noisey and could hear the people in the next room clear as day laughing and talking all night which made it hard for the kid to fall asleep! Hottub was barely hot, steam and sauna room was old and out dated and loud when turned on and not hot or steamy at all either. Parking was expensive as well.",
      "rate": 4.0,
      "tripDate": " March 2024"
    },
    {
      "title": "Affordable Stay and Park",
      "text": "This hotel is not the most chic but it is very clean and mere minutes from the airport. I live two hours from the airport and loathe the idea of delving into airport traffic. Travelling is hectic enough! This hotel offers a one night stay rate with $10/day parking for your trip and a free shuttle that keeps you out of the airport melee. It is really a great solution and the staff are helpful, solicitous and courteous.",
      "rate": 5.0,
      "tripDate": " April 2022"
    },
    {
      "title": "135 Carlingview Drive",
      "text": "First of all, the service at the front desk of the hotel at the address 135 Carlingview Drive was really bad. I called the front desk around 10am on April 25 because my test results came back I wanted to ask how to check out. The receptionist's attitude was so bad that I just didn't hear what she answered and I asked: Can you please repeat that? Then the receptionist yelled at me and hung up the phone. I really don't know what I said wrong? I also didn't know exactly how I was supposed to check out, so I got my bags and went downstairs and the receptionist simply ignored me until I ask her to check my test results, which I think you guys are very irresponsible.Secondly, on the first night of my stay my dinner was messed up. I received pasta, but I am not a vegetarian. So I called the restaurant for a replacement. They told me they gave me the wrong bag and I didn't have dinner until after 8:00 and it was only four pieces of potatoes and a piece of fish, which I don't think it enough for any adult. At over $1,000 for three days, it was very much not worth the experience.",
      "rate": 2.0,
      "tripDate": " April 2021"
    },
    {
      "title": "Convenient, comfortable and clean",
      "text": "Needed location near airport for early flight with free shuttle to same. Best Western is a reasonably priced brand I know I can trust.  I was very impressed with modern décor of  room and bathroom  AND individual shampoo/conditioner- so hard to find these days.  They really got it right with a shower cap and make-up remover towelette.  Bed was extremely comfortable.   The room and bathroom were  sparkling clean.  Keurig coffee machine was a nice touch.  Definitely recommend this hotel. Due to covid didn't use pool/tub.",
      "rate": 5.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Beware of party hotel!",
      "text": "This hotel was used by guests to throw a party and gathering of more than 10 people and the hotel did nothing about it! This clearly breaks the bylaw in ontario.  They booked 3 rooms and had more than 12 guests between all 3. They were constantly moving between rooms slamming doors and screaming. I called to complain about noise and they did nothing except ask them to keep the noise down. I confronted the group in the hallways and counted more than 10 people. They claimed they weren’t breaking any rules because they had 3 rooms (however they were clearly all jumping from room to room together). I reported it to the hotel staff who I heard knock on their door and asked them to keep 10 or less in a room. They knew they were breaking the bylaw and let it happen! If it wasn’t after midnight and I was in desperate need of sleep I would have and should have called 311 and reported the party. The hotel should have done the same. Instead I continued to hear doors slam and screaming all night long. So much for a good rest before travelling. I travel often and would never stay here or at a BW again. Beware of this hotel.",
      "rate": 1.0,
      "tripDate": " October 2020"
    },
    {
      "title": "Do not waste money on it",
      "text": "I had a horrible experience here. The food is pathetic. I wasted 1050 CAD for worst possible service.They have no food menu, no choice. Not even a single alternative, they should not call it a menu.For today's lunch, they sent me freshly cut tomatoes, and carrots with a bag of chips after telling them that I am vegetarian.They forgot to bring me lunch yesterday, and when I called at 3:30 pm I was told that I might not have heard door knock, and they blamed it on me. After heated discussion, they gave me microwaved stale fries and a wrap.Water is charged at 2 dollars a bottle, even though GAA rate covers food.Some front desk people are horrible. My yesterday's calls were answered by someone who had zero value for guest service and hospitality.Stay away from this hotel. Total Money Grab.",
      "rate": 1.0,
      "tripDate": " May 2021"
    },
    {
      "title": "Good parking package.",
      "text": "My wife and I stayed for 1 night prior to our flight. The hotel is so convenient to Toronto Airport and their package pricing was very competitive. Very friendly and helpful staff. The rooms are attractively decorated and the walk in shower is a real plus. Very good towels and bed linens and the king sized bed was really comfortable. We would definitely stay here again",
      "rate": 4.0,
      "tripDate": " October 2020"
    },
    {
      "title": "Vacation",
      "text": "Stayed here the night before leaving for the Bahamas. The staff was very friendly and check in/check out was quick. This is the third time we stay here prior to travelling and we have always had great service. The shuttle service is very efficient and simple. When you check in, you simply let the staff know the time of your departure. When you return from your trip, you give the hotel a call and the shuttle picks you up within fifteen minutes of your call. Will definitely stay here again And recommend this to other travellers.",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Park and fly issues",
      "text": "Stayed here before going away for 2 weeks at end of January. Room would not warm up. Their solution was to bring a space heater. There was no follow up or apology. On returning in a snow storm we called to find out when the shuttle would arrive. Was told that he would call the shuttle driver to find out and then he hung up. No call to update us on where the shuttle would arrive. I called back (total of 6 calls made). Finally got told that the shuttle was coming but he would call the driver to find out. Hung up again. Finally with one of us in a wheel chair. Went out to the post specified by the hotel (37) and saw the shuttle at post 43. On my way there with the luggage the shuttle pulled away. Immediately called hotel. Same person said that he would call the driver and hung up again. Called again and was informed that the shuttle had returned to the hotel. Asked for a phone call when the shuttle was returning. After a 15 minute wait decided to take a cab at a cost of $21 plus tip. Received a call from the hotel that the shuttle was on its way when we were almost there. Let them know we were taking a taxi. No empathy or offer of recompense. Will not be going back there",
      "rate": 2.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Finally home in Canada",
      "text": "After flying in from Mexico early as a result of Covid-19 it was good to be back in Canada. The front desk was staffed appropiately and precautions were in place. Although the dining room was closed take-out establishment names were available, as well as a cooler with sandwiches,beverages and yogart for sale. I requested a room close to the elevator as I was walking with a cane and have  a bad knee. The shuttle driver  on both trips to airport was friendly and extremely helpful.",
      "rate": 5.0,
      "tripDate": " March 2020"
    },
    {
      "title": "Rudest manager ever!!",
      "text": "We've stayed here on numerous occasions.  Front desk staff are nice but under pressure from a very rude manager who needs some management training in customer service. Rooms are lovely and clean. Prices have gone up alot. Paid $222 for 7 days parking and 1 night stay. We will however never stay here again!!Part of attraction was the shuttle service however after a minimum of 6 stays here and giving numerous recommendations to friends,  last night totally disappointed.  Upon arriving at pearson at 2am we call for shuttle only to be told no shuttle service between 2 and 4am. Had to call for a cab to hotel. Upon enquiries with front staff  who were also rude, a discussion with the manager He so much as called us liars when we said we have never been told about no service and that we saw other hotel shuttle services at the airport at well after 3am.  He didn't allow front staff to speak for themselves and argued that they had told us about the time restrictions.  How would he know what we were told!!! This is the second time this particular manager has been very disrespectful but we thought we'd give the hotel another chance.  Wrong idea. No sense contacting best Western head office  independently owned and operated so no recourse. We will not be back and all of our friends will not be going either.",
      "rate": 3.0,
      "tripDate": " March 2022"
    }
  ]
}