{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Best Western Plus Toronto North York Hotel & Suites",
    "url": "/Hotel_Review-g155019-d188395-Reviews-Best_Western_Plus_Toronto_North_York_Hotel_Suites-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.0",
      "reviewCount": 925
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "50 Norfinch Dr",
      "addressLocality": "Toronto",
      "postalCode": "M3N 1X1",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2c/81/ab/6e/lobby.jpg?w=500&h=-1&s=1"
  },
  "description": "At the Best Western Plus Toronto North York Hotel & Suites you're sure to find that little something extra. With our modern amenities and thoughtful design, the Best Western Plus Toronto North York Hotel & Suites will stand out among other hotels in Toronto,ON. For the business traveler, a spacious work desk and free internet access are included in all our guest rooms to ensure you don't miss a beat while you're away from the office. For extended stays, each room provides a convenient in-room mini fridge that is ideal for drinks and snacks. We also have an in-house fitness room, so you can keep up your workout routine while you're on the road. As always, the Best Western Plus Toronto North York Hotel & Suites will provide you with the superior customer service that you are used to at Best Western® Hotels & Resorts.",
  "featues": [
    "Free parking",
    "Free High Speed Internet (WiFi)",
    "Fitness Center with Gym / Workout Room",
    "Pool",
    "Bar / lounge",
    "Kids stay free",
    "Car hire",
    "Business Center with Internet Access",
    "Parking",
    "Wifi",
    "Hot tub",
    "Indoor pool",
    "Heated pool",
    "Restaurant",
    "Vending machine",
    "Conference facilities",
    "Meeting rooms",
    "Baggage storage",
    "Newspaper",
    "Non-smoking hotel",
    "Shared lounge / TV area",
    "24-hour front desk",
    "Express check-in / check-out",
    "Dry cleaning",
    "Laundry service",
    "Self-serve laundry",
    "Air conditioning",
    "Housekeeping",
    "Room service",
    "Microwave",
    "Refrigerator",
    "Flatscreen TV",
    "Non-smoking rooms",
    "Suites",
    "Family rooms"
  ],
  "reviews": [
    {
      "title": "Excellent Hotel in a Convenient Location in Toronto",
      "text": "The hotel is a very nice facility in a great location in Toronto.  Modern rooms with excellent beds and large bathrooms.  Great wireless internet.  Clean and well-kept public areas.  Beautiful pool.  Friendly front desk and restaurant staff.  Great breakfasts with 15% discount for hotel guests at the restaurant. Highly recommended.",
      "rate": 5.0,
      "tripDate": " November 2022"
    },
    {
      "title": "Best location in North Toronto",
      "text": "Stayed here 11 ties in the past 8 months because location is great, seconds off 400 and a minute to the 407 so access to everywhere, downtown in 40 minutes in morning and 1/4 the price of a downtown hotel.  Good bang for the buck. It is under renovation but still plenty quiet for sleeping.  Restaurant is good reasonably priced and a good dinner menu.  Very good and friendly service that respond to any issues, TV remotes in the room are horrible and never seem to work and most of the time the channels do not respond is the only knock against the place.",
      "rate": 4.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Stay AWAY",
      "text": "If I could give this hotel 0 stars, I would. When we arrived, our room wasn't even ready yet. The room is not very clean, there are sticky weird stains all over the headboard there is dust on the furniture and the grout in the shower is filthy. They don't have cribs, as advertised on their website so we have to go and buy a safe sleep space for my two month old. They did eventually bring a pack and play they found in the basement that was FILTHY. I'm offended they expected my two month old to sleep on it, I wouldn't let a dog sleep on it. there was an incessant ringing noise coming from our toilet, and we had to shut the water off to the toilet for it to stop. We asked for extra blankets, and the gentleman who brought it up to us apologized and stated they only had one extra blanket in the entire hotel. The doorstop was loosely held in with one screw and fell off and the bathroom toilet paper dispenser is taped to the wall. This hotel is a dump, stay away.",
      "rate": 5.0,
      "tripDate": " September 2022"
    },
    {
      "title": "They solicit positive reviews only to provide the absolute worst of service.",
      "text": "It’s a Best Western so something is broken in the room. This time it’s 3 out of 4 lights, the toilet, and someone took the power plug to the TV. They argue with you if you want your room cleaned more than once a week and their do it yourself laundry services are constantly broken. They did offer to dry my clothes after I washed them and the dryer was broken but they in turn ruined $200 in cooking my clothes.  You would get better service at a homeless camp under an overpass.",
      "rate": 1.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Stay - March 2022",
      "text": "Not impressed, travelled in 2022 03 for a sports event. Cleaning was not done until Day 3 and needed a 24 hour notice request, clean beds had black hair in them, pool, hot tub and gym are were closed, restaurant was mostly closed. We ended up checking out early and moving to another hotel for the remainder of our stay which better suited our needs.",
      "rate": 2.0,
      "tripDate": " March 2022"
    },
    {
      "title": "Dirty Hotel. Never Again",
      "text": "The front desk representative did try their best to accommodate the hotels short comings with extra towels, etc. However, this was a dirty hotel. There was hair on the bed and the bathroom floor. The ice bucket, shower, toilet and sink all had dirt on them. The shower curtain had mold. The bed linens were stained. The towels had hair on them but were folded as if they were unused. The heating unit was sticky. We stayed at this hotel for a funeral. The soap gave 2 people who are not related rashes. The pool seems to be permanently closed but is advertised on their website. Other family members with different rooms had the same complaints as well as plumbing issues. Never again.",
      "rate": 1.0,
      "tripDate": " March 2022"
    },
    {
      "title": "Avoid this hotel",
      "text": "Terrible service, extremely rude staff, breakfast is not included, avoid at all costs. We had a horrible stay at this hotel. We booked our weekend stay back in February to receive the lower rates. We booked two refundable rooms as we had 8 people. As we got closer to the weekend we needed to cancel one of the rooms. After calling the hotel, I was told by someone claiming to be a manager that I was unable to cancel because I had a non refundable room and after arguing for a few minutes that I had in fact paid for a refundable room, the he got angry and told me I had to cancel my entire reservation and rebook a single room online. Of course two days before a busy weekend, there were no available rooms online at any hotels Including this one. I was forced to call customer service who had to work with upper management to get me a room at the rate I had originally paid after telling me this person was in fact NOT a manager and that he should not have done what he did. I was perfectly in my right to cancel one of my rooms. Additionally we had zero service during this stay - no replenishment of towels or toiletries for three days. Breakfast was NOT included as it stated on the website, resulting in an extra cost to us at over $200. The room was also dirty upon arrival. Upon checking out the same front desk person recognized my name and gave me a lecture on cancelling procedure and how I should come to the hotel next time to cancel in person which makes zero sense as we are travelling from away and the policy is to cancel 24 hours in advance. I’m extremely disappointed with this stay and I will not be staying again. However, the customer relations representative who dealt with my situation was extremely pleasant and helpful. If you just stay here and need to make any changes, do not call the hotel directly - Call the reservations line or customer relations.",
      "rate": 1.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Front Desk lack of training",
      "text": "We stayed overnight and after several repeated calls to the front desk (James), he did not care or attempt to control the noise coming from the adjoining room and hallway. The noise went on from midnight until 3am. Drained from no sleep, we checked out at 4am, after no action was taken by hotel from unruly guests. I expect more from this Best Western Plus chain, and will not be frequenting a Best Western again. My job requires I travel over 100 days a year. This chain of hotels I will be boycottingB. Mitton",
      "rate": 1.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Poor",
      "text": "When I made my reservation I was told breakfast was included with the price, as that was the deal on Expedia. We paid the price we agreed on but no breakfast was included. I was told we could add it on for 15$ a person. Our group had 5, total of 75 extra dollars for breakfast. T",
      "rate": 2.0,
      "tripDate": " March 2020"
    },
    {
      "title": "Surprisingly good",
      "text": "We stayed with our family of 4 3 different nights. Each stay, the rooms were very clean and in excellent condition. Better shape than more expensive or higher rated hotels. Suite rooms have plenty of space and 2 bathrooms. TV's are large, wall mounted in some rooms and have perfect signal / picture quality. Coffee maker is simple to use.Beds are comfortable. Sofa bed is hit or miss (like most hotels). Location is perfect if you are going to Wonderland, Vaughan Mills Mall or even ok if you don't mind a longer commute to downtown. But for downtown probably should pick something closer. Staff are really helpful and kind. They will make you feel taken care of as much as they can given the staff shortages in this industry - so give them a break :)Check the condition of the elevator though before using it.",
      "rate": 4.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Convenient, reasonable and a pool!",
      "text": "Comfortable and affordable, with  friendly staff. Pool is a great amenity and there’s an in-house restaurant that’s reasonable.  Currently being renovated so will be nice when complete.  Free parking and wifi, close to Hwy 400 for easy access north or south.",
      "rate": 4.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Positive Experience",
      "text": "Keyur has treated us with an utmost equal manner and we feel included at our stay. He listens and understand new comers issue and goes above and beyond to fulfill our expectations so that we can be a part and parcel of the Canadian Society. Keep up the good work Keyur, you truly deserve to be blessed in each and every aspect and we continue to stay at this location because of your services.",
      "rate": 5.0,
      "tripDate": " February 2024"
    },
    {
      "title": "Perfect service in a very busy hotel",
      "text": "Toronto was packed so we had to stay a bit of a way out but its manageable with the underground and lyfts. the hotel was buzzing due to local events but the reception and management handled everything calmly and efficiently and couldnt do enough for us. sadly they do not do breakfast but the attached restaurant does one of the best breakfasts that we had in the USA with the modt friendly of staff.",
      "rate": 5.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Management is incredibly rude.",
      "text": "The manager Nick is not helpful at all is incredibly rude and does not let his guests speak when they are trying to ask/explain something. He speaks over people and is incredibly unprofessional. I have never been spoken to the way he has talked down at me. He said things such as \"I will give them a piece of my mind\". When trying to explain something to him and he continuously spoke over me or interrupted I told him he was being incredibly rude- he threatened me with \"this message is being recorded\". I was only trying to explain something to him and continued to interrupt me when I was speaking. If this is the way he speaks to his customers, I can't imagine the way he speaks to his staff. Awful customer service.",
      "rate": 1.0,
      "tripDate": " February 2023"
    },
    {
      "title": "Poor Service",
      "text": "My tv did not work - I was told someone would come look at it and they never did. My hairdryer did not work - housekeeping did replace it but it threw off my morning.The restaurant closed at 1pm and never reopened. There is nothing within walking distance.",
      "rate": 2.0,
      "tripDate": " October 2022"
    },
    {
      "title": "Rooms are not clean!",
      "text": "Rooms are not very clean. There was stains on all the furniture , and toilet paper in the toilet when we arrived. Air conditioner was also not working. The one in our room turned on but did not make our room cold at all. The air conditioner in the living room wouldn’t even turn on. It was so gross and muggy in our room due to this. There was also stuff behind the bed on the floor. Also, the one light beside the one side of the bed did not even work. Just an awful stay!",
      "rate": 2.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Disappointing",
      "text": "The tubs are very slippery. I traveled w/ children. I slipped and fell. Staff is not concerned about guests well being, no offers to call for medical assistance. They don't deliver 1st aid to room. My son had to get it from reception. At check out I asked the incident be reported. I received a call shortly after checking out informing of a $25 discount. More concern at the moment of the incident would be greatly appreciated, especially when traveling with just children.",
      "rate": 1.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Lovely",
      "text": "I enjoyed my stay at Best Western.  The room I got was really great. But for some reason the AC in my room was turning off not I couldn’t change it cause my room got a bit cold.  Besides that, everything else was great.  The staff was great and friendly as well!",
      "rate": 5.0,
      "tripDate": " October 2021"
    },
    {
      "title": "Best western",
      "text": "Compared to the other hotels I stay at for the past 3 months, this hotel had the kindest staff of all. Restaurant good food, rooms are clean, wifi is very good. Location is not bad just that the constitution on the street makes it hard to get anywhere quicker",
      "rate": 5.0,
      "tripDate": " April 2023"
    },
    {
      "title": "Terrible stay",
      "text": "Blamed for smoking in room, don’t even smoke. Manager threatened to charge smoking fee. Worst place to stay. Will not stay there again. Room was not clean had some sort of liquid dried all over the head bed, had to clean myself.",
      "rate": 1.0,
      "tripDate": " July 2023"
    },
    {
      "title": "Excellent And My Favourite place for Stay",
      "text": "Great customer service! The man I spoke with Yash was very helpful in answering questions as well as helping in finding the best hotel for my husband and I.  The attention to detail provided by (Yash) was impressive and his customer service skills are excellent.  I really appreciate all the efforts that. From customer service department he put on solving my issue. I was pleasantly surprised. Great work! I cant thank him enough! Thank you so much for such a WONDERFUL experience.",
      "rate": 5.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Too far from downtown Toronto ",
      "text": "The hotel is too far from downtown Toronto (30min if no traffic)There are some fast food places around but you really need a car.There's a nice mall 12 min away, 'Yorkdale'.The room was nice.No safety box though.We found couple of cockroaches in the bathroom and room.",
      "rate": 3.0,
      "tripDate": " September 2023"
    },
    {
      "title": "Great services",
      "text": "Staffs are very professional. Provided a great service and gave us information about the mall.  Great experience.  Staffs will try their best to help you as much as they can.  Hotel is very clean.  And it is under re-modeling.  I am sure it will be even better.",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Room cleanliness is really poor",
      "text": "I had to change rooms three times due to hair on bed. The staff seem to be upset that I am asking for a clean room which is the bare minimum that a hotel should provide.  They made it seem that I am the bad one and made excuses about labour day and being booked. Regardless a dirty room should not be given to a guests. My daughter slept with all her clothes on as questioned the cleanliness of the bed even after changing rooms 3 times",
      "rate": 1.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Very Satisfied",
      "text": "I would recommend this hotel to everyone who are planning to spend some time in toronto. The hotel crew are really very fiendly. Especially in the reception a lady called Supriya and the auditor called Al Nawaz were quite talkative and very helpful. The hotel is clean, quiet and bed was very comfortable.  I would stay again there for sure next time i am in toronto.",
      "rate": 5.0,
      "tripDate": " July 2023"
    },
    {
      "title": "TERRIBLE & OVER PRICED!",
      "text": "Over priced and lacked cleanliness.  Rooms & contents are not very well maintained.  Front desk clerk was just okay and seemed like he was in a hurry. Garbage was left from the previous occupants, coffee maker was dusty/dirty on the inside (could not use), the bed sheet had a stain, the electrical outlet in the bathroom did not work, the radiator was extremely loud and the wall paper was peeling off, as well as, the faux leather of the desk chair armrests. The bathtub faucet was not attached to the wall/tile (needs to be re-caulked)  Wi-Fi and cable both cut off later in the night.  Did on enjoy our stay!",
      "rate": 2.0,
      "tripDate": " March 2023"
    },
    {
      "title": "Great place to stay",
      "text": "I've enjoyed a few nights at the BW Plus Toronto NY since fall 2022, and I I always feel like a valued guest when I stay there.. Al at the Front Desk is a great host and goes out of his way to accommodate me. He was especially helpful with some Internet issues I had on my last visit . The rooms he books for me are very comfortable, and the breakfast in the restaurant is tasty. I enjoyed using the pool and hot tub. Good value for money too. The location is also ideal for me since I travel to York U. for business and it's convenient especially when the weather is not good, since it's so close tot the campus.",
      "rate": 5.0,
      "tripDate": " March 2023"
    },
    {
      "title": "There's mold in the bathroom",
      "text": "Here are a couple of things we noticed:1. They use way too much cleaning products all throughout the hotel. Our room smelled like the inside of a mr.Clean bottle.2. There's mold in the shower and on the shower curtain. You can see and smell it.3. The hotel's amenities are OLD. The machines in the fitness centre are worn out.4. Their breakfast is gross. Do yourself a favour and don't eat there.5. The location is terrible. Make sure you have reliable transportation if you're staying here.6. I gave two stars because the people are nice and there's free wifi and parking.",
      "rate": 2.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Awful service/ gross",
      "text": "Don’t waste your money.  No flexibility over booked hotel on Expedia.. refused refund.    Pearson delays do not book here they don’t care…. Unlike other hotels like Hilton or holiday inn express they assist and care about future business.   This isn’t a $327 night hotel.",
      "rate": 1.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Go if you don't like quality",
      "text": "If uncomfortable beds and dirty amenities and being overcharged are your thing, Go here!  Sure to disappoint!   Enjoy disappointment at every level, and when you go to pay the bill, be consoled by the fact that \"Oh, it's going to get better in 2024!\"",
      "rate": 1.0,
      "tripDate": " December 2023"
    },
    {
      "title": "Mediocre hotel and bad location",
      "text": "Hotel is neat and all but location is really bad. If you are a tourist don't go for this hotel as it is really far from downtown. We thought it would be near york university but that too is not reachable walking but by car. Another thing is they took a deposit of 150 CAD even after I paid whole amount beforehand. I can understand taking a safety deposity but 150 CAD is too much for a tourist the hotel should understand that. Overall won't recommend for a tourist at all as i said beforehand really bad location. Though if you have business in North York it is decent. Please lower the safety deposit money though. I would have ranked the hotel higher if the security deposit was around 50 CAD.",
      "rate": 3.0,
      "tripDate": " December 2019"
    },
    {
      "title": "Dirty Room",
      "text": "There was dirty washcloths and garbage under the bedskirts long with food. Obviously hasn’t been clean properly in some time. The whole floor reeked of smoke even though it says smoke free hotel. The hallway was lined with garbage when we checked in after 3pm. We needed to ask for pool towels twice the same day as it was empty every time. Disappointed when paying well over $200 per night.",
      "rate": 2.0,
      "tripDate": " March 2023"
    },
    {
      "title": "Pleasant experience",
      "text": "Booking by room was a breeze since I prefer booking with front desk rather than a third party. Staff very helpful and attentive. Nice, clean room with King bed and full bath with enjoining room with sofa and another washroom with shower. Both rooms had big screen TVs. Recent decor updates including new cushy, broadloom. We were very comfortable and we are very fussy. Everything tastefully decorated and very comfortable. Room amenities in good working order. Thermostat in each room. Air quality was also very good. Not stuffy. Thank you to the helpful staff.",
      "rate": 5.0,
      "tripDate": " January 2022"
    },
    {
      "title": "Always Friendly Staff Happy to Help.",
      "text": "We often utilize this location for its proximity to Toronto Track and Field Centre. The staff is always friendly and happy to answer questions and give suggestions. The hotel is clean and the rooms are clean above standard. Internet connection was sufficient and beds are comfortable.",
      "rate": 5.0,
      "tripDate": " March 2022"
    },
    {
      "title": "Poor service and unchanged sheets",
      "text": "The bedsheets were not changed as we found hair, stains and other stuff on them. We called the front desk but the staff showed up telling us he didn’t do cleaning so we had to change the sheets ourselves. He brought us two old sheets not looking pleased. The cleaning staff didn’t leave us a change bathroom floor towel after we put the dirty one outside. The front desk staff were not friendly or efficient either. We didn’t feel welcome. The bedside outlet was dysfunctional and didn’t charge well. The room smelled stuffy. There was no complimentary bottled water at all. The internet worked fine. The little fridge was a help when we bought our own bottled water and other drinks. Compared with other hotels we had stayed, this one was not one we’d recommend.",
      "rate": 2.0,
      "tripDate": " May 2023"
    },
    {
      "title": "Horrible and filthy",
      "text": "we walked in our room and the smelly of mildew and dirty socks hit you. I made a special request for bedding for the pullout couch the was none in sight when I opened the couch there was dirty sheets on the bed  the mirror around the jacuzzi tub was filthy. The tub was broken and dirty paid extra for the jacuzzi tub room. The night stands and crusted dirt on them. We were told about the breakfast or wifi. They put us in a room beside to room under construction that started at 7am . We have photos of everything",
      "rate": 1.0,
      "tripDate": " June 2020"
    },
    {
      "title": "Looks like they trying to update the outside but rooms still need alot of work",
      "text": "First there was no breakfast option available, No Coffee available, and there seemed to be a Propane smell in the front lobby.  When I got into my Room, The Sink was Cracked, the tap was dripping (It could be seen that this tap was leaking for a while now)  The Bathub looks like it was replaced but the floor was lumpy....  When I went to turn on the bath tap, the handle fell off.  It was a loose screw but something that should not happen.....   This room needs to be updated.....",
      "rate": 2.0,
      "tripDate": " November 2021"
    },
    {
      "title": "Horrible experience",
      "text": "The staff spoke to us badly (screamed downright at us) and in addition they charged us the 2 days of stay without our consent on the credit card.For the room, everything was old and dirty (chair and lamps broken) and the bathroom which has a hole in the ceiling so much that the guest in the room upstairs took his shower and it leaked into our shower.Anyway, I will never go back to this hotel again.",
      "rate": 1.0,
      "tripDate": " September 2023"
    },
    {
      "title": "Worst stay ever",
      "text": "Room was smoked heavily even with complaints at first arrival . Had been ignored sent handy man to spray some what solution- said it will go away. Next morning complained again for a change of room , got denied manager on board said will send someone to spray OZONE solution will make it go away.  When we came back from day trip , Nothing had been done Smoke odors were big time to killed my eyes!The last day at check out we’re honored compensating with free breakfast!  It really would make my allergies go away!The other worst thing ( the closet is a joke a curtain size of 1/2 of a regular door!!!Management need to team up for customers satisfaction when staying Not to patch when leaving",
      "rate": 2.0,
      "tripDate": " May 2024"
    },
    {
      "title": "Nasty rooms",
      "text": "Rooms were disgusting. Cleanliness was horrible. Stained sheets.  room smelled like smoke. Plus they charged me for 3 nights and I didn’t even stay 1 night at this hotel. They wanted to give me a a third room after the first one smelled like smoke. The second one has stained bed sheets. I asked them to change it and they said that they couldn’t.",
      "rate": 1.0,
      "tripDate": " September 2022"
    }
  ]
}