{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Best Western Plus Travel Hotel Toronto Airport",
    "url": "/Hotel_Review-g155019-d236390-Reviews-Best_Western_Plus_Travel_Hotel_Toronto_Airport-Toronto_Ontario.html",
    "priceRange": "$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.0",
      "reviewCount": 1588
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "5503 Eglinton Ave W",
      "addressLocality": "Toronto",
      "postalCode": "M9C 5K5",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/29/33/be/a1/hotel-exterior.jpg?w=500&h=400&s=1"
  },
  "description": "At the Best Western Plus Travel Hotel Toronto Airport you're sure to find that little something extra. With our modern amenities and thoughtful design, the Best Western Plus Travel Hotel Toronto Airport will stand out among other hotels in Toronto,ON. For the business traveler, a spacious work desk and free internet access are included in all our guest rooms to ensure you don't miss a beat while you're away from the office. For extended stays, each room provides a convenient in-room mini fridge that is ideal for drinks and snacks. We also have an in-house fitness room, so you can keep up your workout routine while you're on the road. As always, the Best Western Plus Travel Hotel Toronto Airport will provide you with the superior customer service that you are used to at Best Western® Hotels & Resorts.",
  "featues": [
    "Parking",
    "Free High Speed Internet (WiFi)",
    "Fitness Center with Gym / Workout Room",
    "Free breakfast",
    "Bowling offsite",
    "Airport transportation",
    "Business Center with Internet Access",
    "24-hour security",
    "Wifi",
    "Breakfast available",
    "Complimentary tea",
    "Vending machine",
    "Shuttle bus service",
    "Taxi service",
    "Baggage storage",
    "Non-smoking hotel",
    "First aid kit",
    "Umbrella",
    "24-hour check-in",
    "24-hour front desk",
    "Express check-in / check-out",
    "Clothes dryer",
    "Dry cleaning",
    "Laundry service",
    "Self-serve laundry",
    "Washing machine",
    "Blackout curtains",
    "Air conditioning",
    "Desk",
    "Housekeeping",
    "Coffee / tea maker",
    "Flatscreen TV",
    "Sofa bed",
    "Complimentary toiletries",
    "Safe",
    "Sofa",
    "Telephone",
    "Clothes rack",
    "Iron",
    "Private bathrooms",
    "Wake-up service / alarm clock",
    "Microwave",
    "Refrigerator",
    "Electric kettle",
    "Hair dryer",
    "Non-smoking rooms"
  ],
  "reviews": [
    {
      "title": "Pleasant and very comfortable airport hotel",
      "text": "A very pleasant one night stay at this airport hotel. The room was comfortable and quiet - just what we needed after a long haul 15 hour flight from Hong Kong. The lady who drove the shuttle that picked us up from the airport was absolutely lovely - so sorry we didn’t get her name. Very nice and most helpful receptionist checked us in. A more than adequate breakfast served in the morning. Simple but everything you needed to start the day. Delightful young lady Jashndeep kept on top of clearing tables very efficiently. Thank you to all who made our one night stay such a successful one.",
      "rate": 5.0,
      "tripDate": " July 2023"
    },
    {
      "title": "Excellent service & stay",
      "text": "Had a wonderful stay, all of the staff (reception, housekeeping, waiter, other staff) are very helpful.The bed in the room we stayed in was very comfortable, they offer great discounts if you stayed there for 2 nights & a lot of different promos to choose from based on your preference.Room is very spacious.They also offered early check-ins and late checkout option, with a very minimal rates compared to other hotels.Shuttle service to and from the airport is every hour which is great. They also offered a wide variety for breakfast (included on your stay!), they have coffees, teas, juices, hot foods (different every day!), waffles, yogurts, different kinds of bread, etc.Hotel is very near to the airport so it's very convenient, I was able to catch my meetings after we have arrived in Toronto because of the location of the hotel and it's shuttle service!",
      "rate": 5.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Toronto Rescue Hotel",
      "text": "After checking into a Quality Suites Hotel near Toronto Airport the situation deteriorated quickly. I was checked into a room on the floor major renovations were taking place with noise , sawdust etc. Then Inoticed the toilet was not working or any taps. I called the desk and they advised they had a water problem and it would be off from 11.30am - 5.30 pm. I had planned to do laundry but was advised they didn t have a laundry either. I asked about the airport shuttle and was advised they didn t operate one. At this point I demanded my prepayment back and told them I was out of there...they also tried to keep that payment too. I took a cab to the Best Western and it was a different world. Excellent service , laundry , shuttle , good rooms , good breakfast , and the toilets and showers worked too.",
      "rate": 4.0,
      "tripDate": " January 2020"
    },
    {
      "title": "offer no service and blame it on covid AND when pople have a complaint to head office AT LEAST RESPOND DID nothing",
      "text": "if you don't offer the service don't show it on your website. When people check in Tell them we don't clean the rooms when you stay for more than 1 night, we no longer offer breakfast and the pool is closed. the pool i understand I do not understand the rest. BE UPFRONT ABOUT IT.I had a room with a king bed.the carpets showed where on the back of the door up by the closing mechanism had a stain of some kind. this room is 180 a night you expect a lot morefurther pool closed continental breakfast not served and they only give you new towels or make the room if you stay 3 nights and say this is due to covid.another company will do less and blaming it on covid.if the customer is not there leaves the room, what is the difference if they clean it after you check out the same sheets and towelsthe only way they give you fresh towels if you went and got them.O did I say they charge a prime rate for all these services yet do not provide them!And if they are not providing them the Customer should be told before check-in. May be big letters on the front door. O sorry people would go to one of the 5 hotels motels in the same area next door the is a motel. 89 dollars a night the do give towels rugs a worn no stains no pool and no continental breakfast O sorry that’s what this site offered.be very clear about what is provided.I check into any hotel I expect my bed made and clean towels that I do not have to go AND FETCH ON MY OWN. And when I pay a Prime rate I expect more. If you take parts out be upfront and tell people. Since you do not drop the rate they will go elsewhere.",
      "rate": 1.0,
      "tripDate": " October 2021"
    },
    {
      "title": "My overall experience at Best Western Plus Travel Toronto Hotel.",
      "text": "The hotel is beautiful with friendly and cordial management team, had very good memories. They maintained a safe distance with all the safety and precautions while providing food, during my quarantine,called me time to time to check up on me or whether I needed anything at the room. The food was good with varieties with fresh fruits all the time. I'd like to stay and even recommend my friends for this very hotel, while visiting Toronto. Overall rating on the service=10/10.I wish them all the best for their future endeavours.",
      "rate": 5.0,
      "tripDate": " February 2021"
    },
    {
      "title": "Over night airport stay",
      "text": "Most hotels were far over priced for an airport stay  we had an additional car with us and they were able to also give us a better rate. They answer the  phone personally and dont put you thru to a call center in Texas, great personal service.  Far enough from the airport that you don't hear the planes.  Shuttle to and from airport.  There was a great selection of breakfast foods in the lobby for our 4am departure. Thank you",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Overnight stsy",
      "text": "Very good hotel, excellent staff. Due to the Covid-19 the restaurant was offering take out for its guests, very wise and considerate decision. I would stay here again, the location is ABIT farther than other airport hotels, but everything you would require is on site.",
      "rate": 4.0,
      "tripDate": " March 2020"
    },
    {
      "title": "It was an 5 Star rating, 2nd stay shows the truth",
      "text": "We have been with this place some days ago. Awesome service, super helpful staff. First class breakfast. On checkout they offered the Best Western membership with 10% discount for further visiting.So we returned today. Payed with 10 % discount $164,30. On Expedia the room was $144...What a rip off.Then the staff complaint loudly to me my debit VISA card is not welcome.... They told me to note come back with that card and only today is an exception and if I could give them some cash for safety....Thank you Best Western, we won't. Not for that 90 days we'll be traveling Canada. We for sure will find places to stay where they welcome guests.If not for the first stay, you would get 1 star only.",
      "rate": 2.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Clean, friendly and good accessible room",
      "text": "We stayed there for 1 night and required an accessible room.The accessible shower facilities were perfect for our purpose, lots of space in the bathroom. We had a better than expected meal at the restaurant; breakfast also offered a better selection than the usual Best Westerns. The shuttle bus driver was so helpful, assisting with entering and exciting the bus.",
      "rate": 5.0,
      "tripDate": " August 2021"
    },
    {
      "title": "In the end no shuttle service: a disappointing finding",
      "text": "We stayed at this hotel in transit. Upon arrival the desk agent tells us that no shuttle is available at our chosen time only one 2 hours before and one 2 hours after but he can get us a taxi. We agreed and went down to wait for a taxi at the same time as the shuttle was supposed to leave but we saw no shuttle but many, many taxis were being utilized by guests to go to the airport. This has left us wondering if indeed there was a shuttle or rather, if the desk staff prefers us to use taxis...Next time I will not book a room there, I will spend the extra money on a better hotel. If I had known that staying there would cost me 25$ extra in taxi I would have booked a better hotel for sure. No, I will not go back.",
      "rate": 2.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Satisfied",
      "text": "The staff were friendly and the room was very clean and comfortable.  On site restaurant, Bite, had great food which was reasonably priced with very large portions.  Just beware of shuttle service from Toronto Pearson Airport, there is more than one shuttle with the other shuttle going to another Best Western Plus close to the airport so just confirm which Best Western the shuttle is going to before boarding it.",
      "rate": 5.0,
      "tripDate": " January 2024"
    },
    {
      "title": "Uninvited guest!",
      "text": "Someone tried to access my room at 5:25am one morning, while my 15-year-old daughter and I were inside. They had a key card that was able to open my door and only because I had the internal lock on were they not able to actually get in. The man at the front desk was rude and not helpful but admitted it was ´the driver’. This is completely unacceptable and unsettling. I contacted the hotel manager and Best Western customer service, and received zero response or acknowledgement for my concerns.",
      "rate": 3.0,
      "tripDate": " February 2023"
    },
    {
      "title": "Prompt, friendly reception",
      "text": "Transportation arranged via phone call to hotel, after picking up luggage from baggage carousel at YYZ. Only had to wait a couple of minutes at the Hotel Shuttle pick-up area when friendly shuttle van driver came by for pick up. Hotel was farther away from airport than I expected, but it still worked out. Arranged for a wake-up call and booked a ride back to Pearson at the desk. Ride back was prompt, but scary, as the driver was wavering in the lanes; thankfully there was little traffic that early in the morning. Had to leave so early, couldn't take advantage of the free breakfast. Room OK - unfortunately an expensive place to lay your head for 4 1/2 hours between flights.",
      "rate": 3.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Value for money",
      "text": "Very good service, clean and comfortable room, free breakfast, free wifi, free parking and reasonable price. Better than airbanb stays at same price (~$100 per night). We enjoyed our stays and staffs are very good.",
      "rate": 4.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Smoke odor in room",
      "text": "On July 31, 2021 at about 11:45pm, I checked into my room after 14 hours of travelling, for my room to smell strongly of cigarette smoke. I immediately called the front desk to report it, and the man at the front desk rudely told me \"what do you want me to do about it?\" I asked for a room swap and he said they were completely sold out for the night, which I do not believe is true. When asked for compensation, he said I can receive a free upgrade when I book this hotel next time, but I will never stay here again. Absolutely horrendous customer service.",
      "rate": 2.0,
      "tripDate": " July 2021"
    },
    {
      "title": "Business trip",
      "text": "Clean and well presented lobby and room.  Very friendly and helpful staff at check in and check out.  Excellent value for the money.  One of the best included breakfasts I've experienced with a good selection of gluten free options.  Comfortable beds and pillows - each time I've stayed here, I've slept really well. Will stay here again, for business or pleasure.",
      "rate": 4.0,
      "tripDate": " March 2020"
    },
    {
      "title": "Perfect for one night",
      "text": "The cab driver didn't know which Best Western Airport Hotel - apparently there are two and in fact, in one of the Booking.com confirmations they didn't list the address.  Luckily I figured out it was the Eglinton location as the cab ride was $30.00 - without blundering around. . Currently there only seems to be one shuttle per hour. Room was great for a one night stay and some food was laid out by 4.45 am.  If you get in late, the Irish pub just down the street has very good food and service.",
      "rate": 4.0,
      "tripDate": " April 2022"
    },
    {
      "title": "Excellent!",
      "text": "This will be my new go to Toronto airport hotel. Very friendly staff, room was great, included hand sanitizer/wipes as well as the other usuals. Breakfast was pick up and go with good options, good coffee and a place to refill water bottles. Late check out was accommodated and the airport shuttle runs on the hour and is quick. Couldn’t ask for anything more!",
      "rate": 5.0,
      "tripDate": " March 2021"
    },
    {
      "title": "Perfect provider",
      "text": "Hotel was clean and had a smart look to front entrance.  Room had a nice size to it with a refrigerater, microwave, couch, table and nice chair to sit on and write notes or make phone calls.  TV was excellent with lots of channels to choose from.",
      "rate": 4.0,
      "tripDate": " March 2020"
    },
    {
      "title": "Always Superb !!!!!!!!!!!!!",
      "text": "Good day Team BWPTHTAMy relationship with best western is around 8 years and I am really happy the way we get along, this time also it was great experience in all regards.The only humble suggestion is regarding the booking of  room with 2 queen beds when someone is taking room with 2 queen beds he/she is assuming that we can have 4 adults in the room , but it was not like that , I need to pay for my 2 kids 14 and 17 10$/head extra , other than that everything was superb.Here I want to mention the superb / tasty / fresh / warm  morning breakfast it was brilliant , best in any class , lot of choices and specially AMAN and her crew treats us soooooooooo good Thanks for that and happy new year   CheersAamir Sheikh",
      "rate": 4.0,
      "tripDate": " December 2019"
    },
    {
      "title": "Unreliable shuttle bus from airport",
      "text": "A group of travellers waited 70 minutes in the evening for the hotel shuttle bus from the airport that the hotel said ran every 40 minutes. We found the driver and the staff at Reception rather grumpy.  The hotel seems old and tired and our room had a dirty shower.The redeeming feature was the helpful day staff who took care of something I had left in the fridge until I could come back for it.  Also there is a useful Subway across the road.",
      "rate": 3.0,
      "tripDate": " April 2023"
    },
    {
      "title": "Service Makes the Difference",
      "text": "This was not our first time staying at this hotel. We use it as a place to park our vehicle in Toronto when flying out of Pearson, and then are able to stay overnight when we fly back in. The parking fees are probably not much different than you would pay right at the airport parking lot, but it is the worry-free convenience and the personal service that we appreciate. We had outstanding service for the shuttle to and from the airport, this time the best ever with hardly any wait time. Direct, without all the stops that were the case from other hotels or parking spots years ago. When you are tired, this convenience is priceless. As well, we appreciate the convenience of parking on-site, no transfers of vehicles, no handing over our keys.The room was great, an upgrade from our reservation, and with all the conveniences we have come to expect. The included breakfast was adequate for what we needed, but fell really short of what we had just experienced on our tour of Spain. The menu changes daily, so besides the usal cereal and waffles, boiled eggs and chicken sausage was not that appealing. Higly recommended for a Travel Hotel. The mangement has it right in terms of service. We would definitely stay here again.",
      "rate": 4.0,
      "tripDate": " October 2022"
    },
    {
      "title": "Slightly Above Average, Clean, and Affordable Hotel",
      "text": "Arrived half hour early and was able to check in with no problem. Front desk person was cordial and efficient. They are doing some slight parking lot construction renovations but it didn't affect our stay in any way. The hotel is located about half hour outside of all the main Toronto touristy things a traveler may want to visit such as CN Tower, Hockey Hall of Fame, St Lawrence Market. Our room was on the third floor and we had no issues. It seemed very clean, the bed and pillows were comfortable, the AC worked great. Bathroom has a full tub and the water pressure was great compared to some hotels I have stayed at. There is a restaurant in the hotel but we did not go to it. Overall I would say it is a slightly above average hotel stay and the pricing compared to other Toronto hotels is much more affordable.",
      "rate": 4.0,
      "tripDate": " June 2023"
    },
    {
      "title": "Our go to Location!",
      "text": "Anytime my husband and I travel  close to this area, we always stay at this Best Western location. The front desk is always accommodating and very professional. The room was very clean, and the bed was very comfortable to sleep in. I would recommend this location to anyone!",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Clean, comfortable and great location",
      "text": "Highly recommended. Excellent service, everything was extremely clean and beds were very comfortable. Breakfast was still available (thank you for not getting rid of it completely) but was adapted due to COVID (i.e. bread rolls individually wrapped). Location was very easy to find and get to as well.",
      "rate": 5.0,
      "tripDate": " December 2020"
    },
    {
      "title": "Over-priced & fails all expectations for airport hotel experience ",
      "text": "Although charged $50 for early check-in, we proceeded to wait for an additional hour to get in the room. The \"free\" shuttle to the airport ended up more expensive than a taxi after charging our family of four extra expenses for suitcases... even though we we the only people on the 5 am shuttle. The restaurant is closed fir renovation and the only opion for any food or drink outside breakfast is a vending machine with drinks. Overall, a very unsatisfactory airport hotel experience.",
      "rate": 1.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Very nice hotel at excellent value",
      "text": "I was staying foran over night flight from Pearson and reluctant to take a shuttle. This hotel shuttle was operated by the hotel and came immediately to pick me up and dropped me off at the airport promptly at Pearson the next morning. The take out breakfast was huge, the staff friendly and the room an excellent value. Highly recommend. My wife will be staying there next week following my excellent experience.",
      "rate": 5.0,
      "tripDate": " October 2020"
    },
    {
      "title": "Awesome",
      "text": "Even though the bus service was not available at Toronto airport, they made me take Uber and compensate the fare.The receptionists were all good and professional. Breakfast was good . I will recommend everyone to stay here and take advantage of the good services.",
      "rate": 5.0,
      "tripDate": " March 2022"
    },
    {
      "title": "Great place for a overnight if you are flying from Pearson",
      "text": "Breakfast was great.  Service was very good.  Beds were very comfortable.  Liked the added touch of the coffee machine in the lobby.  The shuttle service was slow to pick up at the airport, but it saves the $42 dollars on a taxi.",
      "rate": 5.0,
      "tripDate": " February 2023"
    },
    {
      "title": "BWT is a good place to stay",
      "text": "The front desk staff were very pleasant,  friendly and very helpful when we came in. Our rooms were clean and big enough for 2 adult people, bed was comfortably good and the pillows were just right!. Dining staff were also very pleasant and efficient. The food was just right on terms of amount so that nothing goes wasted. They also had healthy options. The person who cleans and fixes our room daily is also very pleasant and efficient! I am surely coming back next time! -Arlene C.",
      "rate": 4.0,
      "tripDate": " August 2023"
    }
  ]
}