{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Beverley Place",
    "url": "/Hotel_Review-g155019-d253003-Reviews-Beverley_Place-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.0",
      "reviewCount": 63
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "226 Beverley St",
      "addressLocality": "Toronto",
      "postalCode": "M5T 1Z3",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/02/4a/7b/a0/living-room.jpg?w=500&h=-1&s=1"
  },
  "description": "Beautifully restored 1887 Victorian houses in the heart of downtown Toronto. Minutes walk to restaurants, shopping, theatres, University of Toronto, etc. Central air conditioning with electronic air purification. Free Wifi. TV in all rooms. Full breakfast included (in front of wood fireplace in winter). Individual fire escapes with each room. Immaculate and well-maintained. Daily housekeeping.",
  "featues": [
    "Free High Speed Internet (WiFi)",
    "Wifi",
    "Free breakfast",
    "Non-smoking hotel",
    "Air conditioning",
    "Non-smoking rooms"
  ],
  "reviews": [
    {
      "title": "A Gem of a find",
      "text": "We just returned from a 3-day stay in Toronto. We went up for the Toronto Film Festival, and were closed out from all of the hotels in the downtown area. We were too late, and all , in our price range, were completely sold out.  I spent two days surfing on the internet for a place to stay, and somehow ended up on a B& B site.  This place sounded lovely and seemed to be unbelievably centrally located.  I read about it on this B & B site, then checked with tripadvisor.com, and then coincidentally found it listed in the US. AAA Ontario Tour Book with a 3-diamond listing, and best of all THE PRICE WAS RIGHT!!!Well, we visit Toronto often, and have stayed in some very nice hotels,BUT we will never stay anywhere else again. The Beverley Place B&B is superb. The location is wonderful, right at the University of Toronto, on a major cross road, College Street, with easy access to streetcars and the subway system, plus it is in  walking distance from everything.The rooms are wonderful, clean and quiet, and the beds new and super comfortable. The sitting area is  lovely and the breakfast a joy. The breakfast is served at a large round table where the guests find it easy to talk and interact with each other. At three days of breakfasts we talked with other guests from, Holland, London, France, Ireland, Buffalo, New York, Madison, Wisconsin, Montreal, and India. Served for breakfast is; cold cereal, french toast, hard-boiled eggs, scones, fresh fruit, toast, coffee, and orange juice. Also, there is off-street parking available for the guests at an additional $8.00 a night, which is a very reasonable price. We parked our car and only used it when we absolutely had to. Upon our return our reserved parking spot was always there for us.Finally, if you stay at the Beverley Place, be sure to take a short two block walk to Baldwin Street for a fabulous eating experience. There is a small but marvelous area there with a ton of ethnic restaurants, all of them with terrific menus and reasonable prices; Inidian, Thai, Japanese, Chinese, Italian, Vegetarian, Mexican, and more. Enjoy your stay in Toronto, and make it even better with a stay at this lovely B&B.",
      "rate": 5.0,
      "tripDate": " September 2005"
    },
    {
      "title": "The Rooms! The People!  The Food!",
      "text": "Had to make a quick trip to Toronto and was fortunate to discover the Beverley B&B, unfortunately for us, for one night only.  The first impression was the interior design of every room.  It's very obvious the owner has exquisite taste.  Our room was so comfortable with all the amenities anyone could ask for.  The host/employee who checked us in was very friendly and down to earth.  You could tell he was proud to be a part of this business.  The owner served a delicious full breakfast with many choices, all the time creating a friendly relaxed atmosphere. Although this B&B is smack dab in the middle of downtown, the rooms are so quiet that you'd think you were in the country.  If anyone can find something to complain about, they're way too picky.  I'll be back!",
      "rate": 5.0,
      "tripDate": " October 2005"
    },
    {
      "title": "A beautiful place to stay.",
      "text": "This place is amazing.  I stayed here last fall and was very pleased with the service, the quality of the beds, the location, the parking and you can't beat the price.  Highly recommend.",
      "rate": 5.0,
      "tripDate": " September 2005"
    },
    {
      "title": "Very Bad Experience Here!",
      "text": "I booked a specific top floor room with ensuite bathroom 7 weeks in advance of arrival. All details were confirmed in writing by the owner and I re-confirmed two days before arrival. On arrival I was told that I had been moved to a room in the basement, which I quietly refused to take. Was offered a room in a building across the street with no electricity and a bathroom at the end of a long hallway. In the end, a single woman who is a senior was left sitting on their porch all alone trying to find a room for the weekend at 4 pm on a Friday. Owner was on site but never appeared to explain or apologize. Staff kept running back and forth between me and the owner while he hid. Shameful and unkind behaviour by the owner. Staff were kind to me.",
      "rate": 1.0,
      "tripDate": " May 2022"
    },
    {
      "title": "They canceled our reservations 3 weeks without talking to us",
      "text": "We booked our two rooms in February 2022 for August.  At that time the owner was very nice and assured us that we would have a great stay.  The Third week of July, we got an email telling us that they were cancelling our reservations because they got a better offer.  No warning, nothing.  We had to scramble to find other accommodations since it was so close to the date or travel.  Do not trust this guy to keep his word. So unless you book more than two rooms and for more than 4 days, be prepared to have your reservation cancelled out from underneath you with no warning.",
      "rate": 1.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Owner Cancelled Reservation Because Had Longer Booking for Higher Rate",
      "text": "I had booked two rooms back in February for two nights in August.  Beverley Place had sounded wonderful and was in a convenient location.  The owner, Bill, seemed nice.  We confirmed by email and I followed up every couple months.  I checked again in early July.  Bill confirmed we had the two rooms we requested with private baths.  I think the next day he called and wanted to move one of us to another building, since he had people that were booking more than 2 nights.  I was unhappy and said I would talk to my friend and get back to him.  He then sent an email canceling our reservation.  Said \"there were too many problems\".  Bottom line was that he could get more money from a booking now, than when we made the booking when he had few customers.  We are having to pay more for hotel rooms booking the month before our trip than we would have had to in February since most hotels are full and the other bed and breakfasts I checked were full.",
      "rate": 1.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Weird policy",
      "text": "I was trying to book a room with ensuite for one night a couple of months in advance for an elderly couple.  The receptionist was willing to take my booking but would not guarantee the room saying that people who book for longer than one night take priority over my booking and could 'bump' my friends into a room with shared washroom.  Hardly 'customer service'.  Clearly not all guests are  deserving of equal treatment at this bed and breakfast.",
      "rate": 2.0,
      "tripDate": " January 2004"
    },
    {
      "title": "Awful breakfast nice room",
      "text": "We stayed at the Beverely Place B&B in September.  We were in the house at 226 Beverely place (there are 2 houses one across from the other).The room was nice, large, bed was fair.  What was really strange was the breakfast.  When we arrived in the breakfast room there were 2 large bowls of dry cereal on a side table, a bowl of cut up fruit on the main table as well as some hard boiled eggs, jam and peanut butter.  The woman in the kitchen (she never introduced herself, but she was not the owner) came and asked if we wanted toast (not what kind of bread) and scrambled eggs.  We said yes.  We got one piece of rye toast.  The eggs she brought out in a bowl and served to the entire table.  They were fried in oil, not butter or margerine, but oil, they were greasy and tasted just awful.  Next day I opted for the piece of toast and the hard boiled egg!  Not the kind of breakfast I normally expect from a B&B.  Still, the place is ideally located, and has parking for only $10.- a day, so if you don't care what you eat, go for it.",
      "rate": 2.0,
      "tripDate": " September 2006"
    },
    {
      "title": "Rotting Mice Behind the Walls",
      "text": "The only good thing about Beverley Place is the location.   It is within walking distance to everything in downtown Toronto.  It consisted of two houses across the street from each other.  The rooms were very dark and did not have adequate lighting.  Each person is supplied with one very thin ratty bath towel.  The bath mat in the bathroom was thin and full of holes.  There was a piece of dental floss lying just outside the shared bathroom door that remained there during the duration of our stay of four nights.  The second shared bathroom was downstairs and  always smelled bad.  We found out from the owner the day we were leaving that there were dead mice rotting behind the walls causing the smell.  The closet had bent wire hangers so nothing could be hung.   We could never get internet from the room we stayed in, we had to go across the street to the other house.  The living room in both houses were always locked at night and only accessible in the day when none of the guests were home.   So the only place one could relax after an adventurous day in Toronto was in your dingy room.The breakfast was interesting and so bad we never returned for another breakfast.  We had to run across the street in the pouring rain to the main house.  The time for breakfast was open between 8 am to 10 am.  We got there approximately 9 am.  The table did not have enough room for the number of guest so everyone was jammed around the dining room table.  The breakfast consisted of three grocery store cereals, a bowl of cold boiled eggs with the “best before date” stamped all over them,  a bowl of cold scrambled eggs with only a few chunks left and the only decent thing left on the table were the scones.  I don’t know if they were homemade or something purchased and reheated. In the house we stayed in had articles about Beverley Place framed in the halls.  It apparently won awards and was quite the place in the mid 1980’s.  It is just too bad it never maintained the status it once had.  I would never stay or recommend anyone this place.",
      "rate": 1.0,
      "tripDate": " June 2010"
    },
    {
      "title": "Thanks to TripAdvisor",
      "text": "Thanks again to TripAdvisor for coming up with the goods! Beverley Place is the ideal place to stay in Toronto when you don't have your own transport. The accomodation is spotless, host friendly and the breakfast was really good too. If you are coming in from the airport forget taxis etc just use the public transit system. We took the bus from the airport to Kipling (end of the line) and then the Metro to Queens Park (a 5 minute walk). Quick, simple and under $3!! I don't think it took more than 50 minutes 'door to door'.Another suggestion, if you want to go to Niagara Falls, the local bus goes from the garage just off Dundas (15 mins walk) for $35 return. Most of the organised trips we saw were $90+.",
      "rate": 5.0,
      "tripDate": " July 2006"
    },
    {
      "title": "Our Home-away- from-Home in Toronto",
      "text": "We stay at Beverley Place every time we go to Toronto. This time it was with our entire B.C. family. and 2 friends (we used almost all their rooms) for my daughter's wedding. Everyone loved it. Because it is a converted house (or rather 2 houses across the street from each other), all bedrooms are different - but that's part of the charm. You indeed have to carry your luggage up the stairs - but good luck trying to find a B&B anywhere in a house with an elevator! The breakfast (sometimes served personally by the owner, Bill) is marvellous. Fruit, cereal, homemade biscuits(!), French toast, scrambled eggs (not, contrary to another review, one or the other), toast etc. And you sit around a large table - and get to meet a lot of interesting people.A word about the third floor in the \"main\" (i.e. breakfast) house. It is quite unique. Indeed, lugging bags up there can be a challenge, but it was just right for our daughter, her husband and 10 year-old son and 8 year-old daughter. one of the 2 bedrooms is very spacious, with a queen bed, and a single bed in an alcove. Perfect for the daughter. It also has a beautiful patio attached.Their son slept in the other room, with its own bathroom. Absolutely perfect.Parking: There is a charge of $15 a night for parking. It is a bargain, as there is No other place to park. all of Toronto has permit parking only on residential streets. Park on the street and you are almost certain to get a ticket. You reach the parking from the street behind through a very narrow lane.Location: It is virtually next to the University of Toronto. There are no hotels anywhere nearby that I have seen. It a short walk to Kensington market (a must-visit), and to the tram car line that will take you to the CN tower area (fare: $2.10).Review by Barry Whaites (not Donalda)",
      "rate": 5.0,
      "tripDate": " May 2017"
    },
    {
      "title": "Great Location, Great Facility",
      "text": "I have stayed at Beverley Place twice in the past two years. Both times the rooms were elegant and comfortable.  The location is perfect - walking distance to the University, shopping, dining and entertainment. Staff is very professional and helpful. Breakfast is a wonderful way to start the day - a hearty meal and interesting company, usually from many different parts of the world.",
      "rate": 5.0,
      "tripDate": " April 2011"
    },
    {
      "title": "Convenient to U. of Toronto",
      "text": "I stayed here for a business trip at the University of Toronto.  This place is less than 5 minutes walk from campus, and so is incredibly convenient.  My room was adequate, but nothing special; I paid less to stay in a basement room, and perhaps other rooms are nicer.  The dining area is beautiful.  My one complaint is the somewhat inconsistent way breakfast is served; the lady serving breakfast would sometimes offer toast or scrambled eggs to some people, and not to others. Although they say they take credit card (and will request the number from you) they really want to be paid in cash.",
      "rate": 4.0,
      "tripDate": " May 2007"
    },
    {
      "title": "Great stay",
      "text": "Beautiful house. We had 3 rooms with 6 adults. Lots of space, clean and just a 10 min walk to downtown Toronto. Very Nice breakfast and very helpfull housekeeper. I Recomment this Place . Several good restaurants nearby. Chinatown around the corner.",
      "rate": 5.0,
      "tripDate": " July 2019"
    },
    {
      "title": "My new place to stay in Toronto.",
      "text": "I loved my stay at Beverley Place. My room was on the third floor and had an ensuite bathroom as well as a beautiful white iron rod bed. On Saturday, breakfast was served by Paulden, who was lovely, and on Sunday, by Jean-Claude, who was also lovely. Coffee, juice, homemade scones, eggs, toast, french toast, and fruit are set out. I had amazing conversations with interesting guests and the host, Jean-Claude. For Toronto, I’d consider this a budget hotel. The location can’t be beat. UofT is just steps away, and so are many food choices. It’s a very short 6 minute walk to Queen’s Park station. Looking forward to meeting Bill on one of my next visits. The large ornate painting of him drinking coffee in the breakfast room with his baseball cap on backwards is fabulous. I’ll be telling all my friends about this place.",
      "rate": 5.0,
      "tripDate": " January 2018"
    },
    {
      "title": "Intentionally furnished, beutifully detailed, and wonderfully relaxing comfort.",
      "text": "I took a getaway weekend to relax and treat myself in the city of my youth and I wanted somewhere private to explore as a tourist all over again. Beverly Place delivered and then some. Older and historic neighbourhoods are idilic settings and  are one of the best ways to experience Toronto. A stones throw from U of T and the rebranded Innovation District with the MArs Centre and worlds bets hospitals, Provincial Legislature, The Art Gaallery of Onatraio and of course China Town and Kensington Market, it's unbelievably placed. Finding your way around is a snap. I arrived later than I expected and was told the key would be in the mail box and a sign on the room door. I entered the front door of a well manicured and visually sunning brownstone, one of the best looking on the street. The owners insisted on removing shoes and I could tell why. The floor runners and carpeting were luxurious and respected the Victorian treatments in every corner. The House was not only immaculate;lyy furnisly furnished with pepriod pieces, the quality was remarkable. A Grand piano stood at the front of the sitting room which extended the width of what was quite a substantial home.  Up the first flight of stairs, I landed on the second floor. Large mirrors, and a wonderful umbrella and coat stand took up space along with other pieces of substantial hallway furniture adorning the hallway, the familier, deep, Victorian 'Rose\" colour throughout matched the deep thick runners. My room - number 5 - at the top of the house was aup a narrow staircase further on. Once I got the right key in the lock the door opened to a spectacular  four poster Queen in white linen with enough pillows I knew I was in comfort. The room was large and l-shaped. The double doors to the deck drew natural light in. The centre of the room beyond the bed hosted two oversized mission style blond oak rocking chairs sitting on a wonderful what I first assumed was a classic period area rugh. A smaller yet substantial day bed - sley bed like arms -  was similarly conforted by white linen treatment and bolstered arm rests - more diplay of luxury. The side wall housed an inset cupboard with room for all my clothes to hang, a microwave, and a small bar fridge. The bathroom door opened to a completely contrasting modern three piece bathroom in black marble and striated green walls and floor.  In the room, a fireplace in the corner reflected similar marble, which, along with the peaked ceiling above the louvered French doors to the deck were the only modern references. I realized each piece of furniture was intentional. The oversize rocking chairs sat on a carpet not of traditional flowered Victoria pattern, but of a South West almsot Navaho cubic design to compliment the seating. A curious writing desk took up its own wall near the day bed, referencing a Scottish early 20th century deco  Glasgow School motif in its hardwar, but with familiar dark red wood - perhaps cherry. Noticing detail became a game of sorts. The caharacter of the home, its rooms, its tastefull and intentional furniture, and wall art also, held new interest the longer I stayed The character of the nieghbourhood and it's surrounding cutltural attractions similarly held new treasures, and I started one of the most memorable weeknds in a long while. Toronto is a place to explore, the unique, and the trendy of course, are around every corner. It's worth exploring Beverly Place for yourself - one room at a time. Quick notes:I slept late and missed breakfast and other guests - hey, it's your time, never feel pressured to conform! The City is  24 hours - from chain drug stores and coffess shops, to early morning eateries, regardless of your schedule - so don't rush.Don't overplan - take it as it comes - I didn;t see south of Queen, North of College, and other neighbourhoods like Cabbagetown. Go back again. I wouldn't reccomend it but I didn't meet Bill until the morning I left, and paid full in cash then. Bill is wonderfull and full of zest - he really fits in with the house. Next time I would love to listen to him for a while. In the end, it's not a hotel. Sit back and relax. Hope this  helps you  - enjoy your stay!",
      "rate": 5.0,
      "tripDate": " June 2015"
    },
    {
      "title": "Victorian gems in the heart of downtown Toronto",
      "text": "If you are the BnBs kind of type and you are looking for a stylish and affordable place downtown Toronto, then you should seriously consider Beverley Place. Located just a block from the A.G.O. and just literally steps away from Dundas Square, Chinatown, Kensington Market and the University, these two Victorian houses are quiet and simply gorgeous. We chose the bedroom with shared bathroom, given the convenient price that beat any discounted hotel rate you could find on line (especially in a high season period like August). We were very happy with our choice, we loved the elegance of the common areas and the hearty breakfast served by our lovely host. I can't wait to be back!",
      "rate": 4.0,
      "tripDate": " August 2012"
    },
    {
      "title": "An oasis in a crazy world",
      "text": "A medical emergency found us at Toronto general for five days. I stayed two nights in a large expensive unnamed hotel very close to the hospital amongst the chaos of sirens, police, noisy people in the halls, elevators, crowds, etc.  Beverley place was recommended to me by a friend and I  spent a couple of nights there while the waiting for my husband to be discharged from hospital. It was a beautiful, clean,  comfortable, quiet haven in a lovely neighbourhood, a welcome escape after the stress of a hospital visit.  Bill  was so kind and accommodating with my uncertain  schedule. I  highly recommend it and if I am in that area again I’ll definitely stay there.",
      "rate": 4.0,
      "tripDate": " May 2022"
    },
    {
      "title": "Wonderful Bed and Breakfast!",
      "text": "We have stayed at Beverley Place 4 or 5 times over the past few years and have had an excellent experience every time. Lovely heritage home, wonderful location that is accessible to everything and a considerate and welcoming owner and staff. Staff go ot of their way to accommodate requests and make your stay comfortable.  Breakfasts are very good and healthy to boot!  This bed and breakfast has a huge number or loyal customers who have been coming to Beverly Place for many years, so yes, it is difficult to get accommodation unless you book in advance.  Thank you Bill, you do a great job!!",
      "rate": 5.0,
      "tripDate": " July 2018"
    },
    {
      "title": "A great place to stay.",
      "text": "Old Victorian house. Very quaint. My room was a third floor ensuite bathroom.  Great location, close to art museums, shops,  and restaurants. Friendly staff and nice breakfast.  I would definitely stay at this  B&B again.",
      "rate": 5.0,
      "tripDate": " May 2018"
    },
    {
      "title": "THE best B&B, excellent location, down-home comfort",
      "text": "the house is aesthetically pleasing, at a very convenient location. staff are friendly and helpful.arrive and you will be astounded by the art of the two guest houses adjacent to each other on beverley street. read the map and realize you are in the heart of downtown, just 5 minutes away from U of T, a plethora of cuisines in Baldwin Village, the colors and culture of Kensington Market and Chinatown. stay for a night and wake up to the smell of fresh-baked scones - that's right, a fresh batch is made every day - and other simple breakfast delights, and meet visitors from italy to hong kong to sudbury, ON...i have stayed in many bed and breakfasts around the world (1 in dublin, 2 in san francisco, 1 in london) and this is the best that I have encountered.private bathrooms are also an option for the neurotic. overall, the place is utterly clean and comfortable.given its location the price is a crazy bargain. stay longer (2 weeks or more) and you get even cheaper rates.I have a temporary place to stay in TO (a dorm room) and I still prefer staying here!",
      "rate": 5.0,
      "tripDate": " September 2009"
    },
    {
      "title": "Good location ",
      "text": "This was a good location, but unfortunately I didn't get breakfast because I had to leave early for work. Had they let me know, I would have asked for something to go, but they didn't offer or inquire when I booked or once I said I had to leave in the morning. They were more focused on making sure I paid in full (cash) than giving me a muffin or toast to go. Other B&Bs I've stayed at at least had some cold options for people to pick from.",
      "rate": 3.0,
      "tripDate": " July 2017"
    },
    {
      "title": "Just Perfect",
      "text": "We searched B & B web sites for a place near China Town because we like to tour around that area of Toronto.  After a few calls to places I chose Beverley Place on Beverley St. because my name is Beverley.  We had a great May 24th weekend there and will go back not just because of the name but because it is such a beautiful, well run place.  Our room was perfect, the bed is honestly the best I ever slept in away from home.  It was quiet even though downtown location, the bath tub was deep and perfect for a luxuriant soak after a long day walking up and down China Town and other areas.  The staff were friendly and attentive.  Nice and close to subway for easy access to other areas of Toronto.  We mostly walked all over, Queen Street shops, City Hall, Campbell House.  Lots and lots to see and do.  Nice variety of restaurants around the corner on Baldwin Street.  We will be back.",
      "rate": 5.0,
      "tripDate": " May 2013"
    },
    {
      "title": "Above average but not stellar",
      "text": "So Beverley Place was our first stop on our tri-legged (Toronto-Montreal-Quebec) tour. Our other two BnBs were so astoundingly great that this place just pales in comparison. Hence it lost a star :)We were travelling with a 15 month old and my review is obviously a reflection of that.First the pros :Safe and convinient locationDecent house keepingRooms were cleanLiving room was pretty gorgeousCan't beat the priceThe Cons:The place lacks consistencylet me elaborate : I called three times cause I had some change of dates etc before booking. All three times a different person answered and all three times I was given a different rate. 10$ +/-. Of the three mornings we were there, breakfast was some dry scones on one day (not filling) and scrambled eggs and french toast on the other two (very hearty)No microwave, fridge etc in the room. Since I was travelling with an infant this was very annoying. The owner was kind enough to let me use the common kitchen which they keep locked but I would have prefered to have a tiny fridge in the room where I could store some milk etc.While the rest of the house was cool our room was really really hot on most of the nights. By the second night we figured out that we needed to keep the windows open to be able to sleep.Now my biggest complaint at Beverley Place was sleep quality. I am a light sleeper and if noise does not bother you (like my husband) you probably will not care. But the flooring all over the room creaked, you could hear the guests in the other rooms, since we had to keep the windows open I could hear the cars go by at night etc etc. If noise is an issue for you, this is probably not the best bet for you.All in all for the money we paid this was a good value. Would I stay here again..probably not.",
      "rate": 4.0,
      "tripDate": " September 2012"
    },
    {
      "title": "Beautiful B&B, Excellent value, great location",
      "text": "My wife and I are in Toronto regularly and we love staying here. The Beverley is our home away from home. The owner and staff is friendly and are always attentive to our needs. It is walking distance to Art Gallery of Ontario (great gallery) and the theatre district and LOADS of restaurants. Park your car (cheap, only about $10 extra) and walk to where you need to go.There are a variety of rooms, with private baths and shared baths. We always prefer the private baths.Breakfast is simple; scrambled eggs, french toast, fresh fruit, cereal, fresh made scones. Not the fanciest breakfast, but it is served with a smile, nice conversation and quickly.We often stay at B&B's when we travel. Some are a little nice and more impressive breakfast, but you will pay double the price. Of all my B&B experiences, The Beverley offers the best value.",
      "rate": 5.0,
      "tripDate": " December 2011"
    },
    {
      "title": "Excellent B&B: lovely house and great breakfast",
      "text": "This B&B was a pleasant surprise on our arrival in Toronto: the elegant victorian house is furnished with authentic antiques of excellent taste, the house and the rooms are spotless clean, the breakfast was just a feast, the owner very friendly and helpful.We had a spectacular suite with private bathroom and terrace. We could sit out on the terrace under the trees populated by squirrels. We had the most delicious freshly baked scones for breakfast along with plenty of fresh fruit, eggs, toast and cereals. Last, but not least, the coffee was smooth and excellent, just what you need to start the day with a smile on your face. The place is very conveniently located close to a underground stop, but the walk to the waterfront is pleasant and short (about 15 minutes). The entertainment district is literally 5 minutes away, while the place is really quiet. We really enjoyed our stay at Beverley and definitely recommend it.",
      "rate": 5.0,
      "tripDate": " August 2009"
    },
    {
      "title": "Great surprise so close to town!",
      "text": "A great home away from home! The owner who lives on site, and staff are helpful yet not in your face all the time and do their best to accommodate your needs.  You will stay in one of two separate Victorian homes across the street from each other and it's quiet....bedrooms are generally spacious and luxuriously furnished with antiques, and there are several grand pianos and simple yet delicious breakfasts. Guests tend to be artsy and interesting and breakfast conversations are always fun.   Well located in a funky restaurant-filled neighborhood right downtown, blocks from Ryerson and the Art Gallery.  One house is wireless, the other not but apparently it is being renovated. Best deal around for the convenience of being blocks from Queen and walking distance to shops and Chinatown.",
      "rate": 4.0,
      "tripDate": " September 2007"
    },
    {
      "title": "very nice and comfortable",
      "text": "very nice, well located, very quite, very nice room ( double room with bathroom) and good breakfast.",
      "rate": 4.0,
      "tripDate": " August 2007"
    },
    {
      "title": "Nice room, just parking problem",
      "text": "I'm talking to the lady (owner) on the phone and booking the place on that day. she said there will be a parking available on site for $10 a day,  and the room for 2 people is 85CAD. When I got there,  there is no parking left. The lady said the other room bring 2 cars.  I can't park on the street because there are some construction along the Beverley street. It such a hassle to find a parking space close by. When I check in she said the price is 95CAD!  I argue her that she said on the phone it's 85CAD she said I must heard wrong. However, she gave me 5CAD discount. the total cost included tax is about 100CAD.  She then led me to the building across the street.The bathroom/ house is nice and clean, A house keeping will come  occasionally to clean the bathroom. The towel always there. Breakfast is nice. I'm on the 2nd floor, the master bedroom there. There are 3 more room on the same floor which I saw inside is much smaller than mine. The first floor have kitchen, and living room. Underground room have another bathroom equip with shower and a pay phone.  I'm satisfied for staying there, very impressed with the bedroom.I've some photos up ,so check it out.enjoy!",
      "rate": 4.0,
      "tripDate": " April 2007"
    },
    {
      "title": "Know before you call for reservation",
      "text": "The proprietors do not list prices, and do not use email (!) thus you have to (make an often international) call.  They can then determine your rate on the spot based on your voice, accent and manner of speaking -- which of course reveals race, ethnicity,, education and often income level. And they do not take credit cards; it's cash upon arrival,.  And it's not cheap.   I do not want to support such a mode of doing business and I called again to cancel my reservation.",
      "rate": 3.0,
      "tripDate": " July 2018"
    },
    {
      "title": "Wonderful location and room",
      "text": "I stayed at Beverly Place during one of the worst heat waves I've ever experienced so it was nice to know I was coming back to an air conditioned room. I couldn't fault the location as it is just south of the University of Toronto and within walking distance of everything I wanted to see downtown.  It is also only two blocks away from the subway (underground) and street cars (trams) run from the top of the street along College Street.  I had a big room with a marbled ensuite which was wonderful.  The price was right for me and onother person, though I have to admit that the managers were a bit strange as I had to pay in cash and I didn't get a receipt.  Be prepared to have the manager check every single $20 note for counterfeits!  Breakfast really suited me because there was lots of fresh fruit (if you got to the table early), juice and really nice freshly baked biscuits (scones) or muffins.  Hot choices included white or brown toast, French toast (eggy bread), scrambled eggs and fried eggs.  There's as much coffee and tea you could want to drink. I really enjoyed my stay and I would stay again.",
      "rate": 4.0,
      "tripDate": " August 2006"
    },
    {
      "title": "disappointment in downtown Toronto",
      "text": "While the two rooms we stayed in, and the home itself is lovely, several details are sub-par for this downtown Toronto location compared to B&Bs in the neighbourhood. Black mould on shower curtains, burnt out lightbulbs, wall patching without paint, rusty nail in shower stall wall, stale breakfast cereal and over-boiled eggs, and duvets without covers. The central air is nice and cool during the day, but gets turned off at night, making rooms stuffy and warm. The hostess lacks sincerity, but is nosy. She blatantly suggested cash terms without shame, didn't say \"Thank you\" when handed $500, and had to be prompted for a receipt. No service or amenities provided beyond ** service.",
      "rate": 2.0,
      "tripDate": " September 2013"
    },
    {
      "title": "A reasonable alternative to a downtown hotel",
      "text": "I stayed at this B&B for 7 days while attending a conference in Toronto.The owner has two buildings facing each other on Beverley street.  The location is quite good, a short walk to the Queen's Park subway station.  I walked each day to the Metro Toronto Convention Centre (about 15 - 20 minutes).  There are several restaurants nearby and the Art Gallery of Ontario.I selected the option for shared washroom facilities at a cost of $75 / night, plus tax.  I was provided a room with two single beds.  The house is older, although somewhat charming does demonstrate its age.  There was a misty odour in the bedroom.  A small TV is provided as is wireless internet.  Noise levels are entirely acceptable, but given the wood frame of the building, one could hear other guests entering and exiting.  The level of cleanliness is adequate, but rugs and carpets are tattered at some places.  No animals are present in the building.  No laundry facilities are available on site, but a laundromat is located about 2 blocks away.I can't say too much about the breakfast.  I usually just grabbed a some fruit to eat on my was to the conference centre.  They provided coffee and scones.I would have preferred to pay by credit card or Interac but the owner requested cash payment.  He proposed a surcharge of 7% on credit card payments.  There are many banks in Toronto but carrying around several hundred dollars to pay for a 7 day stay is certainly uncomfortable. I do recognize the charges imposed by the credit card companies on small businesses so payment by Interac would have been an acceptable alternative.Overall though I was happy about my choice of B&B.  Although there may be a few grimy hotels available in Toronto for less than $100 / night, I do not believe that their overall quality would have been as good as this B&B.",
      "rate": 4.0,
      "tripDate": " April 2010"
    },
    {
      "title": "Great Victorian-style bed and breakfast",
      "text": "I had an excellent experience while staying at Beverly Place for seven days in May, 2006.  Historic Victorian house with antique Victorian furniture and pictures.  Great for history buffs.  Library on ground floor.  Undergoing some renovations.  Excellent; polite staff; clean (but small) room. Plenty of good food and good conversation at breakfast.  Comfortable bed. Clean shared bathrooms.  Quiet, except for traffic noise on nearby street.  Good neighborhood, near University of Toronto, trolley lines and subway.  Inexpensive.  Highly recommended.",
      "rate": 5.0,
      "tripDate": " April 2007"
    },
    {
      "title": "Have stayed several times and would do so again",
      "text": "I stayed here several times between 2007 and 2012, usually for 1 or 2 weeks at a time. Ideally suited for working at University of Toronto as I was. Many restaurants and bars just a short walk away. Staff very friendly and approachable. Best of all are the properties themselves --- they're decorated in excellent taste. I will be staying again as and when I';m in this great city again.",
      "rate": 5.0,
      "tripDate": " November 2012"
    },
    {
      "title": "Beautiful rooms and great scones!",
      "text": "We stayed at the Beverley while in town for a conference.  The staff are friendly and helpful, the rooms are beautiful, and the breakfast delicious.  The location of the B&B was close to Chinatown, Kensington Market, and about a 20 minute, nice walk to downtown.  Highly recommended!",
      "rate": 5.0,
      "tripDate": " May 2012"
    },
    {
      "title": "You have to stay here...Best location...Best Deal!",
      "text": "Amazing location...Free WiFi Internet...and Best Location.  I stayed at Beverley Place this fall and have fallen in love.  This B&B has it all...especially LOCATION.  My wife and I were able to walk to everything including the University of Toronto (you are basically steps from the campus) Eaton Centre (15min walk) the R.O.M (15min walk) the Art Gallery of Ontario A.G.O (5min walk - can almost see it from the property) China Town (5-10min walk) C.N. Tower/ Toronto Convention Centre/Rogers Centre (20 min walk or 5 min taxi) all the major Hospitals are just two blocks over and yet we couldn't hear any street noise from our room (looking out the room window was like being at a cottage with beautiful maple trees [fall leaves were changing].  To add to our convenience of getting around the city there are bikes just outside of the B&B called BIXI Bikes which you can rent for the entire day for $5.00 and drive them all around the city and drop them off and pick them back-up...we used these to go to the C&E grounds, Hockey Hall of Fame and the Air Canada Centre (very short bike ride).  Our room was beautiful and very spacious and had a T.V. internet, fireplace, private bath and a balcony with a table and chair set.  The breakfast was great and the other guest seemed to all be very friendly and from everywhere.  The dinning room for breakfast is beautifully decorated and looks onto an incredibly beautiful victorian style seating room.  The place was absolutely PERFECT and the price was excellent.  The staff were willing to do anything for us and the owner was always so sociable and informative on what was going on in the city.  The entire house was very clean and felt very comfortable and secure.  We highly recommend this B&B if you are visiting the city to see the sights like us or if you were visiting someone at the university or hospitals (Perfect Location) or in town for event at any of the venues (such a great location).",
      "rate": 5.0,
      "tripDate": " October 2011"
    },
    {
      "title": "Not a pleasant stay",
      "text": "If I hadn't stayed at several other B&Bs in downtown Toronto, I'd probably give this place higher marks.  But of the 5 places I've stayed, this is definitely the bottom of my list.  They just don't have the same attention to detail (cleanliness, decor, maintenance) that I'm used to in other places.  And the service... well I found the owner (at least that's what I assumed he was - he never introduced himself to me) quite brusque and borderline rude.  He tried to insist I pay cash, even though they advertise credit card and I insisted that since it was business related, I intended to pay by credit card.  And when it comes to breakfast, he just tossed some food on the table and never asked whether we wanted tea instead of coffee, etc.The whole place had an odd mothball-y smell and the first thing I saw when I walked in was a couch with a broken leg propped up on telephone books.  The decor was an odd mix of antiques and slapped together newer pieces.But the worst part of my stay... when I returned to my room after dinner, looking forward to an early night after a long day, I had to lay awake for an hour and listen to the owners in what sounded like a lovers' quarrel - shouting at each other from either side of a locked door (one had locked the other out of the room and the one outside was threatening to break the door down, etc.).  It made me really uncomfortable to have to listen to that.I travel to Toronto a lot and won't ever stay at this place again.",
      "rate": 2.0,
      "tripDate": " April 2009"
    },
    {
      "title": "Amazingly Furnished B&B",
      "text": "Amazingly Furnished B&B, in a slight grand rococo style, but all in good taste.. lovely tea room with a grand piano. Excellent breakfast with french toast . Very good location. I got a lovely room with en-suite. Happy to highly recommend.. Good for a romantic getaway.",
      "rate": 5.0,
      "tripDate": " March 2013"
    },
    {
      "title": "Lynda",
      "text": "Beverly Place is a wonderful place to stay.  The owner is very friendly and can answer all your questions of where to go.  The place is within walking distance to all restaurants, stores, galleries.  If you have a car you are able to park it during your stay.  Rooms are clean.  I will definitely being staying here again.",
      "rate": 5.0,
      "tripDate": " January 2012"
    }
  ]
}