{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Bisha Hotel Toronto",
    "url": "/Hotel_Review-g155019-d12483976-Reviews-Bisha_Hotel_Toronto-Toronto_Ontario.html",
    "priceRange": "$$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "5.0",
      "reviewCount": 613
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "80 Blue Jays Way",
      "addressLocality": "Toronto",
      "postalCode": "M5V 2G3",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2c/8c/d1/df/front-building.jpg?w=500&h=400&s=1"
  },
  "description": "Captivate your senses at Bisha Hotel Toronto. Centrally located in the heart of the Entertainment District, Bisha puts you in the middle of it all. Our 96 rooms and suites are artfully designed and effortlessly casual. An entire floor of Bisha Hotel was designed by Kravitz Design, combining the ultimate in luxury with a rock n roll edge. BYREDO in-room amenities make each stay a little more luxurious. All rooms also feature complimentary Wi-Fi, an in-room refrigerator and minibar. Guests can enjoy a seasonal rooftop pool with stunning city views, as well as a state of the art fitness center. Bisha Hotel offers four distinct food and beverage options, to satisfy your every need. French Made, located on the lobby level, serves up fresh pastries, salads, and sandwiches during the day in a Parisian-café environment. KOST lets you dine on top of the world, with panoramic city views being served up alongside fresh California inspired cuisine. Akira Back is the globally renowned chef’s first Canadian restaurant and offers his distinctive blend of Japanese and Korean flavours. Mister C pulls back the velvet rope and offers you the best of Toronto nightlife, right in our lobby. Sit back and enjoy the sophisticated elegance of our intimate lobby bar. Escape the mundane and book your stay at Bisha Toronto today.",
  "featues": [
    "Electric vehicle charging station",
    "Free High Speed Internet (WiFi)",
    "Fitness Center with Gym / Workout Room",
    "Pool",
    "Bar / lounge",
    "Evening entertainment",
    "Pets Allowed ( Dog / Pet Friendly )",
    "Airport transportation",
    "Valet parking",
    "Paid private parking on-site",
    "Wifi",
    "Fitness / spa locker rooms",
    "Rooftop pool",
    "Outdoor pool",
    "Coffee shop",
    "Restaurant",
    "Breakfast available",
    "Breakfast in the room",
    "Complimentary Instant Coffee",
    "Complimentary welcome drink",
    "Wine / champagne",
    "Rooftop bar",
    "Taxi service",
    "Business Center with Internet Access",
    "Conference facilities",
    "Banquet room",
    "Meeting rooms",
    "Steam room",
    "Rooftop terrace",
    "24-hour security",
    "Baggage storage",
    "Concierge",
    "Currency exchange",
    "Newspaper",
    "Non-smoking hotel",
    "Doorperson",
    "Umbrella",
    "24-hour check-in",
    "24-hour front desk",
    "Express check-in / check-out",
    "Dry cleaning",
    "Laundry service",
    "Ironing service",
    "Allergy-free room",
    "Blackout curtains",
    "Air conditioning",
    "Desk",
    "Housekeeping",
    "Minibar",
    "Cable / satellite TV",
    "Walk-in shower",
    "Bathrobes",
    "Room service",
    "Safe",
    "Sofa",
    "Wardrobe / closet",
    "Bottled water",
    "Iron",
    "Laptop safe",
    "Tile / marble floor",
    "Wake-up service / alarm clock",
    "Refrigerator",
    "Flatscreen TV",
    "City view",
    "Bridal suite",
    "Non-smoking rooms",
    "Suites"
  ],
  "reviews": [
    {
      "title": "Outstanding truly magnificent hotel and services.",
      "text": "Bisha is a 5 star hotel. Our fourth visit was outstanding from start to finish. From the doorman, check in and suite upgrade for a minimal charge via e-mail the previous day. The staff are simply outstanding throughout the hotel from front desk to Mister C bar and Kost restaurant.We stayed in the eighth floor Stella Suite and it was simply stunning and spacious with a beautiful soaker tub and excellent bath amenities, super comfortable king bed and soft linens.There was plenty of room to lounge and rest. The heating and air conditioning are whisper quiet, you don’t hear either at all.The decoration is simply divine, not cookie cutter and very modern.We won’t stay anywhere else in Toronto, and we find ourselves visiting TO from Muskoka more oftenHeavenly.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Luxury with a smile ! :)",
      "text": "I cannot rave enough about our stay this past weekend, a surprise birthday treat for my boyfriend turned into a staycation to remember! From the minute we arrived at the hotel, the staff Alejandra, Henri and Sami went above and beyond for us, ensuring that everything was on point and the surprise was just perfect! Thank you all and Andrea too for making everything so special ! We really felt like we had escaped the craziness that is 2020, even if our stay was just for the night albeit with a courtesy early AND late check out, it was simply perfect. The rooms and even hallways are gorgeous with beautiful decor, artwork and be sure to opt for a King bed! We had brunch and also breakfast at KOST, sitting in the (November!) sun on the 44th floor rooftop patio next to the pool, overlooking the CN tower and the lake. It really felt like a vacation even whilst wearing a mask and making use of the hand sanitizer stations located throughout the hotel; special packs were also provided upon arrival to ensure a safe stay. I don't know if this review does it justice but for anyone who is all about incredible service and luxury with a smile then The Bisha is for you. Thank you so much for looking after us so well, we will be back and will be sure to spread the word :)",
      "rate": 5.0,
      "tripDate": " November 2020"
    },
    {
      "title": "MY STAY AT BISHA!",
      "text": "What can I say except wow! The second I walked into the bisha the staff was there to help and complete my every need. One of the staff from the front desk really amazed me “Selina” anything I needed at any time she was there to help. Another thing I loved about this hotel is that they always have a solution, to anything and everything. The rooms were amazing and extremely clean as well as the bathrooms. Obviously me and my family we not able to visit the restaurants in the hotel due to the closure of them but Bisha offers a great “In-Room Dining” basically the restaurant in your own room. They bring you a table with all the plates and the food and the cutlery (it was not to eat restaurant foods from takeout boxes). Over all our stay was great and I recommend the bisha to anyone and everyone if you like a nice calm high class stay.",
      "rate": 5.0,
      "tripDate": " April 2021"
    },
    {
      "title": "Exceptional Stay",
      "text": "When we arrived at the hotel for our staycation on a Saturday night, we were immediately greeted by staff outside, and assisted to the front desk. The check-in process was flawless and polished. The front office manager Andrea greeted us and was very kind and welcoming. She sincerely invited us to enjoy our stay and told us the staff were available for anything we needed. The room was immaculate, large, and beautifully decorated. Alejandra at the front desk was incredible! She politely greeted us every time we passed through the lobby, and she assisted us with reservations at the pool and for breakfast. The staff at KOST, and the pool attendants were also very attentive. They ensured we had water and fresh towels while visiting the pool area.We were a bit concerned to be visiting the hotel during a pandemic, but the social distancing signage, sanitizing stations, and overall attention to cleanliness was very apparent. We are looking forward to returning very soon.",
      "rate": 5.0,
      "tripDate": " August 2020"
    },
    {
      "title": "Amazing stay & Hotel",
      "text": "My son and I wanted a night away in the city, when we arrived at the hotel we were greeted by The General Manager and Andrea. Once inside we were assisted by Alejandra at the front desk who greeted us with smiles and made the check in very quick and easy. Nobih assisted us with our luggage and gave us a tour of our room. The room was amazing and very large for hotel suites. The staff at the roof top pool were very polite and attentive . Throughout the hotel there was social distancing signage, hand sanitizers along with maximum no. of guest allowed in the elevator. We are looking forward to our next stay soon.",
      "rate": 5.0,
      "tripDate": " September 2020"
    },
    {
      "title": "Wonderful Weekend Staycation",
      "text": "My husband and I booked a room (The Frank) for a little staycation recently and had such a wonderful time. Even though the pandemic eliminated the use of the hotel's GORGEOUS restaurants, bars, and amenities, we were so happy to have such a beautiful, cozy, and clean room in which to relax. I wasn't sure if robes and slippers would be included given the current circumstances, but a quick call to the front desk and they were brought up to our room. Staff was lovely and attentive. Everyone wore masks around the hotel and when bringing items to the room - we felt very safe and cared for.We ordered breakfasts from Kost and dinners from Akira Bak (one of my favourite spots in the city!) and it was like we were eating out at a restaurant again. SO nice. Will definitely book another stay at Bisha!",
      "rate": 5.0,
      "tripDate": " April 2021"
    },
    {
      "title": "Amazing Staycation",
      "text": "Two friends and I stayed at Bisha Hotel Toronto on the weekend of Nov. 28, 2020. We live in Toronto, but have never done a hotel “stay-cation” in the city before. We are also content creators/fashion bloggers and wanted a place where we would be able to have a great stay AND take amazing photos. We also LOVE luxury and that is why we chose Bisha Hotel for our stay.From the time we  made our hotel reservation, straight through till the time we left the hotel every single person working at the hotel treated us like Queens!  Ankit who first greeted us upon our arrival was extremely helpful with getting all our many, many bags together and brought to our room. Alejandra at reception treated us like old friends from the first minute she saw us. She was also kind enough to upgrade us and once in our rooms brought water for us without us even asking.  She also provided us with her mobile number so we could text requests to her rather than having to call on the landline (love that)!  We stayed in the Alexander Suite and it was beautiful! It was very clean and the bed and pillows were extremely comfortable. There was a small issue with our keycards not working at first, and the fridge door being stuck, but the hotel staff was quick to solve everything.  As we are in a pandemic and Toronto is in lockdown, we did not have access to any of the hotel’s amenities (e.g. bar, restaurant etc.), but we did order in-room dining for breakfast and the food was delicious and flavorful!  This suite also has a gorgeous large patio that would be wonderful to use in the summertime.  As I am visually impaired, I was extremely happy to see that on their website they outlined the accessibility features of the hotel and stated that the staff would read any written materials to you if needed and  provide verbal directions (paper maps can be tricky when you’re low vision). They also provided detailed information about the width of doors in accessible rooms and offer accessible guest transportation.  I love this because as I have low vision and often travel alone, I often require those verbal directions and sometime for materials to be read aloud to me. I appreciate that they have “protocols” in place already to address this.I really cannot say enough about how wonderful our stay was. Would definitely stay here again!",
      "rate": 5.0,
      "tripDate": " December 2020"
    },
    {
      "title": "Incredible stay",
      "text": "We were fortunate enough to stay at the Bisha hotel over this past weekend as we were in town for the Red Hot Chili Peppers concert. Our experience was next to none. Treated like family from the moment we arrived. The staff was so accommodating and kind. The location was perfect— 5 minute walk to the rogers Center, and all Ubers and cabs were available for pick up within 2-4mins. The staff was always asking us if we needed anything, offering to call us cars, or make us reservations. Room service was so quick and pleasant as well. Jonathan, the director of rooms,   was a stand out when it came to setting up our reservations and any other accommodations we requested. He truly made our stay memorable and comfortable. The room was meticulously clean and comfortable and the decor and vibe of the entire building was modern, fresh, and artistic. Cannot wait to return! Thank you Bisha and staff for a memorable stay, your hospitality was much appreciated.",
      "rate": 5.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Wonderful Birthday Stay",
      "text": "We stayed at the Bisha Hotel in Toronto to celebrate my 50th birthday as our other celebratory birthday travel plans have been put on hold (Covid/world wide pandemic).  We live in Toronto and decided on a staycation at the Bisha.  It was the perfect choice.  The staff went above and beyond in their hospitality and friendliness.  We brought our large dog ($150 extra to bring a pet) and they treated him (and us) like family.  We had early check in and late check out so it really felt like a getaway.  If you're looking for a staycation or somewhere amazing (oh yeah, the hotel is beautiful!!!) in Toronto, I highly recommend Bisha.  Thanks again to Alejandra and the wonderful valet for making our stay amazing.",
      "rate": 5.0,
      "tripDate": " December 2020"
    },
    {
      "title": "Hands down this is THE place to stay",
      "text": "I choose bisha hands down over and over again. This is the Ultimate staycation destination (or proper vacation).  The staff here are so accommodating and really make everyone feel like a VIP.   Bisha is a hotspot in the best location, great rooms with  terraces, great for people watching, amazing food and drinks at all the on-site dining options.  Literally didn’t want to leave the building.  Can’t go wrong for any reason.   Luxury allll around.   Special thanks to Selina and Sammy for taking such good care of us.",
      "rate": 5.0,
      "tripDate": " September 2021"
    },
    {
      "title": "Blown away on our special day!",
      "text": "The hotel is absolutely fabulous. The service I received from the first day I visited to see if this was the place I wanted to celebrate my proposal was unparalleled. I was able to get a tour of the rooms and restaurant so it was easy to pick the right room for our special day. Everybody was extremely friendly and helpful. I communicated with Jenna at the front desk leading up to our stay and she was able to take care of every detail and put my mind at ease that our stay would be perfect. She was even able to help me reschedule everything I had planned (the hotel stay and Kōst reservations), when I had to delay because of a  health issue. Her attention to detail and quick responses made everything so much easier. I dropped our luggage at the hotel a couple days before my proposal and surprised my fiancée with a hotel stay close to home to celebrate our special moment. We got the most incredible treatment when we showed up at the hotel. We had a beautiful room with a bottle of sparkling wine and macarons and a hand written note welcoming us. Jenna organized a quiet table for dinner at Kōst. Darren was an incredibly attentive server and brought us each a glass of Prosecco to celebrate. Everyone we encountered in the hotel and restaurant were so caring and took such pride in making our occasion absolutely perfect. The food was incredible at dinner and the view was so perfect for photos. In the morning we were too excited to sleep and got up before in-room dining opened. We called just to get info on when we could order and Jenna offered to get us coffees from French Made and send them up. Then as soon as in-room dining opened, they phoned us for our order and we had the perfect breakfast in our room. We went down to French Made for a delicious lunch. Everything was absolutely perfect!The bed and bedding are so comfortable, the tv has chromecast built in, there’s a Nespresso machine, the options in the mini bar are varied and plentiful, and the toiletries smell incredible. They even have front desk cell phone to text if you don’t feel like phoning concierge. They truly have thought of everything. Thank you so much to Jenna and everyone at Bisha for making our proposal celebration absolutely perfect!",
      "rate": 5.0,
      "tripDate": " December 2021"
    },
    {
      "title": "Exceptional experience",
      "text": "We live in the Bisha Hotel neighbourhood and frequent their excellent restaurants often.  On this occasion I wanted something special for a family birthday event and decided on an overnight stay for 3 adults and 3 kids with dinner at Akira Back sushi restaurant.  Jonathan and his team arranged 2 beautiful connecting rooms with a private hallway and surprised us with balloons and a bottle of bubbly!   The staff throughout the property was super friendly and made every effort to make our stay special.  The dinner at Akira Back was fantastic as always.Thanks again for the excellent service and we look forward to more special occasions at your hotel.",
      "rate": 5.0,
      "tripDate": " April 2022"
    },
    {
      "title": "Worth a trip to Toronto all on its own",
      "text": "Over the course of the pandemic, local hotels have been a rare opportunity to get away from the apartment, and Bisha has been, without question, the best place I've been for the entire year-plus period. The rooms are beautifully decorated, the furniture is comfortable, the bathrooms are gorgeous, and the staff is beyond fantastic. They have repeatedly gone above and beyond to deal with our dumb problems",
      "rate": 5.0,
      "tripDate": " May 2021"
    },
    {
      "title": "Lovely Hotel",
      "text": "We spent 6 nights at the Bisha and overall it was a nice hotel. Customer service was excellent; everyone was polite and welcoming I would not recommend the room service which we had our first night since we were too tired to go out. The salad was drenched in sauce and the sandwich had way too much mayonnaise. The fries were soggy and the guac was dry. We didn't even eat half of everything because it was so awful. We complained at front desk the next morning and management graciously comped the meal. We didn't end up dining at any of the restaurants in the hotel. We did however really enjoy French Made which is connected to the hotel. It was really convenient to be able to grab a quick breakfast before heading out. The cafe itself is tiny but you can sit in the bar/lounge area in the hotel where there are plenty of seats albeit it's a bit dim in the room. Their croissants were pretty spectacular. Our room (the Nina) was an okay size but did feel a bit cramped at times. There was a bar cart that took up quite a bit of space which I thought was unnecessary. Bathroom had plenty of space but the shower would leak. Every time we finished showering there would be a puddle of water outside. Our room would also get really hot from the sun so we just kept the curtains closed basically the whole time.This was my first time to Toronto so I don't know the area very well but I wouldn't say the hotel was really central to anything. We did walk 10 min to an nice Indian restaurant that was very good; and there is a drug store about a 5 min walk away. There was also a lot of construction at the time of our visit so it did make it a bit awkward getting in and out of Ubers. We always seemed to be picked up and dropped off on the opposite side of the street for some reason.I did happen to lose a glove on our last day and I called the hotel the next day to see if they had found it. The manager said he would look into it and call me back but he never did. Oh well. Overall pleased with our stay.",
      "rate": 4.0,
      "tripDate": " March 2023"
    },
    {
      "title": "Best Service in the City",
      "text": "My stay at Bisha was OUTSTANDING as usual. I was hosting some friends for an annual get together and upgraded to a spacious suite with a dining/conference area. Jonathan Twigg was instrumental in insuring each detail of my stay was absolutely perfect. He went out of his way to check on my team and ensure every request was expedited with care.Thank you for yet another fantastic experience Jonathan and Team!  Can’t wait to come see you all again!",
      "rate": 5.0,
      "tripDate": " December 2023"
    },
    {
      "title": "Sexy but with Substance",
      "text": "I had a wonderful, incredible, absolute perfection of an experience from the moment we walked in to Bisha earlier this month! A lil’ background… I’m from Miami & my boyfriend lives in Toronto so when I go visit him, he does some research and chooses a hotel. For the most part, they’ve been good but Bisha was something special! Walking into the sleek, moody & sexy lobby was the perfect start with FashionTv blaring from the tv’s above the hotel bar at Mister C’s directly across from the front desk. The dark marble floors, heavy velvet curtains & all around cool, slightly dangerous (in a good way!) rock & roll , high fashion vibe was everywhere you looked & I was HERE for it! Greeting us warmly was Karan who made us feel like we were the most special people in the room. He was so lovely & explained everything we needed to know to get the most out of our stay even suggesting he make breakfast reservations for us since the restaurant got quite busy. We said our farewells & headed up to our suite. The dark, sexy, rebel vibe continued with navy walks, black couch & framed museum quality editorial images of Madonna, Naomi & others all over the wall. The bathroom was divine & to top it all off, the toiletries were BYREDO Bal d'Afrique!!! I could have died & gone to heaven (after slathering myself from head to toe with the moisturizer of course). Our entire stay was fantastic & the inly time we had an issue (the a/c seemed a bit hot), they immediately sent someone up to fix it. We ordered in room dining one nigh which was great, valet service was wonderful & Maria at the front desk was an absolute dream too. Truly every, single person we encountered here was just great. Loved the hotel, loved the ambience & especially loved the staff. Will definitely book here again next time I’m in town!",
      "rate": 5.0,
      "tripDate": " May 2024"
    },
    {
      "title": "Phenomenal 24 hour getaway...",
      "text": "“This was our first stay at Bisha. We have been long time guests of the Ritz-Carlton Toronto and were encouraged to try Bisha by a close friend who also stays with you. The entire 24 hour experience was incredible. Andrea was great in establishing contact early on during our booking process. Alejandra was over the top. She took time to speak with me before my arrival and made sure all details were taken care of. The kitchen team at Akira Back prepared one of the most memorable curated tasting menus that we have ever experienced. The room was fantastic and the vibe was also equally amazing. Selina and Henrique were also tremendous. Even the valet / luggage attendant (name is forgotten) was tremendous. We will be back. No question. Thank you!”",
      "rate": 5.0,
      "tripDate": " May 2021"
    },
    {
      "title": "Amazing Family Staycation",
      "text": "My husband and I stayed at Bisha Toronto with our 3 year old son to celebrate my husband's birthday. We had a fantastic time in the gorgeous Stella suite. The room was extremely spacious, beautifully decorated, and had an amazing terrace that my son absolutely loved. I am an extremely picky person but my expectations were exceeded on all levels at Bisha. I was particularly impressed with the service we received from the minute I booked the room until we checked out. The staff helped me to arrange everything I needed for our in-room birthday celebration as well as helped me get everything we needed to make the stay with our little son more comfortable (microwave, fridge, etc.)... Special thanks to Alejandra for everything, she really went above and beyond to make us happy and treated us like family. We really appreciated that! I'd highly recommend this hotel and will definitely be back.",
      "rate": 5.0,
      "tripDate": " April 2021"
    },
    {
      "title": "Family Birthday Visit!",
      "text": "This was an exceptional stay! My family and I really enjoyed ourselves. The staff is extraordinary and made the Bisha feel like a second home for my family and I. Special thanks to Sammy and Salina/Selena(?) for making our stay special, they were friendly, kind and attentive! But most of all thank you to Alejandra. She made a plan for my sister's birthday and worked with me to pick beautiful photos of my sister, added happy birthday signs and provided a yummy snack for her. She really went above and beyond! My sister cried so much! I really appreicated all the hard work and the love shown by the staff. The food at KŌST was phenomenal! The chicken burger changed my life! Really! The pool is amazing! It's so relaxing and I swear nothing beats that view! I would highly recommend this hotel, I promise you won't regret one dollar spent!",
      "rate": 5.0,
      "tripDate": " June 2021"
    },
    {
      "title": "Amazing Location, Amenities, & Service!",
      "text": "From start to finish this was an amazing weekend stay! Upon pulling up to the hotel we were greeted by the valet doorman. Check in was very smooth and we were greeted with Champagne. We received a room upgrade for my birthday which included a personalized greeting touch to the room. KOST rooftop restaurant is very nice with a great view of the CN Tower, and Mister Cee is great in Hotel Lounge/ Bar. We will stay here again next time in Toronto.",
      "rate": 5.0,
      "tripDate": " April 2022"
    },
    {
      "title": "Fantastic Hotel",
      "text": "My fiancée and I recently stayed at the Bisha Hotel and we were extremely happy with our stay. The hospitality, graciousness, and friendliness of the staff alone deserves a 5 star rating; specifically that of the Hotel Manager Andrea, who proved to be a gem during our stay. The overall design of the hotel, its rooms, and the restaurants are beautiful. The room itself (we booked the Andy) was very clean, spacious, and comfortable; we really appreciated the attention to detail. Highly recommend booking this hotel for something different / unique. You won't regret it!",
      "rate": 5.0,
      "tripDate": " July 2020"
    },
    {
      "title": "Our stay at the Bisha Hotel Toronto",
      "text": "Wooow!!! I don't even  know where to start!But my son wanted my girlfriend and I to have his bday at a hotel...And choosing the Bisha Hotel Toronto was the the absolute right choice!Jonathan, the hotel's manager and his amazing staff: Jenna, Maddie, Henrico, Gabriel, Sami, and Michael,Made this all possible with their unmatched customer service.Words are inadequate to express how awesome this crew is!The decorated our room with balloons and a delicious slice of Chocolate cake, coupled by pokèmon balloons that we brought in for them to place in the room also.They also brought up a portable fridge to our room to place our son's bday cake in, because the other fridge in the room was filled with beverages.I'm a huge fan of customer service at its best, and this is why we will recommend the Bisha hotel to anyone looking for a great place to stay while in Toronto.Thanks again Bisha crew.McGregor Peters & Family",
      "rate": 5.0,
      "tripDate": " February 2022"
    },
    {
      "title": "Underwhelming and not worth the price",
      "text": "Stayed here last weekend with my wife. I was told to arrive at around 1-1:30pm to check-in and when I arrived, I was told that Kate put in that I would arrive at 1 at night instead of the afternoon. I went to grab food with my wife for about an hour and when we came back the room still wasn't ready. It took about another hour to finally get a room, while my wife (who's pregnant) sat waiting in the \"lobby\" that has 4 small chairs. Jenna, is the only member of the front desk staff that showed she cared, whereas Kate, Doris, and an older eastern European lady (didn't catch her name) didn't say much other than try and justify why we had to wait so long. The cleaning staff and the staff that bring water and towels were a pleasure speaking with and extremely professional. The hotel is very loud at night (around 2-3am) but I understand that it isn't really in the hotel's control.",
      "rate": 2.0,
      "tripDate": " June 2022"
    },
    {
      "title": "EXCEEDED MY EXPECTATIONS... if that's even possible.",
      "text": "Who leaves not ONE but TWO reviews??? This girl!(I try to show my appreciation where it's due, but don't always get around to writing a review)I still don't feel I did the hotel justice especially after reading the previous review. I'm trying here, but it's true that it's hard to put into words how amazing the hotel itself is and the staff. You'll truly have to see for yourself! I assure you, you won't regret your decision to stay here! I had the pleasure of dealing with the hotel manager Alejandra, their assistant Sami and there were two other front desk individuals whose names I didn't get. The minute I arrived to Bisha I felt taken care of. It was as if these people knew me and welcomed me into their home. Staff is super friendly, caring, thoughtful and accommodating!!!I know Toronto and the location is perfect! It helped the next morning that I could walk over just 200m to Starbucks (just a bonus), but also that I was right by the CN tower (those who are tourists would appreciate it...and for anyone their rooftop restaurant/bar KOST has an incredible view of the city). There are lots of nice restaurants nearby and the night scene is a 5 min walk too. The hotel room was clean, comfortable and chic. I booked the Grace hotel room. There were special features such as a little lounge in the bathroom area, bathroom floors were heated, big full length mirrors etc.I am beyond happy with my stay here! It is totally worth the pretty penny I paid. You literally get what you pay for, so it's worth it. The Bisha hotel is described as a luxury boutique hotel and it lives up to its description. If you're looking to make your stay in Toronto a memorable one, one that will leave you in awe then don't think twice about choosing to stay at the Bisha. I guarantee you will not regret your decision. For any questions speak to front desk staff as they are super helpful and try to accommodate you in the best way possible.Thank you! Thank you! Thank you!I hope to see you very soon. I will definitely be back!",
      "rate": 5.0,
      "tripDate": " July 2021"
    },
    {
      "title": "Amazing getaway",
      "text": "We had the pleasure of staying in the Stella Suite over the weekend and the hotel went beyond our expectations. Our suite was decorated elegantly to go along with their stunning entrance. They were prompt in accommodating our needs and were available to us at the drop of a text. We got to experience Akira Back in the hotel which was a delight dinner as well. Mister C in the lobby had unique cocktails with a DJ to elevate our night. Would definitely recommend this hotel.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "An unforgettable birthday weekend ",
      "text": "I went to Bisha Hotel for my birthday and the experience was unforgettable. We arrived by Uber and were greeted by a friendly bell hop who made quick work of our numerous bags and whisked us into the impressive lobby. The ambiance and feeling of calm was palpable considering the bustling street mere feet away. I instantly felt like I was on holiday. The staff was excellent and attentive, they understood  the true meaning of  great customer service and were a cut above. A swipe of the key card was needed to access both the floor and our room and added to our feeling of security.  Our room was on the 8th floor and was named Grace. It was spectacular and was a great balance between elegance and functionality. From the foyer at the room’s entrance to the long low couch at the floor to ceiling windows to the shower and weighted blankets, it was a home away from home. There are two restaurants and a bar in the Hotel that let us party close to home. From The decor in the room and hotel to the excellent service and location, Bisha Hotel has left its mark.",
      "rate": 5.0,
      "tripDate": " June 2023"
    },
    {
      "title": "Luxury and Genuine Care",
      "text": "This is the third time I have stayed at Bisha. I am a regular traveller to Toronto and have tried almost all of the Boutique offerings. This hotel has been by far the best experience and is consistent in delivery of a luxurious experience with the staff who genuinely care. The rooms are well appointed with lovely linens, heated bathroom floors and in room dinig is fast and acctually delicious! LIke really delicious. You will not regret staying!",
      "rate": 5.0,
      "tripDate": " January 2023"
    },
    {
      "title": "Jenna the front desk manager was amazing",
      "text": "From the moment we walked in the door Jenna was attentive to our needs.  She totally exceeded my expectations and even took time to take pictures in the lobby, as we were celebrating a special bday!She made sure that our room was exactly what we were looking for.  She confirmed our reservations at KOST and Mr. C for the 3 days we were there.  A special surprise was also in our room much to our surprise and delight! She also told us to call her anytime if we needed anything and made sure a bucket of ice was waiting for us when we got to our room.  I definitely will be back and would recommend this hotel to my friends.",
      "rate": 5.0,
      "tripDate": " April 2022"
    },
    {
      "title": "Incredible Stay Downtown",
      "text": "We had a fantastic stay at Bisha Toronto! We had advised the hotel that we would be travelling w a small dog, and noticed the dog bed, bowls and treats for her in the room upon arrival. The team was extremely outgoing with special mentions to George, the friendly doorman that greeted us and made sure we were well taken care of each time we passed by.Team Bisha, Thank you for an unforgettable stay. We will be back next time we're in the city!",
      "rate": 5.0,
      "tripDate": " November 2020"
    },
    {
      "title": "Extremely Dirty Room, Horrible Customer Service from Manager",
      "text": "Booked the Stella Suite and requested a balcony. Was given a room that was not clean. Balcony had cigarette butts everywhere, burn holes on patio couch and used napkins; hair in fridge, bathtub and sink. Couch, Walls and Carpet were all stained and garbage from previous guest could be found throughout the room. During covid you would expect a hotel to make cleanliness a priority. Was moved to the Olivia room which was half the size and had the worse view, then was moved to another Stella suite with no balcony and again half the size. The bed was extremely uncomfortable and the pillows were very thin. Spoke to the Manager on Duty at check out and all she gave was an insincere apology and looked after our breakfast- the only plus of the stay was the bellman and the front desk girl Alejandra were very nice and showed concern over everything. I have travelled the world and have never had such a HORRIBLE experience at any hotel.",
      "rate": 1.0,
      "tripDate": " August 2020"
    },
    {
      "title": "Ultra chic in the heart of Toronto",
      "text": "I booked a suite online called The Stella. I chose it due to it having a soaking tub for my fiancée.Upon arriving we were greeted by the valet who offered to handle our baggage and park our vehicle. Entering the hotel we were greeted and checked in by amazing staff members who made us feel right at home.Our room had a seating area with a modern sofa, art deco on the walls, and a powder room.The main bedroom had a large television, a king size bed, and a monstrous bathroom with a soaking tub and a separate shower.Throughout our stay we were treated well, took use of the valet in out privileges as well as the coffee shop out front.  I would recommend this hotel to anyone who is looking for an ultra modern place to stay and get away.",
      "rate": 5.0,
      "tripDate": " March 2021"
    },
    {
      "title": "Great Birthday Staycation",
      "text": "I never write reviews but I definitely felt compelled to talk about my experience at the Bisha hotel for my 30th birthday last weekend. I never understood how people could feel like they are on \"vacation\" within their own city, but the staff and the service at the Bisha definitely changed my mindset on it. For an upscale hotel, every single one of the staff are completely down to earth and made you feel like a family friend, especially Alejandra, Sami, etc. just to name a few. The suite we got was easily one of the nicest rooms I've ever stayed in with great attention to cleanliness and detail. I look forward to supporting their restaurants and their services for years to come.",
      "rate": 5.0,
      "tripDate": " November 2020"
    },
    {
      "title": "Excellent accommodations!",
      "text": "My wife and I took a leisure trip to Toronto for a little getaway. We have stayed in many hotels all over Canada and this was by far the best one we have had the pleasure of staying in. From the valet, front desk, room service and cleaning staff, everyone was so polite and helpful. Johnathan was so accommodating from helping us book the room, to making suggestions for places to eat near by. We most definitely will be back!",
      "rate": 5.0,
      "tripDate": " January 2022"
    },
    {
      "title": "🖤 When comfort meets luxury 🖤",
      "text": "The Bisha Hotel is ultimately our favourite hotel ever!!! My husband was in Toronto for business, and since it was my birthday I decided to tag along. I had mentioned to the hotel staff that I would be celebrating my 44 Th birthday during my stay at the hotel... and boy did they ever go “over and above “to  make sure that my day was extra special.Their restaurants are extraordinary and their service is impeccable. Their outdoor terrasses ( both at Akira Back and their rooftop dining at Kost) allowed for us to dine in comfort due to their numerous outdoor heaters.  Their pastry chef even designed a beautiful and delicious birthday cake in my honour. Upon arrival in our room I was surprised with ballons and a hand-written birthday card signed by the whole Bisha team... who by the way all knew my name. In today’s world this is absolutely a wonderful added touch. We have stayed at the Bisha a numerous amount of times, and their excellence in customer service  is a constant throughout every single visit. Even though I was away from home on my birthday,  I left like I was right at home at the Bisha ;)",
      "rate": 5.0,
      "tripDate": " October 2020"
    },
    {
      "title": "Anniversary and Graduation Celebration",
      "text": "The Bisha is a gorgeous hotel with an amazing rooftop restaurant.  The rooms are absolutely dreamy and make you attempt to figure out some way that you can stay forever.  My partner was celebrating his graduation and we were celebrating our engagement anniversary.  The staff provided \"CONGRATS\" balloons and we had arranged for some wine and platters while watching euro cup game. The patio with the room was a  dream - I  would have love to been stuck here for quarantine.  We will be going back and would highly recommend you choose to experience this hotel as well.",
      "rate": 5.0,
      "tripDate": " June 2021"
    },
    {
      "title": "Amazing Stay at the Incredible Bisha Toronto!",
      "text": "We recently stayed at the Bisha Toronto for a “Staycation” and what a great experience it was. To start, the manager Alejandra was incredibly hospitable and catered to all our needs. She had our room ready and cooled before we arrived as we had said our A/C had broken at our place and sparked our staycation. We arrived with our dog Whisky and upon arrival were pleasantly greeted by the hotel staff who had our room ready early. When we entered the room we found a Bisha dog bed and food/water bowls for Whisky which was unexpected and a nice touch. The room was very large, clean and had a nice city view. Unfortunately, the amenities were closed due to COVID, but I have been to the rooftop pool before and it is amazing! The attention to detail is second to none here and we will definitely be back for another stay when everything is open again! Thank you Alejandra and the Bisha Staff for taking such great care of us!Alex, Mel, and Whisky.",
      "rate": 5.0,
      "tripDate": " May 2021"
    },
    {
      "title": "Amazing stay at Bisha Hotel Toronto! 10/10 recommend!",
      "text": "I highly recommend staying at Bisha if you are looking for a clean and modern hotel within walking distance to many attractions and 10/10 service! We were in town for my husbands work conference and we booked 3-nights with our Amex Platinum through the Hotel Collection. From the moment we arrived to the hotel we felt like a VIP guest! The front desk staff, especially Maria, was very welcoming, friendly and helpful. We arrived to the hotel early at 10am and we were not expecting our room to be ready until after noon. But Maria was able to accommodate our early arrival and gave us a room upgrade. Our room was very spacious, clean and the king bed was very comfortable. There were even macaroons waiting for us with a welcome letter. The hotel is only 8 minutes walking to the convention center and 10 minutes walking to the Queen Street West shopping district.Since Bisha is a part of Amex Hotel collection, we also got a $100 USD hotel credit that could be used at any of their 2 restaurants, the coffee shop, the bar or room service. We also received free daily breakfast for up to $60 CA for 2 people. We used our credits for brunch at the 44th floor restaurant called Kost, which had a beautiful view of the city. We also got dessert via room service and coffee/pastries at their coffee shop called French Made. We charged everything to the room and did not pay anything extra upon checkout since our credits covered the costs. Overall, we really enjoyed our stay and will 100% be booking again when we are back in Toronto.",
      "rate": 5.0,
      "tripDate": " May 2024"
    },
    {
      "title": "Treated like a King",
      "text": "I stayed here for a weekend with some friends and the service here was phenomenal. The girls at the front desk, Flavia and Angel, knew my name and would ask how my stay was going and if I needed anything each time I left the hotel. Fantastic personal touch! The rooms were luxurious and housekeeping knew to put on the blackout curtains before I would return in the evening. Definitely would stay here again next time I come back to Toronto!",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Staycation",
      "text": "Spent a night at the Bisha this weekend as a little staycation! 2020 has been an interesting year and just wanted a change of scenery.The trip was perfect, and the staff did so much to make us feel welcome. Alejandra and Sadika specifically were angels. There was another gentlemen, maybe a houseman, who delivered some items to our room who was very friendly (forget his name)Alejandra checked us in, and made sure everything was to our liking. She confirmed details of our stay and gave us her contact in case we needed anything. She was a ray of sunshine!! Sadika we ran into in the hallway and she started speaking with us, she was so so kind and even gave us some chips to snack on. Having staff like this who make an effort, especially in such a weird time of quarantine and lack of social interaction helped me forget about the craziness of the world briefly.A couple qualms. First, the WiFi in our room wasn’t working when we had returned at night, so we called front desk and the overnight gentlemen was not very helpful. Sounded impatient and just gave me a 1-800 number to call. As it was midnight I didn’t really feel up to that. The login page showed there was a “pin” option to login, so I was hopeful front desk could’ve given me the pin. Second, was that we had reservations for Kost at 9am on Sunday, and when we went upstairs there wasn’t a soul in the restaurant. We went to the lobby because we were told if the weather was bad (which it was) they would serve at street level, but there was no one there either. No one at front desk was aware the restaurant wasn’t open/no staff. So I was unfortunate we had to source food elsewhere. Of course times are hard right now, but notice that our reservation couldn’t be upheld would have been appreciated.However, the pros of the stay outweigh and small cons! Will be back in future",
      "rate": 5.0,
      "tripDate": " November 2020"
    },
    {
      "title": "Stella Suite with Patio",
      "text": "With all of the The restrictions currently in place in Toronto we didn’t know what to expect of booking a room at BISHA  to have a staycation. From the moment of our arrival we were greeted by Alejandra at the front desk who really made us feel extra special! She knew exactly who we were and attended to all of our needs including making suggestions of the best take out restaurants in Toronto. Shoutout to Walid who helped run out in the middle of the night and get us some much needed Tylenol we were waited on hand and foot to say the least.The hotel just gave you a sense of feeling cool 😎! We ended up going all out and booking the Stella suite and let me tell you when we walked into the suite it was mesmerizing to say the least! You could tell a lot of time effort and energy went into these rooms. What was even more breathtaking was the size of the outdoor patio / terrace was the biggest I have ever seen for a hotel suite! I would recommend this hotel to anyone looking for a world class experience in Toronto regardless of if it’s for business or pleasure!",
      "rate": 5.0,
      "tripDate": " May 2021"
    }
  ]
}