{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Bonnevue Manor Bed & Breakfast Place",
    "url": "/Hotel_Review-g155019-d531437-Reviews-Bonnevue_Manor_Bed_Breakfast_Place-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.0",
      "reviewCount": 55
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "33 Beaty Ave",
      "addressLocality": "Toronto",
      "postalCode": "M6K 3B3",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/14/ec/58/87/photo4jpg.jpg?w=500&h=400&s=1"
  },
  "description": null,
  "featues": [
    "Free parking",
    "Secured parking",
    "Free High Speed Internet (WiFi)",
    "Wifi",
    "Airport transportation",
    "Newspaper",
    "Non-smoking hotel",
    "Air conditioning",
    "Bottled water",
    "Iron",
    "Wake-up service / alarm clock",
    "Complimentary toiletries",
    "Non-smoking rooms"
  ],
  "reviews": [
    {
      "title": "Comfort, Privacy, Convenience, AND Special Attention",
      "text": "My boyfriend and I stayed at the Bonnevue Manor for 2 days of  the Memorial Day Weekend. The staff was very pleasant, warm, and very helpful-neither of us had been to Toronto and they were very good at providing information on attractions, neighborhoods, and transit.  Speaking of transit, we took the streetcars and rocket everywhere. King street is a block away and convenient to the B&B. The neighborhood's an eclectic mix with some stately architecture mixed in with apartments and little stores. It's also very close to the lakefront and High Park. Just a note, stay on the lakefront/King Street side of the block rather than walking up to Dundas for transit-the neighborhood gets a bit dodgy.The Inn itself was not luxurious but casually appointed with some period furniture and some seemingly thrifty finds- but it all went together well enough. The room we stayed in was large. The bed was very comfortable, the bathroom was really nice, clean, and intimate. The color coordination was great and the fireplace was nice to look at (not functioning).  The common areas are wonderfully bright and colorful. The breakfasts were exceedingly fresh-deliciously ripe fruit, great pancakes, delicate breads and pastries. They also make note of any dietary preferences. There's the convenience of resonably priced soft drinks and water in the enclosed canopied deck area which was nice for mood and just hanging out. Coffee, teas, cocoa, and cookies all await you whenever you choose. We really enjoyed the convenience, super-quietness, and overall charm of the inn and its surroundings.",
      "rate": 4.0,
      "tripDate": " May 2005"
    },
    {
      "title": "B&B in Toronto",
      "text": "A very clean, safe and comfortable B&B with excellent buffet breakfast and service which is friendly and helpful without being obtrusive. Don't be too worried about the run-down appearance of the district in which it is situated. Altough a lot of the people are not well off we found them to be very friendly and willing to help. UK visitors please note that they don't take debit cards-credit cards are fine. No TV in the room, but who needs one?",
      "rate": 4.0,
      "tripDate": " August 2006"
    },
    {
      "title": "Friendly staff, amazing breakfast but small rooms",
      "text": "Although the staff are friendly and the breakfast was amazing, the beds are uncomfortable and the rooms are small.  We were put in the room on the main floor, right across from the dining area and were awoken all morning when people came for breakfast.  We asked the staff to be moved as soon as we saw where they had us and they wanted $30 more per night to do so.  We checked in right at 3pm, so there should have been some better options.",
      "rate": 3.0,
      "tripDate": " May 2013"
    },
    {
      "title": "A nice room--in a run-down house in a remote neighborhood",
      "text": "After reading the positive reviews here, I had high hopes for this B&B. The host couple was nice, and the house had a nice historical presence. Also, the breakfast was nice, and they seem to take great care fo their garden.WIth that said, I feel morally obligated to point out the following.  First of all, the neighborhood is full of drunken people, even during the day, and we were frankly scared. The street car/light rail station was close enough, but it takes about 30 minutes to get to the center of Toronto. You'll be waiting for and riding the street car with a bunch of intoxicated people until you reach the center of town... Needless to say, we opted to take a cab, which costs about $20 to town each way. So, it might be wiser for you to rent a car.Second, although the house has potential and the room itself was nicely remodeled, the house is run down and needs some updating. The window kept on opening up, for example, and they kept on running out of hot water as we were taking showers.Third of all, although one of the Internet domain names they use is suggestive of gay ownership and/or operation, everybody there is heterosexual--from the couple who owns and operates it, the people who help, to the guests, and the neighborhood is far from being gay friendly. So, my partner and I felt somewhat deceived and perhaps \"used.\" However, all in all, it is not a bad place for what it is, if you know what you are getting yourself into...",
      "rate": 1.0,
      "tripDate": " July 2008"
    },
    {
      "title": "Lovely house, terrible night",
      "text": "This eclectic house is quite lovely and very clean. However at 2:00am the MANAGER had his friends over to party. They were playing the piano in the common room on the 1st floor, then went upstairs to the 3rd floor (directly above us) and partied until finally we went up to tell them to be quiet...this was at 4:38am. They took it outside (front yard, outside our window ) and continued until 4:56am. Awful night, no sleep. Do not stay here unless you ensure quietness.",
      "rate": 2.0,
      "tripDate": " October 2012"
    },
    {
      "title": "Friendly, helpful, big rooms...very comfy!",
      "text": "We stayed at the Bonnevue for two nights on our first trip to Toronto and just really enjoyed it. We barely limped into town as our car decided to shake violently less than a mile away from the B&B. Finally making it to the place was a relief and the host did all he could to help us. He found a Mazda dealer for us, mapped a route for us, and just tried to help us as much as he could. Once we got the car thing sorted out, he gave us tons of ideas of places to go, things to do, etc. The whole vibe was really friendly and welcoming. We didn't see people who worked there much (in that sense its very different than a hotel where someone's always at the desk) but that didn't  bother us since when we did see them, they were so attentive and just sweet.The place is a B&B, so I was prepared for some quirks. Thankfully there were no pictures of the owners' family members staring at us in our room and no strange collections of dolls, teddy bears, or anything like that all over the place. While there's nothing inherently wrong with those things, I've often found that when I'm surrounded by those at inns or B&Bs, I really feel like I'm intruding in someone's house. It did have that feel of a house, of course, since it actually WAS a house (and had tons of potted plants and stacks of magazines all over the place) but I wasn't overwhelmed by it. The stairway smelled a little strange--I couldn't put  my finger on it, but it seemed to me like when strong cooking odors settle into carpeting. It wasn't offensive, just noticeable. But once we got onto the floor where our room was situated, there was no problem. Anyway, there was a nice little back patio (plastic furniture--very basic) and our room was spacious and comfortable, with a huge, comfortable bed. I didn't expect to have lots of hotel-like amenities (TV, cable, wireless internet, in-room coffee maker, etc.) since I've never had those in non-hotel environments. So, there's not much to do in the place itself but we were in Toronto to see the city, not hang about our lodgings.There was also a really nice breakfast--lots of tea, not so great coffee, though (British thing, perhaps?)--and we left feeling very happy about our stay. Would totally recommend for laid-back travellers. If you want constant attention and people to snap into action when you snap your fingers, try some place else.",
      "rate": 5.0,
      "tripDate": " June 2006"
    },
    {
      "title": "Comfy B&B with Awesome Breakfasts",
      "text": "Very clean and comfortable B&B with fabulous breakfasts cooked by Dorothy.  Other than having found it on Tripadvisor, you’d never know to stop in.  Zero signage, per neighborhood regulations, almost had me thinking I’d been scammed, or dropped at the wrong address by my taxi.  Once figuring out how to get inside, I was warmly greeted by Dorothy, given a brief tour and shown to my room.  Cozy living room seating area with TV.  Out back is a fenced patio with refrigerator and drinks for sale.  The front porch sits high over the street, and is a nice place to chill.  I had a 3rd floor suite, roomy, adequate bed/bathroom.  The window air conditioner took a while to really cool it down.   Very fast internet, over 40 Mb/s.  Breakfasts by Dorothy were the highlight.  Fresh fruits, at least 10 awesome cheeses, fresh breads/croissants, typical beverages, plus some sort of hot dish.  Eggs benedict on a tender moist biscuit was awesome.  As was the quiche with bacon the following day.  The only thing I would change is the serving time, not until 8:30, a bit late for me as a business traveler.  Located about 2.5 miles from downtown Toronto, easily accessible by public bus or street car, however it takes about 30 minutes each way.  At $130 a night, a real bargain vs $500 downtown.  3 star facility, 4 star food.",
      "rate": 4.0,
      "tripDate": " July 2017"
    },
    {
      "title": "Fraternity House",
      "text": "We received a warm welcome from Dorothy, the room was great, washroom area very clean. The beds where iffy (eggcarton foam on top of mattress). I didn't look beyound as I may have left then and there. Breakfast was great, good selection.As for some of the quest the night we stayed I thought I was at a fraternity house, the exccessive noise went on until 4:30AM. There is no access to a public phone when management is not there, they do not stay during the night so if you have a problem big or small make sure you bring your cell phone and don't hesitate to use it. Parking should not be an issue although is was for us because to the unruly guest. The neighbourhood is so so but, we where not bothered by anyone.LorraineOttawa",
      "rate": 3.0,
      "tripDate": " October 2012"
    },
    {
      "title": "Very friendly, clean, convenient, and oh, those hot breakfasts!",
      "text": "B&B people tend to fall into two basic types.  One type is more interested in the accommodation itself - its historical significance to the area, the accuracy and uniqueness of the furnishings, the special \"pampering\" touches offered by the hosts (like afternoon tea, for instance), while the other is less focused on the features of the place (other than perhaps the location) and is interested in the human connections - the friendliness and local knowledge of the hosts, the people in the neighborhood, the interaction with other like-minded guests.  And to be as transparent as possible, this author is clearly an enthusiastic  member of the latter type.  Some of the most meaningful travel experiences I have ever had have come from \"inside local information\" gleaned from helpful B&B hosts.Make no mistake, Bonnevue is a beautiful historical home, which is nicely appointed and extremely clean, and it is set in a pretty neighborhood, which is a very easy streetcar ride into downtown Toronto, but its real charm comes not from museum-quality appointments, but its human connections.  To find yourself witnessing a \"cultural exchange\" over breakfast between Glenn, the host, and a few of the guests about the differences in US and Canadian healthcare drives home the point that you are not staying at a Hilton -- and that is a wonderful thing.  And to walk out front first thing in the morning and have a pleasant five-minute conversation with a neighbor from across the street is what makes the B&B experience so supremely satisfying.  As for the room, it was very clean (if not overly fancy), the bed was comfortable, the bathroom was throroughly modern (complete with a rainshower head), the A/C unit worked well, and the dresser worked (sort of...) - one of the pulls needed to be re-secured, but hey, that's the way old furniture works, right?Finally, a quick word of warning about the hot breakfast option: it is only for the truly committed!  Everything that came from the kitchen was hot and tasted great, but if you are a light eater (or health-conscious), there is more than enough on the continental bar to get you going for the day.  This may be the first (and only) time I will ever have THREE different breakfast meats on a plate along with my scrambled eggs and hash browns!Highly recommended to the culturally-minded traveler!",
      "rate": 4.0,
      "tripDate": " July 2009"
    },
    {
      "title": "Lovely surprise",
      "text": "We originally focused on Bonnevue because of its location near High Park, the Lakeshore and my son's place.The room we had was on the second floor with a private covered deck.  Sounds of birds filled our mornings.  Breakfast was amazing.  Our host, Glenn, catered to needs such as a lactose intolerance with grace and creativity.We enjoyed access to a common living room.  Computer with internet access was in Fedora , a Linux system, and quite slow so only good to look up quite items or send textbased email.s.Location was close to Kind and Queen streetcars and walking distance to Roncesvalles, Highpark and Tennis, rowing clubs.A great alternative to hotels downtown if you are looking to get a bit off the beaten path.",
      "rate": 5.0,
      "tripDate": " July 2009"
    },
    {
      "title": "Great stay",
      "text": "The house is located in a quiet neighbourhood. Behind the house there is a parkingspace which we liked as we felt we could leave the car there safely. You have easy acces to public transport which is a good and cheap way to get around the city. We were welcomed by Glenn who gave us a good advice on how to get to the city centre. There are a lot of small and good restaurants located very close. And finally we would like to say how much we loved the breakfast.",
      "rate": 4.0,
      "tripDate": " May 2018"
    },
    {
      "title": "Fabulous breakfasts!",
      "text": "Located in western Toronto, about 25 minutes from downtown by streetcar which is half a block away.  Quiet residential neighborhood with many good ethnic restaurants within walking distance.  Greeted by Dorothy who was very friendly and helpful.  Room was clean, good size, en suite bathroom.  Bed was a little soft.The breakfasts were excellent, with a different tempting variety each morning.  Breads, cheeses, fruits, lox, a hot entree along with cereal and yogurt available.  Only suggestion is to have the excellent coffee available before 8:00 am.",
      "rate": 4.0,
      "tripDate": " September 2017"
    },
    {
      "title": "Great stay",
      "text": "Wonderful hosts, couldn't do enough for us, very knowledgeable. The room was very comfortable and the breakfasts brilliant!! Very convenient for transport, trams or bus, to town centre, good local restaurants",
      "rate": 5.0,
      "tripDate": " August 2017"
    },
    {
      "title": "Amazing continental breakfast selection, but otherwise a bit odd",
      "text": "We arrived in the evening and were welcomed by Dorothy who was very friendly. Our room was on the top floor and with sloping ceilings and an airconditioning unit.  The bed was fitted under a dormer window, but didn't fit so I banged my head on the corner a couple of times.The room - especially the bathroom - was quite smelly. We decided in the end it was the incense sticks on the stairs, but we kept the fan on in the bathroom all night to try and dissipate the smellThere was NO TV, despite it saying there was on the website and the drawers in the wooden chest of drawers were very sticky and could have done with some loosening up. The shower room was ensuite and backed onto the stairs - hence the \"aroma\"! and the shower had a good pressure despite our heightThe continental breakfast selection was incredible - a wide variety of drinks, fruits, cakes, breads, cheeses, and cold meats which varied every day.  We didnt get on so well with the hot breakfast which you had to preorder and was served at 8.30 sharp. Our first day there was a huge platter covered in various hot food items and you helped yourself.  Dorothy had explained that if not many people ordered a hot breakfast then she dished up individual plates.  The problem was there was no choice, so there was a chance you wouldn't like or couldn't eat it and we hate wasting food. There was plenty of other food available though so we didn't go hungry!",
      "rate": 2.0,
      "tripDate": " July 2017"
    },
    {
      "title": "Great place to stay, fantastic breakfast.",
      "text": "Bonnevue Manor is not downtown, but is in a quiet neighbourhood with easy access to the shore and downtown. We arrived by public transport and used that system to get around as well as walking. Glenn is a helpful host sharing lots of local info and able to book trips to Niagara. He introduced the area to us. Dorothy provided a fantastic and varied breakfast every day and was so lovely to chat with. We also liked chatting with other guests over breakfast. We enjoyed mooching around the hustle and bustle of downtown, and then coming back to the peace and quiet back at base at night.",
      "rate": 4.0,
      "tripDate": " June 2017"
    },
    {
      "title": "A Cozy Spot",
      "text": "My first stay in Toronto, and the location was just right--in a quiet spot between Queen and King on the far west end. We had a warm welcome at the Bonnevue from Glenn, who thoroughly oriented us to the neighborhood, complete with the great tip to buy day passes for a local transit at a nearby convenience store, solving the hassle of parking downtown and of managing trip transfers. We had a sunny room on the third floor (wide staircase) and everything was comfortable and clean. I truly felt like I was staying with friends. Dorothy's hot breakfast the next morning was massive and tasty--we had to walk quite a ways before we had room for lunch! There is a generous parking area in the back off street and exclusively for guests. Springtime in this quaint Victorian neighborhood meant lots of new flowers too. A comfortable stay.",
      "rate": 5.0,
      "tripDate": " April 2017"
    },
    {
      "title": "What a welcome",
      "text": "After arriving from an International flight, tired and frustrated, what better way could one relax than to be welcomed by Glen into this amazing 19th century B&B, his charm and friendliness helped overcome the rigours of travel. What a delight, and oh so much better than being checked into a faceless hotel. The breakfast in the morning delivered by Dorothy, another friendly and welcoming person, was an amazing array of smoked salmon topped with poached eggs and Bearnaise sauce with sides of fresh baby spinach and tomato and potatoes and crispy bacon. Really fantastic!! I would recommend this B&B at every level, a superb find in a great location.",
      "rate": 5.0,
      "tripDate": " April 2017"
    },
    {
      "title": "The owners were friendly and the food was great",
      "text": "We had the top room, one of 3 i think and it was lovely! Not large but had everything we needed.  The owner was really helpful when we arrived and gave us loads of information about how to get into the city and where to eat. Then we were left alone and didnt see anyone else until breakfast time. We could make tea and coffee whenever we wanted it down in the dining room and it was just like being a guest in someones home.  WE loved it. The area is interesting but there are plenty of places to eat - Trip advisor was really helpful for that as was walking around and having a look.",
      "rate": 5.0,
      "tripDate": " April 2017"
    },
    {
      "title": "Charming old house!",
      "text": "Glenn was a fantastic host. Very warm welcome.Best gourmet breakfast but should be served earlier than 8:30... Complainers do not bother, this is a 1891 house located on a very nice street. No TV in rooms but what an atmosphere.Lots of Tibetan restaurants around.Quiet street with fabulous houses!Very good experience!",
      "rate": 4.0,
      "tripDate": " September 2016"
    },
    {
      "title": "Great place to stay",
      "text": "Bonnevue Manor is a great place to stay.  It is an old but charming house, located on the west side of Toronto between King and Queen street, so it is easy to get to downtown via public transportation. It is relatively quiet compare to downtown and safe to stay.  There are a lot of shops and restaurants around.  Hyde park is very close by.  The parking is free.  Glen, our host is very friendly and gave us a warm welcome and all useful information about the neighborhood and transportation system.The room is basic but clean and comfortable, each room has shower and it is up to date and clean.  There is hair dryers provide in the common area each floor.  The wifi worked well.The best part is breakfast, there are warm breakfast,continental, etc.  We stayed there for three nights and each day the warm breakfast was not the same.  We had poached eggs with bacon on the first day, spinach and egg on the second day and egg and sausages on the last day.  Besides that, the provide several type of cheeses and breads, croissant, sweets, fruit and cereal.  Breakfast was serving between 8:30-9:30 am - it might be late for early morning people but we just took it easy and enjoyed our vacation.For the price we paid and what we got, I think this place was a great choice.  I would highly recommend this place.",
      "rate": 5.0,
      "tripDate": " September 2016"
    },
    {
      "title": "Lovely home away from home",
      "text": "We stayed one night in Bonnevue and found it perfect for our needs. Clean, comfortable, convenient to Queen and King streets, this B&B covers all the basis. Our host Glen told us some ghost stories on arrival, gave us a little history and showed us all the amenities. Our room was small, comfortable and surprisingly quiet. Big, clean bathroom with all the necessities! We opted or the full breakfast which was yummy and offered loads if breads and cereals on top of our hot meal. For the price, Bonnevue was all we could want. Thanks Glen! We loved staying with you!",
      "rate": 4.0,
      "tripDate": " July 2013"
    },
    {
      "title": "A  tip top stay in Torontos West End",
      "text": "Looking for a place to stay in Torontos less than fashionable West End I came across the Bonnevue and thought I'd give it a try.The B&B is  located on a pleasant tree lined street North of King (the dividing line between 'sketchy' and OK) and South of Queen. These are the two main East West arteries in Toronto. Both have streetcar service which trundles you pretty much anywhere a tourist needs to go. It also has the advantage of being closer to the airport than most downtown or east end places. My single  room was on the top floor (3RD)  .The bathroom was spotless with an excellent shower. In fact it seemed to have been redone recently. The walls were rather thin and I could hear my basically quiet neighbours, but fortunately it wasn't a problem. Garrulous Glen and quiet Dorothy were excellent attentive hosts, providing everything one needed. The food was splendid. Great breads and croissants. Fresh Fruit. Plain Yogurt ( requested and provided).Hot milk for the strong coffee (also requested and provided) Wi Fi and free parking in the rear through a very narrow passage.Nearby Roncesvalles is a thriving food and boutique street, and not far away one can walk along Lake Ontario. A great stay. I'll be back.",
      "rate": 5.0,
      "tripDate": " May 2013"
    },
    {
      "title": "Sure beats a hotel",
      "text": "We stayed at the Bonnevue Manor condo in downtown Toronto and what a treat it was. Over looking the CN tower, the view was amazing. We had rented the condo for a week. It was a self-contained unit with one bedroom, living room, full kitchen, dining room, and full bathroom. It was the same cost as a hotel but much more comfortable. We were living at home while away from home. Transportation was very handy. The street car is located right across the street. The street car took us everywhere we wanted to go. To the harbour, to the grocery store, to China Town, to the business zone. It was only $3.00 per person to ride a street car. Much more economical than a taxi. We bought our own groceries and prepared our own meals so we didn't have to eat restaurant food all week. There was internet, wifi, TV, and all the ammenities of a hotel. Glenn, the host, was great. He was so helpful when we needed information or directions. We enjoyed our stay and would definitely go back.",
      "rate": 5.0,
      "tripDate": " May 2012"
    },
    {
      "title": "An Outstanding B&B in Toronto!",
      "text": "This B&B, in an impressive former mansion in west Toronto (very easy access from the Gardiner Expressway/QEW) is outstanding! From the warm welcome by Dorothy, to the delicious breakfast by Glenn, to the warm and comfortable bedrooms, everything is excellent! With free off-street parking in the back yard, and the included hot breakfast, the cost is much better than mid-class hotels in Toronto. Easy access to King St. West and Queen Street West makes getting around simple. Each room and the public spaces (including even an ironing room!) all have ample supplies of reading materials, from novels to magazines (including Gaiety) to guide materials. The managers are friendly and very helpful.",
      "rate": 5.0,
      "tripDate": " January 2012"
    },
    {
      "title": "Very quaint & quiet",
      "text": "We loved this place and will stay again.  The breakfast was great, coffee was strong, room was clean, building was quiet.",
      "rate": 5.0,
      "tripDate": " August 2011"
    },
    {
      "title": "A good place good location",
      "text": "I stay at the Bonnevue for 5 days and toured Toronto from there. The location was good, in an older area. Queen St west  is a bit rough but easy access to transit. The house is a lovely old heritage house with lots of brick and wood. Unfortunately it looks like they are going to paint some of the original brick at the entrance gold and cream, I guess they just don't understand the concept of \"heritage\" and how important it is to keep it original and intact.The food was good and plentiful. An array of cold self serve breakfast items with cheeses, breads, cereals, fresh baked items and or a full hot breakfast of the day. They cater to dietary needs too.The room I was on the second floor, had no bath but a lovely walk in shower. The bed was not terrible, had an egg crate foamy on the mattress but the linens were ok. The room was tight but had a large private deck to sit out on which was nice in the summer. Individual air conditioners in each room. I brought my own laptop and they have a cord you can sign out so you have internet in your room or from any electrical outlet in the house, not exactly wireless but it works well and it's fast.The only thing I really did not like ewas the smell when I walked in the door. A strong smell of bad mens cologne. There was a bucket in the lobby that water was dripping into. Perhaps it was to cover the smell of stale water? I'm not sure but that part was not pleasant.All in all a pretty good stay and a good location",
      "rate": 3.0,
      "tripDate": " August 2011"
    },
    {
      "title": "We enjoyed our stay, recommended",
      "text": "- beautiful house- fine rooms with good beds- leaf-covered terrace- air conditioning throughout the house- location good reachable by public transport- we also walked Queen Street W all the way to downtown, a long routewith many shops. Recommended!- both mornings of our stay owner prepared a very nice breakfast on request,both hot and continental- hospitable owner",
      "rate": 4.0,
      "tripDate": " July 2011"
    },
    {
      "title": "Good location, poor wedding planning, service good if you stick to their agenda",
      "text": "We stayed at Bonnevue Manor as part of their Toronto Gay Weddings venture. Unfortunately they botched up the wedding, telling us months in advance that the wedding was at 5pm, then changing the time without telling us until we arrived, a day before the wedding. This meant some of our guests arrived after the wedding had taken place because we couldn't get hold of them. We did not receive an apology and this was very upsetting.We also wanted our own choice of celebrant, and this seemed to be too much trouble, the manager thinking it was acceptable to trash her at length to us.Another pair of guests who also went there to get married had no problems, but I think this was because they didn't specify any preferences and went with the manager's preferred providers.The B&B is well located, though the neighbourhood can be a bit scary at night (by Australian standards anyway).The rooms are simple, but very comfortable. There is free internet in a common area, and TV in the common area also. There are payphones, but no phones in the rooms.There is no guest fridge which is a little frustrating, as tea and coffee is available all day as long as you don't want milk, which is only out at breakfast. We would have been happy to buy our own, but had no where to keep it.The manager was resentful when we asked for breakfast at 7.30, rather than our allocated 8.30 one morning as we had booked a tour. A lovely breakfast was provided nonetheless. He also failed to pass on a message that our tour time had changed which left us standing outside in -11 degrees for 45 minutes.Payment is upfront, so when we left early, partially because we were so upset about the wedding and the manager's behaviour, there was no refund.",
      "rate": 2.0,
      "tripDate": " January 2008"
    },
    {
      "title": "Missing some key \"creature features\"",
      "text": "My partner and I went to Toronto in July 2006 to get married.  Bonnevue Manor offered packages for getting hitched at the wonderfull old B&B.  The wedding went off nicely, and everything was as expected.  The wonderful old place has a nice charm, and when taken for what it really is, this is a great place.However, the rooms leave a little to be desired, lacking some key \"creature features.\"  The AC was cold, the water was hot, the beds were soft, but... that was about it.  There was no TV outside of the front foyer.  There were no refridgerators in the rooms, and the one in the common areas was filthy.  There were no glasses available for when you did go to the store for a drink.  There was no telephone in the room, thankfully our cell phones worked great.  There is a common PC that all can use, but no Internet connection in the rooms.  Thankfully someone nearby did have an unsecure wireless network for those that are brave enough to try it.",
      "rate": 2.0,
      "tripDate": " July 2006"
    },
    {
      "title": "Bonnevue Manor is Home Away From Home! Amazing place",
      "text": "Glenn & Dorothy run this immaculate B&B with lots of love and passion for their guests. They couldn't have made my stay any more welcoming than expected. Lovely place and the breakfasts there to die for! Absolutely delicious and both Glenn and Dorothy made sure I was safe, secure and well-cared for. They provided me with excellent advice and assistance with public transport and I shall definitely be returning again. B&B itself is very well situated within easy access to public transport and there are lots of small and good restaurants nearby. Very happy and pleasant stay. Thank you and greetings from Nish K - London, England.",
      "rate": 5.0,
      "tripDate": " September 2018"
    },
    {
      "title": "Great value, location and altogether wonderful experience",
      "text": "What a wonderful surprise. Not the standard teddy bears and fru fru found at so many B&Bs. A beautifully restored Victorian mansion. Our bedroom was huge -- 2 queen-sized beds, lovely large ensuite and tons of room. Less than a 1 block walk to the King St. streetcar that took us downtown to the theatre in 20 minutes. The B&B location is near the Polish area of town (Roncessvalles) and we returned after the theatre and headed for a wonderful authentic Polish dinner. The neighbourhood is a nice mix of old and trendy. The B&B was spotless, free parking at the back of the B&B, and in the summer, there are lots of decks for sitting outside. Couldn't beat the value. Would never find a comparable hotel in Toronto for the money -- less than $150/night (including tax).",
      "rate": 5.0,
      "tripDate": " October 2008"
    },
    {
      "title": "Great visit",
      "text": "Our room was on the third floor. It was small, as it originally was the maids quarters, but it had everything we needed. Private bathroom with walk in shower; hot water was in abundance. There is a skylight, but the shade does not close completely, and the shade on the other window lets in a lot of light. I woke each morning way earlier than expected/wanted due to the light in my face. The bed was comfortable and the window air conditioner kept things cool;clean towels and bed service daily. Free wifi worked well; did not try the TV. Breakfast was amazing. There is the option of Continental or plate service. Multiple options of breads, butter, jam, etc. Eggs, meats, fresh fruit daily. At least a dozen kinds of tea as well as a coffee machine with latte, cappuccino, etc. available at all times. The house is in an area with many small shops and food spots near. Give @craigscookies a try. Delicious! The boardwalk is walking distance and the tram is just down the street to go into the city. We did not see the manager after our initial check in, but did not have a need too. One suggestion would be to provide info as to how to contact staff if needed.",
      "rate": 4.0,
      "tripDate": " June 2019"
    },
    {
      "title": "Interesting stay at Bonnevue",
      "text": "Glenn and staff are welcoming and excellent.  The breakfasts were great and the guests there are mostly from Europe which made for some fun conversations.  We had a room on the first floor, with it's own bathroom which was great.  The bedroom is a little small with a window A/C right next to the nightstand. It was fine, but have a hard time giving it a 4 or 5 star.  The location is in a good spot with an easy bike ride or tram to the city, about 3 kilometers away.  If you rent a bike, make sure you read all the instructions as finding an empty spot to ditch your bike is a bit challenging.  The bikes worked great though.  Some nice shops and a lot of interesting restaurants in the area.",
      "rate": 3.0,
      "tripDate": " July 2018"
    },
    {
      "title": "What an amazing place!!",
      "text": "Bonnevue Manor is described as a 'bed & breakfast'; however it is totally unlike any B&B or hotel we have ever stayed in!  It is a Victorian urban mansion in a tree lined avenue, which has been superbly restored, and enormous care has been taken to match all the furniture, fittings and decor to the period of the property. Staying there you feel like you are personal guests of the owner staying in his country mansion which happens to be in the suburbs of Toronto. This is very appealing to an English tourist! Yet you rarely see the owner, who leaves guests to enjoy the superb accommodation. However upon arrival Glenn provides a superb brief covering the history of the house, information about transport etc, and goes out of his way to help his guests. There is no sign outside that this is a B&B or hotel; it is just 33 Beaty Avenue to the passer-by.  It has no need to advertise itself, as it clearly survives on personal recommendation and excellent feedback.After two weeks driving around Ontario we gave back our hire car before arriving at Bonnevue; however there is ample free parking behind the house, and had we realised how convenient this is we may have retained the car.The accommodation is excellent, clean and spacious, and there is a lovely guest sitting room on each of the two main floors. In addition our room had its own sitting area with a large comfy sofa, next to the TV. Soft classical music is played quietly and discretely in the background in the communal areas. There are also so many nice touches; an enormous bowl of chocolates in the sitting room, large tins of biscuits in the covered patio area, lots of interesting books and magazines spread around.The wifi is free and works very well. There is a self service coffee/tea station which offers an amazing 19 varieties of tea and over seven types of coffee 24 hours. Breakfast (served 8.30 to 9.30) is excellent with, in addition to hot food, an amazing variety of breads and cheeses. The time may seem a bit restrictive to some, but suited us perfectly.Although Bonnevue is in the suburbs, there is an excellent tram (street car) service along Queen Street West, with a stop just at the end of Beaty Avenue, five minutes from the Bonnevue, 25-30 minutes to Downtown. Queens Street West has many good restaurants within a short walking distance.  Overall a lovely place to stay! It is a superb example of a very sympathetic restoration of a Victorian urban mansion, and a text book example of furnishing and decorating such a gem whilst accommodating all the necessary fire and safety regulations.",
      "rate": 5.0,
      "tripDate": " June 2018"
    },
    {
      "title": "Quaint",
      "text": "This B&B is located in west Toronto between Queen and King street. The streetcar will take you into town in half an hour. The place feels like home and is a bit quaint - in a very nice way. Rooms are spacious and breakfast is great and differs day by day. Excellent care by Glenn and his wife. Lots of restaurants  (mostly asian) are close by and serve good food for a very reasonable price.",
      "rate": 4.0,
      "tripDate": " September 2016"
    },
    {
      "title": "My third visit",
      "text": "In a less than 'fashionable' part of town (Toronto's West End) sits this 19th century house. Built for a doctor it's now a comfortable place to stay. On a quiet tree lined street ,convenient to Torontos two main East /West streetcars, Bonnevue has  free wi fi and parking plus easy access to highways and the airport, it has the added advantage of imaginative and plentiful Breakfasts. The Garrulous Glenn is always ready to discuss the topics of the day, if you feel like it.Furnishings and the common sitting rooms are classic mixture of odds and ends, but the bathrooms are all modern and well stocked.A good place to stay off the beaten track.",
      "rate": 4.0,
      "tripDate": " September 2014"
    },
    {
      "title": "Good Bed and Good Breakfast",
      "text": "very charmant house, the bed and breakfast is not in downtown. You need the car to reach the main attraction. parking is free. breakfast is very very good but you need to select if continental or not in advance, even if there was not microwaver in the room of in the hall, the owner was so gentle in getting the baby milk warm at 7 'o clock in the morning.",
      "rate": 3.0,
      "tripDate": " July 2014"
    },
    {
      "title": "1891 was a good year.",
      "text": "We stayed at Bonnevue Manor in Parkdale Village in the west of Toronto.at the tail end of the terrible winter, when nothing looks it's best. However, once inside this Victorian home, we found every effort had been made to maintain this home in splendid and one might say florid style. Glenn, the owner, says he allowed an OCAD student to go wild, and the main floor is in a flood of primary colours and floral murals, whereas the upper floors had been done in a more conservative Victorian mode.  Period electric lighting fixtures stay,though knob and tube wiring has been replaced and the plumbing and airconditioning have been attended to. New tile flooring and bathroom amenities indicate the pride of the owner in this business. Breakfast was exceptionally good, There is the option of an excellent self-service buffet and/or cooked breakfast.",
      "rate": 5.0,
      "tripDate": " May 2014"
    },
    {
      "title": "I stayed in 2005",
      "text": "Ok so I'm a little bit late on writing this review, me and my two friends stayed here in 2005 being quite young and traveling a long way on our own the staff made us feel like family, the lady who made us breakfast was amazing who knew there was so many ways to cook eggs lol the man who owned it also showed us how to get around and the cheapest things to do, our room was good can't remember much other than a huge shower I loved my stay in Canada however I could have stayed in a box and loved it the people definitely made our trip amazing :)",
      "rate": 5.0,
      "tripDate": " November 2012"
    },
    {
      "title": "Hospitality at its best",
      "text": "My boyfriend and I stayed at the Bonnevue from Aug. 2nd to Aug. 5th.  We chose the Bonnevue due to its close proximity to the Gardiner Expwy since we were in town for Carnival.  Glenn and his wife Dorothy are wonderful hosts with useful information, great stories and very warm personalities.  They have been there for over 30 years and I appreciated their knowledge and guidance during this trip. Our room was a comfortable size (rm. 13), it had just the amount of room needed for a couple.  The bathroom was lovely with a very spacious shower.  There was a closet and a dresser for your clothing, both of which we used and found to be enough storage.  The place is very quiet, sleep is very sound.  Our neighbors were quiet as well, we often felt as if we had the entire third floor to ourselves.  Breakfast is yummy, they ask you in the beginning of any dietary restrictions/allergies and go out of their way to make sure you are satisfied with alternate choices you make.  I welcome anyone to try this B&B if you're looking for a more intimate lodging experience.  Parking is included in your stay, which is a great added value since street parking in Toronto can be a bit difficult during Carnival time.",
      "rate": 5.0,
      "tripDate": " August 2013"
    }
  ]
}