{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Butterfingers B&B",
    "url": "/Hotel_Review-g155019-d1021709-Reviews-Butterfingers_B_B-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "5.0",
      "reviewCount": 14
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "105 Sumach St",
      "addressLocality": "Toronto",
      "postalCode": "M5A 3K1",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-s/01/29/46/a3/not-your-grandmother.jpg?w=500&h=-1&s=1"
  },
  "description": "Built in 1892 this beautiful, tastefully decorated, semi-detached, Victorian house is located on a quiet street very close to downtown Toronto. The prominent features of this boutique Bed and Breakfast include the stained glass windows, the striking ceiling moldings and an elegant working fire place, all of which are original. Wireless internet access throughout the property. Weddings and Special Occasions welcome and catered for.",
  "featues": [
    "Air conditioning"
  ],
  "reviews": [
    {
      "title": "Beautiful B & B with amazing hosts - don't look anywhere else as this place is perfect",
      "text": "We booked the Cupola room for 5 nights. We were getting married in Casa Loma on the 3rd day we were there and wanted something special - not just a normal hotel, but somewhere with a more friendly feel.We couldn't have wished for more. Justin & Caroline, the owners, are fantastic hosts.Justin was there on his own for the first couple of days and he carried our 3 very heavy cases upstairs for us on arrival and made us feel very welcome.We were so so lucky in that the other room downstairs was unoccupied while we were there so we pretty much had the place to ourselves.  It is a beautiful house and immaculately decorated. Classy and simple - we fell in love with the place completely.Our room was gorgeous - exactly as the pictures on their website http://www.torontobutterfingersbb.com/    The bathroom was huge with a whirlpool bath and seperate shower cubicle. Plenty of cupboard and drawer space.TV with multi channels & Air conditioning unit in the room.Only thing missing was a kettle & tea/coffee , but minor detail.The breakfast we were given was AMAZING!!! We had several cereals to choose from, yoghurts, lovely fresh fruit salad, toast and a choice of either eggs & bacon or pancakes- I had the eggs & bacon every day-gorgeous!! My new wife :-) had the pancakes and has raved about them ever since!!!The Streetcar stop is just at the bottom of the road - less than a minute's walk. Lovely quiet street slightly away from the hustle and bustle but still convenient to everything you would want.Justin gave us a map and told us how to get to places and they both went out of their way to help.  So much so, that when at the last minute the day before we were due to get married one of our witnesses pulled out, Caroline came to our rescue.While I was in tears and panicking that we might not be able to get married as we only had one witness and knew nobody else in Toronto, Caroline (who we had literally only that minute met as she had been away) said she would be honoured to step in and be our 2nd witness.Of course this made our day even more special that someone would do this for us. She even got up at 5am for when the hair and make up lady turned up as the wedding was 8am!!!!We truely can't thank them enough for all they did for us and we have become friends.(Plus Caroline is in our wedding pics too!!)They even gave us use of their own laptop when we needed it - We really could not ask for more.  If you are going to Toronto and want something truely special, book Butterfingers - you won't regret it.  We can't wait to go back.",
      "rate": 5.0,
      "tripDate": " July 2009"
    },
    {
      "title": "A gorgeous place, not just for one night!",
      "text": "My wife and I looked for a quite place close to the city centre of Toronto to start our two weeks vacation in Canada. We found this place on the internet and were already attracted by their stylish website.Butterfingers is perfectly located close to downtown Toronto (also only 2min. walk to street car (tram) on Queen St E) and in walking distance to Distillery Historic District. The owners, the young couple Caroline and Justin are perfect hosts; they do everything to comfort their guests. Their breakfast is delicious and the presentation (Justin’s hobby) is mouth watering.Their two rooms are very tastefully decorated and so is the rest of the house. We stayed in The Nook with its beautiful private bathroom and separate sitting room. We enjoyed every minute of our stay.",
      "rate": 5.0,
      "tripDate": " June 2008"
    },
    {
      "title": "Warm welcome in a beautiful setting! A brilliant B&B",
      "text": "Caroline and Justin are supreme hosts, and their B&B is simply tops. We tend to avoid B&B's (lack of amenities, intrusive owners, too many ye-olde frou-frous, etc.), so we're really glad we listened to Tripadvisor reviewers and chose to stay in this wonderful property with such delightful people.The beautifully renovated house has a serene elegance, with stylish upholstery, saturated paint hues, stunning lighting, and unique decorative objects creating a sleek yet inviting atmosphere. Caroline and Justin made us feel as if we were enjoying a weekend visit with really thoughtful friends: bottled water, welcome chocolates, fresh flowers, access to the kitchen, tons of fluffy towels, large closet... I could go on and on. They are the perfect combination of attentive and trusting. The Nook was quiet and comfortable, with a great mattress (as others have noted). Our own sitting room and bath on the second floor basically gave us the entire second floor to ourselves -- an amazing amount of space compared to a hotel. And, as others mention, the bountiful breakfast is superb! The location is very good for exploring Leslieville, Toronto's up-and-coming neighborhood to the east, where there are scores of funky shops and small restaurants. We also were able to walk to the Distillery District and the St. Lawrence Market. On the corner, less than a minute away, are Dominion on Queen, a nice neighborhood pub with decent food, and the Queen streetcar line, offering very quick access to downtown.The hosts are so charming and kind. Without being asked, Justin went out of his way to print us a map to the Toronto Island Ferry, which was a great help, and also found out how we could store our luggage at a downtown hotel before we caught the airport bus. Bravo, Caroline and Justin!",
      "rate": 5.0,
      "tripDate": " April 2009"
    },
    {
      "title": "Beautifully decorated terrace. Amazing hosts",
      "text": "From the initial enquiry emails till we reluctantly said our goodbyes our experience was nothing but positive at Butterfingers. Jason and Caroline welcomed us in the their amazing home like we were family. We arrived early on the day of check in and our room was free, so they kindly let us settle in and get cleaned up for an afternoon in Toronto. They gave us maps and plenty of info on the area. Our room was amazing. Tastefully decorated, very generous in size and extremely clean with a lovely comfortable bed. The bathroom is also worth a mention, again it was large and spotless. The breakfast the following morning was exceptional, from the place settings down to the quality of the food. From cereals, fruit, juice, toast and hot options made to order, it well and truly set us up for the day.After such a positive experience it made it very hard for us to leave Jason and Carolines beautiful home. I can't imagine you would find a better B&B in Toronto. This place will be number 1.",
      "rate": 5.0,
      "tripDate": " December 2008"
    },
    {
      "title": "Must be the best B&B in Toronto!",
      "text": "This place was beautiful - 2 stunning rooms in a beautifully converted Victorian house. The hosts were wonderfully friendly, the decor is fabulous, we had our own lounge area as well as a great bathroom and bedroom. The bed was extremely comfy and there were lots of lovely personal touches such as chocolates on our pillow, books beside the bed. The location was great, in walking distance from some very trendy areas of shops, cafes and restaurants and close to downtown. I would highly recommend it, and wouldn't stay anywhere else if/when we return to Toronto.",
      "rate": 5.0,
      "tripDate": " February 2009"
    },
    {
      "title": "Ideal",
      "text": "Myself and my girlfriend planned to stay in Toronto for three nights at the end of our 10 day trip to Canada. Having researched both hotels and B&Bs on Trip Advisor we settled on Butterfingers. We were so impressed we thought we would write our first review!Location - we arrived at Union Street station on a Wednesday afternoon. We took a taxi to the B&B. The price was settled at $15 (cad) after a bizarre exchange with a cab driver. He asked me what price I would like to pay. I was tempted to offer next to nothing but thought I would opt for $12 - a reasonable price according to our research. He then asked for $15. I suppose we were too tired after our journey to get in to the spirit of any bartering so $15 it was.The cab ride to the B&B wasn't particularly inspiring. We travelled through a few dodgy neighbourhoods before arriving at Butterfingers which was in Corktown as opposed to Cabbagetown which we initially thought when booking.As it turned out the location was excellent. Butterfingers is situated on Sumach Street between Shuter Street and Queen Street East. There seemed to be a lot more going on on Queen Street East than Shuter Street and that was the direction we travelled in when exploring the city.There is a really nice bar at the corner of Sumach Street and Queen Street East - Dominion on Queen. They have a good selection of beers and the food looked nice though we never actually ate there.We decided to try to use the public transport system as much as possible. It costs $9 for an all day pass. You can buy these from the subway station on Queen Street. The problem is that you have to take a street car (tram for UK readers) to Queen Street subway station. We explained to the street car driver that we wanted to get a day pass and he very kindly let us take the trip to the subway station where we duly bought the day passes. Taxis are reasonably priced and if you have a specific location in mind for a night out which is not accessibly by public transport then bite the bullet a get a cab.Butterfingers - absoultely beautiful victorian house with period features, stylishly furnished, great hosts, fantastic brekkie ...... a total gem!The best thing about the place was the very comfy bed. Nonetheless we still managed to get up at 9am every morning to get a really nice brekkie. Caroline is very welcoming and can rustle up a lovely hot snack of your choice (within limits!) in a matter of a few minutes. Things to do - The CN tower is an essential for anyone going to Toronto. The views are amazing from the viewing lounge. There is an option to go to the very top of the CN tower (may have been called the sky pod). We didn't take this option as our guide was of the view that it wasn't worth the added cost. The queues for that option looked big and I'm not sure if it would have added much to the experience. Yorkville is a nice area for shopping. Although the shops are ultra fancy and wasn't the sort of thing I was after. We spent our last night going to an Italian restaurant called Prego which was fantastic. That was near the ROM museum (which in itself is definitely worth seeing). After that we went to the nearby Hyatt hotel (on Caroline's recommendation). There is a small bar on the 18th floor with a patio area which has amazing views of the ROM and the city as a whole. This was a real highlight of our trip and well worth going to for a drink or two.  Also the patio has got to be the best location in town to have a cigarette!The distillery district is also worth a visit. we ate at the Mill Street Brewery on the Wednesday. The grub was great but the place was a little quiet mid week. On our last day we went to the St Lawrence market area for lunch and wished we had spent more time there as it was buzzing with lots of different restaurants and bars.  We ate at C'est What? bar/restaurant which was great.Caroline arranaged a taxi for us to the airport on way home for a flat fare of $55.  The poor driver took the wrong turn off and switched off the meter at £95 so it was good value for money...think that was a one-off mistake but to be on the safe side its maybe best to allow a bit of leeway with time.All in all we would definitely recommend Butterfingers B&B if you plan to travel Toronto.  Our only regret was not allowing more time there!",
      "rate": 5.0,
      "tripDate": " October 2008"
    },
    {
      "title": "Lots of breakfast, comfy bed!",
      "text": "We stayed for 5 nights while visiting family pre-xmas. It's a lovely restored Victorian. The bed was super-comfy and welcoming to come back to after a day of tromping in the snow. The bathroom was toasty warm on a cold winter's day and the whole place was beautifully decorated.Half a block to the Queen streetcar, it's convenient to get into downtown and to other public transit. Justin and Caroline were completely delightful. Friendly, relaxed and happy to help with ideas about what to do and how to get there.Breakfast is more than you can possibly eat: a huge bowl of fruit, cereal, toast if you want, and your choice of bacon (try the great canadian peameal bacon! Yum!) and eggs, french toast or pancakes. We had to tell them to feed us less! Also coffee, tea, juice, milk...really, quite a bit more than you might expect.We'd definitely stay again and are considering inviting other family to join us there. With only the two rooms, it's quiet, intimate and calm. Oh, did we mention NO STREET NOISE at night? Perfect for a good night's sleep!Quite a bargain for the quality and comfort compared to places near home.",
      "rate": 5.0,
      "tripDate": " December 2008"
    },
    {
      "title": "The perfect place to stay whilst in Toronto",
      "text": "My husband and I found Butterfingers to be the perfect B&B to stop.  Butterfingers really is a gem of a place, they are THE perfect hosts, we felt so at home whilst we stopped there.  The hosts were always ready at hand to help, assist on places to visit, restaurants etc...  Constantly going out of their way to accommodate us.Breakfast was fabulous; we were also treated to these amazing pancakes!!  Absolutely luscious.We would love to return in the future some day.",
      "rate": 5.0,
      "tripDate": " August 2008"
    },
    {
      "title": "more than 5 stars",
      "text": "we stayed 3 nights, and we chose the 'Cupola' room: it's a fantastic and romantic room... caroline and justin, we agree, are perfect hosts and they really helped us in all our needs. In Toronto, this is the place to stay!",
      "rate": 5.0,
      "tripDate": " August 2008"
    },
    {
      "title": "Just what we hoped for",
      "text": "We just returned from three nights at Butterfingers and had such a great stay that I was compelled to write my first TripAdvisor review.  Justin and Caroline are perfect hosts--down to earth, helpful, friendly, knowledgeable.  We loved their restaurant recommendations and their delicious and hearty breakfasts.  (I tend to choose B&Bs based on the reviews of the breakfasts, because I like a hearty/tasty meal before a day of sightseeing.)  We wanted to explore the city on foot and were able to from the B&B,  we felt perfectly safe walking back at night, and we slept better than we do in most hotels.  I like B&Bs for their intimacy and personal touches (and, once again, those breakfasts!), but I'm not one for country decor.  Justin and Caroline have created a lovely, modern aesthetic--from the furniture to the bathroom fixtures to the decorations.  And I'm always impressed by thoughtful extra touches, which here include nice bath products, bottled water, and truffles.  I know we'll try to book a stay here again if we have occasion to return to Toronto.  Thanks for a great stay!",
      "rate": 5.0,
      "tripDate": " August 2008"
    },
    {
      "title": "Absolutely Perfect",
      "text": "We stayed in this lovely house at the beginning and at the end of our round trip through Canada. Although we knew that this means the end of our holidays we were looking forward to return to the Butterfinger's B&B during our journey. Not only the house is cozy and at the same time stylish and the breakfast is delicious but also the hosts are so nice and helpful - we felt amazingly welcome and were so comfortable in their house.We stayed in both rooms they offer to guests and both of them are absolutely perfect. They are spacious, comfortable, very clean and the bed guarantees sweet dreams.The house is situated between downtown and the Queen Street with all the restaurants and bars for an exciting night. So every major attraction that Toronto offers can be reached in a walk.The best refreshment for the days in Toronto is the breakfast from this B&B. Bacon sandwich, scrambled eggs, pancakes, cereals, coffee, tea, fresh orange juice and - the best of all - a huge fruit salad.When we return to Toronto there will be only one place where we stay!- Tina & Stefan, from Stuttgart Jul 6, 08",
      "rate": 5.0,
      "tripDate": " July 2008"
    },
    {
      "title": "The perfect B&B in Toronto",
      "text": "We stayed in this lovely house at the beginning and at the end of our round trip through Canada. Although we knew that this means the end of our holidays we were looking forward to return to the Butterfinger's B&B during our journey. Not only the house is cozy and at the same time stylish and the breakfast is delicious but also the hosts are so nice and helpful - we felt amazingly welcome and were so comfortable in their house. We stayed in both rooms they offer to guests and both of them are absolutely perfect. They are spacious, comfortable, very clean and the bed guarantees sweet dreams.The house is situated between downtown and the Queen Street with all the restaurants and bars for an exciting night. So every major attraction that Toronto offers can be reached in a walk. The best refreshment for the days in Toronto is the breakfast from this B&B. Bacon sandwich, scrambled eggs, pancakes, cereals, coffee, tea, fresh orange juice and - the best of all - a huge fruit salad.When we return to Toronto there will be only one place where we stay!",
      "rate": 5.0,
      "tripDate": " July 2008"
    }
  ]
}