{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "By The Park Bed and Breakfast",
    "url": "/Hotel_Review-g155019-d620178-Reviews-By_The_Park_Bed_and_Breakfast-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "5.0",
      "reviewCount": 656
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "92 Indian Grove",
      "addressLocality": "Toronto",
      "postalCode": "M6R 2Y4",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0e/17/88/d9/the-loft-suite.jpg?w=500&h=-1&s=1"
  },
  "description": "Boutique style bed and breakfast (with or without the breakfast) in High Park/Roncesvalles Village. Steps to the largest park in the city, right in the heart of vibrant community. 2 min. walk to Keele subway station. Easy and fast access to downtown and all attractions. Artist/Designer home completely restored with flair and all modern conveniences. Stay at by The Park B&B includes home cooked breakfast. Vegetarian ,vegan or gluten free options available (\"no breakfast\" option is available at discounted rate). Property features dark woodwork, leaded glass windows, hardwood floors, multiple fireplaces, luxurious bathrooms, garden. High speed wireless internet and parking are available free of charge. Daily rates for $239+19% tax.",
  "featues": [
    "Free parking",
    "Street parking",
    "Free High Speed Internet (WiFi)",
    "Yoga classes",
    "Breakfast available",
    "Foot massage",
    "Non-smoking hotel",
    "Outdoor furniture",
    "Wifi",
    "Complimentary Instant Coffee",
    "Complimentary tea",
    "Special diet menus",
    "Head massage",
    "Shared lounge / TV area",
    "Bathrobes",
    "Air conditioning",
    "Fireplace",
    "Housekeeping",
    "Wardrobe / closet",
    "Microwave",
    "Flatscreen TV",
    "Walk-in shower",
    "Bottled water",
    "Private bathrooms",
    "Refrigerator",
    "Electric kettle",
    "Complimentary toiletries",
    "Hair dryer",
    "Non-smoking rooms",
    "Suites"
  ],
  "reviews": [
    {
      "title": "Another great stay.",
      "text": "Stayed in the Garden View for 3 nights the only downside of which was due to COVID 19 we could not enjoy breakfast with Margo and Ziggy.  Although we did not utilize it this time the location is close to High Park and public transit for those wanting to get outside or downtown.  Another great stay.",
      "rate": 5.0,
      "tripDate": " September 2020"
    },
    {
      "title": "Cozy & Accomidating",
      "text": "We had a fantastic stay at By the Park Bed & Breakfast. Our room (Garden Suite) was clean, spacious, and comfortable. Margot was a gracious host. She made delicious breakfasts each morning and gave thoughtful recommendations on how to spend our time in Toronto. The location of By the Park Bed & Breakfast was perfect for easy access to the city via the Keele subway stop. I would highly recommend By the Park to anyone looking for a quality place to stay on their visit to Toronto. -Claire & Peter",
      "rate": 5.0,
      "tripDate": " March 2023"
    },
    {
      "title": "Meticulous Relaxing B&B with Great Hosts!",
      "text": "We stayed 4 nights and totally enjoyed our stay!  Margo & Ziggy are amazing hosts who truly made us feel \"at home\".  Each morning we enjoyed wonderful breakfasts with choice of eggs, or tasty french toast, side orders of toast , orange juice, delicious  coffee via French press!  The B&B is a victorian styled home with beautiful furnishings and architecture. Nicely landscaped grounds.   Located near High Park (Toronto's largest public park) ideal for nature walks, strolls, or jogs, etc.... Rapid transits is a short walk and many good restaurants in the area. Free off street parking!  We will definitely be back and look forward to staying here again!",
      "rate": 5.0,
      "tripDate": " May 2022"
    },
    {
      "title": "always the best",
      "text": "As a frequent traveller to Toronto, I try to make my stay as relaxing and as uncomplicated as I possibly can. By the Park is my favourite spot to stay. Margo and Ziggy are always the most welcoming of hosts, and I feel like a friend in their home. Every detail is well executed and thoughtful. The rooms are well appointed and comfortable,  and the big bubbly bathtub is great after a stressful day. It is close to public transport and offers beautiful areas to take a relaxing walk. Next to High Park and the lovely stately homes in the streets next to it. I always recommend By the Park.",
      "rate": 5.0,
      "tripDate": " March 2022"
    },
    {
      "title": "Gorgeous Neighbourhood",
      "text": "Margo and Ziggy were  incredible hosts. So helpful. Such amazing conversationalists. Their home is clean, cozy and rich with visual art Ziggy has painted. They gave us Excellent recommendations for restaurants and walks nearby. High Park is a 5 minute walk away and the neighbourhood is mature, safe and has beautiful old homes. We parked our car when we arrived (on the street with free parking) earlier in the day, walked to the TTC subway station and took it downtown to watch a Blue Jays game. Did the same when we returned and moved the car from the street to their driveway for the night. Easy check-in. The Room was stunning as was the huge, private bathroom. Wish we stayed longer; forget staying in a hotel!  We requested a small breakfast (egg, toast, potatoes and coffee) and it was perfect. We will return.",
      "rate": 5.0,
      "tripDate": " August 2023"
    },
    {
      "title": "Comfortable and intriguing!",
      "text": "My husband and I stayed here for four nights as I was having surgery at The Toronto Western Hospital.  Margo and Ziggy were wonderful hosts, friendly and compassionate, and the room we stayed in was comfortable and suited our needs perfectly.  They have a driveway for parking, and when switching of cars was needed, they did it themselves, which saved us much stress.  We highly recommend By the Park Bed and Breakfast!",
      "rate": 5.0,
      "tripDate": " March 2024"
    },
    {
      "title": "\"Totally charmed\"",
      "text": "This was our first time at By The Park, but from now on we will definitely choose to stay and relax here any time we are in Toronto. Margo and Ziggy have done a beautiful job restoring this 1910 home in this gorgeous, walkable neighbourhood, one street away from the forest pathways of High Park. They have made the whole place a treat for the eyes, and the bedrooms are all comfortable and attractive. Their friendly hospitality and willingness to help out with information and suggestions adds to the ambience. For those coming from and getting back to Pearson Airport, it is so handy to the TTC subway station at Keele, and to the Bloor UP Express station off Dundas W. And it has good subway and streetcar connections to city centre.",
      "rate": 5.0,
      "tripDate": " August 2021"
    },
    {
      "title": "Simply. The. Best.",
      "text": "Another comfortable stay in a beautiful home. Margo and Ziggy are superlative hosts. The room is well appointed, exceptionally clean and comfortable. Breakfast is always top notch... french toast is a particular favourite of mine. Also coffee is bottomless.",
      "rate": 5.0,
      "tripDate": " June 2024"
    },
    {
      "title": "A luxurious, peaceful accommodation",
      "text": "This BnB is a jewel right off a main street in Toronto but feels like a quiet island of luxury. Near the subway, a large park and a shopping/dining neighborhood. Beautiful interior, most comfortable beds ever. We stayed on the third floor which includes a large soaking tub and a huge solarium. Coffee/ tea fixings and a mini-refrigerator in the room. Breakfast made to order. The only negative aspect is climbing the stairs with big suitcases - no elevator. Hostess, Margo is friendly, helpful and a source of lots of history of the house and area.",
      "rate": 5.0,
      "tripDate": " July 2023"
    },
    {
      "title": "By the Park handy and accommodating",
      "text": "We have stayed at By The Park four times now, and have tried out all three rooms. We were fully comfortable in all of them, though spoiled lavishly by The Loft. Margo and Ziggy are so friendly and accommodating and ready with helpful advice. UP Train connections to and from Pearson Airport via Bloor Station are less than a ten-minute walk away. Subway to downtown is even closer, at Keele.",
      "rate": 5.0,
      "tripDate": " June 2024"
    },
    {
      "title": "B&B  worth staying in",
      "text": "A very charming place with some antique furniture and excellent artwork.  Good breakfast. Not far from subway and High Park.  Hosts were friendly and interesting, sharing with us some of their stories about the art scene .  Plus: long-handled shoe horn at entrance.  Minus: our bed was so  high I had trouble getting in, although apparently a step stool is available.",
      "rate": 4.0,
      "tripDate": " March 2024"
    },
    {
      "title": "Stressful rather than relaxing",
      "text": "My boyfriend and I were really looking forward to our stay as the previous reviews had been very good. I agree that the setting was great; a very quiet road, very leafy, and it was convienently placed near to the subway. The two cats were also delightful. However, our stay was disappointing in a few respects. We felt that you definitely get the overwhelming vibe of staying in someone else's home, rather than just being able to relax. There was a big deal made about no outside shoes being worn in the house which we both respected and were made aware of when the booking was confirmed. I assumed this was because they must have light coloured carpets which is not the case and no explanation was given. I did not help me to feel at home.The other thing which kept happening which quite upset me was that Ziggy, one of the owners, would be very attentive to all the other guests but not us. For example, we would be served last even if we came down before other people or everyone would have their juice poured for them and then the jug would just be put infront of us to serve ourselves. I'm not sure if it was because we were the youngest guests, but I do think that people should be treated equally no matter what their age.There was a limited choice of hot food at breakfast which made it feel that the choices were being offered at their convenience rather than the guests'. We knew it was vegetarian when we confirmed the booking but only eggs in some form were offered every day and in the main you did not get a choice of how the eggs were made.  There was no TV in the room. Ziggy informed us at breakfast that he dislikes TV and never watches it so it was strange then to see him watching TV one evening when we had to disturb him and Margot to get our room key. There was also no kettle in the room, which I feel is a staple you would expect to have in the room. I felt that for the price of the B&B these two items alone should have been there. Overall, not an experience we would like to repeat.",
      "rate": 2.0,
      "tripDate": " September 2008"
    },
    {
      "title": "very noisy due thin walls and floors!",
      "text": "Stayed in one of the downstairs rooms at \"High Park Suites\". What a disappointment! We expected a quaint little room instead we had to admire the plumbing works in the room, in the bathroom and the in the shared kitchen area. On their website, these large pipes running along the ceiling have been cut out of the pictures!! What was even more irritating is the lack of soundproofing in the floors and the walls. We could hear next room guests coughing, chatting and having their tv on even on a very quiet setting! You could hear people moving around upstairs at 12.30 in the morning because of the very creaky floorboards which was rather annoying! Also the bedroom doors are very thin to block out any noise coming from the shared area!But I suppose Margo and Ziggy will be ready to comment on this and challenge my opinions seeing this unfavourable review.",
      "rate": 2.0,
      "tripDate": " September 2009"
    },
    {
      "title": "Couldn't wait to leave!",
      "text": "I can't believe that this is rated the second best B&B in Toronto!! We stayed for four nights in the High Park Suites. In its favor, the place was quiet and clean, and the bathroom was renovated. However, the (Magnolia) room was small, with no reading chair. The bed was hard and the pillows were terrible. Our bed was never made during four nights there. We were very upset to return one evening after a day out sightseeing to find that cleaning staff left the doors of our room wide open to both the hall and the shared kitchenette....an unforgivable loss of security and privacy! Finally, I was dismayed to see a rat scurry over the front porch one day (no, it was not a squirrel) This is NOT one of the best B&B's in Toronto!!",
      "rate": 2.0,
      "tripDate": " September 2011"
    },
    {
      "title": "Lovely place!",
      "text": "B&Bs in Toronto can be unpredictable but this place was a real find.  I wanted to stay in the city with my young daughter and sister and did a lot of research before finding By The Park.  Rather than one place, it's a collection of homes that have been beautifully maintained and/or restored in a graceful older neighborhood near High Park. Although one of their larger homes is a B&B, our rental in in a three story brick home across the street was a self-catering (no meals provided) apartment with a nice size bedroom (great bed) living room/kitchen and bathroom.  All immaculate, new fixtures, and nicely furnished.  We loved the location, right by the Keele subway 1/2 block south of Bloor Street, and a block from High Park.  Parking for our car was provided as well.  I met the owners, a couple who are working very hard to provide beautiful accommodations, and found the whole experience really great.  I've already recommended By The Park to friends.  My only comment for improvement was the summer nights can be very warm, and the room air conditioner worked well in the living room, less so in the bedroom.  There is a ceiling fan in the bedroom.  This wouldn't be an issue most times of the year.  Overall a really wonderful place and we'll be back!!",
      "rate": 5.0,
      "tripDate": " August 2011"
    },
    {
      "title": "Great Gardens",
      "text": "Very friendly hosts, adequate breakfasts, nicely appointed and very well kept rooms, outstanding gardens/landscaping, solid security system, easy walking to the High Park/Bloor Village/Roncesville Districts, within a block of the sub-way, reasonable rates considering the central location.",
      "rate": 4.0,
      "tripDate": " June 2008"
    },
    {
      "title": "Good value for money",
      "text": "We travelled to Toronto for a friend's wedding. Since we needed to save money, we looked for the most inexpensive place near the Old Mill. A friend recommended \"By the Park B&B\". We looked at the website and chose one of the rooms with the lowest price - the Daisy Room. Check-in was quick and simple, the owner was very friendly and organized, the room was clean and everything was in good shape. We stayed for two nights and had a good time. Check-out was quick and simple as well. Definitely a good recommendation for anyone looking for a decent, no-frills, quality place for a really good price.",
      "rate": 4.0,
      "tripDate": " July 2011"
    },
    {
      "title": "Fantastic accomdation in great neighborhood",
      "text": "What a treat to stay in the \"High Park\" accommodations of \"By the Park.\" Margo and Ziggy have done a wonderful job of renovating this lovely 100 year old home. They are welcoming and full of information.  The finishes are so luxurious and they have thought of everything to make their guests comfortable. We stayed in the Walnut and Willow Suites on the 3rd floor. Both rooms were spacious and beautiful and quiet. Not to mention very clean!  We were very comfortable with the ceiling fan and quiet window A/C.  The decor was fabulous, from the beautiful dark wood floors to the white wood trim, and beautiful bathroom tile, we felt as if we were in a 5 star hotel only it was much more private and quiet!    We used the kitchen to make breakfast and carried it outdoors to eat at the table in the garden.  The proximity to High Park made morning jogging a pleasure and evening walks fun. A mere short 2 block walk away was the fast subway service to downtown. A grocery store Loblaws is in easy walking distance as well, also many nice small restaurants.For those who don't want to make their own coffee, there is a Tim Hortons a half a block away and a Starbucks about 4 blocks away. You just can not beat the value and comfort of this lovely accommodation.  An added bonus was the free parking and internet access. I also appreciated  the environmentally friendly practices that Margo and Ziggy have.I am hopeful we can make a return trip someday!",
      "rate": 5.0,
      "tripDate": " August 2011"
    },
    {
      "title": "Nice B&B in a great part of Toronto!",
      "text": "Perfect place and location for a visit to Toronto! Subway is a 2 minute walk, rooms and breakfast are perfect and owners are friendly!",
      "rate": 5.0,
      "tripDate": " August 2011"
    },
    {
      "title": "An uncommonly lovely dwelling",
      "text": "This was a return visit to By the Park for J. and I and we remain enchanted. The rooms are so pleasant that I was excited to return to them after exploring the city. There are gorgeous gardens around the house which makes the window-views extra nice (and last year we spent some time sitting among the flowers). The en-suite bathroom in the room we stayed in was well-appointed and very clean. We both slept incredibly well on both visits despite a tendency for one of us (ahem) to occasionally spend a restless night. It was just so comfortable. We chose to stay in High Park, the house without breakfast (we have an addiction to the nearby Starving Artist waffle cafe) but there are kitchen areas for those so inclined. The hosts are lovely, it's close to a giant park and also public trans . . . I miss By the Park and Toronto very much and will definitely be back.",
      "rate": 5.0,
      "tripDate": " July 2011"
    },
    {
      "title": "Wonderful stay",
      "text": "Always happy to stay here!  The location is beautiful and always kept in fantastic condition.  Margo and Ziggy are very friendly and helpful and it is a nice touch to see the furry friends.  You are made to feel at home while you are here.",
      "rate": 5.0,
      "tripDate": " March 2022"
    },
    {
      "title": "Simply. The. Best.",
      "text": "Another wonderful visit at By The Park Bed and Breakfast. Margo and Ziggy have hit it out of the park again. Can't say enough good things about my stay. A warm welcome, a very comfortable stay, and delicious breakfast. There are a lot of small personal touches that make for a homey stay.... friendly dog in residence, catching up on the day, coffee and water station always available.",
      "rate": 5.0,
      "tripDate": " January 2024"
    },
    {
      "title": "Comfrotable and Cozy",
      "text": "The By The Park Bed and Breakfast is a charming location when staying in Toronto. It's within easy walking distance to the TTC subway and High Park. Margo and Ziggy were very accommodating when I checked in later than I had anticipated. The bedroom was comfortable, cozy and nicely decorated.",
      "rate": 5.0,
      "tripDate": " February 2023"
    },
    {
      "title": "A great recommendation",
      "text": "We were in town to visit our daughter and By the Park was recommended to us. The bonus was that it was close to some old friends of mine as well. The hosts, Margo and Ziggy are very welcoming. Unfortunately,  because of Covid, we could not have breakfast together and get to know each other better. The location is terrific. High Park is beautiful and Bloor West Village as well as Roncevalles Village are a walk away. The rooms are beautiful and comfortable. We will definitely stay there again.",
      "rate": 5.0,
      "tripDate": " July 2021"
    },
    {
      "title": "Simply. The. Best.",
      "text": "Another wonderful visit. Welcoming hosts Ziggy and Margo ensure everything is just right for your stay. The beautifully appointed room and sumptuous breakfast are their hallmark. You are fully at ease in this lovely home.",
      "rate": 5.0,
      "tripDate": " September 2023"
    },
    {
      "title": "Four nights in Toronto!",
      "text": "Visiting family in area, no hotels nearby so tried this B&B.  From the moment we arrived, Ziggy and Margo made us feel at home.  Very laid back, great comfortable room, nice breakfasts.  We had a rental car and parking was easy in private driveway. It will be our \"go-to\" home when visiting family from here on! Thank you!",
      "rate": 5.0,
      "tripDate": " January 2024"
    },
    {
      "title": "A lovely, quiet stay",
      "text": "Nice tall bed, with a lovely madras to sleep on. We got spare sheets so we did not have to share.Clean, friendly place to stay, great breakfast.Takes about 45min with underground or streetcar to get to waterfront/centre.",
      "rate": 4.0,
      "tripDate": " August 2023"
    },
    {
      "title": "Wonderful!",
      "text": "We thought by the online photos that it was pretty nice place but that is an understatement!  My husband and I went to TO for our daughters birthday and booked By The Park.  We were met by Margo who is so out going and friendly.  The minute we stepped into our loft suite we were blown away.  The room is beautiful and incredibly spacious and bright.  Elegant and spotlessly clean.  We felt like we were in a palace!  Our breakfast was delicious.  We have already booked again.",
      "rate": 5.0,
      "tripDate": " March 2023"
    },
    {
      "title": "Lovely Lovely",
      "text": "Lovely room and lovely hosts. We couldn’t ask for a better experience. I know many people post 5 stars when places should be given 2  stars. However, this was truly a fantastic place.  We had the Victorian room and it was wonderful. Thank you again for a terrific time.",
      "rate": 5.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Fabulous stay - we'll be back!",
      "text": "Fabulous stay - comfy room (with an excellent shower!), delicious breakfasts and a great location for access both to downtown and the airport. Also right next to High Park which is worth exploring in its own right. Will definitely be back!",
      "rate": 5.0,
      "tripDate": " September 2023"
    },
    {
      "title": "Best BnB in Toronto, by far!",
      "text": "Always a comfortable, welcoming and relaxing visit to By the Park. I have been visiting for many years, and it is always a Five Star experience. The bedrooms and bathrooms are always superbly kept and maintained, as are the common areas. The beds are comfortable, and the bedrooms are beautifully decorated. The breakfast is served in a lovely dining room. The meal itself is tailored to each guest, and freshly prepared. I love the hosts, and they have become my home away from home.",
      "rate": 5.0,
      "tripDate": " December 2022"
    },
    {
      "title": "Visit High Park",
      "text": "A beautiful large house in an amazing part of Toronto. Nice central location.  Margo and Ziggy served a good breakfast and assisted us with forgotten items. This house is right next to High Park (like it says) and worth the visit. I would go back! There are a number of restaurants on Bloor St within a 5 minute walk.",
      "rate": 5.0,
      "tripDate": " November 2023"
    },
    {
      "title": "A Great Find",
      "text": "We were so fortunate to find such a lovely place near our son's home. Looking for accommodation in this area has been a bit challenging. But.......now that we have found this place, it will definitely become our \"spot\" when we come to Toronto. The entire home is very clean and so lovely. I slept in and missed breakfast most days but my husband enjoyed the breakfasts. Our private bathroom was very beautiful! The view from our room into the gardens was a lovely scenery.......Only positive things to say about this place and the hosts!",
      "rate": 5.0,
      "tripDate": " June 2022"
    },
    {
      "title": "A Pleasant Surprise",
      "text": "We required a place to stay near High Park and selected this BB. We were not expecting very much and we were there as a result of some unfortunate circumstances.I can say this place exceeded my expectations in every regard. It was a very beautiful home, that was taken care of meticulously.  The hosts, Ziggy and Margo, were very nice and accommodating.  I can honestly say that if we had to stay in Toronto again, this would be the first place on my list.",
      "rate": 5.0,
      "tripDate": " October 2021"
    },
    {
      "title": "Charming stay in TO",
      "text": "We rented all rooms at the B&B for the weekend of our daughter’s wedding (located nearby at the High Park Club).  Accommodated our family very nicely, plus the upstairs suite was a fabulous gathering place for the bridal party to get ready.  Margo and Ziggy are wonderful hosts and have a way with eggs (any style) for breakfast. We look forward to staying again!",
      "rate": 5.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Perfect!",
      "text": "Excellent accommodation! Location ideal for accessing public transport and Margot was superb in providing assistance with directions. Very much appreciated the early check-in and breakfast chats with Ziggy. Entire home is beautifully appointed and rooms are simply lovely. I did find the low lighting on main and second floors a tad challenging and might also suggest that a chair/bench be placed near the front entrance to allow for easier shoe removal (no outside shoes allowed-but they provide slippers!) Have already recommended!",
      "rate": 5.0,
      "tripDate": " April 2023"
    },
    {
      "title": "Simply. The. Best.",
      "text": "It was such a delight to return to By The Park B & B. The hosts, Margo and Ziggy are supremely hospitable. There are simply not enough superlatives to describe the experience of staying here.  They want to ensure you have the best visit. The room was beautifully appointed, and the bed was heavenly comfortable. The breakfast table is lavishly set. Breakfast was most delicious.",
      "rate": 5.0,
      "tripDate": " March 2023"
    },
    {
      "title": "Marvelous find!",
      "text": "Wonderful hosts, delicious breakfasts, excellent location, beautiful house, lovely room, and a comfortable sleep -- we couldn't have asked for more. We stayed four nights in the charming and spacious loft suite, then immediately rebooked it for our next visit to Toronto. We felt fortunate to have found such excellent accommodation and are already looking forward to our next stay.",
      "rate": 5.0,
      "tripDate": " October 2022"
    },
    {
      "title": "Great place to relax",
      "text": "We have stayed at the B&B several times. It close to High Park,TTC and Lakeshore. Great restauraunts on Ronscesvalles Ave are super close. The property and rooms are super nice and clean. The owners are friendly and run a great busines. Looking forward to next trip in the fallRob/Shelley",
      "rate": 4.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Highly recommended",
      "text": "We highly recommend! Margo and Ziggy were very friendly and helped us learn more about Toronto. The room was picturesque and comfortable. The bathroom was beautiful, with a rainfall shower and jet bathtub! Breakfasts were tasty. They are very well located--we didn't drive, as the station to catch the subway is right across the street. We would definitely stay again the next time we are in town.",
      "rate": 5.0,
      "tripDate": " December 2022"
    }
  ]
}