{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "CampusOne Student Residence Downtown Toronto",
    "url": "/Hotel_Review-g155019-d17518511-Reviews-CampusOne_Student_Residence_Downtown_Toronto-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.5",
      "reviewCount": 9
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "Campusone 253 College St",
      "addressLocality": "Toronto",
      "postalCode": "M5T 0C6",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/18/a7/78/75/photo6jpg.jpg?w=500&h=400&s=1"
  },
  "description": null,
  "featues": [],
  "reviews": [
    {
      "title": "Bon rapport qualité prix - idéal en groupe",
      "text": "La chambre, au plutôt le mini appartement, est idéal quand on voyage à plusieurs!Nous étions 4 et avions eu un prix pour une \"chambre\" comprenant 5 chambres, 3 salles de bain et un salon.Le salon était assez sommaire (un canapé, un fauteuil, une table basse, une table avec 4 chaises). Pas de télé, mais cela ne nous a pas manqué.Les lits sont confortables, un peu en hauteur (rangement en dessous).Chambres assez propres, mais cela se voit qu'à l'année cela est utilisé par des étudiants.Salon en roof top utilisable et appréciable!Salle de jeux lego à disposition pour les enfantsSalle de fitness et wifi également inclus.Super petit déjeunerPoints négatifs: pas de parking, propre mais pas à \"hyper\" propre (quelques cheveux dans une des douches)Nous recommandons cet établissement si voyage à plus de 4.",
      "rate": 4.0,
      "tripDate": " August 2019"
    },
    {
      "title": "Gut",
      "text": "Wir waren zwei Nächte mit 5 Personen im CampusOne. Fange ich erst mit dem nicht so Guten an. Wir waren im 3. Stock zum Innenhof. Dort steht die Klimaanlage des Hauses und ist Tag und Nacht an. Alle wollen es kühl haben und irgendwo muss sie ja nun sein. Aber es ist doch schon ein lautes und fast permanentes Brummen. Ebenfalls ist die Lüftung des Badezimmer nonstop am Brummen. Ich habe wunderbar mit Ohrenstöpsel geschlafen, aber ohne hätte ich Probleme gehabt. Das empfindet aber auch jeder unterschiedlich. Ich denke, dass es ab der 6. Bus zur 25. Etage zum Innenhof leiser sein wird. Ein Foto (Blick aus dem Schlafzimmerfenster füge ich an). Wir hatten mit 5 Personen 3 Schlafzimmer und 2 Badezimmer. Es war alles sehr sauber. Eine Zwischenreinigung gab es nicht. Das Frühstück war lecker, gut und ausreichend. Auf allen 25. Etagen kann man sich durch unterschiedliche Aktivitäten die Zeit vertreiben (Gymnastikraum, Kicker etc.). Die Gemeinschaftsküchen kann man nutzen. Ebenfalls haben wir die„Laundry“ genutzt. Waschmaschinen und Trockner sich reichlich vorhanden. Im 25. Stock hat man bei Tag und Nacht eine phänomenale Aussicht.Die Lage ist top. Alles ist ohne Auto erreichbar (Bus, Bahn oder z.B. eine 3/4 Stunde zu Fuß zum CN Tower).Fazit: wir würden bei einem Besuch in Toronto hier wieder übernachten, aber auf einer anderen Etage!",
      "rate": 4.0,
      "tripDate": " August 2019"
    },
    {
      "title": "Bon séjour - cadre agréable ",
      "text": "Le CampusOne est une résidente étudiante hitech ouverte aux touristes pendant les vacances Les chambres sont spacieuses, agréables et assez bien équipées, il manque la tv pour que ce soit parfait mais le wifi fonctionne très bien.Il y a de beaux espaces communs: salle de sport, cuisine collective,... qui permet de voyager en groupe et de se retrouver facilement.Le petit déjeuner est copieux mais il n’est pas possible d’avoir du lait chaud et le personnel refuse que l’on utilise le micro-ondes mis à disposition car : « le plastique pourrait prendre feu ».La housse de matelas en plastique est bruyant dès que l’on bouge sur le lit.Il n’y a pas de store occultant dans la chambre ce qui peut être gênant pour les chambres avec des grandes fenêtres.",
      "rate": 4.0,
      "tripDate": " August 2019"
    },
    {
      "title": "Atrocious",
      "text": "Worst customer experience I've ever had. Nobody in the office, manager is constantly away. No way to get in contact with the front desk. Summer breakfast is offered without milk and little variety. The coffee is disgusting. Absolutely atrocious service.",
      "rate": 1.0,
      "tripDate": " June 2024"
    },
    {
      "title": "Campus One Review",
      "text": "The residences are in excellent condition. The people are all friendly and the food is delicious.  I also found the place to be in clean condition.  I would stay there again if there is another trip to Toronto and would recommend the place to my friends. Thank you for the opportunity to submit this review.",
      "rate": 5.0,
      "tripDate": " December 2023"
    },
    {
      "title": "Génial ! ",
      "text": "Une belle surprise! En rentrant dans le bâtiment, on ne sait pas à quoi s’attendre, nous sommes au milieu d’étudiants ... mais arrivés dans la très très grande chambre, c’est une belle surprise, nous étions 6, avions 4 grandes chambres. Le petit dej sympa devant la tour CN.",
      "rate": 5.0,
      "tripDate": " August 2019"
    },
    {
      "title": "Well looked after",
      "text": "Stayed here for a week while attending a convention in Toronto. Great room we was given a 3 bed 2 bathroom apartment. Although no kitchen we could share the communal kitchen,, and had use of the laundry.Breakfast was included which was good too. All staff we met was very helpful.We enjoyed our stay thank you.",
      "rate": 4.0,
      "tripDate": " July 2019"
    },
    {
      "title": "Good location, accommodation and breakfast ",
      "text": "We stayed in 2 families with kids in June. Most students were in vacation. But some were in campus and all very respectful with families and friendly.Great installation, all new.Great lounge with amazing city view. Good breakfast. Great location. Good price.No parking lot!",
      "rate": 5.0,
      "tripDate": " June 2019"
    },
    {
      "title": "Dreadful",
      "text": "I recently stayed at Campus One.  I was intending to stay for a few nights, and also booked for some colleagues.  Apart from the fact that the accommodations were very poor, the breakfast minimal and no milk, running out of fruit, it was the sheets that were the worst.  Please look at these pictures of sheets, and note they are not even sheets.  They are pieces of cotton sitting on the plastic cover.I canceled the rest of my stay there.  Dreadful.",
      "rate": 1.0,
      "tripDate": " July 2019"
    }
  ]
}