{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Canada Suites Toronto Furnished Rentals",
    "url": "/Hotel_Review-g155019-d594281-Reviews-Canada_Suites_Toronto_Furnished_Rentals-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.0",
      "reviewCount": 82
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "55 Bloor St E",
      "addressLocality": "Toronto",
      "postalCode": "M4W 3W6",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-s/02/66/e3/ff/1-bedroom-executive-suite.jpg?w=500&h=-1&s=1"
  },
  "description": "Canada Suites offers the best Toronto short term rentals. Experience the ultimate in luxury & comfort during your Toronto extended stay! We offer spacious designer decorated 1 & 2 bedroom 2 bath Toronto furnished apartments with walkout balconies featuring Simmons Beautyrest beds, 2 or 3 fireplaces, 2 or 3 Plasma LCD TVs, 2 Ipod docks & fully equipped kitchens. Maid service, WiFi Internet, Cable TV & Unlimited local calls are complimentary. On-site parking is available. Why choose Canada Suites? - Think outside the box... Where would you rather be - boxed in a small room in a crowded downtown Toronto hotel or enjoying a spacious suite in a luxury condo building?- Save money... Travelling with colleagues? Taking a family on a trip? Only at Canada Suites up to 4 people can stay in a suite at no extra charge.- Feel at home... Entertain family and friends in the living room. Prepare a home made meal in the kitchen. Do your laundry without leaving your suite. Connect multiple computers to WiFi & surf the Internet from anywhere in your suite. Get some work done or just relax in front of the fireplace & watch a good show on a big screen Plasma TV.",
  "featues": [
    "Free High Speed Internet (WiFi)",
    "Wifi",
    "Fitness Center with Gym / Workout Room",
    "Pool",
    "Restaurant",
    "Pets Allowed ( Dog / Pet Friendly )",
    "Non-smoking hotel",
    "Air conditioning",
    "Kitchenette",
    "Refrigerator",
    "Non-smoking rooms",
    "Suites"
  ],
  "reviews": [
    {
      "title": "Spotless Apartment with lovely pool in great location @ 736 Bay",
      "text": "After a shaky arrival ( the entrance & reception area is very basic ) we were delighted with the 2 Bed Presidential SuiteThe place was very clean with well equiped kitchen area / dining roomSitting area that converted into extra beds - helpful to us as we were a party of 4 ( 2 adults & 2 children ) but both bedrooms has double beds rather than twinsAll normal 5* luxuries - fluffy robes / slippers / toiletries etc. Welcome gift & amentiy packs in kitchen a nice touchPool area on 2nd floor again beautifully clean & well equiped - we used it every day & had the place to ourselves !Overall very impressed",
      "rate": 5.0,
      "tripDate": " August 2011"
    },
    {
      "title": "Very roomy furnished condo in a great location.",
      "text": "I rented a Presidential 2 bedroom suite for myself and 2 colleagues for a week. It was much more cost effective than 2 hotel rooms because it is a huge furnished condo in a nice Bay street condo building with a full kitchen that has a dishwasher, stove, fridge, microwave and pots and pans. The condo had 2 balconies, and we had 3 TVs and 3 fireplaces in ours. Overall the condo was better than described. It was huge, nicely decorated and even had free soft drinks in the fridge when we arrived. We didn't have to pay a cent for calls we made and the use of wifi was also free. There was no restrictions on the number of computers we could connect - we stayed at Westin before and paid up for each computer we had running. I should mention 2 Ipod docking stations in the room - nowhere else do they have it.",
      "rate": 5.0,
      "tripDate": " May 2011"
    },
    {
      "title": "Good Furnished Rooms",
      "text": "Needed a place to stay in Toronto. The Canada Suites I chose because of price and location. I was happy with them. Easy to book - Pay with Pay Pal - late night arrival was ok.They offer good two room flat. Clean and nice. Have all modern electric equipment. I asked for high speed Internet. It worked well. Will come again when visit TorontoWolf & Marta Spieldorn",
      "rate": 5.0,
      "tripDate": " May 2006"
    },
    {
      "title": "Highly Disreputable!! Avoid at all cost!!",
      "text": "I called Canada Suites in October and reached the manager on his cell phone. I was planning to visit  Canada during the end of November and he told me about his apartments and the rates. He said that he needed a credit card number to reserve it and would send me an authorization form by email to fill out. Once I returned that to him, he would bill my credit card.I received the authorization form the next day, but at the same time one of our family members became very ill, and we waited to see what would happen. When we were uncertain if we could travel, I tried to call Canada Suites to let them know the situation, but could never get through. I left messages both on the cell phone and email to see if we could still hold the apartment until we knew if we could make the trip. I never received a response. I got in touch with my credit card company and they informed me that my credit card had already been billed for the full amount without my signing an authorization form.Again, I tried to reach Canada Suites to see if I still had a reservation. I again left cell phone and email messages, but received no answer. At that point, in November, our family member died, and we realized that we would still be going to Toronto. Again, I tried to reach Canada Suites to see if we still had a reservation. In fact, we needed to stay an additional night, so I left that in my message. I still received no response. I was able to get in touch with Signatures on Bloor, where our reservation was booked and spoke to one of the managers. I asked if he had a reservation for us and he said it was impossible to tell since he never received the names. I told him of our dilemma, we were about to come up and, because of the lack of communication, we did not know if we still had a reservation. He told me that what I was experiencing was not unusual for Canada Suites. He had received previous calls from people who had made reservations and could not reach the company.Within a week of the date we were suppose to arrive, and after many attempts to reach Canada Suites, I finally got through, almost by chance. The manager picked up his cell phone at the time that I called and I was able to speak to him. I told him about my frustration in trying to reach him and the lack of response. He assured me that my reservation was cancelled and that he would refund my money. I asked him to send me something in writing so that I would have a record. He sent me an email which was quite confusing.It said that he cancelled my reservation, but could not directly refund my charge because he never had verification. My credit card company would have to get in touch with him to verify my identity. It has been months, and Canada Suites has not returned my money. The credit card company has been trying to get the refund from Canada Suites and has been unsuccessful. Avoid this company at all cost!!!",
      "rate": 1.0,
      "tripDate": null
    },
    {
      "title": "Unprofessional and unreliable business",
      "text": "I was relocating from Toronto to Vancouver in November 2005 and required temporary accommodations for one week in Toronto for packing and loading of my household goods and to wrap up business.  While surfing the Internet, I discovered a good deal offered by Canada Suites - one week for a one luxury bedroom condo in downtown Toronto for $699.00, excluding taxes. I booked the room from October 24 to October 31 by calling the manager of Canada Suites on September 27.  I was required to provide my credit card and was charged the entire amount, including taxes (approximately $900.00).  I received a fax confirming the reservation from Oct 24 to 31 and that my card had been debited that same day. On October 24, I called Canada Suites to confirm that the keys for the suite would be available at the concierge desk. The manager said that he had no reservation under my name for that date. He indicated that he would look into the matter and call me back in 15 minutes.  Forty-five minutes later, I had yet to hear from the manager.  I called him to inquire what was happening.  The manager responded, in condenscending tone, that there must have been an computer error, that he had no room for me, and that he would refunding my deposit. When I asked him what he was going to do about finding alternative accommodations, he simply suggested that I call around and gave me phone numbers for other businesses. Suffice it to say that it was impossible to find a deluxe bedroom suite for that price in downtown Toronto anywhere.  I ended up taking a room at local hotel, which cost me over $500.00 more than budgeted.Over the next few weeks, I kept checking whether a refund had been credited to my credit card. I called on numerous occasions to speak to the manager, but no one ever picked up the phone. I therefore had to leave a number of detailed messages asking that someone get back to me. I never received any response from Canada Suites.  I advised American Express that I was disputing the amount charged by Canada Suites since they had never provided the services. American Express indicated that they would investigate. On December 9, 2005, American Express sent me a letter indicating that the merchant (Canada Suites) had not provided them with the information needed to resolved the dispute.  They therefore fully credited my account. I can understand an error in entering a reservation, however I cannot accept the failure by the manager to take responsibility for the error and to make it right. In addition, there is simply no excuse for not issuing a credit to my credit card immediately. The repeated failure by this company to answer the telephone or return calls speaks volumes.",
      "rate": 1.0,
      "tripDate": " October 2005"
    },
    {
      "title": "Terrible customer service, arrogant management, but gorgeous set up",
      "text": "I must admit that this was gorgeous. I have a mild case of OCD and everything was so meticulously organized which I appreciated. I stayed in the master with hubby, 4 boys shared two pullouts and the other 2 kids shared the second bedroom. We had enough space and it was pleasantly decorated and very clean. So the hotel room itself is awesome. What I didn't like was the manager Mark. He acts all nice but he does not care about anyone except for himself. His desire to make the customer happy was non existent. I called the day before to verify that the booking was still on, since I had read MANY reviews of last-minute cancellations and other so called mixups which I was concerned about. I asked about parking and he said that to park and we can arrange a parking pass after and it would be $28 per day. He said he will be in the lobby between 4-8pm and we could sort it out then. I arrived and tried to figure out parking in the alley like he said. I called the number several times over 15 mins and no answer, with my family in the car getting very impatient. We circled for about 30 mins trying to figure out where this so called parking garage was. Finally we just parked across the street at a garage. Get into the lobby with my 6 kids who are all under 11, with a ton of luggage as you can imagine, and had to wait in the lobby for  an additional 30 mins for Mark to show up. You can imagine my stress levels dealing with cranky kids. So when he got there, he acted like he was this professional businessman, and he was but was also extremely arrogant at the same time. Thought he was the best thing on earth. I was so worked up and we had an altercation because he told me there was nothing he could do about the parking situation. No apology for not answering his phone and no apology for keeping us waiting. He said he does not answer his phone when with a customer. I said that he needs to hire someone then!!! Making my family wait an hour is unreal and not acceptable. He said he is the only one on duty and can only do one thing at a time. Do you really think I care? Since when does it take over an hour to check-in?!!! He argued back every comment with something ridiculous and (attempted to) talk down to me. He was trying to be diplomatic but it was complete arrogance. He said I could leave the parking garage across the street and park in his hotel. I said I would be paying twice then and that did not make sense.  So being the arrogant guy he was, he repeated himself word for word.  Man I hate when people do that.  I said sure that I would move my car, but that I am not going to pay and that surely he can work something out. I said that I am not stupid and know that he has the power to fix this if he wanted to.  He refused. I said surely you can take care of this, as it was your fault. He refused. I said do you have any idea how infuriated I am and that I have six kids here for goodness sakes. He said yes I see you have kids, again in his disrespectful tone. Totally oblivious to what it is like having a young family, and refused to take any responsibility. Took me a while to calm down from his attitude and it ruined my impression of the stay in Toronto. So if you are prepared to deal with someone who doesn't care about making a customer happy, then go for it. It is a beautiful room he has set up, but I will never return.",
      "rate": 2.0,
      "tripDate": " January 2015"
    },
    {
      "title": "Really good deal for the money",
      "text": "Was very easy to book over the phone. Amazing rate! Great location near all the boutiques on bloor street. Suite was clean with marble and two separate tvs as promissed. Dishwasher was there as well as washer dryer - but i didnt use them. calls were free and high speed i-net was a big plus.  I found that lack of dry cleaning service was a minus , but other than that they seem to be a Fantastic deal for the money",
      "rate": 5.0,
      "tripDate": " March 2006"
    },
    {
      "title": "Had a great stay in Toronto at Bay st",
      "text": "I really enjoyed my stay in Toronto at Canada suites. The staff who signed us in was really nice and knew a lot about the area and the sights in Toronto. We also went to a restaurant called Spring Rolls that the staff recommended (and we were given a coupon for it).",
      "rate": 5.0,
      "tripDate": " November 2011"
    },
    {
      "title": "Comfort and Luxury in Yorkville",
      "text": "I really enjoyed staying with my husband at Canada Suites.  I was surprised by the multitude of amenities available that you wouldn’t find at other hotels. Their kitchen is fully equipped and we decided to go grocery shopping at Pusateri’s in Yorkville and cook a nice meal. It was lovely to stay in the Yorkville area and walk around visiting all of the shops. Our dinner was really special with the beautifully decorated table, fireplaces and music on the television. The free Wifi and attraction guide in the room really helped to make our stay downtown enjoyable.  I slept very well as beds were extremely cozy and soft.  Can’t wait to go back.",
      "rate": 5.0,
      "tripDate": " October 2011"
    },
    {
      "title": "Felt right at home at Canada Suites!!!",
      "text": "We were greeted at the door and taken to a beautifully decorated, well lit, one bedroom suite at the top floor and provided us with to a welcoming basket filled with delicious wine and chocolate.  The hotel really went the extra mile to provides us with everything we needed from an umbrella, to a fully loaded kitchen (every utensil dish or tray you could need).  They also offered comfy bathrobes, slippers, and soft pillow, blankets and bed making us feel homey and relaxed. The view from the balcony was stunning and we could see the CN tower and the lake.  There was free wi-fi and local calls which was very convenient to help me do my work during our stay.  I also LOVE Yorkville. Would definitely stay there again!!!",
      "rate": 5.0,
      "tripDate": " November 2011"
    },
    {
      "title": "Homey convenient place to stay downtown",
      "text": "I stayed for 4 night s at Canada Suites and was very happy with my choice.The apartment was spotless well appointed and more comfortable than a hotel room.It is very close to the Sick Kids and a short walk to Eaton Centre.If I could make one suggestion it would be to get full cable service. Business travellers need diversions and the cable service was very basic and a bit disappointing. Other than that a terrific value and I would recommend!",
      "rate": 4.0,
      "tripDate": " October 2013"
    },
    {
      "title": "review of 1505, 736 Bay",
      "text": "We stayed in apartment 1505 at 736 Bay St, managed by Canada Suites. The apartment is very big for a city apartment. The kitchen had everything we needed except dish detergent for hand washing, but there is a 24 hour mini-market and a big supermarket just across the street. Service from Canada Suites staff was responsive and friendly. The dining table was broken on arrival but it was replaced within 24 hours. Free internet and local calls were very handy. Not cheap overall, but good value if you want more than a hotel room. Having 2 bathrooms was a big plus. Would be very good value for a party of four or more. Ability to do laundry was great. The location is close to the subway station (go across Bay to the College Park complex and through the shopping mall. We were able to walk to downtown. It's 2 minutes walk from Toronto General , Sick Kids and Princess Margaret Hospitals. This presented a problem with construction noise at TGH, and occasional ambulance sirens, but this is the big city, so this is not unexpected.I would use Canada Suites again.",
      "rate": 4.0,
      "tripDate": " September 2012"
    },
    {
      "title": "Be careful - lots of show with no substance!!!!!",
      "text": "Arrived at our apt at 10pm, only a security man on the desk who had to call someone from Canadian Suites and let them know we were there, although we had advised arrival time. Had to sign a 'lease agreement' in the reception, although we were on holiday staying 5 nights. Got to the apt eventually after calling their office, very well presented if you want to enter a show home. Had to move the dining table as there was only enough room to walk round the bed and no room for luggage - no storage except for a bedside cabinet. List of wrongs - fridge and freezer clean (I think) but the smell when you opened the doors was awful, kitchen tap leaked like a waterspout, chipped flooring and wash hand basin, no shower curtain, balcony cracked concrete, no light bulbs in the posh lamp, lots of slats missing on the blinds (no privacy as we were overlooked and there were no curtains) and the worst was that the door lock was broken so we couldn't lock from the inside.No answer at Canadian Suites and no rooms available anywhere. We had to block the door with a case and my husband had to sleep in the lounge (after we made up the bed that was already meant to be made up!!!) We left the next day and were given a refund, but it took 7 days to go onto my card. YOU HAVE BEEN WARNED - OK if you like frills with no substance.",
      "rate": 1.0,
      "tripDate": " July 2012"
    },
    {
      "title": "Everything you could want...",
      "text": "We found Canada Suites online for my parents to stay at after we had our first child. We didn't want a hotel room and chose to find a furnished condo. Canada Suites delivered that and more! Service was impeccable and thoroughly courteous. Upon arrival, we were delivered the keys and toured around the condo, despite travel arrangements being hampered by the weather. The condo itself was clean, large and carried all the necessary amenities for your comfort. Ideally located and ideally priced for the duration of the stay, I'm not sure there's anything more to say!",
      "rate": 5.0,
      "tripDate": " February 2011"
    },
    {
      "title": "Great location, comfy & much better than a typical hotel",
      "text": "I needed a place downtown while my new condo was delayed by the builder the third time around... I rented a 2 bedroom condo at Canada suites and was very pleasantly surprised. It was spacious, very clean and nicely decorated. Oh, and a really nice bed too. Overall great value for money. Thanks !",
      "rate": 5.0,
      "tripDate": " January 2010"
    },
    {
      "title": "beware of canadasuites.com",
      "text": "Beware of this company, they are totally unethical.Paid for my accommodation in advance with them some 3 months early, then 1 day before we arrive they send me email (do not even ring) to advise the apartment is damaged and are cancelling the booking.They made no attempt to find us suitable replacement accommodation, just abondoned us.Thank goodness we had friends in the city who found us accommodation but at a much higher rate.My advise is if this company asks you to pay in advance tell them to get lost.",
      "rate": 1.0,
      "tripDate": " July 2008"
    },
    {
      "title": "Spoiled our holiday",
      "text": "We reserved Canada Suites in March for a trip we were taking in June.    On the Friday night before the Monday check-in we received an email advising we could no longer be accommodated because the previous tennant had damaged the suite.  We spent all weekend trying to find alternative accommodation - we are a family of four and are spending a month visiting various Canadian cities.  We were 'on the road' and the last thing we had expected to be doing was sitting on the phone and internet trying to find a place to stay.   When we called back to ask if they could refer us or suggest a suite hotel they were extremely unfriendly and unhelpful.  Finding any accommodation at the last minute is difficult and usually very expensive.  Frankly, I am not even convinced that the suite was damaged, when I asked of they had anything else they were indifferent -- I got upset and said I did not think they could just cancel the reservation and the manager replied that they could do whatever they wanted.   We did get our money back but that was little consolation.  I would advise caution when dealing with this outfit.",
      "rate": 1.0,
      "tripDate": " June 2008"
    },
    {
      "title": "Great location!",
      "text": "Location: right in the centre of Bay Corridor. Do all attractions and entertainment is within walking distance and close to transport.There is free parking which is great.Service: This is not a hotel do there is no front desk not room service or daily cleaning. So one has to bear those aspects in mind when booking.Also it's an apartment (kind is old and dated so beware of expectation of chic and bright place).The people running the place is very helpful and accommodating. Room/apartment: it's good size 2 bedroom suite around 900 sqft) but dated. It has all the necessary amenities (dishes, cutleries, pans, coffee maker, toaster, etc) that you would need and also 24 hour sms grocery shop across to buy food/ supplies.",
      "rate": 3.0,
      "tripDate": " August 2016"
    },
    {
      "title": "Great experience with budgeted cost",
      "text": "The hotel is very good with interior and it is very clean also. It is budgeted to stay. Guides were very friendly. We stayes here for 5 nights. Surrounding places are also very good to visit and atmosphere is awesome around the apartment.",
      "rate": 4.0,
      "tripDate": " July 2015"
    },
    {
      "title": "Canadian Suites",
      "text": "The reception staff are rude and unfriendly. Apartment is nice and well maintained. Parking is 28.00 dollars a night which is ridiculous and they hound you for it.For 2000.00 a week certainly not high end fair i would say certainly not executive.",
      "rate": 3.0,
      "tripDate": " September 2013"
    },
    {
      "title": "Nice decor and a great rate - great place to stay for a family",
      "text": "We decided to rent a furnished suite in Toronto to spend a week exploring this beautiful city.  We wanted to take our kids with and needed a larger place than a regular hotel room. Our friends recommended Canada suites. We checked out their website and they had suites available. They gave us a really good price for a two bedroom suite which also had 2 bathrooms and 3 beds. When we came the place was clean and nicely set up. They did not forget to arrange for extra bedding for the pull out bed so that the kids did not have to share beds. We asked for a PS2 for the kids (They rent those at $10 per night with a game) and that kept them busy. The Suite also had a second tv in our bedroom so that we could watch it while the kids played. Internet was free and was set up in the bedroom as well. Kitchen was nice and had a dishwasher, pots and pans,  dishes, etc. We cooked a few meals and didn't have to eat out that often. We were very happy with the suite.",
      "rate": 5.0,
      "tripDate": " June 2007"
    },
    {
      "title": "an amazing experience",
      "text": "Me and my friends stayed over at 736 Bay for 4 nights during the month of November. The quality of the suites is very luxurious. The building that we stayed also had a swimming pool and a gym. Very close to the subway as well as grocery stores and banks. Overall amazing experience at a great price! I would recommend it to anyone looking!!",
      "rate": 5.0,
      "tripDate": " November 2012"
    },
    {
      "title": "True Canadian hospitality in Toronto",
      "text": "I went to Toronto for the first time in November. A friend got a great promotional rate and we went together. I mentioned to Canada Suites associate who greeted us on arrival that my friend was from New York and was affected by Hurricane Sandy. Richard from Canada Suites instantly gave us free bottle of fancy wine and a basket with chocolates as a welcome gift. This made us feel really great. I found the apartment beautiful. The suite had great functionality, including 2 TVs and 2 Iphone docks.",
      "rate": 5.0,
      "tripDate": " November 2012"
    },
    {
      "title": "Breathtaking Lake Ontario views",
      "text": "Loved the apartment on the 31st floor. Amazing view of Toronto skyline and very comfy bed. The fellow who met me was super friendly and even showed us where the 24 hour Sobeys store was. I never knew that downtown Toronto you could rent a really nice condo for a few weeks instead of paying 500K for one. I will never use a hotel again. Thanks for the great stay",
      "rate": 5.0,
      "tripDate": " October 2012"
    },
    {
      "title": "WOWWW!!!!",
      "text": "I stayed at the large 2 bedroom suite at 736 Bay street this week. This suite was about the size of 2 hotel rooms in size and unlike a hotel it had a neat kitchen with pretty much everything in it. Free WiFi was nice to have. Beds were comfy and we had more than 6 pillows for each bed. It was a very pleasant experience!",
      "rate": 5.0,
      "tripDate": " July 2012"
    },
    {
      "title": "excellent choice at Bay and College - watch web site for deals",
      "text": "This suite exceeded my expectations. It is less than five minutes (walking) to two subway stations, is in a great location, has an amazing 31st floor south view, includes everything the web site boasts (e.g., laundry, well-stocked kitchen, etc.) as well as lots of little extras you don't expect. For example, the bathroom was loaded with toiletries, the gift basket was very generous, and there was even a soap packet for washing clothes (all included in the room cost). The Canada Suites representative was able to accommodate my arrival changes and everyone I interacted with was very professional. Note that I stayed at the Bay and College location, not the Yorkville location (which seems to be the only one on TripAdvisor). I plan to watch for discounts on this location when I return to Toronto next year.",
      "rate": 4.0,
      "tripDate": " February 2011"
    },
    {
      "title": "Great find and location!",
      "text": "We were selling our house and needed to stay close to our neighbourhood. CanadaSuites Yorkville offered the amenities we needed. It was clean and comfortable and Andrew provided excellent customer service. Our children, 5 and 7, were able to quickly adjust to apartment living because it was well appointed and spacious. Finally, the beds were extremely comfortable and we all slept well! Thank you for all of your assistance, Jane and David K.",
      "rate": 5.0,
      "tripDate": " January 2010"
    },
    {
      "title": "Dishonest Company!!! Don't risk it.",
      "text": "I booked here two months in advance. Three days before I was set to arrive, they emailed me and said they had to cancel my reservation. When I called back to find out what was going on (I was very angry) they hung up on me when I asked who the owners are. I called back and they hung up on me again...",
      "rate": 1.0,
      "tripDate": " January 2009"
    },
    {
      "title": "Great Rate For A Good Size Suite",
      "text": "We stayed at Canada Suites downtown building.The suite was bright and spacious, 2 bedroom 2 washrooms unit.  What a change from small overpriced downtown hotel room I had to share with two children!  The suite even had a terrace overlooking Bloor Street.I only wish they had better bedding. Other than that, our stay at Canada Suites fully furnished luxury unit was pleasant and enjoyable.I can definately recommend the company and its facilities to other travellers, especially families with children.",
      "rate": 4.0,
      "tripDate": " July 2007"
    },
    {
      "title": "Waist of time and money",
      "text": "Planning a weekend trip to Canada, I came across the website on craigs list.  The rate seemed good and the pictures of the room looked exceptable.  Worked with Andrew to get a reservation.  They required a deposit to be sent before a confirmation could be sent out.  The only way to get them the money was by international wire.  I tried twice with information given to me by Andrew.  Both times the wire did not go through, and was bounced back by their bank for insuffenant information.  I kept emailing the general email account sending attention to Andrew.  I did not get any responses back.  I finally got a hold of them they day before our trip to see what we wanted to do about not being able to wire funds.  Andrew said that it was not his problem and said that I was waisting his time and hung up.I am now out 120 dollars due to the wire transfer fees and no room a day before the scheduled trip.  Waist of time and money.  Do not use at all Costs.  This seems so much of a scam if anything.!!!!",
      "rate": 1.0,
      "tripDate": " June 2007"
    },
    {
      "title": "Excellent Location",
      "text": "We stayed in Suite 1009 for a week.  It is billed as a 1 bedroom+guestroom suite, which is precisely what it is.  The guestroom has a bed in it, but it isn't big enough to call it a separate bedroom, I guess.Andrew, who appears to be the owner/operator/proprietor of Canada Suites, took my booking, and I paid through PayPal.  Andrew seems to travel a fair bit, but was still reasonably responsive to emails and phone calls.Having seen some of the reviews here, I was somewhat concerned that some of the loose ends wouldn't be taken care of.  There was a glitch with parking, but it was resolved by email before we even got to Toronto.  Our check-in and check-out were quick and pain-free.  Some others commented that you will want to make sure that your reservation is confirmed, but I didn't have any issues with this.The suite itself was exactly as described on the web site.  It's not a penthouse suite at the Hilton, but it is clean and has all of the amenities one needs.  Imagine staying over at a friend's place; that's what this is like.There's a dishwasher, a clothes washer/dryer, a full kitchen, full bathroom, etc.  Everything is not super-new, like in a newly-built hotel suite, but then you're getting a 1+1 bedroom suite (which sleeps 4 well) for way less than a hotel room in a comparable location.  Plus the kitchen allows you to cook your own meals and save even more cash.The key to the suite needed some jiggling to open properly.  It sometimes took 30s-1 minute to get the door open.  Once you get the hang of it, it's not a problem, but it was a bit frustrating for us.  Andrew indicated that previous tenants had stolen the keys, so it is a copy of a copy that we got.  Security wasn't an issue: electronic keycards are used to gain access to the building.The location is amazingly good (Yonge+Bloor).  You are literally next door to the entrance to the subway (in fact, the stop is serviced by both major subway lines downtown).  By subway you can get to most places in the city very quickly.  We walked to performances at the Four Seasons Centre, to the Eaton's Centre, to the ROM, etc.  You can't really get much more central than this.  There is every imaginable type of restaurant within a 5-minute walk.  The area is safe to walk in at night, and there are regular police car patrols.  All in all, the best possible location we could've asked for.Traffic noise was non-existent.  I am a very light sleeper, and heard not a single thing from outside the suite.So for a trip to Toronto, I can recommend staying with Canada Suites.",
      "rate": 4.0,
      "tripDate": " September 2006"
    },
    {
      "title": "Overnight Stay for Hospital Visit",
      "text": "I stayed over at Canada Suites to be able to go to a very early appointment at one of the down town hospitals. What a pleasure.........  The room was modern, loaded with gadgets and amenieties. Took the whole stress out of a serious medical test.....",
      "rate": 5.0,
      "tripDate": " November 2011"
    },
    {
      "title": "Spacious suite! Great value and a fantastic downtown Toronto location",
      "text": "I had to attend a series of meetings downtown Toronto with 2 unrelated colleagues of mine and booked a 2 bedroom unit at Canada Suites on Bay street. Its a great accommodations solution as it allowed us to all have privacy (we had their 2 bedroom Presidential suite with 2 bathrooms) and at the same time gave us an option to sit down and discuss a few issues at a dining room table. Free wifi was a big plus and so were 2 separate balconies. Having 3 TVs was great and we also used the kitchen that even had a dishwasher and a stove. I would certainly be back.",
      "rate": 5.0,
      "tripDate": " April 2011"
    },
    {
      "title": "Great location and a gorgeous suite",
      "text": "We needed a place to stay for our relatives and contacted several firms. Canada Suites had a 2 bedroom suite (similar to a 3 room flat) available at a fantastic rate that was much less than the Marriott's rate. Their manager who dealt with us - Andrew, was very courteous and professional. He arranged for an extra folding bed and did not charge us. We selected a Suite with a terrace and it was better than we expected. View of Bloor street was great. The place was very nicely decorated and felt homey and cozy. We have opted for a maid to come in and she was very nice and did a terrific job.Thank you folks for a great time we had.David",
      "rate": 5.0,
      "tripDate": " June 2007"
    },
    {
      "title": "Loved the decor (Great design job & a FANTASTIC location)",
      "text": "We stayed at one of their 2 bedroom suites with 2 washrooms. We didn't feel boxed (as in other TO places like Delta Chelsea). Great modern decor and a pretty big space for downtown Toronto. Definitely can recommend for families with children. Even our boys said that place was cool.Sylvia & Dino",
      "rate": 5.0,
      "tripDate": " January 2007"
    },
    {
      "title": "crappy experience",
      "text": "I didn't actually see the inside of a room. We booked through booking.com in early March for the Easter weekend. 3 days before we were set to leave, we were informed that they had overbooked. They offered us accomidations at another suites  hotel, which we felt we had no choice to accept because of the short notice. That suite turned out to be really crappy. We emailed Canada Suites to express our displeasure, but they never bothered to respond. Don;t hang your holiday plans on this place!",
      "rate": 1.0,
      "tripDate": " March 2013"
    },
    {
      "title": "Amazing Stay in Downtown Toronto",
      "text": "I stayed in 736 for 7 days and had an amazing experience overall. The quality of the apartments from Canada Suites was incredible and the staff was very helpful. The location of the apartment was walking distance to stores and the facilities within the building are great. I would definitely recommend them.",
      "rate": 5.0,
      "tripDate": " August 2012"
    },
    {
      "title": "Just What I Needed",
      "text": "This week I stayed in one of Canadian Suites 2 bedroom suites at 736 Bay Street. The location was great close to anything you could possibly need. It was about the size of 2 hotel rooms, but it had the perk of a kitchen that I could cook in. There was free WiFi and the beds were very comfortable! Overall it was just what I needed for my stay.",
      "rate": 5.0,
      "tripDate": " July 2012"
    },
    {
      "title": "Clean, Beautiful and Great Location",
      "text": "Had a great stay here at the Bay and College location.  Service was great prior to our arrival.  My relatives were from L.A. so they really loved the location and ease of walking to nearby attractions.  They were really able to enjoy downtown Toronto from this condo.  The place itself was clean, beautiful and luxurious then we had expected.  Not being able to see pics prior to our arrival made me a little nervous but it all worked out and we loved the place.  Will recommend this place for sure!",
      "rate": 5.0,
      "tripDate": " August 2010"
    },
    {
      "title": "Lounge like you are in your own living room while you attend a conference at the convention center",
      "text": "I was in Toronto for ten days to attend a convention at the metro center and wanted a place where I could refresh and relax after a long day of attending meetings and lectures. This was the perfect place to lounge - I could not imagine having that much room in a hotel room. I loved the in suite laundry - it reduced the stress of packing a lot and having to do laundry for days after getting back home. Also, it was nice to have fresh linen and towels whenever I wanted to. The particular apartment I got was modern, clean and well-equiped. I enjoyed not having to decide whether to pay for internet service or phone calls. I also enjoyed the onsite security, the convenience store right around the corner, the little treats they had left me in the welcome basket and the five minute stroll to the convention center. I do have some complaints, which are relatively insignificant and may sound like I am being picky, which I am being....but since we are being honest, I will say them: I did not like the water-pressure of the shower in my unit, I thought the toilet seat was too small for the toilet bowl and I think the cleaning lady had forgotten to change the bed sheets as they smelled of male cologne and I kept sneezing from the dust mites.  Fortunately there was a laundry machine in the unit and the latter issue was easy to solve.",
      "rate": 5.0,
      "tripDate": " April 2010"
    }
  ]
}