{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Canada Suites on Bay",
    "url": "/Hotel_Review-g155019-d3323404-Reviews-Canada_Suites_on_Bay-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.0",
      "reviewCount": 109
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "736 Bay St",
      "addressLocality": "Toronto",
      "postalCode": "M5G 2M4",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0e/b6/a8/d9/canada-suites-penthouse.jpg?w=500&h=400&s=1"
  },
  "description": "We are staying open to help families and individuals who are in need of essential temporary housing downtown Toronto near the University Health Network hospitals! We are a very short walk away from the Toronto General Hospital, Princess Margaret Hospital, Mount Sinai Hospital, MARS building, Women's College Hospital, and the Sick Kids Hospital. Make Canada Suites on Bay furnished apartments your Home Away from Home in Toronto. We offer some of the largest Toronto furnished rentals - Our Family Friendly 2 bedroom 2 bathroom plus den (den can be used as a 3rd bedroom) furnished apartments are approximately 1000 square feet and offer fully equipped kitchens, 3 plasma LCD TVs, fireplaces, and in suite laundry machines. Our central downtown Toronto location is across the street from the Sick Kids Hospital, College Park complex and the Subway station. We are just a short walk away from the Eaton's Center, Toronto City Hall, AGO, ROM, University of Toronto (U of T), Ryerson, Princess Margaret Hospital, Toronto General Hospital, and Mount Sinai Hospital. Our furnished apartments can be rented on a 4 week (Min. 28 or more nights), monthly, and month to month basis. Our furnished apartments are an ideal choice for families, hospital patients and staff, university faculty, business travelers, and government officials.",
  "featues": [
    "Paid private parking on-site",
    "Free High Speed Internet (WiFi)",
    "Fitness Center with Gym / Workout Room",
    "Pool",
    "Vending machine",
    "Bicycle rental",
    "Game room",
    "Pets Allowed ( Dog / Pet Friendly )",
    "Parking garage",
    "Wifi",
    "Sauna",
    "Baggage storage",
    "Non-smoking hotel",
    "ATM on site",
    "Express check-in / check-out",
    "Clothes dryer",
    "Laundry service",
    "Washing machine",
    "Allergy-free room",
    "Air conditioning",
    "Desk",
    "Dining area",
    "Fireplace",
    "Kitchenette",
    "Dishwasher",
    "Bath / shower",
    "Private balcony",
    "Separate living room",
    "Sofa",
    "Telephone",
    "VIP room facilities",
    "Bottled water",
    "Iron",
    "Private bathrooms",
    "Wake-up service / alarm clock",
    "Microwave",
    "Refrigerator",
    "Complimentary toiletries",
    "Hair dryer",
    "City view",
    "Non-smoking rooms",
    "Suites",
    "Family rooms",
    "Smoking rooms available"
  ],
  "reviews": [
    {
      "title": "Very close to Sick Kids",
      "text": "Very spacious flat near Sick Kids hospital. Kitchen was fully stocked with dishes, pots and pans, and even had measuring cups! Very clean. We opted for an optional cleaning service every week and Barbara and her team were great !",
      "rate": 5.0,
      "tripDate": " July 2023"
    },
    {
      "title": "What they didn't tell you !!!",
      "text": "We booked our 2 bed presidential suite direct via the Canada suites website . Emailing asking about various suites and locations before booking. We booked the suite CB 027 after looking at the photos online and being assured it was on a high floor.We arrived at 4pm as agreed and the security guard shouted across a young lad who advised that we had not yet been allocated an apartment. I assured him we had and he tapped away on his blackberry for a while and said we were on the 4th floor ! I told him this was not what had been agreed and said we had emails to show this.We agreed to look at the apartment and it was so disappointing the view was a building site or multi story carpark through Windows's at which none of the curtains actually closed. The furniture was nothing like that shown on the website. After much tapping away on his phone he got us to call the office who denied we had booked a specific suite but said they would refund our money but we would have lost too much due to the exchange rate refunding it back to our UK credit card also where would we go?The big shock was to come next when we had to give a €300 deposit that was actually taken from our credit card and has been refunded today 1week after we left at a lose of nearly £20 due to exchange rates we were never at any stage during the booking told about this charge.The rooms were not too noisy although very bright due to curtains not shutting fully and work started on the construction site at 7am sharp .The good about the apartment was it did have the 2 bed rooms we wanted and was in a great location the number 6 bus stopped outside and it was a 5 min walk to the subway.The bad although this Is sold on holiday sites it is in no way aimed at tourist , no advise available , after 2 days we found the metro supermarket in the bottom of the college park. The security guards were extremally miserable and did not appear to speak English.This review may seem like a rant but we have stayed at apartments in Toronto on 3 previous occasions and many others in Chicago and Europe and never come across such a company.The actual location of the building saved our holiday and luckily we were never in during the day to have to look out on the view.",
      "rate": 3.0,
      "tripDate": " June 2013"
    },
    {
      "title": "A great stay, perfect for groups",
      "text": "Positives:Better than a hotel if you're travelling in a group Lots of amenities like fully equipped kitchen, washing machine, toiletries in the bathroomsGreat location, about 10 mins from Eaton Centre. We walked everywhere. 24 hour grocery store over the road and lots of restaurants in the vicinityNegatives:As anticipated from previous reviews on TripAdvisor, check in and parking wasn't the easiest but it was fine in the end! Fortunately when we arrived at the building there was space to pull over and some of us stayed in the car to avoid any parking tickets. The entrance to the parking garage is on Laplante Ave but you can't get in without the fob received after check in. You also can't get into the building until you have the fob so I ended up having to bang on the door and another resident let me in. The security guard called Canada Suites and said someone was coming down. I waited a good 10 minutes before someone turned up, all whilst we were illegally parked outside on the street. The guy then showed us into the garage and brought us back into the building for check in. All in all, not simple at all. I'd recommend calling Canada Suites about 15 mins before your arrival and ask them to wait outside for you! A couple of niggles inside the apartment but not a big deal. One of the hairdryers didn't work, but there were 2 anyway as we had 2 bathrooms. One of the blinds in the bedroom wouldn't open either. I would recommend staying here particularly if you're in a group!",
      "rate": 4.0,
      "tripDate": " September 2017"
    },
    {
      "title": "Reservation cancelled unexpectedly",
      "text": "My wife is suffering from Stage 4 Liver cancer, and as such once a month we need to make a six hour drive to Toronto for her to receive her clinical drugs. Since March, we have been staying at the Canada Suite location on Bay St. My wife really liked it there because it was close to hospital. And for the most part we have been pleased with  until recently.  Six days before we were to come for our Sept. trip, I received an email from Canada Suites saying they needed to cancel my reservation because the landlord wants to take possession of all their rental units as of Sept. 01. I should point out that I had paid in full for my suite months in advance. Needless to say this cancellation only a few days before we were to arrive caused undue extra anxiety for my wife and I, as we needed to find accomodation elsewhere in a short period of time.I called my rep. at Canada Suites to inquire about what happened and he basically cut me off saying he had to take another call and he never did return my call back to me. It doesn't make sense that Canada Suites and the landlord would not have some kind of contractual agreement  in place that would require an advance notice of a number of months from the landlord  to say that they wanted their units back. I am always told by Canada Suites that just how busy they were and that many of their suites are rented out months in advance. So I am sure I am not the only one who were left out hanging . Not acceptable at all.",
      "rate": 1.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Ripped off by liars",
      "text": "We booked a presidential suite, 2 bedroom, 2 bathroom at Canada Suites on Bay for pride weekend. We paid $1100 for 3 nights in February.A month later hotels.com contacted me saying the room is going under renovations and it won't be available. We started looking online to book other hotels but during our search we saw the same presidential suite online for almost triple the price. I called hotels.com and submitted a complaint and they talked to the hotel and got us 2 smaller rooms for the same price we originally paid.We reluctantly agreed and today we arrived to have 3 guys in suits standing at the counter to meet us. They knew who we were before we said anything. They whipped out a binder with our booking and told us they only have 1 room for us but for the same price as the presidential suite. They were rude, gave us the take it or leave it attitude. We asked why didn't they contact us before today and they said they aren't allowed to because we booked on hotels.com.Then they were rude to us for an hour and the 3 guys standing there like bullies laughing at our misfortune saying I'm not responsible for that, I wasn't a part of this and I don't know.After an hour we finally got one of them (Mark) to call their general manager Alex G (wouldn't give us a last name) and this man was worse. He kept saying whatever on the phone and screaming. That phone call was pointless and after it ended Mark was insistent that what we want is to give up our one room as well. But he couldn't guarantee any refunds and neither was he willing to try. He was stuck up and told lies in front of our face to the general manager right next to us to cover for himself.  He said we have 6 to 7 people staying even though there was 5 of us standing there and 1 person was just visiting (we told them this at the beginning of the conversation). He also admitted at one point that the suites were not under renovations and then quickly backtracked himself and said because of work on the elevators (on a long weekend) the noise pollution would have been too much.We are beyond devastated by their dishonestly and lack of moral and it has ruined the beginning of our world pride experience.It is a prime example of money grabbing corporations using anyway they can to steal and bully consumers because they assume most won't argue or put up a fight.I hope they do something about this horrible company and their company \"policies\".",
      "rate": 1.0,
      "tripDate": " June 2014"
    },
    {
      "title": "Poor customer service",
      "text": "Stayed here because Toronto General was close.  Family member was having surgery.  Booked for 7 nights departing Monday.  Surgery was Canceled so left 3 days early.  Was promised MANY times would get some kind of rebates or refund.  Did not get any rebate or refund.  Just tell me the truth.  If you were not going to give me a refund tell me don’t lie.  The apartment was nicer than staying in a hotel.   But over priced a bit for me",
      "rate": 2.0,
      "tripDate": " October 2013"
    },
    {
      "title": "Stuck out in the cold!",
      "text": "My Mother booked and paid for this hotel for a three-day stay for my family. We arrived and no one was there, but a security guard. He asked for id. Of course mine didn't match the name on the envelope that help the key.  This is at 11pm(12 our time). He called someone(called him Mark). I talked to him and he said it was fine, but needed my mother to email him in the morning to say it was ok.  We paid $765 for three nights because we were promised a high floor with a view..it's $425 on the website now... I questioned him about this and he said we had an upgraded room with two bedrooms on the 15th floor, but didn't have any other rooms. Too bad in other words ... I told him he needed to call my mother about id ( I would cost me to). this went back and forth for a bit. Both of us very frustrated. He told me to hand the phone to the security guard and then the security guard hung up. I stood there trying to figure out what happened. Waited 15 min and sucked up the cost and called my mother. She emailed the email I had on my booking reference I was sent.  He finally called back and said he couldn't access that email and I now needed a photo copy of my mother's drivers licence(we used my husband's when booking) and a photo copy of her credit card. My Mother is 74 years old...and it's midnight. She called and he was rude to her...He was on speaker phone and my Dad was there. We were thrown out in the cold. We had no idea what to do. My son now is running a very high fever and my husband had fallen and bruised some ribs.  We eventually found a place to stay thanks a lovely man at Hilton Garden inn on Peter st.  He got us a cab and made sure we made it ok.  I'm not sure what to do about the money for the room.  We are in Toronto and now have to pay for another hotel that we can't afford.  My Mother was crying on the phone to me and I'm stuck in the cold at 1am in a strange to me city with my injured husband, sick child and tired teenager. DONT STAY HERE!  THE GUY TURNED ON ME BECAUSE I COMPLAINED ABOUT NOT GETTING THE ROOM I PAID FOR!  NO ONE IS GUARANTEED TO BE THERE.  THERE ISNT A LOBBY WITH HELPFUL STAFF. Sitting here is tears because we don't know what to do.",
      "rate": 1.0,
      "tripDate": " March 2015"
    },
    {
      "title": "BEWARE Canada Suites on Bay!",
      "text": "This hotel has absolutely terrible customer service. I booked a stay there, but unfortunately had to cancel five days later. The hotel failed to refund $500 of my charge, and despite repeated requests and escalations, is still withholding half of that. I've been told two different amounts for the 'cancellation fee' and the hotel refuses to honour the amount it originally told me. Customer service has been negligent.BOOK AT YOUR OWN RISK!",
      "rate": 1.0,
      "tripDate": " June 2012"
    },
    {
      "title": "Fully Furnished Condo - Excellent location, well maintained",
      "text": "I was in Toronto for a transplant and required to stay near hospital for about 6 weeks. We rented this fully furnished condo on Bay Street. It is extremely close to the Toronto General hospital. At most, walking slowly it is about a 5 min walk. The person in charge of the rental is Mark. He is super nice and very accommodating. The unit we stayed in was amazing, it was clean, bright, well maintained and modern looking. This is a first rate rental. I would definitely recommend this rental if you require a long stay in Toronto. They also do short stays min of 3 days.",
      "rate": 5.0,
      "tripDate": " December 2015"
    },
    {
      "title": "Good option for Toronto",
      "text": "Two well furnished bedrooms, dining area and kitchen are all fitted out to a high quality. We used the pool every day. We were in a family group of four. Very centrtal and rail terminal is 5 minuites away. We all felt safe here. Fire alarms did go off a few times. A worry for me, but no-one else seemed to care. A recommended option for Toronto.",
      "rate": 5.0,
      "tripDate": " June 2014"
    },
    {
      "title": "Good place to stay ",
      "text": "Overall it's a good place to stay small apartments but they have everything you need in them. If your under 6 feet tall you will need a ladder to get into bed! Fire alarm went of when I stayed not really the Canada suites fault thou. Cheap and cheerful I would recommend to others .",
      "rate": 4.0,
      "tripDate": " December 2015"
    },
    {
      "title": "Home away from home",
      "text": "I went to Toronto for my son conference in IEEE which was held in chestnut conference . Canada suite by the bay is walking distance to everything I want to go,I love the place we had 2 bedroom & 2 bathroom with 2 sofa bed extra, very spacious, with privacy, & most off all Mark is very accommodating & helpful, for sure we will stay here again",
      "rate": 5.0,
      "tripDate": " October 2015"
    },
    {
      "title": "Canada Suites Toronto",
      "text": "Lovely 2 bedroomed,2 Bathroom Apartment with all the mod cons including 3 TV's WiFi Washing Machine & Dryer, Stove & microwave etc. Pool & Gym also on site. Highly recommended for family or two couples travelling together as great value for money compared to a hotel of similar quality.",
      "rate": 5.0,
      "tripDate": " September 2015"
    },
    {
      "title": "Home away from Home",
      "text": "Comfort and location at its Best! We have stayed at Canada Suites several times now, and I have to say we LOVE it! The apartments are clean, spacious and modern, Check in is a breeze. It is situated close to restaurants, shopping, also Eaton Center. It's great being able to explore the city so easily and being situated in the heart of downtown.A convenience store is located right downstairs for any necessities needed, also opposite there is a Starbucks and a Pizza Pizza for a quick bite to eat.",
      "rate": 5.0,
      "tripDate": " May 2015"
    },
    {
      "title": "Convenience and good value",
      "text": "We chose Canada Suites because we were traveling as a group of six (two adults, two kids, two grandparents) and wanted an affordable place that could sleep all of us in comfort.Location:  We found 736 Street to be convenient due to its proximity to transit and downtown attractions.  The closest subway station is College, about one block away.  There are two full service grocery stores just above the subway station, Sobey's and Metro.  We could walk to Eaton Centre, the Hockey Hall of Fame, and the Convention Center, CN Tower, and Ripley's Aquarium are a short subway ride or longer walkable distance.Check-in:  This is the trickiest part.  Canada Suites is not a hotel.  It is a residential condo.  You will NOT see any sign for Canada Suites on the exterior.  When you arrive you will have to buzz the front desk for admittance.  If the manager happens to be assisting another guest, you will have to wait until he returns, as was the case for us.  However, once you get your keys and key fob then you're in!Suite:  We had a two bedroom suite (#405), with full kitchen, washer/dryer, and two full baths.  Our unit had super tall beds in the bedrooms, the kind that you could use a footstool to climb into but none were provided.  If you have read \"House of God\" these would be referred to as \"orthopedic height\" (i.e. hip fracture potential if you fall off); something to keep in mind if travelling with seniors.  My two children slept on a sofa bed in the living room.  It's mattress was wrapped in plastic!  My kids didn't mind and I knew when they were still awake because of the rubbery movement noises they would make if they shifted.  There is no mid-stay housekeeping service or other hotel-type services.Facilities:  We used the pool and found it warm and roomy, but there were no chairs or loungers for the non-swimmers.  There is also fitness and games rooms.Overall:  Good location and value and we enjoyed our visit.",
      "rate": 4.0,
      "tripDate": " April 2015"
    },
    {
      "title": "great appartment,  shame about the lift",
      "text": "I was travelling with a group of guides from the Uk. The apartments were amazing and in a skyscraper so we needed to use the lift.One evening we were stuck in the lift for 45 mins until we were eventually rescued. The girls really panicked about it.",
      "rate": 4.0,
      "tripDate": " August 2014"
    },
    {
      "title": "Don't stay here until construction is done",
      "text": "We stayed Sept 17-22, 2013. The one bed apt was as advertised, nice, clean, decent gym, comfy bed, washer/dryer. Kitchen had all utensils needed but no extras like oil, salt/pepper etc that often come with these type of places. Our big problem was the noise!! There is MAJOR construction or actually demolition going on next door which was ridiculously loud even on the 27th floor. Couple that with the no AC after mid Sept law and we were either deafened with the windows open or broiling with them closed (and the noise was still bothersome with them closed). Also note that the building is very close to a hospital so we were charmed awake with sirens at night before the construction started bright and early. It's too bad bc the place really was pretty nice.",
      "rate": 3.0,
      "tripDate": " September 2013"
    },
    {
      "title": "lovely interior but poor service",
      "text": "i stayed in the appartment for a few weeks. I was on the top floor and had trouble sleeping due to the loud noise of what im guessing was the air con equipment in the floor above. Positives: nice interior, very clean and a superb location if you want to be in the heart of the city and close to the subway for easy commuting. An easy walk to queent st west or bloor for shopping or eating out. Negatives: noisy and unfortunatley I found the staff were very rude and unaccomodating when it came to a late check out request. I was quite shocked by the rudeness of the emails i got as a reply, considering it is at heart a business.",
      "rate": 3.0,
      "tripDate": " April 2013"
    },
    {
      "title": "Great place to stay for a family",
      "text": "In my opinion Canada suites is a very convenient and cost effective place to stay when you need a large space and a kitchen. My cousin and her family are visiting Canada and we had a great time staying in a 2 bedroom  apartment right near Eaton's centre that accommodates family comfortably. We were also surprised by the size of the apartment - it is really big. Staff is nice and location is superb - short walk everywhere.",
      "rate": 5.0,
      "tripDate": " December 2012"
    },
    {
      "title": "Great apartment with super service",
      "text": "We had a 5 day stay in an apartment.The apartment was clean, spacious and was well equipped with dishwasher, washingmachine and dryer.Great location on Bay Street where everything is within walking distance.Extremely friendly management that helped us with various logistical challenges during our stay.All in all a super experience",
      "rate": 5.0,
      "tripDate": " May 2017"
    },
    {
      "title": "One of my best stay in Toronto downtown area",
      "text": "Date of stay: September 2012Client name: TranI stayed at Canada Suites on Bay in September. I was given a suite on the 31st floor. Can not stress enough the location, just a short walk from subway, all restaurants, entertainment is within a reach, It is truly is in the centre of everything.  Nice welcoming lobby with the modern furniture.  The apartment was 1 bedroom suite, but I would say it was pretty large compared to the most hotel rooms.  I liked unlimited high speed internet and cable, no extra charge, they said it was all included.  I used kitchen facility, - I was able to entertain my guests and everyone was happy.Positive:The location, price, amenities were all beyond my expectations. Large size of rooms, dishwasher was convenient. Definately reccomend Canada Suites to my friends and colleages.Negative:Noise from the outside",
      "rate": 5.0,
      "tripDate": " September 2012"
    },
    {
      "title": "4* because lack essential service",
      "text": "Would have given this 5*, but because it didn't have left-luggage facility, which made it inconvenient for us, we give this 4*.PROS1. Room -- very spacious apartment, with \"separate\" kitchen (there was a low dividing wall), living-cum-dining room with big sofa bed, plus separate room2. Amenities -- washing machine + drying machine; lots of utensils, fridge, oven, free wifi3. Facilities -- bathroom (with bathtub)4. Shopping -- Short walking distance to Eaton Centre5. Very nice Japanese cheese cake shop nearby, but very long queue (go there early in the morning to beat the crowd, it's only CAD$10 for a cake)6. I think there was an indoor swimming pool and sauna, but i didn't useCONS1. Late check-in time (4pm)2. Early check-out time (11am)3. No left luggage facility (we wanted to \"check-in\" earlier, or just leave our luggage and wander around the place, but there wasn't such type of service available)4. Only one bathroom (hence one latrine) to share between the 4 of usINTERESTING1. I forgot if we need to take out rubbish by ourselves, but there's a \"rubbish\" room that we can put recyclable stuff in there2. We can use the toilet in the changing room downstairs3. Saw a woman with a puppy, therefore not sure if we're allowed to bring pets4. Uber drivers can't really find the place, unless we tell them it's near \"San Francisco\" sandwich -- the main doorway seems more to be on Hayter St5. the mini-mart downstairs and on the opposite corner is exorbitant; CAD$8 for 1 litre of milk !?!?!",
      "rate": 4.0,
      "tripDate": " July 2016"
    },
    {
      "title": "conferencing in Toronto",
      "text": "These apartments were outstanding. The concierge was very helpful and polite. The view was uninteresting, but cityscapes are rarely exciting. quiet and restful. would definitely use this place again and again",
      "rate": 5.0,
      "tripDate": " March 2015"
    },
    {
      "title": "home away from home",
      "text": "Canada Suites on Bay is at 736 Bay, just south of College St.  It's actually a condo building with 25 1 and 2 bedroom suites which are rented out short term.  I had a 1 bedroom with a pull-out leather couch in the living room, a leather futon, a tv and fireplace in the living room as well as a tv and fireplace in the bedroom.  Washer and dryer in unit and pool, gym, hot tub and sauna.  Large balcony with table and chairs and I was on the 22nd floor - great view.  Underground parking.  Will definitely use this place again - much quieter than a hotel and great location.",
      "rate": 5.0,
      "tripDate": " June 2014"
    },
    {
      "title": "Cozy apartment downtown Toronto",
      "text": "I have stayed at Canada suites on Bay last week and had a nice stay. The apartment was on the 22 floor it was very cozy and I felt right at home there. Nicely setup kitchen! Balcony was just amazing. I got to enjoy the unusually warm November in Toronto.",
      "rate": 5.0,
      "tripDate": " November 2012"
    },
    {
      "title": "A mini home away from home",
      "text": "The place is fully equipped with everything you need to make your stay comfortable and easy. Perfect location. Safe, quiet and secure. Heavenly beds. Family friendly. We felt at home in our apartment. We accidentally dropped the tea kettle and it broke. We were worried that we will be charged for it, but when we told Mike about this when we saw him in the lobby he did not charge us for our clumsiness. He brought us a brand new kettle that same day. That is what being a great host is in my opinion!",
      "rate": 5.0,
      "tripDate": " September 2017"
    },
    {
      "title": "GREAT stay!",
      "text": "Being able to make my own meals was great! There's a Sobey's grocery store right across the street. Location was superb! We were able to walk anywhere we wanted to go. Pool was lovely and it was was clean and warm :) After reading other reviews online I was a bit concerned about the building security guards being unfriendly. I spoke to them quite a few times on my way in and out and all I can tell is that they are decent people who have a crappy job dealing with residents of a big condo building who sometimes give the guards hard time. During our 5 week stay the guards would open the electric door for me every time they saw me coming in.",
      "rate": 5.0,
      "tripDate": " September 2017"
    },
    {
      "title": "Great apartment for the price of a hotel",
      "text": "My wife and I just stayed 4 nights at the Canada Suites On Bay. The price is the same as a tourist-class hotel, but instead of a small room, you get a an appartment with seperat bedroom, kitchen, livingroom and a balcony with a great view of the city. This is not a hotel, so there's no cleaning, no reception and you have to buy your own toiletpaper etc. But this is bigger than a suite at a hotel, and way way way more comfortable. The staff was extremely friendly and helpful during our stay, which all in all was a wonderful experience.",
      "rate": 5.0,
      "tripDate": " May 2017"
    },
    {
      "title": "Great Space for our Family",
      "text": "Was very clean and well appointed.  Lots of room for my husband and I and our daughter.  There were lots of good restaurants/pubs in the area, but we did use the kitchen to prepare meals on two occasions.  The den area was great to relax in with family and my daughter said the wifi was fast.",
      "rate": 5.0,
      "tripDate": " March 2016"
    },
    {
      "title": "Home away from home ",
      "text": "Great customer service, we were met with very friendly staff, the suite had everything we needed from coffee maker to laundry soap. Very comfortable, very clean and beautiful view. Thank you for making our stay very comfortable, home away from home.",
      "rate": 5.0,
      "tripDate": " December 2015"
    },
    {
      "title": "Family Four Day Break",
      "text": "We arrived late (1am) from Washington & check in was no problem at all. Our bags were stored when we checked out without any issues. The apartment was perfect, spotless, spacious & in an ideal location.. Clive & Mark were very pleasant & helpful. Will be returning...",
      "rate": 5.0,
      "tripDate": " April 2015"
    },
    {
      "title": "pro",
      "text": "Excellent location. Easy to walk to major attractions. Has Starbucks, pharmacy, and a 24 hour supermarket within a block. Eaton centre two blocks away. Apartment is very nice with loads of amenities. It is very clean, spotless in fact. Everything in working order. Gentleman at check in was very polite, informative, organised a high chair and gave excellent tour of apartment and showed how everything worked. Beds very comfortable.",
      "rate": 5.0,
      "tripDate": " September 2017"
    },
    {
      "title": "Nice, comfi hotel.",
      "text": "Great place, I am very satisfied. The service is on a high level. I will come back. People here are more than regular, widely smiled. Some of the ladies working there are beatiful. Nice bar worth visiting afternoon.",
      "rate": 5.0,
      "tripDate": " August 2017"
    },
    {
      "title": "Superb Location, excellent facilities",
      "text": "Canada Suites on Bay is tucked in on Bay Street. Convenient for the whole Downtown area. The apartment was clean, well equipped with a dishwasher, washing machine and tumble dryer. As we were all about to head for a laundry after 2 weeks of travelling, these last were particularly welcome. With 2 bedrooms and 2 bathrooms, and a large living/dining area, our 5th adult opted to take the mattresses off the 2 pull out sofas and leave them permanently down. The kitchen is equipped for 6 people. There are a number of supermarkets nearby so buying food was easy. The pool was an added bonus to stretch out tired legs after each day of walking. For those who prefer to use transport, the subway station is also nearby.",
      "rate": 5.0,
      "tripDate": " May 2017"
    },
    {
      "title": "NBA All Star Weekend trip",
      "text": "Rented this condo during NBA all star weekend in Toronto. It was perfect. There were 6 of us and enough room for everyone. We had a 2 bedroom 2 bathroom suite with a balcony and kitchen. The living room had 2 pull out sofa beds.Mark was great! We met him the first day we arrived and he was more than helpful. The location is absolutely perfect! Eaton Centre is literally a 6 minute walk. There's a convenience store right outside which came in handy!We all enjoyed our stay and we can't wait to return to Toronto and stay at Canada Suites again.",
      "rate": 5.0,
      "tripDate": " February 2016"
    },
    {
      "title": "Better price for our Family of 5",
      "text": "Perfect location, clean, well decorate, all of what We need to Cook! In addition to that, A Nice and calm pool /spa .Great view of the CN tower and Ontario Lake! Walking distance from Many attractions of Toronto downtown .Really good services from Mark , helpfull tips! excellent choice for my family of 5!",
      "rate": 5.0,
      "tripDate": " August 2015"
    },
    {
      "title": "Wouldn't stay here again",
      "text": "First of all, to be very clear, this IS NOT a hotel. This is a condo. There are tenants who live there, not just for a few nights. Therefore, you are asked to sign a form that lists MANY RULES in a very small font. There are rules that are not listed on their website as well. For example, you are asked to take out the trash at the end of your stay (FYI, if you leave it, they will charge you over $100 for cleaning.) There is no room service. So if you want clean towels during your stay, you have to wash them by yourself. What frustrated me most was that because of the very poor sound proof, when there was a loud party going on the other side of the same floor, there was nothing I could do. Canada suites didn't provide us with the contact information for this kind of situation. I even called the non-emergency # listed by the police, but it didn't help. If this was a regular hotel, I could have just called the front desk and have them send a security to the party. If you are lucky, your stay may be quite pleasant, but it could suck.",
      "rate": 2.0,
      "tripDate": " March 2015"
    },
    {
      "title": "Good apartment (burn the couch)",
      "text": "Firstly be clear, these are some furnished apartments in a normal housing block - it is not entirely owned by one company or anything like that. That is not a criticism, it felt like living like a local which was fantastic. You even have a telephone and cable, good wifi as well as dishwasher, laundry machines, cooker, fridge/freezer and microwave. It does mean when you arrive you might have to wait for the rep to arrive, there is no daily 'service' and if you have a problem then they call in a contractor on next-day service but again, not a problem if you know what to expect. We had a great time living there for 10-days. There is Sobeys supermarket just down the road at 777 Bay (along with a dollar store and metro-supermarket as well). You are never more than 3 steps away from a coffee shop. there is a pizza pizza and starbucks across the road and a burrito place and convenience store on the ground floor of the building. The location is great, 777 Bay connects to the college metro station, the 6 bus runs down Bay and even walking down-town is possible. The apartment itself (we were in 1506 on 15th floor) was clean and fresh, not huge but sufficient for 2 with no problems. The only problem we had was that the dishwasher is so noisy that you have to run it whilst you are out. The laundry system is OK but the fan on the dryer is almost as loud as the dishwasher. Oh and the couch, there were 2 in the apartment, a brown one and a white one - brown one was fine, the white one was a torture device - (Mark, if you read this, I suggest throwing it off the balcony and setting fire to what is left). On the plus side the a/c was very quiet and effective. We really enjoyed staying here and would recommend it - just understand it is not a 'hotel'.",
      "rate": 4.0,
      "tripDate": " August 2014"
    },
    {
      "title": "Old building under maintenance",
      "text": "If you decide to stay in this building please expect water shut down; power outage and air conditioning shut down.  Also the worst the noise and vibrations from 8am to 5pm daily due to ongoing rehabilitation for this old building",
      "rate": 1.0,
      "tripDate": " July 2014"
    },
    {
      "title": "Perfect suite on 21st floor",
      "text": "This is clearly a great place to stay. Flawless treatment at check-in, amazing room size and much better bed than expected. Views were also great, overlooking downtown Toronto and Lake Ontario. Really impressive WiFi speed of over 30 mbps - it was free! (unlike regular hotels who are crazy enough to charge for this even nowadays).",
      "rate": 5.0,
      "tripDate": " November 2012"
    }
  ]
}