{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Canopy By Hilton Toronto Yorkville",
    "url": "/Hotel_Review-g155019-d25020081-Reviews-Canopy_By_Hilton_Toronto_Yorkville-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.5",
      "reviewCount": 51
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "387 Bloor Street East",
      "addressLocality": "Toronto",
      "postalCode": "M4W 1H7",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2a/96/44/b8/exterior.jpg?w=500&h=-1&s=1"
  },
  "description": "The energizing hotel is the perfect place to relax and recharge. The hotel is steps away from the heart of Yorkville, one of the most exclusive and globally recognized neighbourhoods in Toronto. The spirit of this vibrant and refined community is reflected in the hotel's architecture, design, art, and culture. The hotel features a modern café with retail offerings from local businesses on the main floor, a highly anticipated restaurant featuring thoughtfully local artisanal food and drinks, a sleek indoor heated pool, yoga and fitness rooms featuring state-of-the-art equipment, and comfortable meeting spaces. Whether the priority is business or pleasure or both, Canopy by Hilton, Toronto Yorkville brings you a truly local experience of this thriving and artistic city. Our Positive Stay brand promise enables our guests to get the most out of travel and experience the best of this unique neighbourhood.",
  "featues": [
    "Valet parking",
    "Free High Speed Internet (WiFi)",
    "Fitness Center with Gym / Workout Room",
    "Pool",
    "Bar / lounge",
    "Pets Allowed ( Dog / Pet Friendly )",
    "Business Center with Internet Access",
    "Meeting rooms",
    "Infinity pool",
    "Indoor pool",
    "Saltwater pool",
    "Restaurant",
    "Breakfast available",
    "Complimentary tea",
    "24-hour security",
    "Non-smoking hotel",
    "24-hour check-in",
    "24-hour front desk",
    "Dry cleaning",
    "Blackout curtains",
    "Air conditioning",
    "Desk",
    "Housekeeping",
    "Room service",
    "Cable / satellite TV",
    "Flatscreen TV",
    "Bath / shower",
    "Safe",
    "Seating area",
    "Telephone",
    "Wardrobe / closet",
    "Clothes rack",
    "Laptop safe",
    "Private bathrooms",
    "Wake-up service / alarm clock",
    "Complimentary toiletries",
    "Hair dryer",
    "Non-smoking rooms",
    "Suites"
  ],
  "reviews": [
    {
      "title": "Overall enjoyable stay in a new classy hotel with a trendy design",
      "text": "I Booked this hotel based on the location (close to Yorkville), travellers photos and reviews (despite some negative reviews). I was personally not disappointed: the rooms were nicely laid out with a beautiful decoration, and very well appointed (lights, curtains…). The staff were very friendly and professional. Breakfast was decent.One important (from my pov) point to improve though, is the cleaningness in the bathroom. There were hairs in the shower, but I liked the staff reaction upon seeing them for himself: without any fuss, I was moved to another room and was assured that the matter would be discussed with the manager, to ensure further training of their staff. When I came back to my room later on, I found a note apologising for the inconvenience and offering free breakfast.Overall, a very pleasant stay and I would recommend this hotel",
      "rate": 4.0,
      "tripDate": " July 2023"
    },
    {
      "title": "Canopy has you covered!",
      "text": "The brand new Canopy Hotel by Hilton was nothing less than spectacular!We stayed 4 nights just after the property opened and we were truly amazed by the level of professionalism, hospitality, and a genuinely caring and gracious staff.Selena, Alex, Iogo, Fanette, Khushboo, Saki, and Anna were a delight. Extra kudos to Selena.The food served in Dia, one of the most beautiful restaurants in the city, was nothing short of perfection.The rooms are original and fun, as is the lobby and public areas. Great job Canopy! Thank you for making our stay very special!",
      "rate": 5.0,
      "tripDate": " February 2023"
    },
    {
      "title": "Very good hotel. Highly recommended!",
      "text": "The staff are all very friendly and welcoming, from the cafe, to the front desk. Great service! The rooms were really nice, everything smells new. It also has a heated pool and gym. There is a cozy restaurant but I didn’t have a chance to try it, will dine next time for sure. Location wise, it’s very accessible as it’s close to the subway, just takes about 5 mins. walk or less.",
      "rate": 5.0,
      "tripDate": " December 2023"
    },
    {
      "title": "We paid 5* prices for 3* hotel ",
      "text": "This review is based on the fact we paid $469 a night for a standard room in the hotel. The checkin staff were very friendly when we arrived, although the layout of the entrance from the street to the checkin desk is a little odd. We were put in a room on the third floor that was pretty spacious, however it was an anointing room, for the first night this was fine but our second morning we were woken by our neighbours alarm and multiple phone calls, no sound proofing at all! We asked to change rooms which they did, although the room we were changed too was significantly smaller. I liked the electrical controls, but they are a bit of a novelty, the room didn’t have enough surfaces and it would have been nice to have a mirror in the room to so hair and make up at the desk as I hate getting readying in a damp bathroom (there was also very limited space around the sink for getting ready). I am a tea drinker and there were 4 varieties of tea when we checked in, I drank one English breakfast tea and this was no replenished, and when we loved rooms again there was no English breakfast (I actually hid all the tea bags and then one was replenished), I know I could of called down to the desk to get some but it’s just hassle I don’t want. There was also a bit of an oddity in both rooms when we first got to them there were no hand towels, but once the room had been cleaned hand towels appeared?! The location of the hotel is okay, although it’s not near downtown Montreal where a lot of the other hotels are. Overall the stay was fine but it certainly was not worth the price we paid for it!",
      "rate": 3.0,
      "tripDate": " September 2023"
    },
    {
      "title": "Poor. We felt invisible.",
      "text": "We had a very disappointing stay. We were shocked to discover that the large tv had absolutely no way to access movies (paid or not). No streaming. Nothing that could be attached to make our event enjoyable. Also, we had room service for dinner but nobody came to collect the considerable number of dirty dishes from our room, in spite of us calling the front test when we were finished. Way too much $$. Very poor value. We won’t recommend this hotel to our out of town guests.",
      "rate": 2.0,
      "tripDate": " March 2024"
    },
    {
      "title": "Form over function in some cases ",
      "text": "I’m a big fan of the Canopy brand in general, but I have a hard time loving this particular Canopy. It seems like it’s designed more to look great than to be great. For example, the electric controls next to the bed are unnecessarily complicated— there’s about 9 buttons to control different lights and shades and things, and it isn’t easily usable. You have to hunt through all of them and try to remember the difference between the sconce light and the halo. It’s needlessly complex and that makes it harder to use.There is also a motion-activated night light under the bed, so if you get up in the middle of the night, it shines a light for you, which isn’t great if your partner if sleeping or even if you yourself want to try to go back to sleep. The night light is hyper sensitive, so it activates even if you just lay in bed and dangle your leg down. And there’s no way to disable it. If you don’t want lights going off every time you get out of bed, you have to shove a pillow under the bed to block the motion sensor or cover up the light.I love the filtered water/ice stations (one of my favorite parts about canopy hotels!) but the ones I used here seemed a lot more temperamental than others. You have to hold your water bottle at exactly the perfect angle before water will dispense, but since there’s no instructions, you have to poke around til you figure it out.There’s no little shelf in the shower stall, so if you bring your own toiletries, you have to either put them on the shower floor or balance them on top of the wall-mounted toiletry bottles.I also didn’t love that there’s no door on the bathroom and only frosted glass around the toilet cubicle.The bed was great — very comfy — and the blackout shades were an excellent touch. Very convenient location, close to the subway.  And the decor is beautiful, very sleek and bright.  It just all feels like it was designed without any context of how a guest will actually interact with all these things.",
      "rate": 3.0,
      "tripDate": " August 2023"
    },
    {
      "title": "A nice new hotel - but can be nicer",
      "text": "This is a very nice new Hotel with modern design.  2 points thru might consider improving, the breakfast venue is not really very hospitable and it takes a long time to actually receive what you ordered.  The Room I was in in the 2M floor was poorly designed  (toilets that are so so narow ,  very dark room and not enogh lighting",
      "rate": 4.0,
      "tripDate": " August 2023"
    },
    {
      "title": "10/10 Pride Weekend Getaway ",
      "text": "My partner and I stayed at Canopy Hilton Toronto for Pride 2023 and we had such an incredible experience. From the modern amenities and beautiful city views from our room, to the friendly and helpful staff, everything was top notch! Not to mention the unique decor including a mural by a local Toronto artist - lots of great places to take photos! The hotel restaurant, Dia, is also very accommodating to dietary restrictions. We are vegan and they had many options for us to enjoy.Definitely recommend for a romantic getaway in the heart of the city!",
      "rate": 5.0,
      "tripDate": " June 2023"
    },
    {
      "title": "Nice Hotel, Friendly Staff, Good Food",
      "text": "It was snowing in Toronto for my entire business stay, so I was happy to have everything I needed within The Canopy.  The room was clean, new, modern, safe, well appointed and quite spacious. I ordered room service dinner from their restaurant, which was a delicious baked chicken with mashed potatoes and a small salad.  Breakfast was just as good: the Mexican Eggs Benedict. The room provided a very quiet & comfortable sleep. All around in the hotel I experienced friendly and helpful staff, especially Bianca & Maria from the front desk and Darling who helped bring things I needed to my room.  I highly recommend this hotel and I will stay here again when in Toronto.",
      "rate": 5.0,
      "tripDate": " February 2024"
    },
    {
      "title": "The ONLY hotel you would ever stay at when visiting Toronto",
      "text": "This is the second time staying at this hotel and will be the ONLY hotel I stay at whenever I come to visit Toronto. This review was meant just for the restaurant but I had to rave about my entire experience.   The esthetics are impeccable with minimalist, yet extremely comfortable decor. The menu is limited (not in a bad way), but diverse, bursting with flavor, and always visually appealing (request for the Shakshuka eggs to return to the menu please, chef Justin!). The staff are truly incredible (shout out to Anwar who is the first/last person that you interact with whenever you arrive or leave the hotel- which as we all know can set the tone for your entire stay,  and every single day Anwar was at the entrance pleasantly greeting/assisting. He was so professional and kind. Victor, at Dia, so warm and friendly, he took care of me every morning, with the utmost attention to detail; Marianthi who curated gorgeous cocktails in the evening was always bubbly and entertaining (as a bartender should be), Maria the front desk/concierge, took care of me even before I arrived and would touch base with me during my stay,  and finally Lorei, the manager, who assisted me when I had to be relocated from my room because it required 2 days worth of maintenance -Lorei followed up and followed through by taking care of me through the entire process and I was beyond happy with my new room). The entire team understands the true meaning of \"service\" and to \"do the right thing\". I am returning in April and September and plan to make my reservations now! Even if you're not a guest at this hotel,  the restaurant is worth the visit.",
      "rate": 5.0,
      "tripDate": " January 2024"
    },
    {
      "title": "Night at the canopy",
      "text": "Eloquent design throughout the hotel, top tier customer service at the front desk and an exquisite selection of food at the Dia restaurant. I’ll give my stay a 10/10. 13 minutes away from the CN Tower and right in the heart of downtown. The hotel has a vibe of elegance and class.",
      "rate": 5.0,
      "tripDate": " February 2024"
    },
    {
      "title": "Great stay, and loved the restaurant!",
      "text": "Stayed with my husband last weekend for little get away and we loved it. The rooms were bright and clean :)  the best part was the Restaurant they have on the second floor, Dia. We had dinner and it was just amazing! they even had a live Dj playing.  Overall it was great stay and we will be coming back for our wedding anniversary in December.",
      "rate": 5.0,
      "tripDate": " August 2023"
    },
    {
      "title": "Lovely modern hotel with amazing staff",
      "text": "Very friendly staff and accommodating! We only had lunch there but Lorei and Katherine arranged for us to see one of the rooms. Rooms are very clean and modern! Would definitely stay there next time I visit Toronto!  Food was great as well! Location was convenient, near the subway station!",
      "rate": 5.0,
      "tripDate": " June 2023"
    },
    {
      "title": "Awesome new hotel! ",
      "text": "We had the best time at the Canopy! They had awesome customer service and great food! I highly recommend this new hotel for anyone looking to stay somewhere downtown Toronto.  Had a great experience and would return anytime I stay downtown.",
      "rate": 5.0,
      "tripDate": " August 2023"
    },
    {
      "title": "Couple Shopping Trip",
      "text": "We have had an excellent time. We love the modern hotel. The staff has been spectacular.  They kindly sent us a surprise anniversary cheese board with card.  Lovely.  The bartenders are also so pleasant.  The bed is so comfortable we slept so well.",
      "rate": 5.0,
      "tripDate": " February 2024"
    },
    {
      "title": "New favorite Toronto Location ",
      "text": "The best hotel I've stayed in since traveling for business and personal. The attention to detail of the hotel was terrific. The atmosphere, the bedding, and the ambiance are a 10 out of 10. I can't wait to go back. Please don't miss out on the restaurant! AMAZING",
      "rate": 5.0,
      "tripDate": " July 2023"
    },
    {
      "title": "Poor value for the money",
      "text": "New, clean, fresh and stylish hotel in good location, hotel in the lower floors of the building, no view,  subway running beneath, ridiculous tiny room and bath room, no storage, careless housekeeping, beds not made, seperate reduced (!) breakfast menue for diamond guests, status not well appreciated except for a cheap and useless handwritten welcome letter, very poor value for the money.",
      "rate": 3.0,
      "tripDate": " October 2023"
    },
    {
      "title": "Premium service lacking",
      "text": "When we pay a premium price for hotel accommodations, we have a right to expect premium service – full stop! Canopy Toronto fell short of our expectations. We arrived at the hotel to a less than welcoming reception. The room was not available and we asked if a text could be sent when it was ready --- response, not possible.Other requests were met with excuses like – the hotel has only been open a few months so we are not fully operational or I’m a new employee without the answers.The property restaurant was understaffed. At times, coffee refills required three requests and a 15-minute wait. The selection and portion size of breakfast items available for Diamond status guests were of low value. Meat options were all pork which didn’t work for our Muslim guest.Room service was superficial with incomplete daily refills of in-room tea/coffee service.The property is new and nicely appointed with an OK location. There were some superstars working at the hotel including a very friendly Scott at the front desk, a completely cheerful Anna in the restaurant and an engaging Marcelo at the main entrance. All three of them are 5-star worthy with a clear understanding of hospitality.",
      "rate": 3.0,
      "tripDate": " June 2023"
    },
    {
      "title": "Superior Hotel with excellent food and service.",
      "text": "I am in hotel business for 40 yrs. This is the best superior quality brand new facility. Everything about this hotel is special, unique and excellent. Rooms are state of art, central excellent location. User-friendly  and most modern fittings everywhere in hotel. Dinner and Breakfast in Día restaurant is most enjoyable. Staff is superbly trained -reminds of fine dining service. Food is very good, well presented. SELINA dinner hostess should get 7 stars for caring and training all staff with exceptional service. Was most enjoyable stay. Will stay again. BEST OF ALL, THE HOTEL CARES FOR EVNVIRONMENT ADN EVERYTHING IS BASED ON GREEN CONCEPT.",
      "rate": 5.0,
      "tripDate": " July 2024"
    },
    {
      "title": "Poor Customer Service",
      "text": "I recently stayed at the Canopy by Hilton from June 29 to July 1, and unfortunately, my experience was far from satisfactory. I believe that this could be an exceptional property in Toronto with some service-related improvements and training. Postive Expereinces: Modern Rooms: The fresh and modern room design was a highlight.Atmosphere: The hotel’s ambiance and vibe were enjoyable.Location: Proximity to restaurants, nightlife, shopping, and the subway was convenient.Beds: The beds were comfortable.Negative Experiences:Air Conditioner: Upon arrival to the room, it was hot and humid, showing 23 on the thermostat. I changed it to 18, and a couple of hours later, it was still at 23. At this point I requested maintenance, but it was not fixed as later they had to be called again as the room did not cool down. In total, the broken air conditioner required two maintenance visits, disrupting our comfort during the stay, and required us to change rooms after 9pm. I will acknowledge that we were offered assistance with our room change and we declined, but we appreciated the offer. A brand new hotel should not be having these types of issues already. Housekeeping Services: On Sunday, we didn’t receive housekeeping services while we had left between approximately 11:30am and 5:30pm. We set the room to \"Service\" using the touchpad control on the wall when we left, assuming this would result in the room being refreshed, but upon our return, it was not. Therefore, we had to request housekeeping services, or we would not have received any. Thankfully, we were planning on going back out for dinner, so there was an appropriate time for the service, but had we not, this would have been extremely inconvenient. Towel Situation: During the requested housekeeping service, they took all our old towels and did not restock the room with any replacement towels. As it was somewhat later in the evening, we waited until morning to request a new set of towels. We texted the front desk at 9:11am and did not receive a reply within 10 minutes, so we called down, at which point we were advised towels would be sent right away. After 30 minutes, they had not arrived, and a follow-up text was sent to which we were informed they should be coming, and they apologized. After an hour passed by and no towels had been received, another text was sent, and a fellow hotel guest friend (Ryan Bester), who had stayed many times before, went to the desk and spoke to the Manager on duty, at which this is only when we were able to finally have replacement towels provided at approximately 10:24am. Also, an investment in more plush towels would be a pleasant upgrade as the bath towels were quite scratchy and low-quality. Restaurant Service: The restaurant service at Dia was subpar on Sunday morning for breakfast, with delays in taking orders, missing condiments, and no follow-up on our meal, to name just a few of the issues. I would not return to this restaurant or be able to recommend it after this experience. Check-Out Experience: Upon check-out, the desk agent’s lack of care and competence was disappointing. They asked how the stay was, and I shared that it wasn't great, to which the agent responded, \"Awesome, is emailing your bill okay?\" There was a complete disregard for my disappointment in the stay and a clear lack of attention provided to me as a guest, as the desk agent was working as if a robot or on autopilot. Upon asking what the total for the bill was, it was also higher than expected. It was found that it was due to charging breakfast to the room as we had received a $50 food and beverage credit due to the room change and air conditioner, but that it had not been applied. The agent then had to have another desk agent (Maria) assist in fixing the billing issues, further showing the level of incompetence of the desk agent.Additionally, after emailing the property about my stay providing this feedback, no response was received from the hotel and it had to be escalated to Hilton Customer Service, who basically stated thanks for the feedback, sorry about your stay, have a nice day. Overall, this was a very disappointing stay for a brand that is supposed to be a higher-end boutique-style hotel. I would recommend choosing any Marriott property in Toronto over this hotel until they learn how to provide good customer service.",
      "rate": 2.0,
      "tripDate": " June 2024"
    },
    {
      "title": "My new favorite Toronto hotel!",
      "text": "Excellent!  The rooms, amenities and food are all outstanding.  But the service is even better.  This was my third visit and they always exceed expectations.  One of the best! I spend an average of three nights a week in hotels and I can’t say enough about this one.",
      "rate": 5.0,
      "tripDate": " April 2024"
    },
    {
      "title": "Staycation at the Canopy!",
      "text": "I stayed at the Canopy during Valentines. The aesthetic of the hotel is insane! I would describe it as elegurbanxurious, we were fascinated. Every detail of it, from the hallways, the lobby, the restaurant, coffee shop to the actual rooms!! Big shout out to Joe the Chilean guy who was very helpful to every questions and everything we needed during our stay he is very proactive and sweet!!We are definitely coming back and unquestionably will be recommending it to our friends!",
      "rate": 5.0,
      "tripDate": " February 2024"
    },
    {
      "title": "Chic Hotel",
      "text": "This my second stay in the last year at the Canopy By Hilton. The hotel is modern, stylish and unique in so many ways.Canopy By Hilton has created a hotel inside a condominium building. Floors 2 to 5 area allocated for Canopy.Rooms are meticulously clean and offer a clean, modern, futuristic stay. Everything is new which is a plus.After a disappointing stay at the DoubleTree Hilton downtown Toronto, the Canopy was a perfect choice for a second night.The neighbourhood is quiet with all the conveniences one would need. Now it advertises itself in Yorkville but you have a 15 minute walk to the center of Yorkville.Overall, this hotel kills a lot of the downtown older hotels. It was nice to have a quiet and peaceful experience. Thanks Canopy.",
      "rate": 5.0,
      "tripDate": " July 2024"
    },
    {
      "title": "You have to go here!",
      "text": "What an experience! Hotel was so clean and welcoming! The hotel truly makes you feel like you’re away on vacation. Rooms were so pretty, comfortable and spacious. Great bar in hotel too!Shoutout to Maria at front desk for being so wonderful.",
      "rate": 5.0,
      "tripDate": " February 2024"
    },
    {
      "title": "A fantastic staycation",
      "text": "Oh my gosh! I like the hotel so much, Shataja is so kind, she arranged my stay very well, all the staff in this hotel is very helpful and professional. The breakfast tastes so nice, and the cocktail is very nice too. I think it is the best Hilton property in Toronto!",
      "rate": 5.0,
      "tripDate": " March 2024"
    },
    {
      "title": "Girlfriend Approves it!!",
      "text": "Starting from check in where Kevin helped a lot and made us feel welcome, and Patricia at the restaurant she ensured that the proposal was amazing, and the planning and co-ordination was great. Selena, who was our server, was wonderful. A big thanks to Saki for getting us slippers at 4 am, Special mention to Jennifer the housekeeper and the houseman who got me the dental kit. Sorry I forgot your name.",
      "rate": 5.0,
      "tripDate": " November 2023"
    },
    {
      "title": "Nice new hotel is Toronto",
      "text": "The hotel is very modern . Conveniently located. Rooms are modern and comfortable.  The products in the shower are very high end. Staff helpful. The restaurant food is good, particularly the breakfast. My waiter Joao was incredibly attentive and really went above and beyond.",
      "rate": 4.0,
      "tripDate": " October 2023"
    },
    {
      "title": "Near perfect hotel",
      "text": "A clean, modern and stylish hotel in a perfect location - walking distance to Bloor/Yonge, the brickworks, Rosedale and close to the subway and DVP. Approximately a 15 minute subway ride to the Eaton Center or financial district. Lots of convenient shops in the immediate area. The pool and gym are fantastic - plenty of equipment, new and not busy. The room was very clean and well thought out - techy lighting and tv. The main drawback is the ridiculous paving stones in front of the hotel which are broken and uneven making it hard to wheel a suitcase or for people with mobility issues. Hopefully the hotel addresses this before someone gets hurt.",
      "rate": 4.0,
      "tripDate": " December 2023"
    },
    {
      "title": "Classy city residence",
      "text": "Great room and all the latest bathroom gadgets!  Clean, comfortable and friendly staff.  Dia restaurant was great too and the swimming pool was quiet and warm. Great location for the subway or for Ubers.  Breakfast menu very varied and great coffee",
      "rate": 4.0,
      "tripDate": " January 2024"
    },
    {
      "title": "Fantastic experience and friendly staff!",
      "text": "This hotel is the place to stay in Toronto! The rooms are so comfortable, the location is perfect, and the staff are kind and helpful. I especially like talking to the door staff and front desk staff! Aya in particular was so friendly and personable. It was great getting to know her! I highly recommend Canopy!",
      "rate": 5.0,
      "tripDate": " April 2024"
    },
    {
      "title": "Stay Away ",
      "text": "Please take my advice and stay away from the Canopy Hotel by Hilton in Yorkville Toronto. The staff there are extremely rude and are not helpful. In all my years of traveling I have never met an organization that refuses to do what they can to asssist the guest even when the hotel is in the wrong. The prefer the clients ro suffer the losses.Kevin and Winson let me know when my $400 \"incidentals fee\" will be refunded to my card.",
      "rate": 1.0,
      "tripDate": " November 2023"
    },
    {
      "title": "Outstanding New Hotel in Toronto!",
      "text": "The first Canopy by Hilton in Canada was truly amazing. I was met by friendly staff, walked to me room, water brought to me in a reusable glass jar.Room was amazing with everything electronic, black out blinds. Also liked the feature with automatic ambient lighting in night mode so you can get up to the bathroom without waking anybody else up.Love that this hotel focuses on sustainability with zero waste. A leader in sustainability with no plastic in sight.Restaurant had great food with locally sourced honey. Top shelf cocktails and exceptional service.This would be my first choice to stay for my next visit to Toronto.",
      "rate": 5.0,
      "tripDate": " March 2023"
    },
    {
      "title": "Definitely NOT Yorkville!",
      "text": "This hotel was very nice and no complaints for the price.  However…to describe it as anywhere close to “Yorkville” is very misleading. It is at least a kilometre away and in a completely different and less attractive neighbour hood. How about some honesty in advertising?  Visitors expecting to walk out the front door into a trendy area will be sorely disappointed. MR",
      "rate": 3.0,
      "tripDate": " June 2023"
    },
    {
      "title": "Wonderful new option in Toronto",
      "text": "This is a relatively new property and the first Canopy in Canada, so the staff there are quite proud of their space.  The room was clean and well-laid out (as most Canopy properties are) and the staff couldn't have been friendlier.  For us, the complimentary breakfast (we are Honors Gold) was outstanding and we have to thank Anna and Victor for the tremendous service in the morning!  We were there during their first ever Thursday night music series in the restaurant/lounge, which was a real treat.  Thanks to Lisa, the head of sales and marketing, for spending so much time talking to us about the hotel and what they're trying to achieve.One caveat:  if you're driving, there is an entrance to the hotel on Selby Street where the valet is located.  It's a bit confusing, because the hotel is on the bottom floors of a 55-story residential building.  The lobby is on the 2nd floor and the whole layout (especially when you're just arriving) is a bit complicated.  But once you figure it out, it sort of makes sense.",
      "rate": 5.0,
      "tripDate": " July 2023"
    },
    {
      "title": "Superb Hotel Stay-modern, contemporary, stylish-great staff and service",
      "text": "The Canopy Toronto is fabulous. The staff of the hotel are knowledgeable, courteous and friendly. The contemporary look and design of the hotel is inviting, comfortable and calm. The rooms are spacious with superb amenities including a nice touch-Nespresso coffee service in each room. The restaurant on the main foyer (2nd floor) is a delight-modern contemporary, classy spot with a great menu and excellent service. Breakfast my two days there were a treat  and a great way to start the day! Ideal location in -great valet parking and regular parking if you are driving. You can easily access DVP. It is close to public transit and short walk to heart of Yorkville. I highly recommend this hotel if you are visiting 'the Six\"",
      "rate": 5.0,
      "tripDate": " February 2023"
    },
    {
      "title": "Fabulous new hotel in Toronto close to everything ",
      "text": "I loved my recent stay at the Canopy. The welcoming atmosphere at check in was lovely ! The design has a bit of an art deco feel. My room was so cozy & comfortable (the hotel even made me a holiday inspired welcome drink). I had a dip in the pool before turning in for one of the best sleeps! Once I pressed the button for the black out shades I floated in the comfiest of beds. Great location, wonderfully airy rooms, and a cafe + restaurant is onsite as well. I will be back !",
      "rate": 5.0,
      "tripDate": " December 2023"
    },
    {
      "title": "Canopy Hilton yorkville Toronto",
      "text": "An excellent luxurious Hotel! For a moderate price!The staff is excellent. Everything was ready before i came in.The valley suite is on a corner and nothing blocking with a regular moderate price. All is modern in the room, the blinds are opened from the wall control. Light detection when walking... A MUST SEE!",
      "rate": 5.0,
      "tripDate": " April 2024"
    },
    {
      "title": "Superb! 👍",
      "text": "What a wonderful visit!  This is a very beautiful hotel; the ambiance, the vibe, and the design all contribute to how much enjoyable it is to stay here. Additionally, Lorei was really polite and made sure we had a great time at check-out, and Shataja gave us all the information we needed to know about their facilities when we checked in. You also can't go wrong with Dia Restaurant's food.  Will definitely come back and recommend it to others!",
      "rate": 5.0,
      "tripDate": " November 2023"
    },
    {
      "title": "Friendly and warm staff",
      "text": "Really enjoyed my stay! The room looked great, went to the swimming pool every day, and the staff was really friendly and warm. Specifically, we want to mention Bianca who was way above being just nice and professional and really helped us to navigate the city. Thank you!",
      "rate": 5.0,
      "tripDate": " January 2024"
    },
    {
      "title": "Expect the unexpected!",
      "text": "I stayed there for 6 nights and I’ll definitely return thanks to Bianca at the Front Desk. She’s knowledgeable at her job and the friendly vibes from her made our day!Besides that, the location of the hotel is extremely convenient which is next to a subway station and shopping spots and the hotel is very modern since it’s a brand new hotel.",
      "rate": 5.0,
      "tripDate": " April 2024"
    }
  ]
}