{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Castlegate Bed & Breakfast Inn",
    "url": "/Hotel_Review-g155019-d250068-Reviews-Castlegate_Bed_Breakfast_Inn-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.0",
      "reviewCount": 73
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "219 Spadina Rd",
      "addressLocality": "Toronto",
      "postalCode": "M5R 2T9",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-s/01/e6/3b/9a/breakfast-room.jpg?w=500&h=-1&s=1"
  },
  "description": "Castlegate Inn is located in downtown Toronto close to all major tourist attractions including Casa Loma, ROM, University of Toronto, Bata Shoe Museum and major hospitals. Our inn is steps from Dupont Station, with easy access to the entire city! We have been rated as \"one of the best value Bed and Breakfast in Toronto\" by Lonely Planet. Each of our rooms is equipped with cable television, mini-fridge, microwave and private washroom.",
  "featues": [
    "Tennis court",
    "Business Center with Internet Access",
    "Refrigerator",
    "Family rooms"
  ],
  "reviews": [
    {
      "title": "Great bang for your buck",
      "text": "I find some of the reviews on this site really surprising...My experience of castlegate inn was great.  Right on the subway line, close to cool shops and restuarants on Bloor street, safe walkable area at night, clean rooms, friendly staff... and cheap, cheap, cheap!  Breakfast was simple, but certainly edible in a sweet breakfast room that was tastefully decorated.Not quite a B&B, but definitely not a hotel, Castlegate reminded me of the pensiones of italy... cute and reasonably priced.(btw, if you get a chance, try the raw food bar down the street - I think it was called \"LIVE\" - very tasty)",
      "rate": 4.0,
      "tripDate": " October 2005"
    },
    {
      "title": "A good find...",
      "text": "3/5 stars... (people are very polar on here, they either do a 1 or a 5... don't take my 3 as not liking it...).We found the Castlegate Inn in a real pinch, when we were looking for the cheapest room possible.  (On our drive in to Toronto, we ran over a car hood that pierced our gas tank...  We had to stay an extra 2 nights, so we were on quite a budget).  This was the cheapest place we could find, in an area that seemed reasonably close and had good transportation. It turned out to be a pretty good find.  The place, at the time, seemed brand new.  Their rates don't seem to have gone up any, since As far as this being a \"bed and breakfast\" ... I would say its somewhere in the middle of being a bed and breakfast and a hotel.  If you're looking for a cozy house where everyone shares a common space, but you have a room, this is not the place.  If you're looking for a place that has hallways with room numbers, and no real common space, this is it.  In the morning, there is a breakfast room.  Also, many (if not all?) of the rooms have nice private balconies.The area is more residential than anything.  There aren't any good places to eat nearby.  My travel partner and I decided we would spend a night in, and eat dinner on the balcony.  The only problem was, there was no good place to get food from in the area.  We walked at least a mile in several directions looking for a grocery store that had some sort of food we could get without much preparation.  We failed on that count.  We did find an LCBO for wine.  Then, we went into a bar that served food--the only place in our trek that we could find.  The place was a little sketchy, but we thought it might be one of those places that looks sketchy but has good food.  We got take-out, ate it at the B&B.. The meat seemed tainted, so we didn't even finish it.  We still talk about how gross that food was to this day.On the good side, the B&B itself was clean (at least for us)... The area is quiet.   The people were nice.  There was a refridgerator and microwave in room.  There is a subway station a block away.  A major tourist attraction (Casa Loma) is 3 blocks north. And most importantly, the price was right.",
      "rate": 3.0,
      "tripDate": " July 2004"
    },
    {
      "title": "Typical B&B,Good Location,Good Price",
      "text": "I stayed at the catlegate for three nights while in Toronto.  My most important requirement was (1) Price and (2) Location and Castlegate met both these demands.  I called them and got a rate as online they appeared to be booked.  Paid $68CAD ~ $55USD which I could not find anywhere downtown for that price.  Be warned though that it took us more than 1 hour to find it by car, even though my friend was from Toronto and we were on Spadina.  Spadina is weird, there is a RD and Ave and at one point the numbers 0 out and start again.  As well the numbers on one side of the street have no corolation with the other side ... Ya hard to find, don't ask your friends to meet you there, I would go one block down to Bloor and Spadina and meet everyone.  THE ROOMThe room was cozy, homy feeling, very very clean, nice smell (not hotel and cleaner smell which I hate.  The bathroom was very nice, showe stall, full length mirror, nice big closet, tv w/ a lot of channels, nice desk, comfy bed, with convenient fridge and microwave.  From these reviews I guess maybe I lucked out and got the good room, I was very pleased.  Your room is actually in a different building from the lobby, you have two keys to open front door and your door.  Be warned that the lobby have 4 stairs DOWN, if you have luggage its hell then you walk back up those 4 steps w/ your luggage and go to the your building (4/5 townhomes S) and then walk up 5/6 more steps w/your luggage to get to your room.  Was it just me or was that a pain? :)THE PLACEThe place was very nicely redone.  The outside and inside.  The guy that is there on weekdays although seemingly nice is kinda creepy but the lady on the weekend is so kind!  Breakfast was kewl but TO being coffee house central with three on every block, I guess maybe you don't need it.  I would get breakfast one block down at Bloor at CoffeeTime for $1.17 CAD not US ... I loved it.  I got breakfast there one day but the other two I didn't feel like getting up early, wearing my coat, heading to the other building for breakfast.  The guy there seemed to have me on watch as they are very ademant you only take one of each ... I didn't like this!  They are flexable though if you need to borrow stuff they have irons etc.  The check out, as all checkout time, was inconvenient for me as my flight out of TO was 5pm, so at noon I just placed my luggage in their lobby, again the lady there was beyond sweet.  I came back to get it and found the entire lobby full of luggage, guess everyone caught on :)LOCATIONI loved the location, I didn't need a cab or TTC or subway at all.  One day only I bought a day pass but that was b/c I was travelling to Scarborough which was 45 min away.  Otherwise everything was on foot.  Things close by include:  Subway and bu stations, 3 within 1 mile from there, coffee shops, places to eat, drug stores and generally everything you need.  Attractions by foot include:  Chinatown (so close) Casa Loma (you see from the hotel), U of T, The Annex, Shopping District (Bloor), Eaton Center ... well everything except if you want to go down to harbor front you need to take the subway but thats cause its so South.  I loved this location!  I got to see everything because I walked everywhere.  The area was safe, I never felt uneasy even though I was on my own and walked two block down to Bloor at least 4 times a day.All in all - depending what you are looking for in a hotel - this was a good place!",
      "rate": 4.0,
      "tripDate": null
    },
    {
      "title": "disgusting, smelly, and unfriendly",
      "text": "this hotel is not a bed and breakfast, it is a coverted house with a musty painted aluminum breakfast room in the basement.  maid service costs $20 extra per day and parking is unattended down the street.  the bathrooms were not actually cleaned, just sprayed with bleach.we checked in, saw the room, and promptly checked out.  the front desk would not refund us despite the time being 12noon.i am reporting them to AAA who actually recommended this dump to us.",
      "rate": 1.0,
      "tripDate": " September 2005"
    },
    {
      "title": "What a Dump!",
      "text": "My husband and I have been to many hostels and B&Bs in Europe and Canada and have NEVER stayed in a place as dirty or as poorly managed as the Castlegate Inn in Toronto. Our room was a fair size but it was filthy. We couldn't use the shower because it was missing tiles on the floor of the shower, there was no shower head and there was so much mildew and mold growing in there, it was a health issue.The closet doors were broken and the \"fridge\" and \"microwave\" were so revoltingly dirty, you would never put food in them. There was a huge stain on the bed spread, and the ceiling fan had at least an inch of black dust on it. We had problems with the parking. We drive an SUV, and were told to pull it around to the back of the building. To get there, we had to drive it down the most narrow alley you can imagine. I asked for a spot in a different location. There were only 2 spots out front. We were assigned one. When we got back after a long day away, both spots were taken. We went to the front desk to ask what was going on. The one car was a paying customer and the other was the hotel maid who parks there because she doesn't like parking in the back (she drives a small car by the way). We were told that we could park on the street until she was done her shift- AT OUR OWN EXPENSE! We refused and the front desk clerk went to try to find the maid. Half an hour later, the clerk came back and told us that the maid was going to move her car now. We waited in the car for another 15 minutes for the car to be moved. I wouldn't have my worst enemy stay here. What a dive!!!! We tried to get our money back and they told us NO!!!! This was partly our fault because they had us pay up front which we should have never agreed to do. DO NOT STAY HERE!!!!!",
      "rate": 1.0,
      "tripDate": " August 2005"
    },
    {
      "title": "More than what you paid for :)",
      "text": "I stayed at Castlegate Inn while in Toronto for a conference.  My needs were simple; a quiet place to stay, a clean, comfortable room and easy access to the city.  As it was so reasonably priced, I expected little else.  But I found the staff (Amy and Lolita) to be kind and helpful, going out of their way to meet my needs, the establishment very clean and tastefully decorated, and the proximity to the subway line was absolutely marvelous!  The room even had a fridge and microwave, so I had the option of making or bringing food into my room.  On my last day in Toronto, I had a few free hours to look around.  A big tourist attraction, Casa Loma, was right down the street, and the staff advised me to take a short walk down to the Bloor area and the University of Toronto campus -- good advise.Thanks to everyone at Castlegate Inn.  Should I return to Toronto, I would definitely stay there again.",
      "rate": 5.0,
      "tripDate": " December 2005"
    },
    {
      "title": "very poor experience at Castlegate",
      "text": "One of the worst places to stay, even on a budget. Had to park several blocks away, the room condition was terrible. It looked as if it was not finished. The tile in the bathroom was not all there. The breakfast did not have all the items promised. The only redeeming factor is close location to subway.  I would spend more and stay closer to downtown. Cheap it is and cheap is what you get.",
      "rate": 1.0,
      "tripDate": " June 2005"
    },
    {
      "title": "A Home Away From Home",
      "text": "The flight from Ottawa to Toronto is only take one hour, but that day, I had to got up very early in the morning after two weeks of meetings. There was a long line up at the check-in counter and security check point. Arriving in Toronto, I had to wait for about thirty minutes before I could collect my lugage. Sitting in the taxi on a long trip to downtwon, it seemed like a longest day ever in my life. But all of those unpleasant situations was washed out when I arrived at this nice B&B which has great location in town. A place that is very close to Dupont subway station which means an easy acess to travel around the city. The hotel looks so neat and clean. The staff at the front desk is very helpful, efficient. When you are tired from your trip, there is nothing in the world you would like to see but the big and sincere smile of the staff at this B&B! The room I stayed was quite small but clean and neat. It has a small television with cable, fridge, microwave and alarm clock, although until the end of my stay, I could not make it works :-(.As an Indonesian, I am not used to have muffins for breakfast, so I go to a convenience store on Dupont street, about three houses to the north, for my breakfast supply during my stay. Again, the location of this B&B is a winning one.I, for sure, will stay in this place everytime I come to visit my friends in Toronto.",
      "rate": 5.0,
      "tripDate": " April 2006"
    },
    {
      "title": "Note to fellow travellers: This place is GREAT!",
      "text": "Note to fellow travellers: This place is GREAT!The service and the location are just what I needed! I highly recommend it. Thanks to Mike at the Front Desk for making me comfortable. I'll be back!",
      "rate": 5.0,
      "tripDate": null
    },
    {
      "title": "Castlegate Inn",
      "text": "I really enjoyed my stay there.  The Inn consists of three beautiful victorian looking houses on Spadina Rd, which are all very close to the Subway station and convenience stores.  Each room has a private bathroom, a mini Fridge, a microwave and a TV. The building is very quite and is well kept.  It is great value for $75CAD.  The staffs are also very friendly and very helpful, which is always a bonus.",
      "rate": 3.0,
      "tripDate": " August 2006"
    },
    {
      "title": "Just perfect",
      "text": "I found The Castlegate Inn while searching for B&B’s in Toronto located near the Casa Loma. My cousin was getting married at the castle, and I needed to find a nice but cheap place for my family including my husband and two sons. I was quite busy with work, and never had the time to call for reservations. I somehow managed to make all the arrangements with the inn by e-mail and fax.The inn responded quickly with detailed answers to all my questions. I was a little hesitant to provide my credit details by e-mail, so the clerk suggested I fax my details instead. Our room suited us perfectly. It had a little fridge that came in handy for all our snacks and supplies, and had a pullout sofa with extra pillows and blankets for the kids. It was just perfect. I was quite exhausted from our trip, so while sleeping in, my husband snuck down to the breakfast room, and was kind enough to bring some tea, croissants and muffins back to the room for me to enjoy a light breakfast in bed! We really enjoyed our stay at Castlegate Inn.",
      "rate": 5.0,
      "tripDate": " October 2006"
    },
    {
      "title": "What a disappointment!",
      "text": "The reception office and the house that contained it (219 Spadina) seemed quite nice. However, we stayed at 203 Spadina - one of the other houses - in much need of renovation.  We were a party of 3 couples and were given the three rooms on the third floor.  The stairs were daunting and there was not notice made of that when we registered.  The rooms were not air conditioned and the window frames were falling apart. There were no screens and to get air circulation we had to open all the doors and the fire escape door and hope for a breeze.  Thankfully this was May and not July - or it would have been unbearable to stay.The furniture was worn and shabby with large chunks of the surface missing on the night table.  There was no place to hang anything. The bathroom was straight out of the 40s with a gaping hole (at least 3/4 of an inch wide and a foot long.)in the wall at the edge of the bathtub.  The bathtub was badly chipped.  But at least this bathtub was full height to the ceiling - the other room had a sloped ceiling over the tub. The smoke detector was missing a battery and only one of the rooms had a reading light.There was no place to set a suitcase, except on the floor and floorspace was at a premium as the room was extremely small.  The window had to be proped up with a stick.  The carpet was worn, crinkled and generally shabby and in need of replacememt.The receptionist was accommodating and helpful and managed to find us a battery for the smoke detector and the breakfast was acceptable.This would be a good place for a starving student but for what you got, it was very much overpriced. I think that even at $50 for the double it would be overpriced. We paid almost double that.On a scale of one to ten, it might be a three (if you were in particularly good shape ). Incidentally, some of the stairs were irregular and had inconsistant rises.This would be an embarassment to the tourist industry in Toronto. ..a very poor advertisment for the hospitality industry.",
      "rate": 1.0,
      "tripDate": " May 2006"
    },
    {
      "title": "Okay",
      "text": "I've chosen the Castlegate Inn because of the price. I am rather accomodated in B&Bs, because they're normally much cheaper than hotels (in Canada). I do not need daily maid service, as long as it's clean when firstly entered. Castlegate's rooms are seperated in smaller townhouses, which suffer on deficits old houses might have. I couldn't open my window, and the bathroom appears old but functional with a bath tube, small sink and mirror. Bed was comfortable, and there was a TV set offering more than 70 channels. Additionally the room featured a fridge and a microwave, which may be helpful for self-catering. Breakfast was disappointing because it was limited in regard of choice and amount. You were only allowed to one croissant, apple, orange juice and coffee. Location is northwestern of downtown and very close to a subway stop (Dupont).",
      "rate": 3.0,
      "tripDate": null
    },
    {
      "title": "Pleasantly wonderful place to stay",
      "text": "Castlegate Inn offers an affordable place to stay in Toronto. Its closeness to Casa Loma is cool. (Though Casa Loma wasn't what I expected.) Next time I visit T.O. I'm sure I'll stay at the Castlegate.",
      "rate": 5.0,
      "tripDate": null
    },
    {
      "title": "Good value in Downtown Toronto",
      "text": "Castle Gate Inn offers very good value.  This inexpensive downtown Bread and Breakfast is conveniently located for walking to many Toronto tourist spots, restaurants and neighborhoods.  The accommodation is basic and similar in small European B&Bs.  The staff are extremely helpful, the subway is next door and there is free parking in the winter which greatly reduces the cost.  The basic room is small but has ensuite bathroom, frig and microwave.  If you book a slightly upgraded room they are a little larger with more decor.  We have booked this spot several times in 2006 because of its location and it suits our budget.  The continental breakfast helps get your day started without searching for a restaurant.",
      "rate": 4.0,
      "tripDate": " November 2006"
    },
    {
      "title": "What you pay is what you get",
      "text": "The Castlegate Inn is cheap.  I paid $58.99 per night in April 2006.  It's centrally located in the Annex neighbourhood and is near the subway.  I would compare it to a youth hostel.  For my money, I got a small, oddly shaped room with TV, alarm clock, fridge and microwave.  There was no air-conditioning.  The ensuite bathroom appeared to have been built in what used to be a closet; it was about 2 feet deep and 8 feet wide.  Any large guests would have trouble squeezing past the sink to the toilet or shower stall (no bathtub).  The floor of the room sloped badly, the bathroom plumbing wasn't properly attached to the wall, the soundproofing between rooms was poor and I noticed ants in the bathroom.  However, it was reasonably clean.All in all, expect to be staying in an old house in need of much renovation that has been converted to hotel rooms.  Don't expect the Ritz or the Hilton.  For under $60 a night, I prefer it to the Canadiana youth hostel in Toronto where I've stayed before.",
      "rate": 3.0,
      "tripDate": " April 2006"
    },
    {
      "title": "A little Europe in Toronto!",
      "text": "Found Castlegate Inn by accident! ( friend of a friend). Little place just perfect! Reminded me of Europe. Loved the whole thing!",
      "rate": 4.0,
      "tripDate": null
    },
    {
      "title": "Customer Service does not make up for terrible room",
      "text": "We booked a room at the Castlegate Inn and were placed in Building #203 Room 3. It looked nothing like what you see online and was at best substandard. The bathroom although clean, needs a renovation very badly. It looked as if a 10 year old had patched the walls and the door was damaged. There was no screen in the one window, no place to hang clothes, cramped space for two people. As far as breakfast goes, forget it unless you are one of the first there and can get a seat. It has very limited seating and is very cramped. That takes place in Building #219.  So you have to leave to go even get your breakfast even if you wanted to take it back to your room, but then there was not much space to eat there unless you like eating in bed. Parking? Now that is a joke if you drive anything larger than a Dodge Neon, passage between the two buildings to get to the rear parking area was like threading a needle and definitely needed a steady hand. An extra $20/day for maid service makes this place even less desirable, if that were possible. So if you plan on going for more than a night or two, you need to realize there will be no maid service. Not all was bad, it is very close to Dupont subway station and customer service was exceptional but you have to wonder why this potential for a good B&B is not renovated and made more habitable? But that is for them to decide. I would not recommend this place to anyone and hope enough people start to avoid this place until it is updated and upgraded.",
      "rate": 1.0,
      "tripDate": " September 2006"
    },
    {
      "title": "Not good",
      "text": "We had booked into this hotel for 4 nights, but left after two even though we had to pay for the other 2 nights - that's how bad it was!  The ceiling in the bathroom was so low, you could hardly stand up in it (and I'm not a tall person!).    The bed was old and creaky and the stairs up to the room were very narrow and not good for bringing suitcases up to.  The breakfast room was very cramped and we had to ask for food as there was none left when we arrived for breakfast.",
      "rate": 1.0,
      "tripDate": " August 2006"
    },
    {
      "title": "A great disappointment",
      "text": "My wife  and I are seasoned travellers and have very basic and reasonable expectations in regards to cleanliness and security.  We arrived in Toronton on an evening flight and went directly to the Inn.  The front desk was closed. We found the key to our bedroom in an enveloppe which had been glued to the front door, with the door number on it.  We then had to find our room which was not even in the same building as the front desk.  With our luggages, we had climb up a good flight of stairs.  The front door of our room appeared to be made out of a cheap plywood.  It wasn't even a real door.  Once we found the light switches to the bedroom, my wife was despondent.  The room looked as if was some kind of storage room for outdated furniture.  We had no choice but to make do with the situation given that it was late.The next morning, we found another place, that was cleaner and safer in a much better location for the same price.",
      "rate": 1.0,
      "tripDate": null
    },
    {
      "title": "Great location - average accomodations",
      "text": "The good things about Castlegate Inn:Location. Right in the heart of the Annex neighborhood and steps away from the TTC/subway systemNeighborhood, I. You're within easy walking/driving/biking distance to many restaurants and bars, not to mention Casa Loma!Neighborhood, II. Mind you, this is very close to the University of Toronto, so it's pretty unfair to expect some lavish digs when you're neighbors with a bunch of college kids. It's a vibrant, lively and safe neighborhood you can walk though at all times of the day (or night.)Staff. They were good to us when we've been there. .The not so good things about Castlegate Inn:The breakfast. Don't bother. There's a 24-hour store (Rabba's) to the right on Dupont, and a nice little grocery store further down the street. Pick up some basic staples and keep it in your room.The \"This Old House\"-vibe. Castlegate Inn is comprised of three converted Victorians. This is an older, non-gentrified part of town, so yes, unfortunately you might spot the occasional mouse. Don't leave open food containers around...same as you'd do at home, right? Overall...you get what you pay for, but you get a real feeling of community. It's inexpensive lodging in the middle of a cool, college part of town and convenient with it's proximity to the subway.  My husband and I have been to Toronto multiple times and have stayed here on all but one trip - our first time to the city. We'll be back this summer and we have reseravations at Castlegate Inn.If you're looking for inexpensive rates, go to the hostel. If you want flashy, go to a nice hotel in Yorkville, or get a nice room near Pearson Airport. This is a decent place to experience Toronto!",
      "rate": 3.0,
      "tripDate": " August 2004"
    },
    {
      "title": "Castlegate became my Second Home!",
      "text": "During my recent two week visit to Toronto I enjoyed staying at the Castlegate Inn Bed and Breakfast (219 Spadina Road). My room was super clean. And despite my twin-bed and room being small (I booked a single), I was still comfortable. Since this was my forth trip to Ontario, it seems to me that the standard for a B&B, is small sleeping quarters with rather firm mattresses. Not cool for me.But to compensate for a tiny room and bed, I enjoyed having a full washroom with a huge tub. Very cool!  I also enjoyed the sunny private front porch where I sat to read or write during the day.A few things you should know about Castlegate that are on the negative side. One, the breakfast is not included in the rate. You must pay an extra $3 a day. In my opinion, it’s not worth it. They only had a weak variety of fruit and pastries with coffee or tea. You can get pancakes/biscuit, sausage/bacon, and orange juice/coffee for $3 at McDonald’s or Burger King, which is walking distance from the B&B. Or, you can do like I did. Since I was staying for 14-days, I went to the local grocery store, and stocked up. As far as room decor, I wasn't impressed. It is rather boring and lacks color, but I always bring my own things from home if I'm traveling for long periods of time (see pics). If you like a big screen TV, sorry, the one in my room was a mere 13-inches, but the sattlelight cable was a plus. The best qualities about my room was the mini-fridge (which was rather large…awesome!) and large microwave (...more awesome!). Plus, as mentioned, the full washroom was wonderful.Another down side of the Castlegate, is the temperature. July was very hot and humid in T.O. Fortunately, I had a room with AC. Some rooms do not. Yikes! I would have baked! Be sure to request a room with AC if you are traveling in the summer months. Lastly, on the negative side, there are no elevators, and if you stay on the third floor like I did, you’ll have to haul your luggage up 3 flights of stairs. Better do your push-ups!If you bring your lap top, their highspeed internet service is superb. It cost $5 a day or $25 a week. This rate is much cheaper than the local cyber-cafes.The two best aspects of the Castlegate Inn are the cleanliness of the entire facility and the front desk staff. They were professional and courteous every day. Specifically, the front desk manager, Michael. He is outstanding. He became my tourism guide and was kind and helpful when I needed directions. I had no problems checking in or out. He helped me better understand Toronto’s subway system. Plus he was efficient, thorough, and super friendly. Hospitality is one of my top priorities when traveling. There is nothing worse than staying at a so-called five-star hotel or B&B, paying top dollar, only to be treated rudely by the staff. I stayed at another B&B last summer and their rates were twice the rate of Castlegate Inn. They served a full breakfast, yet you had no private washroom or telephone! And it was light years away from downtown (Islington House B&B in Humbervalley). So, overall, if I had to grade Castlegate Inn, I would give them an A for awesome!",
      "rate": 4.0,
      "tripDate": null
    },
    {
      "title": "good marks",
      "text": "I would definitley agree with the frequent stay couple. I travel to Toronto alot on business and I need a small place where I am more than a number, this place is it . I have used the Inn for aprox. 2years they have given me a good frequent stay rate. Since I usually only have a coffe and muffin for breakfast it works for me. \"Tip\" to others I always request a room in 219 - if I can get one. Location is great and when my wife joins she feels safe in the area. The rooms are pretty good size wise and clean - the beds have all been comfy. Good cheap eats on Bloor street about 10 minute walk south, I can't say I have tried all the places but they are priced towards the student crowd so thats a plus, and I have yet to be truly disappointed. I am still truly amazed at the selection of places to eat in Toronto its as if no one ever eats at home !",
      "rate": 5.0,
      "tripDate": " March 2006"
    },
    {
      "title": "A great stay!",
      "text": "We stayed at Castlegate Inn on our latest visit to Toronto.  We had a wonderful time.  The room was clean, the bed was comfortable, and best of all, the price was superb.  The office and housekeeping staff were very friendly.  They always remembered our names, and were always eager to assist us when we had a question; something I have never experienced at any other hotel.Their continental breakfast was simple, consisting of butter croissants, large muffins, and a nice brew of coffee from Timothy’s.  The staff frequently replenished the buffet, and made fresh coffee, as some of the guests took extra items to-go.The inn is quite conveniently located next to Dupont subway station.  We prefer driving, but came to realize that transit in downtown Toronto is the way to go.  It was wonderful to walk just a few steps to the station, and moments later, be at the CN Tower, and all the attractions, and not have to worry and pay for parking! All-in-all, this was a great stay, and a bargain compared to the hotels we have stayed at previously.  Mind you, this is not the Four Seasons; but the service was superb.Thank you Castlegate.  We hope to see you before the New Year!",
      "rate": 5.0,
      "tripDate": " September 2006"
    },
    {
      "title": "Really top notch service",
      "text": "I can only rate the service as I had to cancel trip due to family illness just before I was due to stay there. However in making the booking and helping me with some paper work subsequent to my cancellation the staff there were very professional, helpful and friendly.",
      "rate": 5.0,
      "tripDate": " March 2003"
    },
    {
      "title": "Cheap, basic, perfect.",
      "text": "The people who denigrate this place are expecting the moon for under $100.    Get real!  This is Toronto, and accomodation here is EXPENSIVE.  Castlegate keeps the prices low by basically not having a front desk.This place is a bargain and it is less than a block from a subway entrance.  Thumbs up by my yardstick, but whiners please go down the street to The Four Seasons where they're used to pandering to your temper tantrums.",
      "rate": 4.0,
      "tripDate": " April 2005"
    },
    {
      "title": "Great Location, Great Bargain!",
      "text": "Castlegate Inn is a terrific find--located in the lovely and charming Annex neighborhood of Toronto, its price can't be beat, particularly considering its convenient proximity to the University of Toronto and many tourist attractions (Casa Loma Inn, Bata Shoe Museum, etc.)Staying at the Inn (which I think is actually three or four Victorian-style houses converted within into apartment-type units, all along Spadina Road) is actually more akin to living in an apartment than staying in a \"traditional\" hotel.  My room was generously sized and clean, with private bathroom, cable TV and telephone.   (My only complaint:  no reading light next to the bed).The room also contained a mini-kitchen containing a sink, microwave, coffee maker and dishes; there are a couple of grocery stores within walking distance, which easily made up for any lack of room service or on-premises restaurants (and helped save money).The subway is within easy walking distance, which is great.And the staff couldn't have been nicer, friendlier or more helpful.  I enjoyed my stay immensely and would definitely visit again.",
      "rate": 4.0,
      "tripDate": null
    },
    {
      "title": "Good place to stay",
      "text": "Was cheap and in toronto there aint many places cheaper let me tell you. Found it to be clean and basic. Staff were very helpful. seen some bad reviews and was a bit wary when going but found it to be fine and would stay there again. I have given it a 4 rating because it did exactly what it advertises and also the subway to down town it about 20 steps away.",
      "rate": 4.0,
      "tripDate": " September 2006"
    },
    {
      "title": "Cute and Sensible",
      "text": "We stayed at the house on 219 Spadina and felt it was excellent.  Off street parking available and helpful staff.  Our room had a nice balcony so you could sit out and enjoy the view and quiet neighborhood.  The rooms were clean with a fridge, tv and microwave.  One of the better Bed and Breakfast's I have stayed at by far.  This will be my premiere lodging for Toronto events for many reasons.The house was literally minutes from the very clean and efficient subway system.  Tons of local shops and restaurants within walking distance.  You can leave your room and go each direction and experience Toronto on so many different positive levels.  We stayed a week and there was still not enough time to see it all!",
      "rate": 5.0,
      "tripDate": " July 2006"
    },
    {
      "title": "Excellent!",
      "text": "My girlfriend and I stayed at this establishment for two weeks at the end of August 2004. The room was cosy, warm and very clean. The staff were very friendly and helpful. The location was perfect as the Dupont metro line was seconds walk away, giving you access to all the best sights (such as the CN Tower, and the Eaton Centre for you shopaholics)! We both feel that Castlegate Inn is excellent value for money and would definately stay there again! However, the only slight downside was noise coming from the main road early in the morning.",
      "rate": 5.0,
      "tripDate": " August 2004"
    }
  ]
}