{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Chelsea Hotel Toronto",
    "url": "/Hotel_Review-g155019-d183778-Reviews-Chelsea_Hotel_Toronto-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.5",
      "reviewCount": 9360
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "33 Gerrard Street W",
      "addressLocality": "Toronto",
      "postalCode": "M5G 1Z4",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2c/21/86/9c/chelsea-exterior.jpg?w=500&h=-1&s=1"
  },
  "description": "The Chelsea Hotel, Toronto provides comfort in the heart of downtown Toronto and guests are within walking distance of prime retail districts, colourful local neighbourhoods and major tourist attractions. As Canada’s largest hotel with 1,590 rooms, guestrooms are complimented with complimentary basic Wi-Fi and most rooms feature balconies, offering stunning views of the downtown core. The Chelsea Hotel, Toronto offers 3 in-house dining options. Relax in the lobby bar— Elm Street Bar & Lounge. Enjoy breakfast, lunch and dinner on the seasonal patio with Market Garden. While express|o coffee and wine bar is the solution for an afternoon treat. Relax and rejuvenate on Deck 27. This perfect adult-only urban retreat includes Exert fitness centre, an indoor heated swimming pool and a seasonal sundeck. The Family Fun Zone, located on the 2nd floor, includes a family pool featuring the 130-ft indoor “Corkscrew” waterslide, Kid Centre with resident bunnies and Club 33 teen lounge.",
  "featues": [
    "Paid private parking on-site",
    "Free High Speed Internet (WiFi)",
    "Pool",
    "Fitness Center with Gym / Workout Room",
    "Bar / lounge",
    "Game room",
    "Patio",
    "Indoor play area for children",
    "Parking garage",
    "Wifi",
    "Pool / beach towels",
    "Adult pool",
    "Indoor pool",
    "Heated pool",
    "Fitness / spa locker rooms",
    "Sauna",
    "Restaurant",
    "Breakfast available",
    "Breakfast buffet",
    "Outdoor dining area",
    "Waterslide",
    "Children Activities (Kid / Family Friendly)",
    "Kids pool",
    "Highchairs available",
    "Pets Allowed ( Dog / Pet Friendly )",
    "Taxi service",
    "Conference facilities",
    "Banquet room",
    "Meeting rooms",
    "Rooftop terrace",
    "24-hour security",
    "Baggage storage",
    "Concierge",
    "Convenience store",
    "Currency exchange",
    "Non-smoking hotel",
    "Sun deck",
    "ATM on site",
    "Doorperson",
    "Umbrella",
    "24-hour check-in",
    "24-hour front desk",
    "Dry cleaning",
    "Laundry service",
    "Ironing service",
    "Blackout curtains",
    "Air conditioning",
    "Desk",
    "Housekeeping",
    "Private balcony",
    "Cable / satellite TV",
    "Flatscreen TV",
    "Bath / shower",
    "Safe",
    "Telephone",
    "Iron",
    "Wake-up service / alarm clock",
    "Complimentary toiletries",
    "Hair dryer",
    "City view",
    "Non-smoking rooms",
    "Suites",
    "Family rooms"
  ],
  "reviews": [
    {
      "title": "One of the most Expensive, and no bang for your buck",
      "text": "It's unfortunate that this place has many people over a barrel and they won't even buy them breakfast before doing it. This Hotel is very close to alot of the amenities that someone would need on their visit to Toronto. Most people come here because they offer a medical rate. the Eaton's center is within walking distance, same as st. Michael's hospital, food and just about anything you would need for a visit at your fingertips. My friend had a pre-op appointment, about a week before she was going for surgery and we stayed here. At first she reserved a deluxe room, 2 beds, needs a fridge for her meds. When we got here, after driving 8 hours just to get here. We were apparently booked for 1 queen bed. No fridge in our room, according to the front desk staff the 1500 room hotel does not have a fridge for every room? we were finally put into a room with 2 beds, again no fridge, instant coffee, INSTANT COFFEE and no coffee pot, just a small kettle. If you ask me, You are being charged for everything! you pay for parking, you pay for breakfast, and the prices are outrageous, talk about taking advantage of the people who had no choice but to come this far for help. Upon check in we were told that we would be on the waiting list for a fridge. We went the entire 3 day 2 night stay without a fridge The rooms were clean, but the first room was drafty and we could not get it to warm up. The bathroom was small and we had the kettle only. after going to the front desk the next day, we got a deluxe room, which is what was paid for, and it was nicer, but the wallpaper was peeling off the walls and these rooms all need updating. I did not try any of the food at the hotel, we shopped and ate out. the concierge staff is very helpful.",
      "rate": 3.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Staff, location were great, the room not so much, pool locker room felt unsafe",
      "text": "I have mixed feelings about the Chelsea. The location was great for me, very close to the hospital that I was going to. There is a little, College Park, with a kiddie area, across the street from the Gerrard entrance that you can cross to get to Dollarama, Farm Boy, reasonably priced groceries. There was a McDonald's right outside the Walton St exit on Yonge but you can't get back in through the same doors, still pretty convenient. There's a Tim Horton's, Shopper's at Gerrard and Bay and a Fresh City, if you don't mind spending a premium price, for specialty food-organic, vegan etc. practically attached to the hotel. I'm still working out the underground PATH system (which I love) and there's access near the Red Lobster at Bay and Edward nearby. The Eaton Ctr is just past that.I was disappointed entering my 'Deluxe' room with extra square footage, (appreciated), and balcony on a quieter side of the hotel. The carpet was buckled (tripping hazard), the handles of the bathroom faucet leaked all over the vanity (wrapped towels around), noisy ceiling fan, ?burn? hole in curtains, room was a bit smelly(former smoking room?).They offered to change rooms but I was too tired. They removed the 'deluxe' fee though from one of the nights. There is a thermostat dial on the wall that isn't connected to anything. I thought it was broken but Front Desk said the hotel is centrally heated/cooled so no temperature control in the rooms. It was warm and humid and I prefer a cool room to sleep, I slept with just a sheet. The bed was comfortable for me but my friend didn't think so. The staff were very polite and accommodating with: providing a fridge, extra pillows, a blanket (instead of the comforter but still too warm), extra body products which are nice, natural products that did not aggravate my fragrance and skin sensitivities. Even after housekeeping hours they had security bring up extra pillows.I'm concerned about not knowing whether I could get a fridge until arrival because I travel with food due to dietary restrictions and no microwave access unless you get a suite.Parking fees were reasonable for downtown Toronto but were waived at the time of my stay.There is self-serve laundry in the locker rooms by the pool but there were men coming out of the ladies locker room (doors unsecured) during pool hours, really creepy. I wouldn't personally use it, or let kids go down there, alone.",
      "rate": 3.0,
      "tripDate": " September 2021"
    },
    {
      "title": "A nice hotel for a quick city explore!",
      "text": "We stayed at the hotel for 2 nights and found it very comfortable. The hotel is absolutely huge, and very busy! The lobby was enormous and it took a while to get our bearings with the different coloured lifts. The parking was $38 a day and the car park was very busy, we did eventually find a space. Check in took a while as it was so busy but the staff are friendly and polite. There are 26 floors, and a pool on Deck 27 with a gym. The pool was clean but the water was cold. The room was nice but a bit dated. The shower was tricky to work, pull the tap away from the wall hard to make it work. The grouting in the shower was dirty and red, and the sealant was a bit black and mouldy in places. There was also a sharp bit of the carpet by the door. The room has a fridge, kettle, hairdryer and USB charging points in the bedside lamps. Very good location for exploring the city. A nice hotel for a quick stay!",
      "rate": 4.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Best Child Friendly Hotel in Toronto",
      "text": "Took our 2 Grandchildren for March Break Chelsea had so many Activities in house for Children they had so much fun. Market Garden had food specials for Children was very affordable and excellent value for price and Grandchildren actually ate their meals. 2nd Floor Kid Zone is awesome!",
      "rate": 5.0,
      "tripDate": " March 2024"
    },
    {
      "title": "Amazing ",
      "text": "Stayed here for 6 nights in December and had the most amazing first time in Toronto with my boyfriend. We was celebrating our 4th anniversary which we let the hotel know before, on arrival we did not have to wait long to check in (never really seen the check in queue that busy either as there was always 2/3 staff on at one time), on arrival we instantly felt welcomed. The receptionist wished us congratulations which was lovely and had told us they had upgraded our room (I did originally request a balcony room). We stayed on the 22nd floor. The room was lovely and spacious and like we requested the balcony shown a great view of Toronto. We also had a fruit delivery from the staff which was deeply appreciated For first time visitors in Toronto, the Chelsea did an amazing job. It’s central location helped as we was literally a few minutes walk from prime locations. We stayed room only which was no issue as the hotel has so many food places near. Starbucks, pizza places, takeaways, Toronto is a top location for different types of cuisine, anything you want is there.The staff we found was so helpful, they couldn’t have done enough for you, the Christmas decorations made it seem so much more Christmassy and even Santa was in the lobby! Rooms were cleaned daily. A few days after check in I had a email asking how our stay was going and we only had 2 issues: a lift in our room would have been convince the and the hotel does seem to have a bit of a problem with their lift system (only problem we found), where you can end up waiting about  minutes for the lift to go up to come back down. A few hours later I checked my email to find the manager had emailed me apologising for both issues, and they had put a fridge in our room! It really was such a lovely thing to do and it really did go a long way. Downstairs there was a restaurant and coffee shop, we didn’t even get time to go here but the prices of food did look quite pricey to what we was spending elsewhere. There’s a shop downstairs also in case you forgot anything.We didn’t get round to going to the swimming pool or use the facilities in the hotel, but if we returned we would 100% use them. On check out we had a late flight and was welcome to leave our bags in their secure bag system The Chelsea hotel is a popular hotel for booking trips, we booked Niagara Falls trip (through get your guide) and we was picked up from outside the hotelMe and my boyfriend had the most amazing time in Toronto and I think the Chelsea hotel was the most magical, Christmassy place. It actually makes my heart hurt when I think about how much I want to go back, I fully understand how people want to move to Canada. The hotel made us want to return back to our room after a long day of exploring. I would recommend this hotel to anyone wanting to see Toronto, the hotel, staff and people of this city make it an experience you will never forget",
      "rate": 5.0,
      "tripDate": " December 2019"
    },
    {
      "title": "Not worth the money",
      "text": "I suppose this hotel doesn't really feel like they need to put an effort into this building because of the location and, of course, they'll be busy no matter what but this place is outdated and run down for the money you are expected to pay.There's no mini fridge in the room, the walls, floor, drapes, and bathroom tiles were stained and dirty looking. The beds are double rather than queen with only 2 small pillows. When a family of four books a room, why are there only 3 towels provided? Inconvenient to have to call down for more. The walls were thin, I could hear the shower from another room like it was in ours. Speaking of the shower, the tub handle almost fell off when we turned the water on. Also, don't advertise a kids pool and waterslide and not have it open. Sure, it's a great location and you're clearly making a lot of money here, invest some of it back into the building- there's no excuse for the state it's in especially since you're being charged a surcharge for the location. I will find somewhere else to stay next time I'm in town.",
      "rate": 2.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Couldn't wait to get home and shower",
      "text": "I'm not usually one to complain but they emailed me and asked so here goes. My only real expectation was that the room was clean and everything worked properly. The only reason we stayed there was because my son had an appointment at sick kids for 9am and their was a nasty snow storm coming in. For the price and location we were seriously disappointed. Took us a half hour to get booked into our already reserved room at 11.30 at night due to short staff. Tub stop in the bath tub didn't work. Low water pressure in the shower. Bath tub had chips out of it that looks like someone has smeared silicone over. Shower head fell apart while attempting to adjust the water pressure. Top shelf had coffee cup rings pop tabs and other trash. Our non smoking room had cigarette buts all over the patio. Went to make a instant coffee in the morning but the kettle didn't work. Heater was so loud it would wake us up through the night. I could go on but I've already wasted enough time on this. Unless out of necessity for another appointment at sick kids we certainly won't be back.if you are heading to the area for fun, spend a couple bucks more and go somewhere that takes pride in their rooms and doesn't just bank on people staying there because of location.",
      "rate": 1.0,
      "tripDate": " February 2020"
    },
    {
      "title": "No longer worth the money",
      "text": "I agree with most of the other reviews, this hotel was too notch 20 years ago. Now, it is simply dated and very overpriced for downtown Toronto.They are living on their past reputation and returning clientele but everything seems dated now. Now as clean as it used to be, dated rooms, huge lines and waits to checkin. Just simply not worth it with so.mich competition in downtown Toronto. There as been at least 3 different occasions in the last 6 months that I cancelled because other comparable hotels were priced much lower. I finally came back to Chelsea and it was a huge disappointment. Compare...you will find much higher quality and lower pricing in downtown Toronto.",
      "rate": 1.0,
      "tripDate": " December 2019"
    },
    {
      "title": "Would never return or reccomend",
      "text": "I stayed at this hotel with my husband after booking the Family Day special and we were extremely disappointed by the state of this hotel. Having read the reviews ahead of time, nothing prepared us for the mess this weekend was. We parked our car in the underground parking only to find out the elevator was broken and we needed to carry our luggage up several flights of stairs. There was a very long and loud line of people waiting to check in, we waited for 30 minutes to check in! The elevators were dirty with empty alcohol bottles and cups on the ground. The room was outdated (although it was functional) and dimly lit with a slight odor of stale smoke. We were excited to use the hot tub and pool but were very disappointed to find it was packed with people engaged in questionable activities in the pool. The sauna is unnaturally hot and dry compared to others I have been in. The checkout process was also a nightmare as the elevator was still broken and it took me 20 minutes to drive out of the parking garage due to the line up of cars trying to get out. I am unsure if the AC even works. We tried to use it all morning and eventually opened the windows. The whole place is a very very crowded mess. The only positives of this hotel were the staff who were lovely and the cardio gym is nice and clean. Aside from that, I would never return or recommend this place to anyone.",
      "rate": 1.0,
      "tripDate": " February 2020"
    },
    {
      "title": "10/10 in the heart of Toronto",
      "text": "Chelsea Hotel is the largest hotel in Canada (1500+ rooms), but everything is perfectly organised and there is always some helpful stuff around. Location in Toronto downtown is a big plus, close to shops, P.A.T.H., metros station, tourist hot spots etc. Room size (we had single Queenbed) is good for a city hotel. Everything is clean, well maintained and we had daily room service. The bed was a little soft for our taste.Price tag for continental breakfast is quite steep, taking the limitation of choice into account. However presented food qualitiy is very good. And there are plenty of alternatives around the hotel, e.g. Fran's Restaurant in College St.",
      "rate": 5.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Great hotel!",
      "text": "I spent months trying to decide on a hotel before finally settling on this one.Best decision!!This hotel is a 2-3 minute walk from downtown!Our room had a view of Yonge-Dundas Square.Check in/check out was a breeze.Concierge was amazing! We always spoke with Jessica.. she truly went out of her way to make sure we had something to do throughout our whole trip.Rooms were clean & well stocked.The restaurants were clean & had a very good vibe.You can reserve a car/limo for a flat rate to drop you off at the airport.If you are interested in the Niagara Falls tour.. they pick you up & drop you off right at the hotel. (You should definitely book this tour btw)",
      "rate": 5.0,
      "tripDate": " March 2020"
    },
    {
      "title": "Definitely not 4 star",
      "text": "When we arrived yesterday they didn't have a booking under my name and pretty much left me to deal with the problem directly with my personal travel advisor even though I had all the paperwork showing the hotel and the dates , after about 20 minutes of me making calls I returned to the desk to be told they found a booking in my name for July not march (I find this hard to believe as surely using a customer's name would have flagged that up at the beginning my name is not very common. Really the only thing good about this hotel is the location and the beds are comfortable,  as long as your just looking for somewhere to sleep you will be ok.Told the gym and pool facilities were out of use no reason given just closed . Cups for coffee in your room we paper cups which leaked, no water provided in room to drink. Bath had all the metal paint coming away in the bottom and finishings chipped or broken. Our room was a standard which seamed 2 small double beds (small enough that we removed the desk in between and pushed them together as we couldn't have comfortably both slept in 1 ).We travel alot and don't moan about things like hairs in the shower etc and aren't fussy people but I don't believe this should be sold as a 4 star it seams more like a 2 star at best. ........oh and for those who do like to comment about hairs there were 2 large ones on the bed when we arrived 🤣🤣Looking around there are plenty of other hotels close by if your wanting it for location, I was staying here 3 nights and 1 night at the Hilton niagara but I have now changed to move to the Hilton quicker as we have come from the UK to holiday here so this hotel would not be my choice if I had known what it was like .",
      "rate": 2.0,
      "tripDate": " March 2022"
    },
    {
      "title": "Just ok",
      "text": "This hotel has a really central location and has easy access to shopping malls, transport and some of the sites. All staff were very friendly and helpful throughout our stay; reception staff, concierge and catering staff.We didn't eat in the hotel but did pick up some take-away coffees & breakfast items to take with us.I was however really disappointed with our room. It did not match any of the advertising photographs online prior to booking. The hotel is undergoing renovation and the pictures are of the newly refurbished rooms. Our room was spacious enough with a safe but it was very run down looking. There was a large black mark on the carpet near the window and the whole room was quite dusty (presumably due to ongoing building work).The bathroom was very small with a small tub & overhead shower. Again, the suite was extremely old. I wouldn't have booked this hotel if I'd realised the photographs did not match the actual room we'd be staying in.I think this will be a nice hotel once renovation is complete but not before then.Can't fault the staff at all, they were great",
      "rate": 3.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Terrible",
      "text": "The food was overpriced and not great. The rooms are small for the price. The service was terrible, I paid extra for parking an breakfast and it is definitely not worth it. $65 for 3 small breakfasts and the lady in the restaurant charged me for my breakfast twice and said the refund would go towards my room. I have yet to see this refund, at checkout I explained it to the front desk to make sure that I would get my refund it wasent there.",
      "rate": 1.0,
      "tripDate": " September 2021"
    },
    {
      "title": "WILL NOT STAY HERE AGAIN",
      "text": "The overall quality and service of this Hotel was poor. Cleanliness of the lobby was poor. The elevators very small and slow. Staff is not customer service orientated. The ice machines were always empty on all floors and the room service said they could not bring just ice. Well guess what, I will not be bringing my business or money to the Chelsea again.",
      "rate": 1.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Family holiday",
      "text": "We arrived in Chelsea hotel, Toronto after booking our accommodation 9 months earlier.  We had looked closely at the website and we’re happy from the photographs that this hotel lived up to its 4 star status.   How wrong we were.  We were a party of  2 parents and 2 older teenager as.  they gave us a room that had stains on the ceiling, smelt damp and musty and had brown decor that was there from the 90’s .  It was cramped and had 3 beds that are small European doubles.   The bathroom was tiny.  The walls are paper thin we could hear the girls laughing nd chatting well into the night.   The curtains did not meet in the middle. It was not a 4 star room, far from it.The next morning we asked for a different room, agreed to pay an upgrade and ended up with a room that contained a bedroom, a couch and a camp bed, totally unsatisfactory.   First evening we asked the concierge for a Japanese or Indian restaurant recommendation and he advised there were no such restaurants in the area of downtown Toronto?!Myself and my older teenager old son went for a swim at 9.30pm to a empty pool.  A hotel attendant came by and told us to leave, over 18s only.  My son  could share the pool with the kindergarten kids on the second floor.We have stayed in a lot of hotels around the world, this one completely oversells itself.  II would not recommend it. It’s busy, noisy, lifts are dirty, it has lot of busy people traffic through the ground floor after  10pm…..    we weee very disappointed with our hotel in Toronto.",
      "rate": 1.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Needs improvement",
      "text": "Our travel agent booked us into this hotel on our first night. We requested a walk in shower as my wife has mobility / balance issues and uses crutches. Our son was travelling with us and we also requested rooms nearby. The room we were assigned was a very long way from the lift which was very difficult after a long flight, and my son was assigned a room 2 floors up and on the opposite end of the hotel. Our room was very poor. The shower was dirty and very tired and the window glazing was blown. The sound proofing was non existent and the road noise was very apparent late into the night. Our son’s room was better as it had been refurbished which is why we gave 3 stars We passed on breakfast as it was $33 We didn’t like Toronto and will probably not return. We only stayed for a trip to Niagara",
      "rate": 3.0,
      "tripDate": " June 2023"
    },
    {
      "title": "Needs a major renovation, 1 or 2 star",
      "text": "I’m not sure how this hotel has a rating of 3.8.  We stayed over March break.  Lobby is nice.  Rooms are awful.  They feel so gross.  Cigarette burn in the chair upholstery.  Curtains felt ancient and looked like they’ve never been cleaned.  Splashes on the wall, god know what it was.  The room had a weird Smokey smell, guessing it used to be a smoking room.   Balcony was filthy.   No coffee machine In the room.  The elevator situation is terrible.  Waiting so much time and every time an elevator comes, it’s full.  The pool, which is the reason we went…is heavily chlorinated my eyes were burning while watching and my daughter said it was cloudy when she went under.  I felt like there was black mold in the tile grout.  My daughter has been complaining about itchy armpits and My mind keeps going back to the pool. The booking of times for the pool is not a great system but I guess it’s the only way since the pool is tiny.  I felt really bad for the girl who was in charge of that because people were rude and getting mad that there were no times left. I think that is to be expected when travelling during a super busy time and I can’t hold that against them.  The breakfast which was included in our room was also not great.  I’m glad it was included because I would have been annoyed paying $20 per person.  I feel like I’m being such a complainer but it really was disappointing. The floor was sloping and I actually got concerned that maybe the structure wasn’t stable, that’s how terrible the building feels.  I would never go back.  There are much better, cleaner hotels in much better areas.  The staff were nice but that’s not enough to ever bring us back.  Now to go wash everything in hot water.",
      "rate": 1.0,
      "tripDate": " March 2022"
    },
    {
      "title": "Why stay anywhere else?",
      "text": "When I’m in Toronto I will either book an Airbnb or Stay at the Chelsea Hotel. This hotel is only a few minutes walk from the CF Easton Centre, and TTC services.The room I was in was very modern, with a large TV, fridge and balcony, which in my room (2665) gave me a beautiful sunrise view in the morning.Everything is explained upon check in and the reception staff are very kind and courteous. I ate at the restaurant once, opting for a pizza meal deal (1 slice, 1 pack of crisps & a can drink) which cost CA$11.80 including tax, the deal is advertised as CA$10.Because you are in what I call Ryerson District, you have a lot of fast food options, as well as essential stores such as Shoppers Drug Mart, 7Eleven & H-Mart. The area around The Chelsea hotel gets quite lively at night, with clubs & karaoke bars just on your door step.There wasn’t anything too bad about my stay here, as I’m a regular. But the bathroom only had 1 roll of toilet paper but 2 holders. It seems like the paper wasn’t refilled before I checked in. As it was only a short stay (2 Nights) it wasn’t an issue.There is a gym on the 27th floor, with all the regular cardio equipment as well as a swimming pool, Jacuzzi & separate sauna (located in the changing rooms)All in all if you are looking for a place to stay that is central to all the shops in Toronto. The Chelsea hotel is the best choice.",
      "rate": 5.0,
      "tripDate": " April 2023"
    },
    {
      "title": "Disappointing Stay",
      "text": "Have stayed at this hotel several times in the past, but never had any problems. This time, there seemed to be terrible communication problems between me and the staff. There are many foreigners working there, which is not a problem. However, they do not understand most of what you're asking for.I ordered extra towels and a plastic bag insert for the ice bucket, which is normally given when the room is cleaned.I received the plastic bag and ice tongs. Where are the extra towels?The 1st room we stayed in had a very loose door knob to the bathroom, which was about to come off.The water mysteriously made strange noises then turned off but came back on 30 mins. later.The lamps were old & the USB port didn't work on 1 of the lamps along with non-working plug.The other lamp had a hole for the USB port but nothing in it.I could not charge my phone at all.They suggested a new room, so we got an upgrade to 1 of their re-modeled rooms from the manager and free parking.The manager was very nice and understood the pains we were going through.My question is, why didn't they give us a decent room to begin with and we wouldn't have had these problems.",
      "rate": 2.0,
      "tripDate": " October 2022"
    },
    {
      "title": "Extremely disappointed",
      "text": "My name is Allison Dixon. I am from McDougall Ontario. I checked into your hotel today under the patient program for a duration of 14 days with the possibility of extending to October 28th (baby’s original due date)Upon arrival I was told that my vehicle was too large to fit into your parking area and that I would have to find public parking. (Fine)When I asked if I could unload my luggage at the front door before going to find parking I was told no that the vehicle had to be moved.I just delivered a very premature baby by C-Section at Mt.Sinai hospital. Under medical order I cannot lift more than 5lbs let alone walk blocks through the city with luggage, but I did it anyways as instructed by your front desk staff & security. Upon checking in finally in pain & exhausted, I asked if there was a fridge and microwave. The clerk said that she would request a fridge but I could not have a microwave. When I called to make the reservation I was told that upon checking in all I had to do was request these items. I am a breastfeeding mother that needs to be able to have certain supplements in the morning to provide my baby who is struggling for their life with the best possible nutrition. I then asked if I could add the breakfast option to my room (I would have been happy to pay the extra fee) again I was told no that it wasn’t a possibility or option for me!To say the least, the treatment I received is completely unacceptable! During this very stressful hard time in my life I would expect that a mother who has just gone through a very complicated medical procedure and now continues to be in NICU everyday needing accommodation in Toronto would be treated better than this. This hotel came highly recommended which I have yet to agree with especially as a guest paying thousands of dollars to your establishment.",
      "rate": 1.0,
      "tripDate": " September 2021"
    },
    {
      "title": "Third Rate Dive",
      "text": "This hotel has been here for many years.  The website shows nicely decorated, updated rooms and advertises a rate of mid $300's.  Good deal, right?  Didn't read the fine print.  The room I got is circa 1980, the a/c unit is so loud that sleep is impossible but when it does mercifully shut off, the noise of the pigeons over sounds of traffic and sirens is equally irritating.  I've stayed here before and enjoyed it. This horrible mess of a room for the bargain price of over $1,000 for two nights is the biggest rip-off I've ever encountered.  Third rate dive.",
      "rate": 1.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Honeymoon",
      "text": "I would maybe give this place 2.5 starts at best!!! We travelled from Nova Scotia for our honeymoon and to see friends who we couldn’t have at our wedding due to covid and it was a short trip and the only nice thing about this hotel is the pool and location. The rooms were very old and tired and service was non existent! When requesting early check in so we could makeIt to the ball game at 1:30 they pointed us to their Public lobby washroom to change and wash up after a day of traveling before the game and dinner. Don’t expect much for the fact we were celebrating our honeymoon but we got nothing! We travel and stay at hotels for other events such as anniversary of us meeting and birthday and get something personalized for the occasion and we got nothing! In the past from other chains of hotels we have gotten in the room (champagne, chocolate, discount at their restaurant or just a card from the staff at hotel wishing us a happy birthday or anniversary) We travel to Toronto offten For work and pleasure and won’t be back at the Chelsea hotel! This is the worst hotel experience we have had.",
      "rate": 2.0,
      "tripDate": " May 2022"
    },
    {
      "title": "Clean, convenient and well-appointed",
      "text": "This is a great and big hotel. We got a quiet room on the quiet side of the hotel so we couldn't hear anything unless we were awake. Our room had a lot of basic necessities you needed but I don't think every room has the same. I would have liked extra bath towels and when I had them they took them away during cleaning even though I didn't put the towels on the floor. Service was friendly and the pool and hot tub were great. The AC wasn't noisy and you could open a window. But there didn't seem to be airflow because it took 3 days to dry clothes. We only think the room is a bit small and the vents caused us to hear our neighbour doing things we didn't want to know they were doing. And the door slamming was quite loud as no one except us closed the doors quietly. But when I was sleeping, I didn't hear anything. Perhaps I'd come back and stay in the roomier part of the hotel. But Toronto downtown hotels seem to be quite expensive.",
      "rate": 4.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Broken bed and internet only in bathroom",
      "text": "We've stayed at this hotel and few times but this was the worst stay I've ever had.  The only place that I could get internet in my room was either sitting on the floor by the door or in the bathroom. Even when I did manage to get internet it kept cutting out.  I phoned the tech help line twice with no luck.Both my husband and I ended up with sore backs. My husband went to the pool to sleep on the loungers as they were more comfortable.  We found out, as we were packing, that the bed was actually missing the middle support rail. We couldn't find any newspapers in the lobby but did find ones that were left behind in the buffet restaurant (which was really expensive) $24.99 for a continental breakfast.",
      "rate": 2.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Excellent until near the end",
      "text": "I had to go to Toronto general for some tests and a procedure and needed to stay nearby for 7-8 nights. I booked for 7 nights and asked about extending the stay, which they said was no problem. They gave me a medical discount which was very generous. The Chelsea has its own parking which is convenient. For the second half of my stay I would not be able to drive while I recuperate. The rooms and facility are clean and well maintained. There is free wifi. The phone was locked until I paid an additional deposit and was then $1.90 per local call. When I tried to extend for one night I was told I would have to switch rooms, which was very inconvenient and I decided to leave instead as I had quite a bit of stuff to moveThis is why four stars instead of five. .While I was moving my stuff down to my car the north elevator would not access the parking levels, so a couple of annoyances at the end of the stay. Others have complained about the noise of sirens etc BUT hey, it's the downtwon of a big city near the hospital district. If your windows are closed you won't hear much of it - maybe it's worse on the north side of the north tower (even-numbered rooms up to n56). I had my window wide open to have fresh air and enjoyed the street life.",
      "rate": 4.0,
      "tripDate": " October 2021"
    },
    {
      "title": "not the worst...but close",
      "text": "Rude check-in staff and when we did get in the room it smelled funky and was not really fresh and clean.  Thought about asking for a new room but then I'd have to deal with the absolute worst check-in staff imaginable.  Slow and lazy, with a side of \"can't help you\" just isn't worth the time and effort.  the \"restaurant\" is overpriced for the fare served.  Avoid this place like the plague",
      "rate": 2.0,
      "tripDate": " December 2019"
    },
    {
      "title": "Chelsea - perfect location downtown",
      "text": "Great location, great service, walking distance or affordable cab to many attractions. $15 to Rogers, $65 to zoo, $60 to airport. Restaurant on site is great quality but breakfast is overpriced, phenomenal alternative: Frans or Eggsmart, both within walking distance and are amazing! Jasmine spa right next door offers great couples massages. Gym at hotel was amongst the best I’ve seen for cardio equipment, full circuit, cable machine, and free weights. Wifi worked great. Upon check in the line up is massive around 3pm, check in early or late to avoid lines. Our flight arrived at 7am, they secured our luggage while we explored the city, we were able to check in early with a room at no additional cost at 1pm, they also accommodated a late checkout (12:30pm). The staff and service is top notch, great experience overall.",
      "rate": 5.0,
      "tripDate": " July 2022"
    },
    {
      "title": "It is what it is",
      "text": "We were very excited to stay here, because we booked a balcony so we could have private time after our child went to sleep. We also loved that it had a water slide so we could occupy him in the mornings after breakfast.While we booked months ago (and paid) specifically for a balcony room, we were very disappointed to find out that our balcony door only opened two inches and there was no way for anyone to get out. To be clear, a balcony that you can't go on is just a window.  They had hard drilled a piece of wood in so the door could not be opened. I would have complained but we had already been told the hotel was completely booked and there would be no room for us to move.Our son very much enjoy the water slide. It was our favorite after breakfast activity. The breakfast was delicious because it was included. If you were to pay for your own breakfast it would be way over-priced. We bought our child an $8.50 breakfast special every morning. (Our breakfast was included).  However, we recently got our bill and we're somehow billed $41. So we will have to call the hotel and fix that(check your bill).  The hotel is a bit run down but it was what it was. We booked that so we could have a balcony for a private space and we weren't given exactly what we booked so for that reason I don't think I would stay there again. To be clear I even called twice to make sure that their balcony doors opened, and then I followed up again to say hey we booked this balcony. We just had to make the best of it",
      "rate": 3.0,
      "tripDate": " July 2022"
    },
    {
      "title": "dissatisfied east coast customer",
      "text": "We booked a stay for two nights using our airmiles-6000  as well as 154$.  The hotel was close to everything. However, extremely dated, with peeling wallpaper, dirty carpet, and dated bed/bedding. Certainly not good value for what was paid. We requested a cot and they were going to charge 30$ until I spoke to them about our displeasure with our room. Sadly, we would not choose to stay at this hotel again. The only positives from this stay were the bar/restaurant service, the lobby decor, and the location which is within walking distance of many attractions and the downtown core",
      "rate": 2.0,
      "tripDate": " November 2022"
    }
  ]
}