{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Chestnut Residence & Conference Centre",
    "url": "/Hotel_Review-g155019-d311925-Reviews-Chestnut_Residence_Conference_Centre-Toronto_Ontario.html",
    "priceRange": "$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.0",
      "reviewCount": 163
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "89 Chestnut St",
      "addressLocality": "Toronto",
      "postalCode": "M5G 1R1",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0f/e8/1f/3c/room.jpg?w=500&h=400&s=1"
  },
  "description": "Chestnut Residence & Conference Centre offers accommodation in Downtown Toronto, with the look and feel of a hotel and the economy of a University Residence. Chestnut Residence & Conference Centre is located in the heart of downtown with Toronto's famous City Hall and Nathan Phillip's Square as our direct neighbours. Near shopping, business, entertainment districts and all major attractions.",
  "featues": [
    "Paid public parking on-site",
    "Parking garage",
    "Free High Speed Internet (WiFi)",
    "Free breakfast",
    "Game room",
    "Business Center with Internet Access",
    "Meeting rooms",
    "Non-smoking hotel",
    "Internet",
    "Breakfast buffet",
    "Vending machine",
    "Air conditioning",
    "Non-smoking rooms"
  ],
  "reviews": [
    {
      "title": "The accommodations basic and met our needs",
      "text": "We made a quick three day trip to Toronto and only needed a place to lay our heads. Room was clean. Air conditioning worked. Quiet sleeping conditions. Breakfast was good and the location allowed us to walk everywhere we needed in less than 2 km. Staff were friendly and a very secure building.",
      "rate": 4.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Just fine and a great deal!",
      "text": "We heard about 89 Chestnut when my son was notified that it would be his residence when starting University in September.  We were going to be in Toront a few weeks before, so we decided to stay there instead of a regular hotel.  We had two adjoining rooms with a south view of the city looking over Nathan Phillips square so there were lots of trees and the CN tower was in the view.  Comfortable, clean air-conditioned rooms and the shower had invigorating water pressure.  You couldn't ask for a better downtown location - the Eaton Centre, Queen St. and the subway very close and great restaurants all around.  Walking distance to the theatres, Yonge St, University of Toronto and just about everything.  Price about $80 Canadian for two including an OK continental breakfast with option to upgrade to a great hot breakfast.  Excellent security and underground parking.  We didn't miss the TV - in 8 days I went out a couple times to the Common room on the floor to watch the news.My son lives there now for the academic year and loves it.  Taxi stand at the hotel across the street.  What more could you ask for?",
      "rate": 4.0,
      "tripDate": " August 2005"
    },
    {
      "title": "Great New \"residence\" Accommodation downtown Toronto",
      "text": "Great rooms, great location and a good value. A university of Toronto residence the rest of the year but visitor accommodation for Summer season. Friendly and helpful staff and a welcoming atmosphere. If you have a minimum 3 night stay(they don't accept shorter bookings) in downtown Toronto, this is the place to be!",
      "rate": 4.0,
      "tripDate": null
    },
    {
      "title": "excellent, clean, comfortable centrally located budget choice",
      "text": "This is a student dormitory which rents rooms to travelers in the summer. It is an excellent budget-travel choice. There is a security guard 24/7, so if you arrive late at night you will not be standing outside the door waiting for someone to let you in. You must use your key card to get to your floor of the building. Room was clean and comfortable, but the lighting was rather dim. There is AC. This is a high-rise building, so windows are not openable. No fridge or microwave in the room, but you can use the shared one in the common room on your floor. Breakfast in the cafeteria is included, and it is plentiful and offers a variety of choices: Eggs cooked in different styles, pork sausage, halal chicken sausage, baked beans, oatmeal or rice porridge on alternating mornings, fried potatoes, 3 yogurt flavors, cantaloupe and honeydew, toast, fruit juices. You can also buy dinner, which is basic cafeteria food, for a reasonable price. The location is very good, with many places to eat nearby. We give it our highest recommendation.",
      "rate": 5.0,
      "tripDate": " June 2024"
    },
    {
      "title": "Disgusting service",
      "text": "Stayed here for 3 days rooms are disgusting, mucky, curtains don’t close. All you hear all night is the lift is the lift going up and down. My husband and I went down to breakfast to grab a snack to eat in the room while we got ready for a day trip to Niagara Falls and l was not allowed to leave the dining area and come to my room you was only allowed breakfast if you sat in the dining room full of shouting students. Staff extremely rude!! AVOID!!",
      "rate": 1.0,
      "tripDate": " June 2022"
    },
    {
      "title": "I would never stay here again",
      "text": "This so-called hotel is literally an old dormitory. The rooms have no refrigerators, no TVs, not even a trashcan. The staff was unfriendly and inattentive at checking. There is no coffee available unless you go in to have breakfast. Unfortunately I would say this is the worst hotel I’ve ever stayed in.",
      "rate": 1.0,
      "tripDate": " June 2022"
    },
    {
      "title": "A great night's sleep in a nice place",
      "text": "We needed a place to stay while in Toronto on Saturday night. We just needed a place to sleep. Found 89 Chestnut,  the room was clean and provided a great night sleep. This place was reasonable priced and fit the bill. I will definitely stay here again.",
      "rate": 5.0,
      "tripDate": " August 2022"
    },
    {
      "title": "A gem at this price",
      "text": "If you want room service, daily housekeeping and multi-channel tv this is not the place for you. If on the other hand you want a cheap room (we paid CDN$79 per night) right in the heart of the city (it's located behind Nathan Philips Square close to the bus station and Eaton Centre) with a free breakfast buffet then this is a great deal. Formerly the Colony Hotel the rooms obviously have a hotel feel with comfortable beds and chairs, nice bathrooms, a writing desk and table. There is a hairdryer in the bathroom and also an iron and ironing board. Housekeeping comes around twice a week but there are plenty of towels available to keep you going. Check-in was quick and simple. You have to show your key to security before going up to your room but the staff are very friendly. Check out was no problem either and there was no problem storing our bags until later. An added advantage of the hotel is that the airport express bus stops directly outside the front door so no long walks with luggage. I found this hotel thanks to reviews on here and would have no problem recommending it to others.",
      "rate": 5.0,
      "tripDate": " June 2005"
    },
    {
      "title": "What a deal!!",
      "text": "Great place!  This is the cheapest place with the best atmosphere I know in downtown Toronto.  I paid $79 a night as opposed to $150 that I normally pay in other hotels.  The only difference is that there was no TV in the room.  But who is goes to Toronto to watch TV.  I would definately stay there again, this place is a keeper!",
      "rate": 4.0,
      "tripDate": " June 2004"
    },
    {
      "title": "Worst than sleeping at the Bus Terminal!!!",
      "text": "The original booking was done through Booking.com for July 16th to July 19th. Prior to arriving I called to verify some questions about bedding, air conditioning, lounge area, breakfast, towels, etc. We arrived on July 16th at 3:30 pm and were assigned a room on the 21st floor, Upon arrival in our room we turned on the air conditioning because the room was very hot. The room had two double beds with soiled carpeting. The room temperature did not change after a half hour so we went down to the front desk. Front desk put in a call to maintenance to have the air conditioning fixed in lieu of offering us a different room . We were forced to leave our room and go into into the sweltering heat of Toronto while this was being done. Upon reentry into the room we found first that the air had not improved and secondly that there were new boot prints all over the carpeting from maintenance. The carpeting on the side of the bed beside the air conditioning unit was wet and we stepped on it with our stocking feet. I called down to the Front desk to advise them that the air was still not working and they asked that I give them a minute and they would call me back. They called back and asked that we meet them on the 14th floor to see another room. We were relocated and finally re situated in a new room by 6:45 pm.  I asked that the Manager be called and the Front Desk called Krishna. After I explained the entire situation to him and told him that it took over 3 hrs for us to get a proper room he said he would have to check with his team and that I could call him back the next morning. I asked that he call me back the next morning.  I cancelled my morning plans and waited for his call which never came. My Husband finally called Krishna from Montreal that afternoon because the whole situation was unacceptable. Krishna said that he had not called me yet because the day was not over, He told me husband that the air was working fine and that the carpeting was wet because it had been washed (it was not wet anywhere but by the unit and only after it was worked on and if it was washed is it policy to send guests into a room with wet carpets). My husband said that the whole situation was unacceptable and that I would be leaving on the 18th rather than the 19th of July as planned. Krishna would not admit to any fault but said that I would have to deal with Booking.com since that was who I booked my hotel through. I did get a $55.94 credit for half a day but when I received my billed via email from Booking.com it stated that I should have only been charged for 2 days, but Chestnut Residence charged me for 2 and a half therefore further credit is due to me.  I would also like to point out that the elevators were constantly malfunctioning and broken. Krishna the manager lacks in Customer service. Due to his inability to take immediate responsibility for the mistakes made instead of blaming Booking.com, our trip was ruined and cut short. We felt mistreated and mishandled. To sum it all up, I would not recommend the Chestnut Residence to anyone, not even if they had nowhere else to go.",
      "rate": 1.0,
      "tripDate": " July 2013"
    },
    {
      "title": "Pretty happy overall",
      "text": "We had stayed here when it was the Colony Hotel, so we knew the location (within 5 mins of 3 subways and from the Eaton Centre) was excellent.The staff were friendly and approachable, and the room we arrived to was clean. Someone earlier had written that you could help yourself to towels and toilet rolls since housekeeping is only twice a week, but when I asked about this I was told it was not the case. However, reception brought some up for us within minutes of asking.Breakfast was excellent. There was a wide choice available. Cereals, lots of different breads, some fruit, hot breakfast, and plenty fruit juice. They even had ice cream.The problem we had was that on the website it said they were doing refurbishment over the summer period. I emailed in and asked them to clarify this, but received no reply. We were booking last minute so we got to the stage where we had to book and so went ahead. Now, if the room along the corridor is being painted, it's not likely to bother me.  But a JACKHAMMER going.....I have a problem with that!!!! There were signs up about this, but you don't see them by the lift until you've checked in. We had checked into the room when we came back out and saw the sign saying that certain rooms would be affected. So we asked to change rooms. The new room was at the other side of the hotel and one floor up - all they could give us. But it was still a problem for the first few hours of the day and late afternoon. I was pregnant at the time, so wanted to lie down sometimes.Of course, you're out most of the day. But they said they'd be doing it from 9AM-5PM each day. So when I was woken up at 8:30am one morning, I phoned reception and complained. This was met with bewilderment as they seemed unaware of the work going on?!? Strange.So what I would say, is for the price, this is a great place to stay. But if you see ANYTHING on the website about upgrading the hotel, then make sure you phone and clarify. (I tried this but couldn't get through on a couple of occasions).",
      "rate": 4.0,
      "tripDate": " July 2006"
    },
    {
      "title": "Great location and breakfast",
      "text": "The rooms themselves are very basic. Pretty much just a bed and a bathroom, no amenities such as TVs or anything like that. The location was great, and walking distance to most of the things to do in Toronto. If you are not looking to spend a lot of time in the room, and just looking so somewhere to sleep and leave your things then this is all you need, but definitely no frills. In saying that, the breakfast was fantastic, probably the best of our trip!",
      "rate": 3.0,
      "tripDate": " August 2019"
    },
    {
      "title": "Good",
      "text": "Me and my son stayed here for the weekend with the wrestling on at the Scotiabank Arena.The room itself was very basic with 2 beds and no luxuries like tv's. The toilet was basic and it definitely was 'no frills'.However...1. The location is fantastic for the entertainment district. Right near the subway and only 20 mins walk from the CN Tower.2. We were on the 26th floor and the view out of the window was fantastic.3. The shower, whilst basic, was powerful and that is what I like.4. The price is decent for where it is in Toronto.5. Breakfast was included and it was really nice. It had all the breakfast favourites including tater tots, bacon, Sausages and a lot of cereal choices! The star I'm knocking off is for the beds which are not comfortable and pretty rock solid. However for everything else, it was a really good solid stay.",
      "rate": 4.0,
      "tripDate": " August 2019"
    },
    {
      "title": "Not Worth It",
      "text": "The TripAdvisor blurb for this place says it has \"the look and feel of a hotel\". It's true that it once was a hotel, but it looks and feels like a hotel that hasn't been updated or cleaned since the early 2000s. The only good things about it are the central location and the price (at least in comparison to other accommodation in the same part of the city), plus the buffet breakfast that's included in the price. The breakfast choices are pretty limited but it's all fresh food.  I have stayed in many university residences and other basic accommodations like hostels, but this is among the dirtiest and worst-kept I have ever seen. The public areas look run-down and tired (chipped paint, scuff marks and gouges) and the rooms are in terrible shape. The linens on my bed were old, discoloured and worn, there was dust all over the baseboards, and the fixtures were rusty (see photos). There is no bedside lamp, or even any light with a switch near the bed. The bed linens are too small for the mattress so they pull loose as soon as you lie down. The mattress is a single layer (no box spring) and is very uncomfortable. The amenities were very basic - soap and shampoo. No ice bucket, disposable cups, or anything else. The phone in the room did not work.There were some kind of renovations being done on the floor I was on, with no notice to guests as to what was being done or what it would involve. On the morning I left, I was interrupted three times while I was trying to pack, by workers wanting to come in the room to \"fix the Wi-fi\". I told them not to come in until I left, and they did. But the building's management should have let guests know about this work in advance - thankfully I was awake and dressed by the time the workers arrived.Bottom line, unless the University of Toronto is willing to invest in updating this place and operating it better (like cleaning the rooms once in a while), don't stay here.",
      "rate": 1.0,
      "tripDate": " May 2019"
    },
    {
      "title": "An okey stay",
      "text": "I was visiting Toronto for five nights and stayed at Chestnut Residence. It was a nice and simple stay. Great beds. Very nice, but simple, breakfast. The only thing I had problems with was the loud aircondition. Good value for Money for a hotel in the centre of Town.",
      "rate": 3.0,
      "tripDate": " June 2018"
    },
    {
      "title": "A budget place that fits the purpose",
      "text": "This hotel is right in downtown Toronto with great accessibility to different locations and public transportation. The room is clean with the basics like A/C, comfy beds, free WiFi and bathroom, but no TV which is OK to me. Breakfast buffet is included with room stay which is good for the value.",
      "rate": 4.0,
      "tripDate": " June 2016"
    },
    {
      "title": "Definitely would come back- budget pricing",
      "text": "Chestnut was a really nice stay for the low pricing. It was a quick walk to the center of downtown Toronto and they had great amenities, like free breakfast buffet for each day of your stay and free wifi. The breakfast was really good, and had lots of variety! Since it is used as a dorm during the months of August-April, the rooms are a little worn out but still clean and comfortable. The rooms are furnished simply like a typical dorm room- no TV's included. (But if you're really being a tourist, don't stay around and watch TV all day anyway!)There is security 24/7 and they check the room cards of each person entering the building, so it is nice and secure. The parking is not free, which bummed me out, but their garage is easy to access from the lobby and I was comfortable keeping my car in there for 3 nights without worrying about safety.Overall, if you're looking for the most value for a low price, look no further. As a college kid with a small budget and an itch for travel, I enjoyed my stay here and would definitely come back. The staff was helpful and very pleasant.",
      "rate": 4.0,
      "tripDate": " May 2016"
    },
    {
      "title": "Cheap and acceptable",
      "text": "I was going to a conference in Toronto and needed a cheap place to stay. We had trouble finding a room for less than $300 that was close enough to the conference. We ended up finding this place. While we were nervous to book it after reading the reviews we went ahead because the price couldn't be beat.Is it a hotel? No. It is a residence. And for that I thought it was fine. We didn't need amenities like a TV because we only needed a bed to sleep. The bathroom was clean, great water pressure and the room was air conditioned. Breakfast was included and there was lots to choose from. I agree that free wifi would have been nice but in the grand scheme of things we paid $99 CA a night and we would stay here again. There were stains on the curtains, but why does that make a difference when you just need a bed to sleep in? If you're looking for no frills and cheap, go for it. If you're looking for a fancy hotel look elsewhere and pay more money.",
      "rate": 3.0,
      "tripDate": " June 2015"
    },
    {
      "title": "Central place for conference",
      "text": "I stayed at 89 Chestnut when attending a meeting there. Very central, conference facilities are moderate but generally OK.  Rooms are spacious but a bit drab and the reception allowed me to leave my luggage for a few days before I checked in which was really helpful. Overall, I'd say this place is pretty OK but it would be even better if they could throw in free wifi for the price they are charging. It is certainly not cheap for a university residence. Good laundry facilities in the basement.",
      "rate": 3.0,
      "tripDate": " June 2013"
    },
    {
      "title": "Toronto is expensive? This place is cheap and OK.",
      "text": "I looked for cheap hotels to rest for 2 nights and most of the hotels in Toronto are too expensive.The residence is pretty nice for the price. And it is located next to the city hall downtown!We booked a two double bed room and while the AC is very noisy (waked me up until I switched it off) the rest of the room was very clean. Bathroom is clean, breakfast is alright and included in the price. Black spots : no kitchen, no TV (not too big a deal if you go around a lot, but still appreciated).The hotel feels very safe as you need to have a key if you wish to go to the floor where your room is. And there is security in the lobby.Floor can be a bit dirty though. Bring slippers!",
      "rate": 4.0,
      "tripDate": " August 2012"
    },
    {
      "title": "Barely maintained university residence is not for everybody",
      "text": "First the good things:  yes, it's inexpensive.  The location is awesome, right behind City Hall and the marvelous Nathan Phillips Square, mere steps from the Eaton Centre, and just around the corner both from cheap but decent eateries and the hospital zone, within very easy walking distance of the Art Gallery, public transit, etc. The staff are pleasant and helpful and stuff gets done when one asks. The mattresses were okay, all linens were clean and fresh, and though the windows were filthy I had a pretty cool cityscape view.  Breakfast was included and was plentiful, varied and nourishing, as well as being available for a decent length of time in the mornings. There was even a postbox outside, very helpful for folks who like to send postcards to brag about their holidays. Constant security presence makes for a feeling of safety.Now the bad things:  the hallways reeked of ancient vomit, and the carpeting thereof was wrinkled and pulled loose -- do staff not realize that this is a serious tripping hazard?  They need to replace their vacuum cleaners, because there were rolls on the hallway floors that looked as if dust-dogs had left dust-doos. The carpet in the room was not clean though the floor tile in the bathroom was. There was significant rust on the inside door frame of the bathroom, and the bathtub HAD NO PLUG. However, when I told the desk clerk the next morning, a working plug was installed within a few hours.  The rooms are excruciatingly basic; no fitted sheets (the bottom sheet bunches up which is very uncomfortable); no TV, of course; wi-fi included (thank you) but extremely iffy; filthy windows and no access to the teensy deck; almost all the electrical outlets are hidden behind furniture. There is a/c but the HVAC system is ancient and extremely noisy -- had to wear earplugs, which shouldn't have been necessary because the location is surprisingly quiet.It would be awful to be a student in such a depressing atmosphere especially in the winter months. I understand the U of T owns this residence.  Hasn't anybody in Facilities heard of upgrades?  Serious money needed in this place ASAP especially if they're offering it during the summer to budget travelers.",
      "rate": 2.0,
      "tripDate": " June 2016"
    },
    {
      "title": "Small, dirty, zero amenities. Awful place.",
      "text": "Stayed here for 4 nights for work to attend a conference downstairs. What a hole! Let me break it down for you.My room looked alright when I first entered. It had a bed (moderately comfy), a desk, a wardrobe, a phone, and a broken lamp which wouldn't turn on unless I held the switch. No clock (my colleague's room had a clock). No hangers in the wardrobe (my colleague's room had hangers). No tv. Obviously no fridge or coffee maker. Lots of dirt and peeling wallpaper. I had to get my door card reset THREE times in 4 days because it stopped working, and my colleagues had similar issues. I will say that their included breakfast buffet was good but not enough to outweigh all the negatives. The bathroom was TINY. I'm not a large person but I had to do yoga maneuvers over the toilet to close the door. They demand (DEMAND!) payment upon check in before you see the rooms - probably because if you saw the rooms before check in you'd leave right away. Did I mention the horrible rancid smell on all the floors? This place is garbage and for that price (conference discounted rate of $109 + tax) it's easily the worst place I've ever stayed. I won't be back and will actively discourage anyone considering this place to go elsewhere.",
      "rate": 1.0,
      "tripDate": " June 2016"
    },
    {
      "title": "It's a Dorm Room",
      "text": "This is a dorm room with dorm room beds and dorm room desks ... and dorm room service. There is no wifi. If you have a Macbook Air like me, you can't use their ethernet connection. I did enjoy the lovely walk from the hotel to the convention center.",
      "rate": 1.0,
      "tripDate": " August 2015"
    },
    {
      "title": "Overlooking Nathan Philip Square, this summer-only hotel is A GREAT FIND!",
      "text": "Open for tourists from May to September (the rest of the time it's a residence for U of T students) this former Holiday Inn offers a huge room, air conditioning, FREE delicious hot buffet breakfast, and FREE internet (they give you a modem, so you hook it up yourself) for only 119.00 Canadian per night!  Best scrambled eggs I've ever had (the chef told me it's the inclusion of a lot of butter that does it).  The room was clean, furniture was basic.  It's not a posh hotel, but if you want somewhere central and reasonable, with FREE wi-fi and breakfast, then give it a whirl!  There isn't a tv in the room, but we were out and about enjoying the city too much to care! The bands/fireworks associated with the ParaPanAm games at Nathan Philip Square every night just added to our enjoyment of Toronto!  The super Textile Museum is just around the corner.",
      "rate": 5.0,
      "tripDate": " August 2015"
    },
    {
      "title": "Clean and comfortable",
      "text": "If you're wanting somewhere to stay where you're going to be pampered and waited on hand and foot, this is not for you.These rooms are part of Toronto University residences, and as such are basic rooms. You have a bed, plenty of storage space, air conditioning and a bathroom with shower and tub. You don't have a TV, coffee and tea making facilities or wifi, although you can pay for a broadband modem during your stay.There isn't housekeeping on a daily basis, just once a week. Breakfast however is included in the price and there is a broad selection.The building was undergoing renovations while I was there, so it wasn't especially pretty to look at, but the staff were friendly and helpful. The room was clean and well maintained and there was a communal freezer and microwave on each floor in case you wanted to prepare something for yourself.If, like me, you are looking for somewhere in the downtown Toronto area that doesn't cost a fortune, and don't mind that you've not got all the trappings of a hotel, then I can recommend the Chestnut Residences. It's close to many of the sights, and has public transport close by. It also has a fitness centre, which I originally intended to use, but ended up doing so much walking during my stay it would've been overkill!I'd stay here again if I ever get the opportunity to return to Canada.",
      "rate": 3.0,
      "tripDate": " June 2015"
    },
    {
      "title": "Good value in a great location.",
      "text": "Nice, big rooms.  Clean, comfy bed.  Lots of drawers & hanging space for clothes.  Nice views, especially from the top floor rotunda.  Housekeeping not the best, but OK, especially for the price.  Breakfast buffet had a wide choice & was included in price.  In-room wired internet can be purchased for an extra $5.  Fridge & microwave available in common room on each floor, near the lounge.",
      "rate": 3.0,
      "tripDate": " June 2015"
    },
    {
      "title": "Not a hotel - a dorm it is!",
      "text": "Even though the Chestnut Residence used to be a hotel, it is now during the academic year a low maintained student dorm. And unfortunately you can tell with the wear and tear on all the rooms - which are then rented out for travelers during the summer break.... So, be prepared for some very rustique experiences and filthy rugs/flooring.... The windows are almost opaque by now... probably never cleaned.However, for the price, it is not a bad choice during summer months, when hotels in Toronto may cost an arm and a leg - just across the street! The location is simply great - walking distance to ROM, uni,clinics, parliament, waterside.... Parking is a serious issue and the internet has to be paid extra... Well, we did sleep well and didn't have to much expectations. Breakfast is adjusted to student needs - but you can find all you need in a cafeteria  style setting....",
      "rate": 3.0,
      "tripDate": " July 2014"
    },
    {
      "title": "Disappointed",
      "text": "We stayed there in mid August for a chess tournament for my kids......The good things first....excellent location very close to Eaton center, Dundas square, light rail and subway. The staff was helpful and friendly. But the rooms are horrible. It probably won't even get one star. Carpet filthy,don't feel like stepping on it bare feet. Furniture old ....won't even buy from a garage sale. There were 2 desks and 2 chairs...one was really old,broken with ripped upholstery and the other has lot of hair on it !!No headboard on the bed,each pillow different size. The sheets not the best bit they were clean. The bathroom sink was broken, missing drain stopper, tub faucet dripping....can go on and on. AC in the room didn't work when we got here.....they sent someone,he had to replace the whole unit and left all the mess after him. And mind you no house keeping. It is done only once a week. We stayed for 7 nights so had to get toilet paper and trashcan liners from front desk when we needed more. It is a student dorm so don't expect hotel service. If you are getting exceptionally good deal and are willing to tolerate all this .......will never stay there again.",
      "rate": 2.0,
      "tripDate": " August 2013"
    },
    {
      "title": "Location and Value",
      "text": "This hotel is one of the University of Toronto residences, so essentially there are many young people staying here (students and travellers).  We did also see some older business people. The main reason to book this hotel would be its location which is central and within walking distance to the CN tower, Eaton Centre, main downtown area and attractions.  It is quite easy to get to from the airport if driving, and includes underground parking for a fee of $24/ night.  There is also an airport shuttle available just in front of the property which makes it easy for those without a car.  A daily breakfast is included for two in the price and is actually quite good and varied.  The lobby area and dining area are nice and clean and there is a common area on the 27th floor which provides lookouts, seating area, TV's, vending machines and a microwave.  The suite itself is a good size, but in need of some updating (carpets, walls).  Internet is NOT provided for free and there was no TV in our room.  The hotel itself and the general area surrounding the hotel felt safe and we didn't encounter any problems.  Prior to our trip I called the hotel two separate times as I had a couple of questions regarding check in/ out.  The person who answered didn't speak English very well, and was a bit curt in her telephone manner.  Once we arrived, the front desk was helpful and nice. Basically, if you are not picky regarding room décor, then this hotel is a great value for its central location!",
      "rate": 3.0,
      "tripDate": " July 2013"
    },
    {
      "title": "Great Deal",
      "text": "There seems to be some confusion in the reviews.  This is more of a residence/hostel than a hotel, and its website doesn't claim otherwise.  That being said, I thought this was a great value and really nice as far as hostels go.  My room was only $99 (Canadian) per night with parking $23/day.  The room rate included a cafeteria style breakfast.  It was much better than the standard \"bagel and juice\" continental offered at most hotels.  There was a wide variety of coffees and other beverages, every cereal you'd ever want, ice cream, yogurt, fruit, and multiple rotating hot options (eggs, bacon, pancakes, french toast, etc.)There was a spacious, full gym with several treadmills and exercise bikes.  It had various free weights, medicine balls, yoga balls, mats, and just about every variety of weight machine available.  There was a TV with cable.The rooms were maybe not quite as \"crisp\" as a standard hotel, but they were OK.  They are very hotel-like besides the lack of TV and mini-soaps/shampoos.  Our shower had pretty intense pressure.The hotel is located close to China town and the university.Overall, I thought this was a perfect hotel for a quick and cheap Toronto get-away.",
      "rate": 4.0,
      "tripDate": " May 2009"
    },
    {
      "title": "Not as bad as some reviews, but internet policy is unacceptable",
      "text": "I stayed here because it was one of the recommended hotels for a conference that I was attending.  I was a little nervous about it because of the reviews.The best part is the location.  It was walking distance to both the University of Toronto and Convention Center and Waterfront.  The included breakfast is extensive, as you might expect in a college cafeteria.It was possible to make things work better than you are first led to believe.  Since they are trying to attract the conference market it would be very helpful if they provided some information on how to make things works.-There is a nice closet space, but no hangers.  They will give these to you if you go down to the front desk and ask.-There is ice in the laundry room.  They will give you a bag at the front desk (and tell you where to find ice, but I would have never figured this out without asking).-The policy on yelling at people to leave their bags and backpacks unsecured is annoying.  Instead of coming down, having breakfast, and walking to the conference with the people I ran into breakfast I had to run back up to the run to grab my laptop.I did not have any problems with the room itself.  I usually stay in 2-3 star establishment, and value location.  The room was clean, there was no mold and their was plenty of water pressure and hot water.  The bed was comfortable, although the furniture was mismatched (which does not bother me).  I don't mind not having housekeeping service...I don't clean my bathroom at home every day.  The 3 provided towels were more than adequate for a 5 day stay.  I like not worrying about someone coming into my room while I am gone.However, in this day and age not having wireless internet is unacceptable.  My laptop is more than a year old and does not have an ethernet port.  Since this was an international conference, many participants do not have data plans that work in Canada.  I had emailed them about bringing my own router to rent the modem and set up wireless in my room, and received no response.  I did not bring my router because my  husband wanted it at home and could not believe that I would not be able to connect to wireless internet at a academic conference in the conference recommended location.  There is a sign on the internet desk that you may not use your own router.  Some of the reviews say that wireless internet is available for University of Toronto students.  This is ONLY true on the 27th floor (and possible some other common areas).  After 3 days (and way too much time in Starbucks) I wandered up to the top floor and was able to connect to the eduroam network.  This network would accept my home institutions credentials (if you are an academic google eduroam to see if your institution participates).  I was only able to connect my ipad, but I assume the reason I was not able to connect my laptop is that Windows 8 was being difficult.  On one hand there is a beautiful view over the city and to the lake and there is very comfortable furniture.  On the other hand it would get very noisy with students.Would I stay here again?  Only if it was again the recommended conference hotel.  Because there were so many staying there I could always find someone to walk with after dark and was able to have some good conversations over breakfast with out advanced planning.",
      "rate": 3.0,
      "tripDate": " July 2014"
    },
    {
      "title": "Consider these facts and think twice before you book!",
      "text": "I read great reviews about this hotel/student residence on tripadvisor and was excited to find accomodation there UNTIL I actually got there.  I want to encourage everyone to read through MY experience before booking.  Keep in mind that most of the great reviews are from visitors who stayed there during the summer and perhaps I had a totally different experience b/c I was a short term guest there during U of T school year when it was being used as a student residence...A. What I did not like about this so-called \"hotel\":(1) I paid $1200 dollars for 2 weeks short term stay and for my terrible experience that was WAY over what I should have paid.  Had I not paid the non-refundable deposit in advance, I would have left after the first night(2) When I got to my room, I found several pubic hairs in the bath tub (it was far from being *clean*)(3) The toilet did not flush(4) For over 60-70% of the time, I had to take COLD shower b/c there was no warm water - this is absolutely unacceptable!(5) The NOISE...  the university students were VERY noisy (e.g. very loud music until 3am, someone played guitar every night around midnight, etc.) and there is one door between your room and the next so you can hear their conversation and a lot more all night.(6) Your room is cleaned only once/week.  There is no info sheet on where you can find more towels, etc.  Nobody is there to empty your garbage that piles up.(7) The cafeteria access:  There are these *strict rules* that you have to abide by: you have to take off your jacket, you are not allowed to bring in your bag into the cafeteria for breakfast (i felt like I was in a boot camp)(8) There is NO refrigerator, microwave, no access to drinking water/ice anywhere on the floor (at least I wasn't told about it!)B. What I liked about the hotel:(1) The high-speed internet access (included)(2) The very friendly front desk staff(3) Amazingly good location to the subway (2 blocks away from St.Patrick's station), and major amenities in downtown.(4) Tons of places to eat around the hotelMy final advice:  If you can afford it, go somewhere else.  Some of the nicer hotels have similar deals.  Plus, I would much rather choose to stay in a nice B & B with private refrigerator & microwave at a much cheaper rate than at 89 Chestnut next time.  I cannot imagine going back there again...  So make your decision wisely!",
      "rate": 1.0,
      "tripDate": " October 2006"
    },
    {
      "title": "Horrible, Terrible, Worst - Running short of adjectives!",
      "text": "A total disappointment to be in this \"hotel\", if they like to call it. It caters to college students who stay there for a long time periods. It was shocking to see that authorities get away with such horrible rooms, service and decor. The room was not cleaning before our arrival and there was debri everywhere. The carpets had not been cleaned in ages and you are guaranteed to throw up if you dare to pick their common refrigerators on each floor. No tvs, no free phone calls to U.S., cleaning service available only one in 5 days. You have to go down to the front desk to collect your \"ration\" of fresh towels and soap every night. The a/c unit made loud noise and the worst pillows I have ever slept on. The mattress box did not have covers and the comforters looked unwashed. The elevators take forever to come up and down. The only good things about this place was the proximty to the city centre and the elaborate breakfast that was part of the stay. Other than that the hotel owners should be sued for the quality of service they provide to their customers. A total rip-off! Go across the street and you will find much better hotels for almost the same price. Pay more if you need to but do NOT stay here. You will thank me for this advice!!!",
      "rate": 1.0,
      "tripDate": " August 2013"
    },
    {
      "title": "Great Location, Good Hotel",
      "text": "The 89 chestnut is a very nice place to stay in Toronto providing you don't want the normal full hotel service. There is no TV in the room, nor is there any option for room service or cleaning. The hotel lounge area is reserved for students only as well, even in the summer. There is no pool at the hotel, well there is, but jumping in would give you an almighty headache. There is an excellent gym, which is free of charge. Also the breakfast is very good, plenty of seating in the resturant over looking a small park, bacon, susages, scrammbled egg, make your own toast, loads of different juices and a selection of coffees - plus fresh fruit, pasteries and cereal, couldn't ask for more really, limited choice for veggies though. The rooms themselves are, as a say, basic. We had two doubles, and it has to be said they where not very comfortable, quite \"scratchy\" sheets. There are two desks in the room as well as a phone with free local calls. The bathroom was very good and clean, bath and very powerful shower with a few comp tolietteries. The air con unit was reasonably good and didn't keep us awake unlike some other hotels I have stayed at. As somebody else has mentioned, the laundary is really designed for the students, however you can use it and we did, but you have to buy a non-refundable card for $5, and also you have to top it up with a min amount of $15, luckily as we had been camping we had a fair amount of washing however for somebody with one load it would be expensive. The location is by far the best thing about this hotel, CN tower is probably only 15 minutes walk, or there is a sub-station with a couple of minutes walk, also there is a street-car stop at the top of the road the hotel is on (less than 1 min walk). A few reasonable places to eat near by including a fairly expensive resturant just across the road, lots of chinese eateries near by as well and a pretty good medetarian take away. There is some very good shopping near by, including a square full of street entertainment and the huge Eaton Mall. I would throughly recommend 89 Chestnut to those travelling on a budget - $99 (Can) or around £49 per night including a full breakfast in Toronto during the summer is very good value in my opinion.",
      "rate": 4.0,
      "tripDate": " June 2006"
    },
    {
      "title": "This student residence/hotel is a wonderful bargain.",
      "text": "Two of us stayed right downtown for $99 (plus tax) per night. This included a fabulous all-you-can-eat breakfast spread (eggs, sausages, fruit, cereal, a dozen kinds of breads and rolls, several types of coffee, etc.). Parking was $23 per night in the public covered lot.  This is a dorm, so don't expect luxury (and our matress was not the best), but it's clean, safe, private, and wonderfully convenient to everything.",
      "rate": 4.0,
      "tripDate": " June 2006"
    },
    {
      "title": "Chestnut Residence",
      "text": "I was in Ontario for a family visit and headed back to Toronto for a day (August 9th) before flying home.  It was a busy weekend in Toronto and finding a hotel room for less than US$200 proved a real challenge because of several weekend events.  I found Chestnut Residence at an online booking site and it seemed okay with me.  The location is the principal advantage of staying here, coupled with the price. My single room charge with tax was about US$116, which included breakfast.  This is a student housing building for most of the year.  The common areas are worse for the wear and the room was cheaply furnished but clean.  There was no television nor wi-fi/internet service in the hotel.  Only one elevator was working that would take me to my upper floor and there was no elevator service down from the floor; I had to walk down to the floor below.  Breakfast service was school dorm-like; a bit chaotic.  But once I figured-out what the system was I found the food and it was plentiful.  The dining room, like the rest of the common areas, was worn and not particularly clean.  The residence building is well-located to take advantage of center-city/waterfront events/attractions.  I would only stay here again if there were no other choices available in the price range I was looking for.",
      "rate": 2.0,
      "tripDate": " August 2014"
    },
    {
      "title": "Worst service",
      "text": "Worst front desk ever. I call down to the front desk to let them know that the bathroom has no hot water and she said its not their problem. I then call couple more times and eventually went down to young Asian lady and ask to speak to her manager. Then she said my manager don't deal with guest and gave me the dirties look ever. However, I find the security desk guys way more helpful. That night pretty much made me wanted to pack my stuff and leave. Worst front desk but good price and location.",
      "rate": 3.0,
      "tripDate": " July 2013"
    },
    {
      "title": "NO advisable to considerate",
      "text": "Aug 9, 2011 We stayed for one week due to family event. It was very unfortunately and shameful that there was absolutely NO standard of cleaninless and NO repair maintenance monitoring and applied to the facilities. The room were very very dirty and layer of dust had shown on top of the furniture. Annoyingly, the water from the sink in the bathroom is always cold and rusty water is running out of the faucet.We paid $99.00 per night. We filed the compliant to the front desk and all they said to us is \"this is not a hotel. take it or leave it\"The photo shown on the web is totally different compared to seevery  on the site.Not worth of the consideration to stay at this \"89 Chestnut Residence\"",
      "rate": 1.0,
      "tripDate": " August 2011"
    },
    {
      "title": "First impressions can be wrong",
      "text": "Arrived here after a long flight from Ireland. Next morning, wife not feeling too well. I had breakfast in dining room, and tried to bring her some toast in our room. Stopped at lobby. No food to rooms, Sir. Argument. Toast brought to room. Wife recovers.This was a dodgy beginning to a week of sheer friendlines, competence, and top of the range value. The problem at the start was not of their making. Proper Canadian rules and regulations. That's really why we went there. Room was excellent. Location couldn't be better.  A/C a little noisy during the night...but a few beers and earplugs put paid to that. if you have loads of money, book a top hotel. If you are mid range, grab this.TOP TIP...Go for the full hot breakfast. Without doubt, the breakfast here is the best you will find in North America or Europe. If you are budgeting for food, have this breakfast, and add 10 bucks a head for a coffee and sandwich that evening. it really is that good.Thanks to all at 89.",
      "rate": 5.0,
      "tripDate": " June 2006"
    },
    {
      "title": "Student residence ",
      "text": "Student residence is the perfect way to describe the hotel \"services\" that 89 chestnut has to offer. Reviews down below were pretty accurate ei. Hallways smell like death, rooms are run down (especially the carpets), walls have holes, curtains have stains, bed sheets have stains and holes, washroom has peeling ceiling and rust, room smells a little bit better than the hallways but bring fabreeze! Both my girlfriend and I's allergies were highly affected by the dust in the room. The receptionists were not friendly but they could respond to our questions. I could go on all day about the rest of the bad things but let's focus on what this place has to offer that's good : the lobby looks nice but don't be tricked, your impression will change once you reach a floor. Location is awesome! Literally can't beat it, 5mins away from st Patrick metro and eaton centre 10min walk away. Also, many restaurants close by to have a quick bit. Last but not least, I was expecting the breakfast to be good but we were quite disappointed. We actually ended up skipping the breakfast and going to subway on the last morning of our trip since the pastries were stale, the eggs smelt horrible, the meats were really greasy, and the tables were quite dirty. The fruits were good nevertheless. To get drinks, you must go thru this gate that seems like it's for employees only as it was a bit confusing at first. Would recommend staying at chestnut if you are low budget travellers like us but honestly, don't know if I could spend another 246$ for 2nights at a dump like this even if the location is perfect.",
      "rate": 2.0,
      "tripDate": " July 2016"
    }
  ]
}