{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Chinatown Travelers Home",
    "url": "/Hotel_Review-g155019-d1944304-Reviews-Chinatown_Travelers_Home-Toronto_Ontario.html",
    "priceRange": "$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "1.5",
      "reviewCount": 76
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "31 Grange Ave",
      "addressLocality": "Toronto",
      "postalCode": "M5T 1C6",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/07/5b/86/32/chinatown-travelers-home.jpg?w=500&h=-1&s=1"
  },
  "description": null,
  "featues": [
    "Paid private parking on-site",
    "Free High Speed Internet (WiFi)",
    "Internet",
    "Baggage storage",
    "Non-smoking hotel",
    "Express check-in / check-out",
    "Private check-in / check-out",
    "Laundry service",
    "Air conditioning",
    "Family rooms"
  ],
  "reviews": [
    {
      "title": "Worst night of our lives",
      "text": "Unfortunately this was the only place that would take us without a credit card.Clean room yes but the room was not air conditioning and the windows would not open, there were no air vents in the room for air circulation. We came into the building at 130am, a man was standing outside talking on his cell phone, he began to record or take pics of us. My daughter asked him to stop and he proceeded to follow us to see where our room was. We got no sleep , loud people in the building and honestly did not trust our safety in this place. Never again will we stay here, it was like being in a prison cell. Cheap ya but not worth your safety.",
      "rate": 1.0,
      "tripDate": " May 2024"
    },
    {
      "title": "GO ON COUCHSURFING, this place is terrible!!",
      "text": "Worst hostel I have ever been to...It is very dirty and the staff is so unwelcoming. Moreover, they are scammers, they made us pay more than the girl sharing the same dormitory on the same night, and she had arrived at the same time.... they found tons of excuses when I approached them with that before yelling at me \"you can leave if you are not happy\". They also have tons of cameras in the house to check that you don't bring anyone and they very aggressively warned us that if we bring anyone we will be charged...They are very mean and disrespectful people.On top of that they came in the early morning and started shouting in chinese very loud in front of our door which woke everyone up. They should be spending their money on cleaning instead of cameras as it is very dirty.... they didn't even change our sheets from the person before and the duvet didn't even have sheets!!!!Please, save your money or spend it somewhere else, where people deserve it, this is just a disgusting place (don't even go to the washroom, you will be sharing it with spiders, bacterias, and other insects and even the dirt from the 100 people before you).",
      "rate": 1.0,
      "tripDate": " March 2014"
    },
    {
      "title": "Chinatown Travelers Home",
      "text": "31 Grange Avenue, Toronto--one of the 3 location of Chinatown Travelers Home.I stayed one night in May, the price was cheap, but the room was terrible!The bugs all over the bed, I can't sleep whole night! A really bad experience I had there.",
      "rate": 1.0,
      "tripDate": " May 2013"
    },
    {
      "title": "Simple place to lay your head but needs some work.",
      "text": "I have read previous reviews and most bad i think it is due to your expectations and i will have to agree with some of the problems mentioned. The main reason one person would pay a different price for the same room  for a different bed is that every booking site has a slightly different price so it is very possible that each will pay more than the other.I had to text a number to check in the man showed up and was quick and fast as they do not live on the property i did have to pay  50.00  damage deposit on my credit card  was told for a key deposit  and damages.When you arrive you are asked to take off your shoes and boots and are given slippers or sandals to wear  i do believe this is a culture thing.I just grabbed my shoes and brought them with me to my room nothing was said.They have a fridge with water in the main front part of the house in which you can buy as well as snacks  they go on the trust system for payment. The man was nice to me he helped me with directions as to where i had to go. later that night i went on a small walk around of the property. 3 floor house, rooms on all floors kitchen in basement and a small laundry room. My room was clean but desk needed some paint and refreshing, fridge in my room needed some cleaning  as well microwave was fine i was on first floor.They have a piece of wood with nail to hang your coats etc, why not go to dollar store and get a few plastic coat racks would make room look much better. Bathrooms very run down tile on the floors falling apart and cracked towel was put on it to prevent from stepping on them a few couple strips of laminate or bamboo would fix that problem very cheap to do. The vanity and walls needs a fresh coat of paint to make it look fresh and clean. the toilet paper is tied down with a bicycle cord so i would assume people are stealing them.  the small changes would make a world of difference. The kitchen is there but no dishes or anything to cook with not even paper plates or a plastic cups. Very dirty need cleaned more and a fresh coat of paint on the cupboards wouldn't hurt either. There is a tv in the kitchen but not hooked up or anything just siting there unsure why. They should take one of the bedrooms and turn it into a sitting room for people staying there. laundry room is simple $2.00 per load. More dusting and cleaning is necessary to keep this place a float.The dorm rooms have a fridge and tv but not the private rooms. the walls are thin but that's not so bad. The have cameras in main part of the house for security some find this a bad thing i feel it is good since the owners do not live there and i am a female like others travellers alone.I do not like the way you hand in the key just put it in a container by the front door and waive at the camera. I feel it needs some tlc and would be a much better place if they would do so. Also keep in mind they have another hostel on dundas st. The location is good and close to major ttc and a ton of restaurants. and within walking distance to the main greyhound / mega bus terminal. SO to finish off if you are looking for a place to just lay your head and nothing else and money is a serious issue then you would be okay here.Cheers",
      "rate": 3.0,
      "tripDate": " April 2015"
    },
    {
      "title": "Stay away!",
      "text": "This was the worst experience in customer service I have ever had. We booked a private room with a private bathroom and weren't expecting much for the price-we just needed a place to sleep at the end of the day. And we didn't even get that! We arrived and waited at least 1 hour for someone to come check us in after calling them. When they did arrive they said that they did not have a private room with a private bathroom available as it was first come first serve and the reservation didn't matter. I said we would take a shared bathroom so the man who had come to check us in called the owner to confirm that was okay. The owner said he was saving the room for someone else so we could go to one of his other properties in the area. Again, I said that was fine. At this point we had been waiting for at least an hour and a half. I asked the man who was checking us in how long this would take as we had tickets to a play that night. Although I was annoyed at this point I was as polite as possible as I just wanted to get the check in over with. The man then called his boss back and said that I wanted them to hurry up in a sarcastic tone that made me sound like I had been very rude to him. When he got off the phone with his boss he said he had to go and would be back in a few minutes. We waited another 30 minutes and when he didn't come back, began looking for a new place to stay as they didn't seem to have a spot for us and we were tired of waiting. Once we found a place I called them back to inform them that we were leaving. I explained what had happened and that this had been the worst customer service I had ever received at any hostel. The owner did not apologize, just said \"whatever \" and hung up on me. I can't comment on the quality of the room since I never saw one. But I don't believe this is anyway to treat paying customers, no matter what the price",
      "rate": 1.0,
      "tripDate": " April 2015"
    },
    {
      "title": "Nightmare.",
      "text": "Don't. Just don't. If you're reading this, get off the page. Do not. Even. Consider. IT. My boyfriend and I booked a room here because it was the cheapest alternative for new years eve that wasn't $300. We got a room (which i'm pretty sure was supposed to be a double bed) that came with a tiny single bed, and what was supposed to be a private bathroom. I guess their definition of a private bathroom is a toilet and shower stuck in one corner WITHOUT a sink. I feel like I need to scrub myself down after just thinking about the fact that I spent the night here. My boyfriend who is an avid traveler and has used many hostels in the past said that it was the worst one he has ever been to. That's saying something for him. It was new years eve, therefore I was expecting it to be noisy, but there is zero sound proofing at all (not like I was expecting it) and we could hear drunk girls downstairs screaming and laughing all the way from the first floor (we were on the third.) You have to take your shoes off as soon as you get in the door, and were almost denied bringing our shoes upstairs. I really didn't wanna leave my shoes at the bottom when someone could steal my good shoes. Just don't. Just don't do it. DONT. Is there anything good about this hotel? You could argue location, close to Kensington market and somewhat close to St. Patrick station, besides that? Price, maybe. But that's it.",
      "rate": 1.0,
      "tripDate": " January 2015"
    },
    {
      "title": "Run! Don't come here!",
      "text": "We arrived as a girl ran from the place screaming”I won't stay” Our room--3 beds squished together with a fridge?we found stained mattress protectors,a ground floor sliding window that didn't close,filth in the fridge& surly staff who informed us we needed 48h to cancel(website saying 24)& keys held together with a dirty hair tie.Beds were awful&only clothes storage was a series of nails hammered into the walls.The WC was horrible;the only cleaning was the shopping-bag-bin on the towel rack, beside the stained toilet rolls on a bicycle chain,. \"cable TV\" was a few channels, powered from the most loose fitting outlet Ive ever seen.  Not getting electrocuted was the highlight of my stay.Woke often by inexplicable fridge screeching to life randomly.  Why this was even in our room was a mystery--there was no way to prep food.1rule to remove your shoes&put on filthy communal flip-flops; though most shoes at the door were flip flops. Should you sleepily forget to take off your shoes, staff barge into your room behind you&chastise you like you forgot as an insult&not because there's no light in the porch where the reminder hangs. If I was doing it again, i'd sleep in subway.",
      "rate": 1.0,
      "tripDate": " August 2012"
    },
    {
      "title": "Worst ever",
      "text": "We first arrived at this hovel to be met by a what you could call a cleaner receptionist who had an earpiece in her ear talking to I don't know who, trying to sign us in. We were ordered to take our shoes off even though she was wearing some herself. We were shown to our room which I can best describe as a box with a small double bed,  a table and food up chair. The room stunk of stale feet, upon closer inspection the duvet had stains on it. There was no wardrobe for us to unpack our suitcases so we had to live out of our suitcases. There was no tea or coffee making facilities. No iron or board. To move onto the bathroom very poorly fitted and very dirty, hairs from other users all in the basin and shower tray, very dirty and could smell the drains coming through the plug holes. There was no bins in the room to put rubbish in. We stayed here for 9 days due to budget we could not afford any thing else but what we payed you would expect certain standards. We hired a car too and when we booked was not told of extra payment for a random parking space that was allocated to the hovel. Which was $120 for the time we were there. Was very surprised that there was no night manager on site as the amount of noise coming from other rooms was hideous from furniture being moved in the room above ours. To a couple making out in the room next to us to general doors being slammed at all times of the night and people using the laundry space opposite our room. The lady who dealt with us was miserable and rude with no interaction with the guests she was happier taking your money and disappearing. We had to ask for clean towels after the 5th day of being there and have to ask for the room to be cleaned which in any lodging establishment whether a hostel or hotel cleaning of a room should be done as standard daily! This place was a disappointment beyond my wildest dreams. I will NOT be coming here again and have been in touch with the  tourist board in Toronto to complain which we have been told numerous complaints had been made!!! Please avoid people I wouldn't even board a tramp here let alone anyone else!! Plus the list of stuff they had on the wall if it went missing was just ridiculous, Wasn't even worth taking!!!",
      "rate": 1.0,
      "tripDate": " June 2018"
    },
    {
      "title": "A fraud",
      "text": "This \"dump\" on Grange st. In chinatown Toronto is a dump and should be condemed.They call it a hotel or inn, it does not qualify as either.I booked a room here and when I showed up, it was nothing like we saw pictures of on booking.com. First, the neighbourhood is terrible.The exterior looks like an abandoned house. Once you enter, you are met by a stange.Then they have trash seating allover the entrance...a garbage bin, cooking pots, some lumber for some odd reason then supposedly that is their frontdesk.This is more like a rooming house with up and down beds in some rooms and more than one bed in the rooms... No room between each sad looking odd kind of bed... I wonder where they bought those beds...metal beds with what looks like home made matresses thrown on.Bed was not made and the lady says \"here is your bedsheets and towels\".We said we are not staying...then she says if we didnt like that room, come over and see if you like this other one...she takes you over next door to another dump and shows you same mess.Rooms have some wooden backyard doors with weired looking locks...some look like were broken before then fixed maybe by the son of the owner.They ask you \" remove your shoes\" and that is about the only english statement they make very clear.We cancelled, and they refused to refund our money.We still left.Bottom line-this place may be the closest downtown cheaper place but if you want to feel sorry for yourself, go ahead and book...they say seeing is believing.Also, I think they are same \"hotel\" as \"university apartments\" hotel that i also saw on booking.com.... This is the name that showed on my card bank statement.If you dont trust reviews, this maybe the first you want to believe... Or be a doubting thomas and go \"feel\" and touch for yourself to believe. SAD.",
      "rate": 1.0,
      "tripDate": " August 2016"
    },
    {
      "title": "Honestly! You get what you pay for.....",
      "text": "The Manager, Caretaker or whoever is in charge is very strange. My first impressions were not a great start. I walked into the front room (Used as a reception from what I could gather) greeted by an older gentlemen’s butt crack as he was leaning over trying to fix something on the floor. This scenario continued for more than 5 minutes before I came to the conclusion that this guy was probably a repairman and not an employee of the hostel as he continued to ignore my multiple attempts to speak with him or even to get his attention. There was a large sign on the wall saying pick up phone if desk is unattended. Considering we had spent almost 10 hours driving that day all we wanted was to get to our room. As I went to pick up the headset the gentlemen got very agitated and proceeded to tell me that the gentlemen on the other end of the phone can’t help me and he seemed very angry that I tried to use the phone repeating again and again and again “I’m the Manager, he can’t help you but I can” this speech went on for minutes and in the end I had to ask him if he was going to check me in or not because my wife (who is seven months pregnant) needed to sleep (as it was late).He kept mumbling for a few more minutes before agreeing to give me a room key and then decided it was a good time to try and make me feel guilty for showing up so late because he was wanting to go home for the night even though at this point he had wasted 15mins trying to check us in. also I might add that they’re signage stated that they’re reception was supposed to be open for another 30 – 40mins As we were traveling with a car we paid extra for an overnight parking spot, we discovered this parking spot was actually on the street next door at an old abandoned hairdressers. GREAT!! Super secure!! Do you really expect us to pay for this? It’s not even your property it’s parked on!!All this before we even got to the room.Rooms weren’t too bad, you get what you pay for. Typical backpackers and good if traveling on a budget, beds pretty uncomfortable but I’ve stayed in worse.The shared bathrooms were pretty disgusting, one had the trash kicked over with used tampons spread across the floor and it was still that way the next morningI probably wouldn’t stay here again",
      "rate": 2.0,
      "tripDate": " August 2015"
    },
    {
      "title": "Get what you pay for location very good",
      "text": "Recently spent a week in the hostel in a private room with private bathroom. Outside of the building did not inspire confidence really needs some work. Arrived for check-in and had to wait only 10-15 minutes for someone to arrive. On check-in no explanation of what if any facilities on site. Was asked to remove shoes before going to room no issue with this. Room itself was basic as I said you get what you pay for there was a double bed desk and chair in room bathroom had shower sink and toilet. Room was clean with a fan provided  for keeping coolLocation was ideal everything walkable from hostel. If not planning on spending much time in your room place is good for a base",
      "rate": 3.0,
      "tripDate": " July 2017"
    },
    {
      "title": "Not recommended at all",
      "text": "Small, dated, worthless staffs and service Ok so u want to open a franchise of hotels in downtown Toronto and want people to stay? Keep staffs who can communicate with them. The staff whom we first met could not speak a word w/O Google translate. Then they moved us to a different building from where we were supposed to stay! From 31 grange avenue to 16 willison crescent. Good thing it was close to shops, malls and bus stops. That two stars Incompetent staffs. Rooms R small, there's a fridge that doesn't work. No place for keeping luggage as the room is occupied by beds! Mouse trap in room- of course there R mice then. Washrooms R small and uncleanNot recommended at all if u R staying with family. Solo visitors- good place to stay for a night or two",
      "rate": 2.0,
      "tripDate": " June 2017"
    },
    {
      "title": "Price and location was the only good thing.",
      "text": "Room was small but it matched the price. The location was great. Chinatown is worth a visit. Room was not clean. Rubbish from previous guests were under the bed. Cleaning staff spend more time chatting and laughing in the morning than cleaning.",
      "rate": 3.0,
      "tripDate": " March 2017"
    },
    {
      "title": "Price and location was the only advantage",
      "text": "The only thing that had an influence on my choice was the price of stay and location. Our room was pretty clean but my friends weren't so lucky. If you're spending 1 or 2 nights you can easly bare with this place but if for longer, better look for something else.",
      "rate": 2.0,
      "tripDate": " August 2016"
    },
    {
      "title": "Don't even bother with this place!",
      "text": "I can't believe I paid good money (and way too much of it) to stay in what amounted to a crappy hostel in someone's basement. I've stayed in better hostels, and have paid less for very nice hotel stays in Europe. The staff was unhelpful, we shared a washroom with others, we basically had a lousy room in a dingy basement that should have like 25 bucks a night. Also, they make you take off your shoes as if you were a guest in someone's home. I know it's Chinatown, but come on! Also, all the signs saying that you'd be charged (overcharged!) for everything hardly made me feel welcome. Never again! The only things I can say in this place's favor are that it wasn't completely dirty and that the location is nice if you want to see Chinatown and Kensington Market.",
      "rate": 1.0,
      "tripDate": " September 2016"
    },
    {
      "title": "Worse thing ever",
      "text": "Im really disappointed from my experience. My room was dirty there was not hot water for taking a bath. The neighbourhood is unsafe i parked my car in the back yard all my stuff in my car has been stolen which had a value of more than 500$ just the location was great just couple of minutes far away from the downtown!",
      "rate": 1.0,
      "tripDate": " August 2016"
    },
    {
      "title": "HORRID SERVICE",
      "text": "Came here for a one night stay as it was close to the clubs we had in mind. Never had such awful service.   We waited almost 30 minutes after picking up the phone line to ask to be checked in. Finally the guy shows up and doesn't even have our info correct. Thought we were there for 2 nights and it was one. He kept trying to tell us two and I kept saying no its 2 guests one night. Not 2 nights.  Guy wasn't even polite. Gave us the machine and we paid 150 for a room that was the size of a shoebox. Also couldn't find anywhere to get ice at all and there are no attendants on duty if you need something.  We will not be back.",
      "rate": 1.0,
      "tripDate": " July 2016"
    },
    {
      "title": "Not clean",
      "text": "The one good thing about this hostel was the location! Right downtown and near everything!If you aren't planning to spend much time during the day here it's fine. Bathroom is really really dirty and doesn't get cleaned well or often. Very loud in the hallways at night. But it is very cheap so for the price it isn't terrible.",
      "rate": 2.0,
      "tripDate": " September 2014"
    },
    {
      "title": "One of the best hostels",
      "text": "The staff is friendly and helpful and its a cheap place to stay. It's also located within chinatown where you can get many good finds for eating. Short walk to downtown. Public transportation nearby. Kitchen was small and ill equipped and could've done with basic cleaning facilities in wash rooms. Quiet street. the rooms were clean. I would definitely stay there next time i go to Toronto.",
      "rate": 4.0,
      "tripDate": " April 2012"
    },
    {
      "title": "Cheap but Nasty",
      "text": "This was by far the most disgusting place I have ever stayed.  It was very dirty, my room (private with 2 singles) smelt of urine, had peanut shells/food all over the floor when we arrived and was infested with flies.  There is a kitchen but you are not allowed to use it.  We stayed here because it was the cheapest place in Toronto and it has a really good location.",
      "rate": 1.0,
      "tripDate": " July 2012"
    },
    {
      "title": "Worst \"hotel\" ever",
      "text": "Worst \"hotel\" ever and it's not even that cheap. The locks to the front door didn't work so I felt unsafe. The room was a complete mess and not what we had booked. Unfriendly staff who didn't care or listen. Good location. I wouldn't recommend it to anyone.",
      "rate": 1.0,
      "tripDate": " June 2017"
    },
    {
      "title": "Horrible ",
      "text": "Stay away. As soon as you arrive there you'll know you booked in into a major disgusting place, as you see the facade of the facility. The rooms are not soundproof at all and I had to spend the night listening to my neighbor couple have \"way too much fun.\" The poor hygiene is obvious, sheets and towels are dirty with nasty spots all over them. Also I had to sleep in my room with boxes of I have no clue what, and the only drawers the room had were full of dirty papers. This is not even worth it's money, it nearly shattered my beautiful, touristy perception of Toronto.",
      "rate": 1.0,
      "tripDate": " July 2017"
    },
    {
      "title": "Ambivalent opinion",
      "text": "This is a weird place but I expected it. It \"feels\" unwelcoming, unfriendly, awkward, filthy. But it isn't too bad once you sink in. You get puzzled about how to communicate with the absent hosts, frazzled by the obligatory shoe removal before getting in. The narrow corridors, the \"poor\" looking everything. But... once in the room, you have a firm comfy bed. White walls. Nothing to decorate. Nothing superfluous. Just 2 cheap towels and clean looking sheets. It feels suspicious and a bit disgusting but also clean in a way. I was alarmed by previous reviews about bed bugs but I turned my room upside down and saw no trace of it whatsoever. The ceramic floors, white contour matelas cover and unprinted bed sheets make it easy to spot anything uspicious. I awoke several time at night to check and no bed bugs.. To be honest, the location is so perfect that I would take my chances and book it again. The wifi is good, it wasn't noisy when I was there for 2 nights. It is for young people who aren't expecting anything other than a place to crash for cheap and in a great location. The place does offer this.",
      "rate": 3.0,
      "tripDate": " October 2015"
    },
    {
      "title": "Exactly what we expected for our money!",
      "text": "We only booked 2 nights to start with as we were a bit cautious of past reviews. We did have to wait a while for someone to meet us at the house but it was easy to find. We had booked a 2 person private room and the ended up taking us to another building a few blocks away. There are absolutely no extras here so don't expect them, however if you are looking for a clean room in a great location for $50 a night then this is your place. We had an attached bathroom and the manager bought us a fan as it was quite hot. We stayed 4 nights in the end. It was all we would expect for the price and we would stay again.",
      "rate": 3.0,
      "tripDate": " September 2013"
    },
    {
      "title": "Never more",
      "text": "We came first night and they didn't have room which we reserved, so we got \"discount\" and shared room in different house.. Bathroom was ugly, but the room was ok... Next morning i found the cocroach in my bed... We try to get refund for the second night, but only thing we got was an email adress.. After couple minutes of complaining we got another room in different house.. Finally the room was clean, but shower and toilet in the same room as beds. I'll never visit this hostel again...",
      "rate": 2.0,
      "tripDate": " August 2012"
    },
    {
      "title": "DO NOT BOOK",
      "text": "Myself and a friend booked this hostel whilst backpacking round northern America.We arrived in Toronto after an over night bus journey from New York City. We found the Chinatown travellers home in our tired state and was told that our room wasn't ready, so we went to sleep in the park at the end of the street until 3pm. We went back to the hostel at 3pm when the woman told us that the room still wasn't ready - she told us to come back at 5pm. We returned to the hostel at 5pm to be told that there wasn't a room for us and they had overbooked. There were also 8 other people stood on the doorstep of the hostel with us, who also had nowhere to stay.We were told to get on a bus out of town to an area called York. We said that we wouldn't get on the bus because we didn't know where we were going. An hour later a car pulled up and took us to York ... all in all a DREADFUL EXPERIENCE!!!! DO NOT BOOK!!!!",
      "rate": 1.0,
      "tripDate": " August 2010"
    },
    {
      "title": "Never again",
      "text": "Upon arrival I was informed I needed to pay tax on top of what had been agreed at reservation. Having read different reviews, I was expecting that. I asked to see the room before I paid and I was shown a room with no bathroom. I said I booked an en-suite and after a short discussion between 2 members of staff, I was shown to a room with a private bathroom, microwave and fridge. There was also a clothing rack and a TV in the room. The bed consists of a firm mattress placed on top of two wooden pallets. I was given two pillows and a sheet, no duvet. I was very cold at night (end of March) as the heating would switch on for a couple of minutes only a few times a day.The bathroom floor was covered in hair and mould in the corners. There was a horrible smell coming from the plugholes. Room floors were also covered in hair, so it seems they never clean after their guests. So if you book it, be prepared to clean it yourself. Unfortunately they do have bed bugs as I suffered a lot of bites all over my body, including face. Not good.Good points:- 10 minute walk from downtown- hot water all day long- fairly quiet location- fridge and microwave provided in private rooms- good wi-fi connection- telephone provided in the roomBad points:- dirt and smell in the bathroom- bed bugs- staff with limited Engish and not very pleasantI never used their kitchen, so can't comment on that. I'd say if you need to save money and are looking for a place to stay for a night or two, go for it. Any longer than that, you may want to book somewhere else. All in all not a pleasant experience.",
      "rate": 1.0,
      "tripDate": " March 2011"
    },
    {
      "title": "Excellent customer service",
      "text": "Just wanted to say that the manager of this hotel was fair in sorting out a reservation conflict we had in the summer of 2018. The manager, Justin, was fair in settling the mistake we had made. Thanks",
      "rate": 4.0,
      "tripDate": " August 2018"
    },
    {
      "title": "Clean",
      "text": "This place has clean beds and gives you what you pay for. Laundry is also available in the basement. The biggest problem is the staff who are unfriendly and don't really have an ounce of decency about them. To the creepy guy who tries to hit on  female guests to the Chinese lady who doesn't want to communicate in any language. If they were a bit nicer to their guests and showed some hospitality this place would be higher. They also double charged me for a nights accommodation but refunded after I contacted them. No apology or reply to my email, how much effort would that take. However if you want a cheap clean bed in a decent location and you can put up with a bit of rudeness this place might just suit you. Our friends stayed in the rex hotel nearby and they got much nicer rooms and service for the same price.",
      "rate": 2.0,
      "tripDate": " August 2018"
    },
    {
      "title": "Better home",
      "text": "Chinatown Travelers Home is a bit better for someone passing by within the city of Toronto, Trial will convince you and the level of resources available for you to enjoy your stay will be provided if asked",
      "rate": 3.0,
      "tripDate": " August 2017"
    }
  ]
}