{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "City*Stay Condos - Simcoe Street",
    "url": "/Hotel_Review-g155019-d14798012-Reviews-City_Stay_Condos_Simcoe_Street-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.0",
      "reviewCount": 4
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "168 Simcoe St",
      "addressLocality": "Toronto",
      "postalCode": "M5H 4C9",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/13/ae/05/4c/photo3jpg.jpg?w=500&h=400&s=1"
  },
  "description": null,
  "featues": [],
  "reviews": [
    {
      "title": "Experience with owner",
      "text": "I booked this place through booking.com back in December and was confirmed for February 29th.  Mike even replied and told us to let him know 10-15 minutes before we arrive to let him know so he can meet us to bring the keys.  Three days before our trip we receive an e-mail letting us know that our reservation is cancelled due to overbooking.  How do you not know that in December.  Now we are stuck with trying to find another place in the same vicinity because we are travelling by train and have that and theater tickets paid for.  THREE DAYS BEFORE????  Nice....people beware.  If I could give 0 stars I would",
      "rate": 1.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Schönes Appartement in guter Lage - Parkplatz inklusive ",
      "text": "Wir hatten zu viert ein schönes Appartement mit einem Schlafzimmer und einen großen Wohnzimmer mit zwei ausziehbaren Sofas. Die Küche war komplett ausgestattet. Ebenso das Bad. Es gab sogar Shampoo und Body Lotion. Alles war sehr sauber. Der Parkplatz in der Tiefgarage ist im Preis inklusive. In der Nähe gab es einen Supermarkt, Starbucks und auch Restaurants. Wir bekamen Restaurant Tipps und viele weitere Infos. Ich kann es auf alle Fälle empfehlen, auch, wenn es nicht ganz billig ist.",
      "rate": 5.0,
      "tripDate": " August 2019"
    },
    {
      "title": "Well equipped apartment",
      "text": "City stay condos is located in Toronto downtown so it is accessible to all main attractions of Toronto.  Supermarket is very closed and biggest mall is walking distance.I arrived about 2:00pm and I was extremely exhausted however reception security was able to contact Mike and apartment was almost ready Anyhow I just had to wait for about 15 minutes. However I was able to store my luggage’s  temporary.  Then mike comes and explain clearly and detail enough about apartments and services.It is service apartments fully equipped. It is one bed and setting room with kitchen and one bathroom Kitchen is fully equipped with electrical stove and dishwasherBathroom is small but it is well equipped and very clean Setting room is also equipped with TV and stero. Also dryer and washing machine with ironing What did I like ?- well equipped - Very clean - Helpful staff - Location - Free WiFi- Free car parking What I did not like - An expensive - Bathroom shower no adequate pressure it was hard to have shower - Room is so small but apartments is decent - 4 max can fit in this apartments- No daily cleaning - Last day wi fi is disconnected Will I recommend this apartments - yes sure it is excellent apartments",
      "rate": 5.0,
      "tripDate": " July 2018"
    },
    {
      "title": "Cancelled on us last minute after we arrived at the property",
      "text": "Booked this place via Booking.com. Called beforehand to confirm the checkin time. Property owner informed us that we could check in anytime after 3pm but to call him 15 minutes before.Before we arrive I received an email stating that the property owner was unable to charge my card. The email gave me the option to update my card, which I did. I called the property owner who didn't pick up and then called Booking.com who managed to get in touch with the property owner and informed him to attempt to charge my card again. I subsequently called Booking.com again to confirm that everything was ok and this was the start of the property owner refusing to answer calls from both myself and Booking.com.I proceeded to the property and called this owner to get the keys to the apartment but he didn't pick up. We then talked to the concierge and asked him to call the owner, he picked up straight away and told the concierge to tell us to call him. We called again and no answer. The owner was refusing to answer the phone to us.We called Booking.com again and informed them that the property owner was not co-operating with the booking. This left us in a very awkward position as we had to find another place to stay with very little notice.Booking.com informed us that the property owner believes our card was from Brazil, later he changed his story to say US and that he couldn't charge the card (our card is from Tangerine issued in Canada). Later he claimed he called my bank and was able to place and authorization on my card, conveniently the next day after we left.I can't be sure of the reasons behind the property owner's actions but I guess this is because they either double booked (common if listed on multiple platforms) or they wanted the property for themselves on that day (this is common with AirBnB).Booking.com would not allow me to leave a review to warn people so here I am.I'm preparing to file in Ontario small claims court to claim the difference between the cost of this place and the place I had to book in the lobby.I would avoid this place at all costs and I would avoid Booking.com as their customer service has been pretty poor.",
      "rate": 1.0,
      "tripDate": " November 2018"
    }
  ]
}
