{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "College Backpackers",
    "url": "/Hotel_Review-g155019-d288553-Reviews-College_Backpackers-Toronto_Ontario.html",
    "priceRange": "$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "2.5",
      "reviewCount": 93
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "280 Augusta Ave Near the intersection of College St & Spadina St",
      "addressLocality": "Toronto",
      "postalCode": "M5T 2L9",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/07/27/27/df/global-village-kensington.jpg?w=500&h=-1&s=1"
  },
  "description": "The College Backpackers is located in the heart of Kensington Market - one of downtown Toronto's most authentic and upbeat parts of the city. Steps away from restaurants, cafes, boutiques, nightclubs, and outdoor markets, The College Backpackers hostel provides its guests with both a relaxing and enjoyable stay. It is also centrally located near all of the best tourist attractions such as the CN Tower, Harbourfront and the University of Toronto. We have private rooms which can accommodate between 2 & 4 guests. In addition, we offer dorm style accommodations with special female only dorms as well. With the recent renovations to our building, affordable prices and entertainment, the hostel is backpacker friendly. Guests can enjoy free internet access, free cable TV, and much more. We offer the best value for single overnights, weekly or monthly accommodation for travellers and students visiting the city. The staff is committed to providing you and your friends with a fun and friendly environment. We offer our guests the opportunity to explore Toronto and other cities, like Niagara Falls. With the no curfew or lock-out feature, the excellent location and affordable prices, we have become a popular choice for travellers.",
  "featues": [
    "Parking",
    "Free High Speed Internet (WiFi)",
    "Wifi",
    "Free breakfast",
    "Non-smoking hotel",
    "Shared bathroom",
    "Shared kitchen",
    "Shared lounge / TV area",
    "Non-smoking rooms"
  ],
  "reviews": [
    {
      "title": "Basic but good location",
      "text": "Stayed here 3 nights as Toronto is soo expensive. It’s super basic and not gives only the bare minimum but it’s safe, the bathrooms are clean enough (although non working on my floor so had to go to the third floor). If it’s just a place to crash then it’s absolutely fine and in a great location. I was a solo female traveller and was fine here",
      "rate": 3.0,
      "tripDate": " September 2021"
    },
    {
      "title": "Experience is made by the people you meet there",
      "text": "I've seen some terrible reviews of this hostel from various sites, and I have to say in my experience it wasn't that bad. I stayed here for 10 days with a small break in the middle when I crashed on a couch. It was what I expected from hostel accommodation. I stayed in a 4 bed female dorm which was clean and had comfortable enough beds, there was a small balcony which is standard in all rooms which offers enough standing room for 2 people at a time. Pros- good free breakfast included each morning- accommodating staff- excellent location in the heart of kensington marker- low costCons- broken safes in room- communal shower area (I prefer a locked shower)- some undesirable residents, probably due to low cost and no staff at night- a dodgy entry system which broke occasionally Though the hostel could benefit from better management of the whole place i.e. repairs/a focus on backpackers/any hostel activities, I made some excellent friends here.",
      "rate": 3.0,
      "tripDate": " May 2017"
    },
    {
      "title": "Dishonest and deceptive tactics",
      "text": "I don't think this review should affect you if you're staying for a few nights, just know that internet rarely works, and at a very slow speed. if you're staying longer, keep reading.I spent 3 weeks in this hostel, only because i paid for the entire period in advance. I am very disappointed and would not recommend this place unless you are looking for the most basic accommodation at a hotel price.Cons :The staff uses deceptive tactics to lure people in. They're displaying high prices online and then offer a lower price on the phone to make it look like they gave you a good bargain, but it's far from that. a quick search for short term rentals on kijiji will reveal that 25$-35$ is the daily price for a private room, not a bed. Some people who had the same accommodation as me paid less, others paid more. I don't like this type of deception.This is what they claim before you come, and next to it are my remarks :- \"the hostel is full let me check if there is still room\", most rooms are empty, and those which are not are hosting old broke people on monthly rates.- \"we have internet\", that's a big lie, the internet is very bad, if you can check email and open facebook within the same hour, that's an exceptional day.- \"we have free breakfast\", the free breakfast is indeed a joke, plain cereal, milk, bread and spreads. i have never seen more basic.Further remarks :The rooms are very basic, really really basic. I was in a private room, it had a bed, period. a bed, the floor, and the walls, literally nothing other than a bed. i had to put all my clothes on the floor.The kitchen material is very cheap and old, I bought my own kitchenware to cook.The hallways and toilets get very cold when it drops below zero.Pros:- Clean.- Location (although not necessary, Toronto is pretty big so you still have to use transportation. you're better off finding a cheaper place located near a metro station rather than focus on downtown).- I met some nice people in the hostel (but they all said they don't recommend it).",
      "rate": 2.0,
      "tripDate": " January 2015"
    },
    {
      "title": "You will hate yourself for eternity if you are staying here",
      "text": "I guess you get what you paid for, but this hostel is probably the worst hostel I ever stayed in. The shower curtains were moldy & unhygienic. Always an awful smell in the shared restrooms & kitchen. There's a sign in the restroom stating that all used toilet paper must not be disposed into the toilet, so imagine the smell of accumulated poop unattended for days!Didn't see other guests & the front desk was always unattended during our 4-day stay. It was supposed to be opened at 10am and closed at 8pm according to their website, but I only saw it being opened for once during our stay (which was when we were checking in). The staff who checked us in was alright and friendly. That being said, the service is almost nonexistent as they never picked up the phone and they would most likely be unavailable after 8pm.We stayed in the so-called \"Deluxe\" Double Bed private room (the largest room they have) but the room is really dirty. It almost feels like they haven't been cleaned for a while. The chair is flimsy and we are most certain that the TV is broken. It was 0C outside & our heater in the room is barely working, we end up sleeping with our down jackets since the blanket was as thin as a bed sheet.The free breakfast promised by the website was nonexistent, apparently they stopped offering breakfast for almost a year (which I am sure that this is definitely false advertising!) The kitchen is super gross as there is a pile of dirty dishes unattended in the sink for days, and there's dead cockroaches and trash in the fridge.Despite situated near UoT and Chinatown, the nearby area is very sketchy with lots of homeless wandering around. It was noisy after midnight as well so I would definitely recommend staying in a hostel that is far away from the city centre (as Toronto transportation is actually pretty convenient). The hostel is not the most accessible place ever as you do need to transfer to a bus after getting off from the underground. It is pretty closed to Kensington Market so plenty of food options available.Unless you are very broke or a huge foodie, I would not recommend this hotel at all. I'm glad that I went there during the winter since other reviews are saying that there were cockroaches during summer - which does not surprise me at all. But yeah, find a better hostel in Toronto. Don't waste your money here and bother that small difference in room rates. My friend stayed in a different hostel (which is CAD$30 more expensive per day) but the experience was way better than mine. Don't make the same mistake like me, book a different place for goodness sake.",
      "rate": 1.0,
      "tripDate": " November 2021"
    },
    {
      "title": "Unprofessional Manager and Staff!!!",
      "text": "Booked a room for this hostel and after a long day of travel we had the front desk agent tell us there was a problem and to wait for the manager... 45 minutes later the manger shows up telling us its not his problem we don't have a room and that he could do absolutely nothing for us (i had a confirmation email of my booking) which left us stranded in Toronto for the night as the other hotels were booked up due to it being the first weekend of summer... I DO NOT recommended anyone to stay here ever!!You will get more bang for your buck and have a far better experience on Airbnb.com",
      "rate": 1.0,
      "tripDate": " June 2017"
    },
    {
      "title": "Disgusting",
      "text": "Arrived and there was a homeless drunk man laying outside the doors we had to go through to get to our room. There is no lift we had to carry heavy luggage up stairs. The area is disgusting and run down, it is full of homeless/drunks/drug addicts begging for money. The reception gives a false sense of what to expect as it is modern and clean. We were given sheets and a pillow case each. There was hairs, fluids and blood stains on our beds. The mattress and pillow were horrible quality. I didn’t even want to lay on the bed as I was afraid of catching a disease it was that filthy. After showering in the disgusting shower rooms and trying to dry my hair in my room the fuse went and our electricity was cut off as this was after 12AM we rang the three numbers that were posted on the hostel door and only one answered and was unhelpful. We were told nothing could be done until the morning. We stated we are tourists we paid a lot of money to come here and for this horrendous hostel and needed to charge our mobiles to which we were told yet again nothing could be done until the morning. As the electricity was turned off our air con therefore would not work and we had to leave the widows open. This area is rowdy and meant we could not sleep. This has dampened my opinion on Toronto completely and I will never come back!",
      "rate": 1.0,
      "tripDate": " July 2018"
    },
    {
      "title": "Clean beds. Barebone accommodations. ",
      "text": "If all you need is a bed this is it. Bed and room was very clean. But it was barebone... WiFi was spotty, the free breakfast was a joke. I would definitely come back in a pinch to get a good night's rest.",
      "rate": 4.0,
      "tripDate": " October 2014"
    },
    {
      "title": "Absolute worst place I have ever stayed in the world",
      "text": "I travel a LOT.  All over the world.  I have never experienced anything WORSE than this place in my life.To start, they charged me a week before my stay, whatever, not a big deal.They should really pay you to stay in this crap hole.First I was a late arrival. I got here at nearly midnight.They told me to get my key at a place called Sam’sSam's was scary as hell ghetto convince store.  I lived in Anacostia and Harlem, I know ghetto. And this place scared me.  They didn’t have my key, couldn’t tell me where the hostel even was located, and when I asked about parking was rudely to to get out of the store.When I asked again two Muslim men shooed me out of the store.I wandered around looking for the hostel for a good 10 minutes.Finally found the place and it was closed, nobody was answering because it was after hours and finally another person staying there told me some lady on the street worked there. This is well past midnight, and she was pissed I interrupted her conversation, and just handed me a pass key. Mind you that they close at 11, and This is WELLLLLLLL after that, so she shouldn't have had the keys anyhow.When I asked what room she got mad at me and told me it was “after hours\" and she told me to \"just go through the doors.” When I asked where I could park she acted like she never heard of a car. And started asking me what was wrong with me and why I drove there (From the US).I then spent over 45 min looking for parking. Almost decided to try and find a hotel, and should have.Around 1:30 AM I did find parking and walked to the hostel. Only to find where she told me rooms were, was a tv room. I try going upstairs but nothing is labeled. Men and women are in the same building, and some guy used his key to show me how to get to where I eventually found my room. Nobody was sketchy, but I have never stayed in a hostel where the men were allowed in the same building, let alone the same floor and hallway as the women, unless it was co-ed, and they said they were not.I finally find the room and it is not Air conditioned, and somehow was that no joke was over 98 degrees.I tried to sleep, even though the room was not conducive to human life.  Oh, and the room opens literally to the street.  So we could not open the sliding door, or people could walk right into the room. I tried to sleep till about 3 AM, even though the night club or whatever was open and it was loud and people were constantly knocking on the sliding door.  At about 3 was when a roommate tried to get out of bed and passed out from heat stroke.We had to call EMS, and I too was told I needed to see a doctor for heat stroke, but 3 of my roommates were taken to hospital because of the temperature. I took a cold shower, and went to my car in a parking garage to sleep. When I asked for a refund, they refused to give me one and said they did not understand what I was not satisfied with my stay.Every time I have had to travel to Toronto since, I have stayed at the Crown Plaza, and have paid about the same as this hostel.  Go to a hotel, your not saving anything.",
      "rate": 1.0,
      "tripDate": " July 2018"
    },
    {
      "title": "The worst hostel I've ever stayed at!!!! Nothing was good at all!!!",
      "text": "All terrible!!! Dirty room, showers, toiletes and corridors, noisy, breakfast is very basic, the staff is not friendly at all, front desk isn't open 24H but it's not clear in the description on Booking, they charge a deposit for the key and for the towel and it's also not said in the description as well, AC was removed from the room in the middle of my stay without any warning at all and the temperature wasn't comfortable enough for sleeping without AC. I talked to the manager and she told me to sleep with the window open, but the area is noisy, so I had to either try to sleep in the heat or with the noise from the neighborhood. Not so pleasant! Also, I left the hostel early and the front desk wasn't open. Talked to them the previous night and they said they would refund me my two deposits (key and towel) on the credit card as soon they got the key that I should drop in a box there. Till this day, no refund was made in my credit card.",
      "rate": 1.0,
      "tripDate": " September 2018"
    },
    {
      "title": "Unsafe",
      "text": "As a solo female traveller I hate feeling unsafe especially at my accomodation. But that’s exactly how I felt here. When booking the website gave no indication in front desk hours and I arrived and it was closed. Tried calling the 3 numbers on the window but no one picked up. I felt too unsafe being on the street by myself and ended up booking myself another hotel. If the website had more information it would have been okay but there wasn’t anything",
      "rate": 1.0,
      "tripDate": " August 2018"
    },
    {
      "title": "Have low expectations",
      "text": "Myself and my boyfriend have planned a trip to Toronto, and needed a base near the centre to see friends and family. I arrived a few days earlier and checked in to the college backpackers myself. We have stayed in hostels all over and usually have a good experience, knowing that there is always something about each hostel that is a bit unique. This is the first one I have ever moved out of early, and have no regrets. The good points of the hostel are the location, size of the room (i was in a private double), and the staff were on the whole friendly and helpful. The free breakfast was simple but fine.The downsides, to summarise quickly are the communal showers - there is no privacy while getting changed. The state of the toilets, there must be a plumbing issue whereby you are is not allowed to flush paper down the toilets. The bins were cleansed out max once a day. The rooms do do not feel hugely secure. The hallway carpets and walls are dirty. The Internet does work outside of the common room, and in there it is intermittent, not helpful for international travellers.If you are looking a basic dorm for a couple nights and don't mind the issues above, it is probably an ok budget choice. However if you are looking, like I was for a clean, relaxed, comfortable place near the city centre you may look for an apartment.",
      "rate": 1.0,
      "tripDate": " September 2016"
    },
    {
      "title": "Bedbugs at an amazing location",
      "text": "TheGreat: the location - right downtown; cool sort of bohemian-style neighbourhood; located right next to restaurarants, bars, cafes, shops.TheGoods: our private bedroom was basic but clean looking, with balcony looking over busy Augusta; fully equipped with a sort-of-modern look kitchen; sort-of-modern looking leaving room area with big flat screen tv; breakfast included (3 different types of bread, cereals, muffins, coffee)TheNotsoGood: the 2 wifi passwords for our 3rd floor did not work; the toilets and shower room need to be upgraded/reno; loud noises late into the night coming from Augusta if your room is facing Augusta (and leave the patio door open because it's hot in the room); no A/C in our private room on the 3rd facing Augusta but there was a small desk fanTheBad: there are only 2 toilet stalls in a tiny toilet (each for women and men) for the entire 3rd floor; household-style toilet flush for commercial/public use (hence not very powerful flush, waiting for the water tank to fill up before flushing again and plumbing issues); the men toilets on the 3rd floor doesn't seem to be cleaned more than once a day, the only men toilet was stuck 2 days in a rowTheHORRIBLE: my bf had bedbugs bites on his had/arm/shoulder after the 1st night",
      "rate": 3.0,
      "tripDate": " September 2016"
    },
    {
      "title": "Great location",
      "text": "Satisfied overall with my stay at this hostel which had a great breakfast, dorm beds which were very comfortable with a good amount of space, great wifi and a kitchen which is very new and always kept very clean. Most importantly the location is bang smack in the middle of Kensington - Toronto's funkiest, alternative scene with a zillion cheap places to eat.If I wanted to be picky I would mention a few things.........I have no objection to making my own bed - the norm in many hostels all over the world. However, I DO object to having to strip the last occupant's dirty bedding off first especially when she has left a dirty pair of underwear under the pillow. NOT something which creates great first impressions.There is only one common area - the TV lounge - which during my few nights stay didn't seem to be used much as it is not a particularly welcoming area. The greatest hostels seem to offer plenty of communal space for meeting and mingling - something you don't find here. This is just a personal preference as a solo traveller and may not affect everyone.The reception staff are helpful and efficient but not overly warm (with one girl I encountered decidedly chilly......after attempting smile number three and receiving nothing but a blank stare I gave up). Again, many guests might prefer it this way and I guess better efficient and aloof than super-friendly and rubbish (maybe........??)The girls' bathroom had one of its 2 sinks unusable for the entire time I stayed. It was filled with water and couldn't be drained as the plug mechanism was broken. By the last day a plastic bag was tied round the taps but the now very stale water was still in the sink.On the subject of the girls' bathroom.......there was nowhere to get undressed and hang your clothes other than in the main communal area. I'm not bothered in the least about getting naked but I noticed this caused great problems - and presumably embarrassment - to others who used the bathroom at the same time as me.None of these things spoiled my stay and I intend to return here when I go back to Toronto but others may have different expectations and standards than mine.",
      "rate": 3.0,
      "tripDate": " September 2015"
    },
    {
      "title": ":)",
      "text": "Lovely hostel, stayed approx 3 weeks, wifi was great ,good air conditioning, Caron at reception was always up for a laugh. Stayed in both mixed and female only dorms, met some lovely people along my travels :)",
      "rate": 5.0,
      "tripDate": " August 2015"
    },
    {
      "title": "Good location, basic hostel!",
      "text": "This hostel is what you pay for, it has everything you would need for travelling solo or in a small group. Rooms are clean and not too hot either, the bathrooms are small and not 5* by any means but it's good enough for what you need. I enjoyed my stay here and met people from all over, its in kensington which is lively and the CN tower is a walkable distance away. Would recommend for young solo or group travellers, not so much for older couples or groups.",
      "rate": 3.0,
      "tripDate": " August 2015"
    },
    {
      "title": "best hostelling experience ever",
      "text": "this was one of the best hostelling experiences we have ever had. the location is so accessible to all transit routes, amazing restaurants, funky shopping places and organic as well as gluten free cafes. The room itself was spacious, well lit, clean, and had great energy. The service from the front desk staff was awesome too.  Well maintained, friendly and relaxed. We look forward to coming back again. Special thanks to kind day staff man and mickey mouse sweater girl. <3",
      "rate": 5.0,
      "tripDate": " May 2015"
    },
    {
      "title": "This Hostel is Amazing, well worth your money.",
      "text": "I stayed here in April 2015 and i couldnt have asked for a better place, it was perfect, i had a private room, it was very clean and modern, i had my own balcony, tv, desk and double bed. The cleaners cleaned it everyday at my request (with new linen). The staff were very friendly, Caron especially, it was a delight to meet her. Location is very central and kept me walking around, which was good. Brand new kitchen and livingroom helped me meet lots of different people and a few even cooked me dinner. It was just a great stay, and ill definately be back at the end of the summer.",
      "rate": 4.0,
      "tripDate": " April 2015"
    },
    {
      "title": "Improvement is needed",
      "text": "There is a lot of potential for this hostel, but in its current state it lacks the fundamentals. My bed wasn't made when I arrived; I was simply given two sheets by the reception staff & was told to bring the dirty ones down. The room smelt very bad. It was clear that previous guests had smoked indoors and the stench had infused into the walls. The hostel lacked atmosphere and cleanliness. Security wasn't the best either - the door to my dorm room struggled to lock. It's cheap, wifi worked well, and it's in a good location in Kensington Market, but much improvement on the basics is needed before I'd ever consider staying there again.",
      "rate": 2.0,
      "tripDate": " April 2015"
    },
    {
      "title": "Very nicely renovated hostel",
      "text": "I stayed 6 years ago and now owner changed and nicely renovated rooms, kitchen, heating and internet. Its awesome place in downtown.Close to everything....Nicest staff.....Good breakfast in the morning",
      "rate": 5.0,
      "tripDate": " March 2015"
    },
    {
      "title": "Pleasantly surprised...",
      "text": "Stayed 2 nights in a 4 bed dorm, which was very clean, apparently fairly new mattresses on the bunk beds were comfortable. Washrooms/showers were impeccably clean. Looked like they had been recently renovated.Communal kitchen is old, but reasonably clean given its age & vocation. Lounge is dingy, & dirty. It didn't inspire me to hang out there, but that wasn't the point of my trip :).Noise levels weren't a problem.Free breakfast of cereal, toast, weak coffee. Acceptable if you're hungry & broke ;)Staff were friendly, but a bit hit or miss on efficiency depending on who's on duty. Karim & another gentleman were really helpful, the receptionist on duty when I arrived struggled with English, the computer, my credit & ID cards, & bill.The hostel is in a very lively & interesting neighbourhood, excellent public transport links to/from everywhere, & walking distance to/from many attractions.Note that reception is not 24 hours. I would stay here again, if my 1st choice was not available.",
      "rate": 4.0,
      "tripDate": " September 2014"
    },
    {
      "title": "Worst hostel ever!",
      "text": "Do not book! There are no staff, the main door is locked and no one is at the desk until 2pm, you can't store luggage, shared toilet and showers are inconveniently located, you can't flush toilet paper, the kitchen is disgusting, bad location near a community centre with people yelling in the street and you can hear everything, the whole place is dirty and not worth booking!",
      "rate": 1.0,
      "tripDate": " October 2021"
    },
    {
      "title": "2 weeks at the College Backpackers",
      "text": "College Backpackers  is centrally located in the heart of Toronto, its is  located along the Kessington Street market, which has a variety of various restaurants ie Italian, Thai, English, Chineese etc. The area has a lot of various shops where you can shop any day any time. You can easily access transport a few meters from the College Backpacker. You can also access banks in the next street. Quite a busy area and very interesting. Try them,their rates are reasonable, you will never go wrong but you will  always feel at home.",
      "rate": 4.0,
      "tripDate": " August 2019"
    },
    {
      "title": "Was my first time in a hostel, not very good experience.",
      "text": "Need to clean often rooms and bathrooms.Smell very bad in hallways.Kitchen full of flies.Not comfy beds.Too noisy on weekends.Nice staff.Good location.Near to the University, library, streetcar, subway and more.Laundry across the street.",
      "rate": 2.0,
      "tripDate": " August 2019"
    },
    {
      "title": "Cheap, dirty, poor quality hostel in Kensington.",
      "text": "I'm glad I stayed there just one night. First off, when I checked in, they just gave me the key and told me that my room was on the 4th floor and my bed should be ok. No explanations, no tour, no nothing. The room as very small and the bunk beds very shaky and noisy. I was top bunk and every time I moved the bed was made so much noise. No plugs for the top bunk. Small lockers. The bathroom was poor: old toilets, no paper to wipe your hands. The shower room: the curtains were not clean at all, we could see the stains. Very small kitchen and living room downstairs. You can leave your luggage for the day unattended in the main hall... There is the Planet Traveller, 2 minutes away, a little bit more expensive but OH so worth it. Go there instead for 10$ more...",
      "rate": 1.0,
      "tripDate": " October 2018"
    },
    {
      "title": "Complete Majeover",
      "text": "This hostel has had a complete makeover since my last visit in 2016. Rooms are far cleaner, service is exceptional with a whole new run of staff. Would definitely recommend to future travelers!! 10/10",
      "rate": 5.0,
      "tripDate": " November 2018"
    },
    {
      "title": "Pretty terrible",
      "text": "First night they got our booking rooms wrong so I got woken up by some fella telling me I'm in my bed. the staff are all very rude except for one guy who helped with the bed situation. The room was horrible and sweaty no air con or anything.",
      "rate": 1.0,
      "tripDate": " August 2017"
    },
    {
      "title": "Good Hostel",
      "text": "The Hostel was just located in one of the busy street Down town Toronto City. They are a lot of eatery on the street and so many bar for those who drink. I cannot complain , the place is affordable. The kitchen is neat and you can prepare your own meal as well.",
      "rate": 4.0,
      "tripDate": " April 2017"
    },
    {
      "title": "Great Area",
      "text": "We stayed in a private room for just two nights. The area was great, downtown was in walking distance as well as some locations to go out at night.However, our room was a little old and the sheets had some stains. The bathrooms were sufficiently clean. The kitchen was brand new and very clean!The included breakfast has everything you need - toast, jelly, peanut butter, cereals, milk, coffee, tea, hot chocolate and some sort of cake.Parking is in fact a little garage behind the house where all cars get stored in so you have no chance to leave during your stay. For this service, you could probably find some cheaper parking space somewhere else.",
      "rate": 3.0,
      "tripDate": " November 2016"
    },
    {
      "title": "You Get What You Pay For",
      "text": "Toronto is an expensive city to visit, so my husband and I thought we'd save some money and get a private room in a hostel. We've done this plenty of times all across the world, but I wouldn't stay here again. We actually didn't shower all weekend because the shower rooms were pretty gross. The staff who worked there were nice and friendly. Our bedroom size was good, but the floor was sticky and the TV didn't work. The breakfast was fine, consisted of cold cereal and milk. They had some bread for toast and a few pastries that went really fast and weren't re-stocked. The internet was really spotty and didn't work our entire first day. They must have re-started the router because it worked most of the time the next day.The best part about this place is the location. The Kensington area was wonderful. During the day it was jam packed with people and really unique shops. I did notice there's another hostel around the corner that looked nicer, so maybe look there if you want to stay in this area.",
      "rate": 2.0,
      "tripDate": " September 2016"
    },
    {
      "title": "Don't waste your money here!",
      "text": "For a hostel charging these prices, this place is not good value.  The internet speed does not even reach 3 mb/sec .  The location is pretty good overall with quite inexpensive yet delicious food in the nearby restaurants.  However as a hostel, this establishment has a lot to learn about the very basics of travellers and their needs.  I would not stay here again nor would I recommend this place.  Much better value choosing a 2 star hotel or Air B&B.",
      "rate": 1.0,
      "tripDate": " October 2016"
    },
    {
      "title": "Never go there!",
      "text": "One of the worst places i've ever went to for staying over night. The sleeping rooms were extremely dirty: there was puke next to a bed, human hairs and rests from a pack of chips lay on the beds. The blankets and the pillows smelled as they have not been washed for months. After asking the personell i was told that the blankets are only washed after a few weeks of usage, even though i paid fifty dollars (!) for one bed, just for staying one night in a dormitory.Furthermore the washing rooms were not clean either. You could find mold all over the place..just a really disgusting condition in there. Also you could not find any soap at all in any bath room.As i tried to explain the staff that 50 Dollars are not okay for such a place to sleep, i got advised not to speak with such a voice to her. My recommendation: Just avoid ever going to that place. Even if you just wanna spend one night there.",
      "rate": 1.0,
      "tripDate": " October 2016"
    },
    {
      "title": "Run away!",
      "text": "Ive travelled quite a bit. I know how hostels work and that what is okay in Mexico is not so in UK. Got that.Said that, this place is just terrible. In all possible ways. When you check in they send you through a different door, as in like you need to leave the building.  Entrance to the rooms is terrible. It just looks like no one bothered to take care of it for years.You go upstairs and the carpet is just filthy and disgusting. No one has ever cleaned that carpet. Found our room and right next to the door someone had just kicked the wall so hard that they had left a whole. Room was okay size. Our bed was not done even if it was a private. The mattress was dirty and uncomfortable. Since it seemed there was no housekeeping the fridge was dirty from previous guests. Just terrible.The room was overlooking Augusta Avenue and had a little balcony: again is good to clean those spots from time to time. We found dirty underwear on our balcony from God knows when. The toilets are just tiny. Two bathrooms for a whole floor. Tiny and smelly. Showers are just the same: tiny and those curtains need to be changed!!!I would not recommed this place to anyone. Seriously. Planet Traveller is much more better and literally round the corner. There is no hostel vibe whatsoever and just looks like left out. This place in UK would be closed down in 2 minutes for Health and Safety issues.Wont stay here again. I would rather pay 39 dollars more and stay in a hotel. Terrible experience.",
      "rate": 1.0,
      "tripDate": " September 2016"
    },
    {
      "title": "RUN AWAY AS FAST AS YOU CAN",
      "text": "Weather was terrible (heavy rain), which shouldn't have been an issue, but throughout our 3 night stay we witnessed multiple parts of the roof falling down, hundreds of buckets in the hallways catching roof leaks, and constantly flooded corridors and rooms. In addition, the bathrooms weren't cleaned once during the 4 days we were there. We arrived to a blocked toilet and limited toilet paper, and it stayed like this for the duration of our stay. The beds were so squeaky and unstable that many people chose to sleepOn the common room couches instead, as sleeping was extremely difficult. We were also promised aircon, and none was provided - the rooms were hotter than outside. Wifi was TERRIBLE no wifi in the rooms, limited wifi everywhere else. AND random people snuck into others rooms and searched through their things on a regular basis. WOULD NOT RECOMMEND TO ANYONE UNLESS YOU WANT THE WORST EVER.",
      "rate": 1.0,
      "tripDate": " August 2016"
    },
    {
      "title": "Stayed Twice",
      "text": "We stayed here in a private room during the fall of 2014 and the spring of 2015. The management are friendly.Convenient location close to University, street cars, Kensington Market, laundromat( across the street) and a good number of cafes and restaurantsPlace was rundown when new owners took over last year. Now has modern lobby,  kitchen, showers and bathrooms. The private rooms have also been done up. The free breakfast is all you can eat but is basic. We made our own. The WiFi is patchy but seems to have improved since last year  Checking out before 8 am can be problematic. If doing so avoid paying the  $20 key deposit.The parking enforcement on the street is agressive. The Backpackers have off street parking for a fee. Avoid getting boxed in by other cars if leaving early.",
      "rate": 4.0,
      "tripDate": " May 2015"
    },
    {
      "title": "Don't waste your money! Horrible place!",
      "text": "The location within Kensignton Market is the only thing going for this place. Booked a private room paying 90 bux a night only to find it contained literally \"a bed\" and \"a tv\". No desk or table or chair or towel or extra sheets or even a closet or hangers for clothes. Room was freezing cold because you have to switch on the heat when you're in the room and the housekeeping people put it back down when they come to clean and you're not in the room. Pillows were completely flat and i woke up with neck pain the next morning even though i slept on 2 pillows. Shower had no soap or shampoo. I had to go to reception and ask for a towel and soap and was told they only give them to guests when they ask for them in order to save. Bathroom for the whole floor has \"one toilet\" and \"one urinal\". The toilet stall has a note that says to throw used tissue paper in the waste basket, which is not in the toilet but rather outside by the sink! Bathroom and shower have motion-activated lights so 4 minutes into your shower or toilet use all the lights shut off and you have to step out and move around for them to come back on. Kitchen is dingy and dirty. Almost all stove controls are broken and/or not working. Dishes and cutlery left in the sink are simply rinsed in water and put back on the rack for people to use (I saw this with my own eyes). Best part is, there are notes directing you to wash your own dishes \"otherwise you will be asked to leave!\" Absolutely horrible experience. Not recommended at all to stay there. There are at least 2 other hostels in the area that will offer a much better stay for the price.",
      "rate": 1.0,
      "tripDate": " February 2015"
    },
    {
      "title": "High price for nothing. ",
      "text": "I thought I would give this place a try. Huge mistake, first off the kitchen was under renovation of thus there was no cooking or fridge I will say that they did get me a fridge so all the food I had bout would not spoil but there was no place make even a sandwich the first room I had a bed on the floor and a TV on the wall. That was it no table no chairs no hangers no tissue the balcony was screwed shut absolutely nothing ... I complained the moved me into another room. That had a little table and one chair.  The showers there are two open showers in one room not a privet shower no locks no soap no place to put any of your belongings other then the floor. This bar far is the worst hostel I have ever been in ... Looks nice and shiny but don't be fooled by glossy floors the place is a dive there breakfast was toast and coffee and cereal.  That's it .. Crap ..not worth the 70 bucks a night ...",
      "rate": 1.0,
      "tripDate": " March 2015"
    },
    {
      "title": "Overpriced dump.",
      "text": "Straight up worst hostel I've ever stayed at and I've been traveling for a long time. constant renovations, filthy rooms, kitchen is old and filthy, weird old homeless looking stinky men all over the place, not too mention highly overpriced for what it offers, go elsewhere!",
      "rate": 1.0,
      "tripDate": " March 2015"
    },
    {
      "title": "Great staff",
      "text": "I heard horror stories of this place and simply not true. The new owners are doing a ton of renos  to the place and it is extremely clean compared to rumours.  I've been here for awhile and it has gotten soooo much better every week. I'm checking out soon and haven't got a bad review of the staff. Only problems I've had here have been with residents and that comes in every environment you are in.  Prices are great and the location is the best in Toronto. The market is awesome just like the people in it.  Easy public transit access as well.  4 stars.",
      "rate": 4.0,
      "tripDate": " January 2015"
    },
    {
      "title": "Absolutely terrible!",
      "text": "I stayed here in August of 2014. My experience staying here was sufficiently negative that I wrote down my thoughts at the time and vowed to leave an accurate review at some point. The only positive thing about staying here was the location. Upon arriving, I had to wait ~1 hour just to get a room different from the one I booked. Karim, the employee at the front desk at the time, fraudulently overcharged my credit card by $10. I had to argue with him just to get linens. In the few times I came to the lobby to use the internet (due to it not working at all in the room), I witnessed repeated atrocious customer service given to every guest he interacted with. The place was filthy and there were flees. Thankfully there weren't bed bugs; however, it is unpleasant to wake up with itchy red marks all over your body. The room itself was not at all comfortable due to the strong paint fumes that wafted in from the painting of a nearby room, short beds that squeaked upon little movement, and the limited number of outlets to charge electronics. I will never stay here again and strongly recommend anyone thinking of staying here to consider the multitude of negative reviews found on various websites. Do not stay here unless you're looking for a terrible experience.",
      "rate": 1.0,
      "tripDate": " August 2014"
    },
    {
      "title": "Did not accept my booking",
      "text": "This hostel did not accept my booking through this website. When I arrived, the hostel tried calling the company, but couldn't get through. We struggled to find a new place, but we found a place that cost more and required us to take a taxi out of Toronto. I want my money back for the hostel and the extra money I had to spend to find a new place.",
      "rate": 1.0,
      "tripDate": " June 2014"
    }
  ]
}