{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Comfort Inn & Conference Centre Toronto Airport",
    "url": "/Hotel_Review-g155019-d189575-Reviews-Comfort_Inn_Conference_Centre_Toronto_Airport-Toronto_Ontario.html",
    "priceRange": "$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "2.0",
      "reviewCount": 522
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "240 Belfield Rd",
      "addressLocality": "Toronto",
      "postalCode": "M9W 1H3",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/18/fb/82/ef/photo1jpg.jpg?w=500&h=-1&s=1"
  },
  "description": "Conveniently located just minutes from the Toronto International Airport, the hotel has undergone a complete renovation in 2010. Our property offers free airport shuttle, park and fly service, business centre, fitness room, and rental car agency. We offer free continental breakfast, free HS internet and free parking. All rooms include Fridge, hairdryer, alarm clock, coffeemaker, iron and board, cable TV, 37in HD flat screen TVs and free weekday newspaper.",
  "featues": [
    "Parking",
    "Free wired internet in the business center",
    "Vending machine",
    "Free airport transportation",
    "Business Center with Internet Access",
    "Conference facilities",
    "Baggage storage",
    "Newspaper",
    "Internet",
    "Free shuttle or taxi services",
    "Airport transportation",
    "Meeting rooms",
    "Non-smoking hotel",
    "24-hour front desk",
    "Private check-in / check-out",
    "Ironing service",
    "Air conditioning",
    "Flatscreen TV",
    "Non-smoking rooms"
  ],
  "reviews": [
    {
      "title": "Horrible experience do not stay here!",
      "text": "We chose this hotel to stay at on our way home from punta cana mainly because it had airport shuttle and breakfast, we waited over half hour no shuttle showed up so was forced to pay for a $27 cab. when we checked in at 8pm there was no hot water for my daughter to take a bath, when i called the front desk they said ‘oh ya hold on’ he hung up and never called back and I checked still not hot water all night or in the morning in the entire place! In the morning we went down for breakfast at 645 everything was laid out but the coffee was empty, I went to ask the guy at the front desk and he replied ‘ya ya’ he was on his phone.  Then we discovered the waffle batter was nothing but runny water, even after pouring several containers, the bagels were hard as rock, the milk was sour, we were very upset as my 6 year old was very hungry. Another family walked in and were just as mad about the water, the manager came in and said ‘ come look I show you hot water now working’ and we all said ya thanks we are checking out, when we pointed out everything wrong with the breakfast he said oh the batter just needs to be stired, there was no staff around to do this as the only employee that seemed to be working was the front desk clerk! he offered for us to stay 6 more hours and we all responded with why on earth would we want to stay here?!  Then as we all needed to be at the airport for a 930 flight the shuttle was late and guess who the driver was? The front desk clerk!! He went outside started the van and told us it was open and he went back inside to warm up while we all loaded our own luggage into the van! I am not one to complain and have never written a review of any place I’ve stayed before and I’ve stayed in a lot of hotels but I thought this one deserved it as I want to warn people not to waste their money here!  Never staying here again that’s forsure!",
      "rate": 1.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Horrible hotel!",
      "text": "We booked a park and fly at this hotel and there was no spots for cars to be parked let alone for 10 days. Had to park up on grass boulevard. Came back from trip and room they put us in door wouldn’t shut and bathtub looked like some dirty person just rinsed off and tub wasn’t cleaned! Window was broken and wasn’t shut. It’s winter! Moved to another room and dirty laundry all over the floor. Third room wasn’t the greatest but had enough! And they want a deposit! Went to check out and they wanted to charge us an extra $30 for 4 people when room was already paid for! Such an awful experience. Will never stay at this hotel ever again!",
      "rate": 1.0,
      "tripDate": " February 2020"
    },
    {
      "title": "HORRIBLE HOTEL ... DO NOT STAY HERE!",
      "text": "First and foremost, it was very challenging talking to staff because of the language barrier. They had trouble understanding English and it was very hard to understand them. Rooms were run down and dirty. Old teabag left in coffee pot. Half bottles of cheap shampoo in washroom for guests. Dust could be seen on all furniture in lobby and conference rooms. Soap splashes on mirror and counter. Dirty fingerprints on bathroom door.  Parking availability was poor. The hotel is away from all stores and restaurants. Taxi service is required wherever you go.  The airport shuttle reeked of diesel to the point I was sick to my stomach and we had to call twice from the airport for a pick up.. The pictures on line don't resemble the actual property and the rooms are way over priced. Stay away from this place!!",
      "rate": 1.0,
      "tripDate": " March 2020"
    },
    {
      "title": "Very nice",
      "text": "My stay here was great.  Five minutes from the airport.   Free parking (unlike many other motels in the area).  Everything was kept clean.  My room was very nice with a comfortable bed.  The WiFi always worked (5th floor).  The hot breakfast was always good with eggs, sausage, waffles, potatoes, muffins, juices, etc.   There are nice restaurants and stores within a five-minute drive.  Easy to get to and from 409 expressway.  The staff was helpful and friendly.   I will stay here again when in Toronto.",
      "rate": 5.0,
      "tripDate": " May 2023"
    },
    {
      "title": "Terrible",
      "text": "Worst hotel I have stayed at yet. Came in after a late train, to wait in the lobby for 10 minutes before the guy came to counter mean while I can see him at the desk listening to music. Got to the room, dirty only one light had a light bulb and smelled like weed. Didn't realize the hotel was under construction. Sounded like someone was opening and closing every door in the hall all night long. Came down to catch our shuttle in the morning to the same guy sitting in the office listening to music for 10 minutes before hearing us call off him, the shuttle was suppose to be included which turned out to be 20$ for us on top of the charge of the hotel which I don't believe was worth what we had paid. Worst experience ever",
      "rate": 1.0,
      "tripDate": " October 2021"
    },
    {
      "title": "Avoid this hotel",
      "text": "We had stayed here previously so booked one night prior to a flight departing from Toronto. Late arrival for us so we could not really just leave. At least the bed was clean (we checked thoroughly) and comfortable. The rest of the hotel was not. One caveat for the main area was they are undergoing renovations. Nothing stated about that when we were booking. The room had multiple problems. Wallpaper taped together with duct tape. Big splotch of goop on the carpet. Bathroom door would not open fully because it stuck on the floor. Main door to hall looked like someone had hacked at it with a tool. There is a window from the bed area through the shower into the bathroom. Pull down blind that catches shower water and will get moldy. Staff were completely not interested in dealing with us and there was nobody at the front desk in the morning. We slept and departed as early as we could. Avoid this hotel",
      "rate": 1.0,
      "tripDate": " May 2022"
    },
    {
      "title": "the real fawlty  towers",
      "text": "We had a three night stay at the Pearson hotel and conference center and very quickly found out it was basically the real fawlty towers. We arrived around midnight due to a late arriving flight. We had called the hotel in advance to ask about airport shuttles of which there wasn’t despite it being advertised on hotels.com which is what we booked on. We had to get a lyft which cost 15-20$. The two men at the desk looked like they couldn’t be more disinterested, asked for ID and card and just started swiping the credit card, didn’t say how much they wanted or what it was for. After throwing it between each other they said it was for 100$ but didn’t mention why again as we had already paid for the property. We got to our room, and found no bedding for the sofa bed so we had to make several trips to the reception to get bedding, pillows etc. We had to make the sofa bed our selves and found the mattress was still in its packet… Despite all this we did find we were about to get good quality sleep here. The breakfast was a very big let down and a shambles. There was no milk and the manager, aka Basil was very rude to both guests and staff and basically berated and humiliated the staff infront of guests yet they could only give us what they had been given. Basil did eventually go buy some milk and to give give him his due he did apologize for the way he spoke to us when we checked out. The wifi did work well and there wasn’t much noise from the street or aircraft noise from the airport. Overall the stay at the hotel was comfortable however we found a bit overpriced for what it was.",
      "rate": 2.0,
      "tripDate": " October 2022"
    },
    {
      "title": "Gross Hotel",
      "text": "Don't stay here. Gross rooms - wondering if they ever even cleaned to begin with. Dirty sheets, general odour, hair in the shower & every dresser, candy wrappers from previous customers, and poor management.  When we asked for a discount for the unhygienic rooms, we were laughed at ...although we have pictures of the uncleanliness. Said we were welcome to check out and argued with us infront of other people checking in.   There was no fan in the bathroom but there was a big picture window that someone lying in bed can see you using. 0/10 recommend.   Streets are cleaner than this place.",
      "rate": 1.0,
      "tripDate": " September 2023"
    },
    {
      "title": "Not worth it",
      "text": "We have stayed at this hotel twice as we had an overnight both ways on our vacation. This hotel is old and worn out. The front desk receptionists are old and worn out, All men who make you feel as though you are nothing but an inconvenience. They are rude and don't make eye contact with you like you are beneath them.  And they do NOT have a hot breakfast.  It is bread,cereal, and coffee that tastes like it has sat there for days.  It was hardly warm.I would not recommend this hotel.",
      "rate": 1.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Horrible Shuttle Service",
      "text": "The hotel was ok.  Nothing fancy, but was a place to sleep before flying put of the Toronto airport.  When booking, we were told that there was a shuttle service to take us to the airport and that we could leave our car at the hotel.  Once we arrived, we were told that our flight was too early (6:00am) for the shuttle so we had to arrange an Uber ride.  When returning from our trip, we called the hotel for the shuttle as instructed and were hung up on 3 times.  Finally they answered and said that they would be there in 15-20 minutes.  After standing in the cold and waiting for 55 minutes (and calling the hotel 2 more times) we ended up taking a taxi to retrieve our car.",
      "rate": 2.0,
      "tripDate": " April 2024"
    },
    {
      "title": "Very Poor Stay",
      "text": "My friends and I stayed here the night before our early morning flight because of the free airport shuttle. We didn't expect much, but were left less than impressed. The room they gave us looked like the sheets hadn't been cleaned in weeks. There were white liquid stains on the head board and red and yellow stains in the sheets. Completely disgusting. The staff was very good about giving us a new room. However, the cleanliness was almost the same. We had to suck it up and sleep our beach towels as blankets because we had to leave the hotel at 3am. In addition, they do offer free airport shuttles and cheap parking, but don't expect to be picked up at the airport in a timely manner. We called from the plane and still waited almost an hour before deciding to spend $30 on a taxi. Awful experience.",
      "rate": 1.0,
      "tripDate": " October 2015"
    },
    {
      "title": "Terrible Customer Service",
      "text": "Do not book here!  My experience with this hotel was negative based purely on my reservation and subsequent cancellation.  I had booked this hotel and then needed to cancel.  I called the hotel to cancel and after being on hold for a while, I finally got someone on the line with terrible customer service skills.  The individual was rude and abrupt. But they assured me the reservation was cancelled.A week later I called to confirm the cancellation.  Due to my poor experience I feared that the guy hadn't actually cancelled the reservation.  Sure enough, I was still booked into the hotel!  And I had to cancel - again!  The people at the front desk clearly do not know how to run a hotel.  And based on the other reviews here, I'm not the only one experiencing this lack of professionalism.  I do not recommend this property.",
      "rate": 1.0,
      "tripDate": " October 2015"
    },
    {
      "title": "THE worst!",
      "text": "HORRIBLE! Trying so save a few dollars, unfortunately, we got exactly what you paid for.Upon entry, you get the impression that the hotel was nice. The lobby was very clean. Then you start the process...  Their system is completely outdated. The lady at the front desk unsuccessfully search for my reservation through a large stack of papers. When she realized it was not there, she asked to see my online confirmation from my phone. She was completely confused. After a half hour long process, she finally gave me the keys to a half cleaned room. The walls were paper thin, I could hear EVERYTHING in the rooms on both sides of my room and in the hallway. The elevators were dirty. The carpet looked like it hadn't been vacuumed in weeks. The check-out system was THE WORST. I waited 45 minutes for a staff member to appear and when he did, he was the shuttle driver and had gone to pick up other guests. He asked me if i  smoked in the room, then took my keys, walked away from me, went to the room to sniff whether he smelled smoke. He was completely unprofessional and lied about my security deposit being refunded.Terrible Hotel!",
      "rate": 1.0,
      "tripDate": " December 2014"
    },
    {
      "title": "Wifi is a joke",
      "text": "This hotel is not worth it, wifi didn't  work, staff is useless and got bad customer service, the location was awful I wasn't allowed to bring my continental breakfast plate to my room.  Just don't.  It's a cheap hotel.",
      "rate": 1.0,
      "tripDate": " June 2014"
    },
    {
      "title": "Nowhere near the airport",
      "text": "This hotel sucked. There is no bar, no food, wifi didn't work and the tv in my room also was on the blink. I will never stay here again and urge anyone considering staying here to spend a few more dollars.",
      "rate": 1.0,
      "tripDate": " June 2014"
    },
    {
      "title": "Would not Return",
      "text": "I chose this hotel because of, the inexpensive rate, its proximity to my conference, the free Wifi, and free breakfast. I would NOT return due to the housekeeping issues. When we first arrived, almost every light was unplugged, others were burnt out, the TV wouldn't work, and there was a used condom wrapper in the bedside table. I mentioned this to the front desk the next morning, and to their credit, the electrical issues were fixed. The next day, after a long day of meetings, we came back to our room to find dirty coffee cups, an unemptied recycle bin, unrefilled coffee supplies, and an uncleaned shower. The condom wrapper was still in the bedside table.Breakfast is  continental style - bagels, toast, cereal, yogurt, juice, coffee, and fruit.Front desk staff were nice.Not a great experience.",
      "rate": 2.0,
      "tripDate": " May 2014"
    },
    {
      "title": "Stay anywhere but here",
      "text": "Horrible service.  $100 security deposit they don't tell you about.  Shuttle service is brutal (over a 45 minute wait to be picked up - other hotel shuttles came by 3 times).  Sheets & covers were disgusting in the rooms.  Unless you are truly desperate, choose any other hotel but this one.",
      "rate": 1.0,
      "tripDate": " May 2014"
    },
    {
      "title": "Cheap but not so cheerful",
      "text": "Although this hotel is close to the airport, it is not easy to find, as they have changed the name. The rooms were comfortable enough for our one night stay over. The paper cups in the room are a bit tackie and are not good if you want a second hot drink. Breakfast was included but I have never had to use plastic cups and plates at a hotel before. Although it must save them lots of money with the washing up etc, it is not very pleasant to dine with. The breakfast was a bit of a scrum and the one member of staff was not able to cope. He also needs a few lessons in basic good manners, especially to the paying customer. Manners cost nothing. Over all, the hotel served its purpose but we were glad to leave.",
      "rate": 2.0,
      "tripDate": " March 2014"
    },
    {
      "title": "Hotel recently renovated - services need to be",
      "text": "Booked this Hotel through Park, Sleep and Fly.  Arrived on Feb 5th to leave car, returning to pick up car and stay overnight on February 26th.  Hotel has recently been renovated and rooms and public areas do reflect this.  My issue is with the staff and other services.  It snowed most of the day on Feb 5th, delaying our arrival at the Hotel.  Even so we would have expected the access off the street to the hotel to have been plowed - which it wasn't.  The entrance to the hotel itself was not shovelled. Could not drive up to front door as parking spots taken up by an employee and shuttle van.  Staff at reception seemed confused re the Park Sleep and Fly billing arrangement.  In fact I will billed twice - on 2 different credit cards - one being one card which I provided Park Sleep and Fly (that charge was posted on Jan 28th), the other on a different card which I used when I checked in on the 5th.In summary have no issue with comfort and cleanliness of the hotel, only with the service, my dissatisfaction with it overrides the benefits of the renovation.",
      "rate": 1.0,
      "tripDate": " February 2014"
    },
    {
      "title": "A nightmare !!! Do Not Stay Here",
      "text": "Upon return from a family vacation, we missed our connecting flight, so West Jet sent us to this hotel for a 2 night stay since we could not get another flight until then. They also gave us food vouchers to use at the dinning room. So off we went to the location indicated for pick up for the hotels shuttle, and there we waited and waited and waited while all other hotel shuttles came and went numerous times...finally it arrived, we loaded our own luggage as no help was even offered. Got to hotel and checked in, I handed the front desk person my vouchers which showed 2 night stay and asked where the dinning room was as it was 11 pm and my family had not eaten. That's when he tells me there is no dinning room or food, but there would be breakfast in the morning and took 2 of our vouchers worth 60.00. Turned out to be dry cereal and toast with juice. Room was ok nothing to write home about bathroom wasn't as clean as it should be, but we were tired it was late and we had 6 people including kids. The next day after getting some rest we needed to get some supper so in order to use our vouchers we had to go back to the airport to use in a restaurant there. So we needed to get the shuttle oh joy here we go again.. We waited 35 min while the driver and front desk person argued about taking us, finally we were on our way made it back to the airport had a bite to eat and went looking for the shuttle amazingly only took 5 min. Got back to hotel went to go to our room only to find out we had been locked out of our rooms..so my husband went down to the front desk to get keys fixed while me and the kids sat in the hallway in front of our rooms. 10 min later he comes back up and tells us to come down to the lobby with him as they front desk person told him we were only suppose to stay 1 night and someone else was in our rooms... How was this possible when all our stuff was still on them.. He was very rude oh and did I forget to mention the front desk person was the same person who drove the shuttle. So when he is out picking people up at the airport you can't check in. So while he was ignoring us and talking to other people we called west jet and filled them in on the situation and told them we wanted to move and would not stay here any longer. They booked us at another hotel, I told the guy at front desk give me a key so I can get my stuff we were leaving, he gave me a key card alright he have me the master key to all the rooms.. Are you kidding me!! If I was staying at a hotel and knew they gave out a master key to anyone id be very upset, I could have opened anyone's room door.. I don't know how this place is still in business..4 other people came and ended up leaving without checking in just by hearing all the trouble we were having.  If you have any sense you will stay somewhere else any where else.",
      "rate": 1.0,
      "tripDate": " February 2014"
    },
    {
      "title": "Worst Hotel in North America",
      "text": "I was booked into the Days Inn by Air Canada, which had cancelled a flight and caused a 24-delay in my itinerary. The room was shabby -- stains on the carpet and a broken toilet paper holder in the bathroom. Services were virtually non-existent. The buttons on the phone for \"housekeeping,\" \"restaurant', etc. were inoperative. Only the front desk was manned. The clock radio was broken. I asked the front desk for a replacement; I needed it because my watch battery had died.  Since the clerk was the only person in the hotel on duty, she promised to find one for me, but never did. I repeated the effort with the new clerk the next morning: same lack of results.Dinner (vouchered by Air Canada) was either \"chicken and salad\" or \"chicken and fries.\" since I hadn't eaten all day, I asked for chicken with both salad and fries. I was told that was not available even if I paid extra. Fries were soggy when delivered. No room service was available for food. Continental breakfast was served, but tables were dirty and there were slops on the floor. Bananas were wooden and inedible. Plastic implements were so cheap that the knives wouldn't cut anything.",
      "rate": 1.0,
      "tripDate": " July 2013"
    },
    {
      "title": "Blood, urine and bed bugs!",
      "text": "We stayed at this hotel at the end of July and found that our bedsheets had blood stains and urine stains on arrival. They changed the sheets but we woke to further blood stains that had not been caused by us and my husband has his legs bitten by bed bugs. The stains were therefore caused by the bugs! When we brought it to the attention of the staff, we were told this couldn't happen, their rooms were clean..... Forgetting obviously that they weren't clean on arrival. We were kindly treated to the wrath of Sam the manager who seems to act with a very aggressive attitude to all customers. As we approached him, he just finished yelling at a family whose two rooms were flooded and had blood stains!! They got nowhere with him either! There were fire alarms items that were hanging off the wall in the hall, telephones didn't work and my friend found food rubbish and cutlery down behind the bedside locker! We asked twice for someone to fix the phone and twice were told they would send someone up, nobody came! After we got home, another review site mentioned room 235 as being infested with bedbugs - we were in 231-232 so not a stretch to believe that they've travelled! Ewww My friend will probably post a similar review about her room ..... All in all, don't stay here - it's dirty, they care nothing for the guests and even treat them with contempt, wifi is sketchy and breakfast is badly stocked and pretty basic. It may be priced competitively but if you value your health, pay an extra 20 quid and go elsewhere! (We transferred to the International Plaza the following night and it was amazing - nice staff, accommodating our early check-in to escape the Pearson, excellent facilities and choice of restaurants and even a bar)!",
      "rate": 1.0,
      "tripDate": " August 2016"
    },
    {
      "title": "Stay here if you enjoy incompetence, and don't like hygiene. ",
      "text": "Booked hotel on may 13, for our stay on the 14th. We asked for a crib upon booking. We called the next morning to confirm the crib because we would be arriving at midnight with our 7 month old. The girl working the front desk told us cribs were first come first serve.  Not sure what they thought we would do with our baby if we didn't have one?? She said they are too busy to determine if we would get one, then said they world assign us a room because they aren't busy.. Anyways, my husband got off the phone with her frustrated. I called back and talked to \"Sam\" . He promised there would be a crib upon arrival and told us to call back in the afternoon. I called back and talked to someone I could barely hear. He basically said call back later and hung up on me. My husband called back and they told us our room number and there was a crib in there. We thanked them and went on with our night. When we arrived at 1230am,we informed the guy at the front desk that we are the ones requesting the crib. He said yes, it's there. Walked up to our room and guess what, no crib!!!  I called the front desk, he said he'd bring one right away.  seriously, the people who work here are beyond incompetent. I opened a soap package as well in our room and there was dirt in bedded in it. They must reseal them. If you can't open a sealed package without it being clean, who knows what else is dirty. Really dirty people running this place. And to top it off,I had to go search for someone working the front desk in the morning to check out. My husband asked for a receipt when we checked out, the guy ignored him and moved on to the next person. We grabbed our bags and started to head out the door and he yelled, \"don't you want the receipt?\"  we said well, you ignored us and thought we weren't getting one. Thanks for the $15 crib charge!!!",
      "rate": 1.0,
      "tripDate": " May 2016"
    },
    {
      "title": "Not that bad",
      "text": "Booked weeks in advance for a good rate and while waiting for the free shuttle from the airport i check out reviews on trip advisor. Based on what i read from previous guests i was expecting a shanty of hotels full of stains, cockroaches and no hot water. It wasn't that but it wasn't a Hilton (for $90 what do you expect?). The room was clean, bathroom was standard, free shuttle each way to airport was nice, breakfast was your standard fare with toast, cereal, waffles, juice, yogurt etc. If i needed another 8 hour lay over in TO i would not hesitate to book again.",
      "rate": 3.0,
      "tripDate": " June 2015"
    },
    {
      "title": "Worst hotel experience ever",
      "text": "Checked in certainly not a 4 star as we were told. Asked for wake up call the never came had to remind them we needed shuttle to airport. On return the shuttle driver wouldnt open the door or assist with luggage told us to put it in the seat.  I complained and he threw my luggage.  Tried to complain to the manager and director Satish Chopra, he was less than professional.  Not his issue wasn't willing to accept any responsibility.  Don't stay here !!!",
      "rate": 1.0,
      "tripDate": " May 2014"
    },
    {
      "title": "Never again",
      "text": "I wouldn't stay here again unless I had no other choice.  I stayed here because I wanted the convenience of Park, Sleep, and Fly and stayed the night before my flight out and had also reserved a room for the night I returned because I wasn't due in until late. The lackluster experience of the first night led me to decide to find another place to stay upon returning to Toronto. When I called to cancel I was told that I could not do so and would be charged anyway because I needed to cancel more than one day in advance, so I reluctantly stayed the second night. I was also overcharged for the second night but there wasn't a manager available to handle it either that night or in the morning upon checkout.Pros: - shuttle to/from airport- room looked recently renovated- continental breakfastCons:- staff not welcoming (kind of grumpy)- only entrance/exit is front door- stained bed linens and frayed bath mat - shuttle to airport did not run as often as advertised- waited at least 40 min outside the airport for the shuttle to pick us up after our return flight- we were charged a higher price than quoted on the phone- housekeeping burst in our room to clean without knocking",
      "rate": 1.0,
      "tripDate": " April 2014"
    },
    {
      "title": "Completely unprofessional",
      "text": "I have now stayed at this hotel twice. One by choice and the last due to a conference booked through my  company. The professionalism of this hotel is non-existent.  The night staff is rude,  unhelpful,  and miserable. The morning staff is a bit better however they take no responsibility for the awful night staff, and do nothing to make the situation better. Management couldn't care less,  and side with their staff over their guests. I'm amazed they have not been shut down yet as the sheets are dirty and the bathrooms have bodily fluids from previous guests. This isn't a matter of u get what u pay for,  it's robbery because no one should pay for this service.",
      "rate": 1.0,
      "tripDate": " April 2014"
    },
    {
      "title": "Terrible, terrible, terrible",
      "text": "Hotels.com booked this room for us with the guarantee that it would include long term parking for our car while we were out of the country.  The hotel refused to honour the arrangements, charging an additional $100 to park.  They refused to refund the full amount even though we changed our mind and parked long term elsewhere.  No response whatsovever from management despite my complaint.  Essentially illegal that they charged for a service that we did not use.  Very, very disappointed.  Would NEVER stay here again.  Clearly a case of bait and switch.",
      "rate": 1.0,
      "tripDate": " March 2013"
    },
    {
      "title": "Need to change the shuttle service",
      "text": "Toronto Pearson is a vast airport. In order to get from one area to another, you often must lug heavy luggage up and down floors and for long distances. Compounding these problems is a real shortage of working phones and few information booths. From past reviews, a reviewer mentioned the need to phone the hotel to tell them of your arrival to arrange a shuttle service. Don't bother. Despite knowing how difficult it is to get a working phone in Pearson, the hotel steadfastly refuses to book a shuttle in advance to meet you. They insist that after you land, you must first call them and wait 20+ min (not good in the cold or if you are there for a few hours of sleep). If you find a charge card phone (and don't have a card as you are a foreigner), don't call collect - their clerk Raoul refuses to accept charges. Thus, you must trudge with your heavy luggage around to find a working phone or information desk and then trudge back to the hotel shuttle point. Often, the shuttle bus does not arrive which necessitates a second trip. The next morning, don't expect anything much better. The driver was late and, to save time, dropped everyone off at Terminal 1, regardless of our protests. Another long trudge with heavy baggage until you came to your correct terminal - not good if you have a short time to catch your flight. How a hotel can screw up a simple shuttle service, even if contracted out, is beyond me. I would rather spend a few more dollars and catch a shuttle that does not need calling and comes regularly (Best Western, Holiday Inn, Sheraton)- at least you will arrive in time for a good night's sleep.Other than the shuttle, their rooms are clean. The decor is a bit dated. No restaurant yet. The free breakfast is make-your-own toast, bagels, boxed cereals, with coffee, Nothing hot and fairly sparse offerings.",
      "rate": 2.0,
      "tripDate": " July 2011"
    },
    {
      "title": "If every hotel in Toronto is booked, and you really need a place to stay...find a chair and sleep at the airport.......”",
      "text": "I was in a jam and was re-routed through Toronto and had to spend the night. It was a last minute booking on booking.com and was charged $300 CAD about $230 USD for a room. It is close to the airport (about 7 minutes) but not as close as just staying at the airport which is exactly what I should have done. Upon arriving, you'll be greeted by a line that might resemble the last gray hound bus leaving Louisiana before Hurricane Katrina. There were two gentlemen working the counter and I'm not kidding, it was about 15 minutes per check-in. Just for the record, there is nothing in this review that could be pointed too as exaggerating.  About 90 minutes later (approximately 1:15 am) I am at the check-in counter and they guy tells me, “I don't think we have any more rooms!” During this 90-minute wait I saw the following walking in and out of the hotel lobby.  Remember Arsenio Hall and Eddie Murphy from the movie Coming to America? Okay, they were there. Remember that movie Dazed and Confused - the entire cast of stoners was there!  Remember that serial killer, Richard Ramirez, the evangelist Tammy Fay Baker, the Menendez brothers, they were all there walking in and out of the hotel at 1 am stoned out of their minds. It was seriously bizarre. Back to the check in..... finally they had a room for me. I check in and go upstairs, the elevator moves at a pace that wouldn't beat a 3 toed sloth down a tree. The carpet in the hallways looks awful, the entry to the room wasn't bad, the actually room itself was acceptable at first visual glance. First stop, the shower...the shower is one of those plastic stand in stalls with a beige plastic flooring that has some foreign substance stuck to it. I laid a bath towel over the floor of the shower and took a shower. No soap or shampoo, is provided in the room. So, I went to call downstairs and wouldn't you know it, the phones don't work...I mean, you don't even get a dial tone....So, I take a shower if you can call it that and get into bed. I inspect the bed carefully. First, they have an awesome alarm clock on the nightstand that is plugged into nothing. In fact, there isn't even a plug anywhere near the bed and you can't call downstairs for a wakeup call because there is no phone. I still can manage....”Come on, I can do this!” I inspect the bed carefully and spend about ten minutes determining if i should sleep fully clothed or risk just sleeping in a t-shirt and briefs....I opt for the latter. I start to feel the pillows or i should say they start to feel me. I am not sure what they are made out of but I think it is safe to say they are one ingredient way from being a piece of plastic. So I’m trying to figure out what these pillows could be made out of and then I thought, we'll let me look inside the pillow case...BAD MOVE FOLKS...if all else fails and you're at this HOTEL do not, for the love of god, do not look inside the pillow case.... So, I go to my suit case and try to determine what would make a good pillow. I got it...my toiletry bag wrapped in a towel...that will do it....as I’m getting this prepped, I can see behind the mattress. There is a 3-inch gap between the mattress and the box spring, we can call this the 3 inch ledge of collectable nails, hairs, oh my god, i can't re-live this. ...Let's just say, if all else fails and you absolutely have to be here at this hotel, for the love of whatever god you love, DO NOT LOOK at the 3 inch Pearson Hotel bed ledge...Just don't do it. You'll save yourself those goose bumps you get when you think of a horrible experience.....Check-out at 6:15 am. That was pleasant. I arrived in the lobby about 17 minutes after entering the elevator on the 5th floor, i arrived downstairs, this bright eyed bushy tail fella greeted me and informed me of the free breakfast around the corner. My uber just arrived in time to save me another 250 words in this review telling you about the breakfast buffet which like my pillow case, i can assure was probably one ingredient way from eating plastic for breakfast.......Seriously, unless you can be as stoned at those kids, or coming from a third world African country, i would seriously rethink staying at this hotel.",
      "rate": 1.0,
      "tripDate": " August 2016"
    },
    {
      "title": "Will Never Return",
      "text": "We stayed here the night before leaving on vacation. We chose it for the proximity to the airport and the stay and park package. The hotel is dated, which is fine. When we entered the room there was a mildew smell, as we walked into the room we could see water damage and mold where the wall met the ceiling. The smoke detector in the room was disconnected and removed, which is both extremely unsafe and illegal. The room was also not what I would consider clean. The bed spreads did not appear to ever have been washed, there think spider webs in several locations and when I tried to open the window (which didn’t open) to get rid of the smell, the window ledges were also thick with dust.We will not stay at this hotel again and wouldn’t recommend anyone else does either.",
      "rate": 1.0,
      "tripDate": " February 2024"
    },
    {
      "title": "Under renovations and not ready",
      "text": "So booked this room while it was under renovation and it met my basics but the washroom really isn’t ready at all. You can see the mirror is missing. The tap was loose and the water pressure was pretty weak. The bedroom was better put together but the pillows are very small. The bed comfort was ok and the springs was a bit harder than I like it. Overall it worked for a business stay",
      "rate": 3.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Horrible",
      "text": "It is a place in the middle of nowhere without commodities, not a single one. I starved all the morning there is nothing to eat or drink. The staff do not use mask and is particularly not nice. I had an early check in and the man in the desk told me without checking anything, that there were not early check in today. He had to admit that he was wrong. I arrived an hour sooner, so I am waiting in a horrible lobby, with construction material in the floor, a permanent bip, and anything else. It is so in the desert that I hope I can found a taxi to go back to the airport, the man in the desk won't help, I guarantee.",
      "rate": 1.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Comfy Stay",
      "text": "Nice hotel, really close to the YYZ airport.Really comfy kind bed, fridge in the room, iron, and iron table. Clean place, lack of noise.Great Breakfast Buffet, with a variety of food, teas and coffee.Friendly Staff",
      "rate": 5.0,
      "tripDate": " August 2023"
    },
    {
      "title": "Someone tried to steal our vehicle",
      "text": "It took over an hour for the shuttle to come pick us up. We had to call three times. While we were gone, someone tried to steal our car and damaged the front end. They tore off our front bumper well and tried to hotwire the car through a part on the driver side near the headlight.",
      "rate": 1.0,
      "tripDate": " April 2024"
    },
    {
      "title": "global airport parking -shuttle",
      "text": "We (my wife and 14 year old daughter) arrived with our confirmation ticket on August 8/12 and were promptly shuttled to the airport. When we returned on August 15/12 we called the Days Hotel for a pick up at 6:20 p.m. We were finally picked up at 7:45 p.m. We had made five phone calls to the hotel during that time. No answer was given for the delay.When the driver finally arrived, he refused to give an explanation for the delay and also refused to get out of the van to open the doors. He said that he was only the driver and not a baggage boy. A male passenger opened the back door and the side door for us. This passenger was picked up at the other terminal. He was with his wife and young daughter. I did not close the doors to see if the driver would get out of the van and close the doors. He told me to close the doors and I refused. He drove off with all of the doors open. My wife said that she was going to call the police. The driver pulled over, turned the van off, and refused to move. He told us to get a cab to the hotel. We phoned the hotel again and the driver finally started the van and drove to the hotel.At the hotel, all of us went to speak to the manager. The manager was calm but we got into another verbal confrontation with the driver.This was a terrible way to finish an enjoyable vacation. Shame on the Days Hotel for employing an individual with so much anger, no people skills and endangering the lives of others.",
      "rate": 1.0,
      "tripDate": " August 2012"
    },
    {
      "title": "Beds were not clean but worst of all this was a HORRIBLE customer service experience",
      "text": "I’m going to start by saying that I’m not one of those people who is especially fussy about hotels, nor am I generally one to complain (you can see I've posted several other positive reviews about other hotels and resorts).   They don’t have to be modern or fancy, but they do have to be clean.   We had a concern about the cleanliness of the beds in our rooms at this hotel and trying to resolve the issue after-the-fact was a very frustrating and extremely disappointing experience – one of the worst customer service experiences I’ve ever had in my life! In April we travelled to the Caribbean for a week with friends and left their car at the Days Inn Toronto Airport before our trip, with the intent to stay overnight when we returned after a late flight.   We chose the Days Inn because the price was reasonable and we weren’t expecting a 5 star hotel.   When we arrived we were very surprised that the lobby was recently renovated; everything was shiny and new and appeared very nice.  We had pre-booked the airport shuttle and didn’t have any issues getting to the airport.   On our return, we landed at Pearson at 2:30am, it had been a long day of travelling, the weather was crummy and we were really looking forward to a few hours of sleep before driving home in the morning.   We checked in sometime around 3:30am.  When we entered our room we first noticed how everything (bathroom fixtures, carpet, furniture, etc.) looked brand new, but then we noticed the lights were already on, there was an open phone book on the coffee table and the bed had been turned down unevenly.   It didn’t look right, it seemed that someone else had been in this room already, so we didn’t touch anything and called the front desk right away.   The staff member at the desk agreed that the bed shouldn’t be turned down already, apologized and brought us a key to another room within a few minutes.   This was not a problem.  However, once in the 2nd room, as we were getting ready for bed, our friends called from their room down the hall to say they had turned down their bed and found what appeared to be SCABS and BLOOD droplets on their sheets!  They were really upset about this and said they’d prefer to just drive home, despite being exhausted.  We then checked our bed and found 2 small spots, also looking like blood - near the pillow.  My friend advised the front desk that he was willing to pay for the parking, after all, the car had been there for a week, but that we expected to be refunded for the rooms.  Again, the man at the front desk apologized to us.   He advised that he didn’t have the authority to refund the rooms, but that he would let the manager know about it the next day.  Once hearing that we weren’t going to be refunded, we asked the front desk man to return to the rooms with us; we wanted him to see the condition of the beds and we wanted to take pictures.   He did this and my friend took pictures.  We left at 4am, only 30-40 minutes from when we had checked in.  We stopped for coffee and drove 3 hours home.The next day, my friend and I each called the hotel and spoke with the manager, explaining our concerns.  He did not even apologize for our experience.  He said he was going to “investigate” and he would call my friend back the next day.    He did not call back the next day, not even after I called to follow up with him.  In fact, it took a WEEK, after leaving several messages with other staff members and finally a phone call to register a complaint with a 1-800 customer service number, before we ever heard back from anyone at the hotel.   At that time I was told it wasn’t blood, but maybe ketchup or chili sauce on the sheets, which I don’t believe.  I was offered 50% off a future stay, which I thought was ridiculous – blood or hot sauce aside, the way they had handled our concerns up until then was completely unacceptable and for that alone I would never return there - not even for a free stay.   Besides that, even if it was ketchup on the sheets, it still means they weren’t clean.   I said that I didn’t want 50% off a future stay, but I expected a refund.  We didn’t stay there because the beds weren’t clean, not because we changed our minds or wanted to drive all night long.  I was told that he had to consult the manager, but I would get a return call within 24 hours.  Of course, no one from the hotel called me back, again.  I had to call back several days later and after another very frustrating conversation, was finally told that they would refund us only for 1 room - not the room with the parking (which was my friends’ room, and actually the one that had the most stains on the bed and was the reason we left the hotel).  We’ve moved on – it was never about the money, but about the principle of it.  Other than the man who was working the front desk that night, I’m extremely dissatisfied with how the other 3 managers/staff members I spoke with handled our concerns and I will continue to tell every person I know who is looking for an airport hotel to NEVER stay here.   Even if the problem we had with the sheets was a 1-time thing, (maybe the housekeeper was having a horrible day?) I am confident that any guest who has any sort of issue/concern will experience a massive headache trying to resolve it with this management team!",
      "rate": 1.0,
      "tripDate": " April 2011"
    },
    {
      "title": "MOST HORRIBLE EXPERIENCE - OWNER IS RUDE! NEVER GO THERE!",
      "text": "I booked this hotel online through bookings.com yesterday August 9, 2011 and decided to check in a little earlier than 3pm. I get there, check in and go to the room and it was just not what I was expecting and let me tell you the pictures online are deceiving! It stated on bookings.com that you could cancel by 4pm so I didn't think I would need to use this option.  I mean its not the most top notch hotel but at the same time, its NOT what I wanted and expected when I got in. Within a minute or so I call and ask the receptionist if I can cancel the room and she said I would have to speak to a Manager since I already checked in. Fair enough - I speak to who I think is a Supervisor and I explain the situtation; I have been there less than 5 minutes, I booked online, its not what I was expecting etc.  He starts raising his voice and tells me he does't give a damn, I should have not checked in. I said well that's why I am calling and have been here only 5 minutes. He kept saying he doesn't care and he can't help me and I would get charged the full amount. I was so shocked to find out that he wasn't the supervisor but the Owner. How does an Owner speak to someone like that? I was so disgusted by it and decided to pay the $100 he couldn't part with and went somewhere else. I went downstairs and he didn't even speak to me. If he had spoken kindly to me on the phone, I may have reconsidered but for $100, he is now going to have m tell my story to over millions of people. Service is crap, the owner is utterly rude and the room sucks. I would NEVER go there again if my life depended on it. I just can't understand why the Owner was shouting when I was speaking so calmly and trying to explain why I wanted to cancel and he didn't want to hear any of it. Can you imagine if you stayed there and something went wrong, or you needed something, or had an issue. Good luck getting anywhere with someone like that...horrible. Ifhe is like that; I can only imagine what he has trained his employees to be like. And to represent Days Inn....forsure I will be writing to head office as well.  I ended up at another hotel who was very accomodating and you can tell great service from one that is crap like the one I experienced. You go to a hotel to relax and enjoy yourself but with the same token, you shouldn't be spoken to rudely or shouted at.",
      "rate": 1.0,
      "tripDate": " August 2011"
    },
    {
      "title": "Turn out the lights and send all the staff home",
      "text": "I had an early flight to the U.K. the following morning and wanted to be a shuttle bus ride away from the airport. I arrived late and at check in I requested a wake up call. My wake up call never came and with seconds before the departure of the shuttle, I called down to the front desk and asked them to please hold the shuttle and I would make every effort to be there in a few minutes. The Night accounting chap Immeditaly decided to have an attitude about how they could not hold the shuttle, there other guests waiting blady blady bluh.When I met Roger face to face I was not a happy camper, the attitude continued, I recommend Roger for some customer care training. If you are an airport hotel and you don't wake up your guests to enable them to catch their flights. \"Turn out the lights and send all the staff home!!\" The response I received from Angela Gleason Resolution Consultant of Wyndham Hotels was a standard form letter, just not good enough. I did make my flight, no thanks to the Hotel team. Missing a wake-up call in a hotel is a major error, further punctuated if you are an airport Hotel. Sorry folks I won't be back and will tell everyone about this experience.",
      "rate": 1.0,
      "tripDate": " March 2011"
    },
    {
      "title": "HELL",
      "text": "my husband and i booked there to stay the night because we had a 600 am flight going to mexico in the morning and had to be at the airport a couple of hours before our flight and we live an just over a hour from the airport so it made sense to stay in toronto for the night  we arrived and check in with a idiot who was rude and did not care about anything except himself we seemed to be bothering him tryed to ask about our shuttle to the airport in the morning and he said oh no that has to be booked well in advance which they offer on line shuttle to airport after such a long drive and alot of problems we managed to get our room and a ride to the airport in the morning we asked for a wake up call and did not receive on thank god my hubby set his cell phone to wake us up we got on the shuttle bus only to load our own luggage aboard and had the drive from hell to the airport i thought i was going to fall out and i had a seatbelt on we were then given a card to call them when we returned and they would pick us up to bring us back to the hotel to pick up our car and go home WELL  we landed got our luggage and so on called and was told to be in a certain spot to be picked up we were told he would be there in about 15 mins ok fine we waited 45 mins then called back as we were left standing outside in the bitter cold with no shelter was then put on hold on the phone for about 3 mins then told the driver would be there any min still no shuttle we watched other hotel shuttles come and go not to mention it was late at night so no traffic only after a hour a van showed up with no name on it the driver got out and screamed ride days hotel frozen i got in my hubby had to load our luggage into the back as the driver just stood there after he opened the door a couple of mins later another couple came running and jumped in saying they had waited way longer than us they had came in on a earlier flight another ride from hell back to the hotel to get our car i was so cold i went into the lobby while my hubby went to get the car the other couple did the same i was so tired and mad at this point did not want to get into it with the desk clerk so i just stood there waiting for my hubby and our car well the other couple had another idea they very politely tried talking to the front desk clerk about it the front clerk played stupid and was very rude to them then he passed it off to the manager who was there who came out of his nice little office only to treat them even worse then lying to them saying they had to pick up other people and had got there and they were not there thats when i stepped in and told him he was lying we had been there waiting where we were told to wait  no shuttle had come for any of us then he turned around and said what do you want me to do we said at least say your sorry or something there was a mix up or what ever NOPE shook his head and walked away what a joke i would never stay there again even if the rooms are free and they paid me to stay there i would rather walk to the airport from home in a snowstorm have traveled all over the world and stayed in all kinds of hotels and most of the time fly out our toronto but never have we been treated like garbage like this i will tell anyone who will listen about this place and how they treat you and to make matters worse we own a bussiness of our own and would never even think of treating a guest this way and if our staff did they would be looking for work elsewhere NEVER EVER STAY THERE EVEN IF THE ROOMS ARE FREE UNLESS YOU LIKE TO BE TREATED LIKE @$#*&^ and i am keeping this short could go on about everything else!!!!",
      "rate": 1.0,
      "tripDate": " January 2011"
    }
  ]
}