{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Comfort Inn Toronto North",
    "url": "/Hotel_Review-g155019-d184058-Reviews-Comfort_Inn_Toronto_North-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.0",
      "reviewCount": 224
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "66 Norfinch Dr",
      "addressLocality": "Toronto",
      "postalCode": "M3N 1X1",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/13/47/3d/cb/comfort-inn-toronto-north.jpg?w=500&h=400&s=1"
  },
  "description": "Welcome to Comfort Inn Toronto North approximately 9.3 miles from Pearson International Airport, near the beautiful city of Vaughan - The City Above Toronto. Guest's are within minutes of the city's best shopping and attractions. Our comfortable guest rooms are equipped with all the standard amenities plus complimentary hot breakfast, complimentary high speed internet, free parking, free weekday newspaper, free Coffee all day in lobby.",
  "featues": [
    "Free parking",
    "Parking",
    "Free High Speed Internet (WiFi)",
    "Wifi",
    "Free breakfast",
    "Non-smoking hotel",
    "24-hour front desk",
    "Self-serve laundry",
    "Breakfast available",
    "Air conditioning",
    "Housekeeping",
    "Microwave",
    "Refrigerator",
    "Flatscreen TV",
    "Non-smoking rooms"
  ],
  "reviews": [
    {
      "title": "NEAT But Unclean!",
      "text": "I have stayed here 3 times during covid. It is affordable but not too clean. Old cobwebs in each corner of the room and always find stains on the table and walls in the suite and washroom. I Brough my own cleaning products with me the last 2. The fridge was dirty inside and worse on the outside. I think maintenance just focuses on the beds and towels and emptying the garbage cans. The cloth shower curtain even smells musty. Its neat but it is not being cleaned properly. Even the tv remote had thick gunk on it. They need to wash down with water and disinfectant. And the ice bucket and coffee maker were filthy. Seems like they don't care",
      "rate": 3.0,
      "tripDate": " January 2021"
    },
    {
      "title": "Getting Better",
      "text": "As you probably know, there is renovation going on.  It's confusing to navigate,but not that bad really.  Reception was located in 129 and breakfast was in two rooms-one for food and one for seating.  You really feel for the staff.Speaking of staff, the late afternoon guy was great-very nice, very helpful.  The chick the next day?  Not so much.  I give her a bit of a pass because of the state of things there.Coffee, fridge and microwave in the room.  Very clean overall.  Having sliding door access to the room was a big plus.  I didn't do breakfast, but I looked at it and it seems pretty good-hot options as well as the standard pastries.In the short term, I recommend MUCH better signage.  On the longer term, putting the numbers on the outside of the rooms would be helpful.The only real complaint I have is the wifi.  I got the room to work in peace, and couldn't do it because the wifi was so crappy.  That's a game changer.  It's an ok place at a reasonable price, but what I needed most wasn't there.I may try it again once the construction is done.  They said it would be about a month, which probably means two.",
      "rate": 3.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Less than stellar stay",
      "text": "Hotel is under construction. Front ‘desk’ is in a room- took one hour to check in. Property is in random states of disarray. Room was a 3 dressed up as a 9… new wallpaper, paint, taps but same old stinky room. Hallways were flooded with perfume to mask the smell. TV sometimes worked (low to no signal), toilet leaked. Hot breakfast was a sham- have to order it the night before and you get a bag which consisted of a cold bfast sandwich, juice, apple pieces- at hotels I have stayed at recently I have seen the return of hot breakfast dining. Not impressed with this property.",
      "rate": 2.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Terribly dirty",
      "text": "Room was smelly , windows filthy readon they toks us is because cleaning staff dont do windows . Dirty panties hanging in bathroom after cpl hours they offered to change our room but I couldn't as had tickets for concert needed to get too . Asked next day for some kind of compensation al long with multiple other guests checking out was told because I didn't change rooms couldn't be that bad get nothing not even a choice hotels voucher  I am very disappointed in this hotel never again carpets in hallways and rooms are disgusting . Stains on all furniture and headboards like greasy hand stains ,mouse and bug sticky traps in rooms",
      "rate": 1.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Overall disappointing stay! Best to avoid.",
      "text": "This hotel is undergoing renovations so some deficiencies can be overlooked. I would avoid this hotel until renovations are completed. One reason I booked here was for the guest laundry. There was a handwritten notation on the dryer saying it was broken, so I asked the check-in clerk (manager?) and he didn't seem to know if it worked or not. He said there's a laundromat down the street. The hallways are dirty and there is no breakfast area due to the renovations, so it's a grab and go bagged breakfast. They didn't have my order ready for pickup even though I had ordered the evening before. There was no bottom sheet on my bed so I was asked to go downstairs and pick one up (no service to the room!)  There was no hand soap in the room and was told there was liquid soap in the room (there wasn't), so another trip downstairs. I mentioned that I should receive a discount for all the deficiencies noted and he said he would put a note on my file. No discount was offered. The staff's attitude was very disappointing as they didn't seem to care about any of the issues we  raised. I usually don't complain much but this stay and staff attitude was unacceptable, especially when paying $270/night plus taxes.",
      "rate": 2.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Do not stay here",
      "text": "The hotel is under construction and has no front entrance or elevator. It is dirty and dingy in the hallways, there are holes in the carpet and stains everywhere. We had to carry our luggage to the second floor. There is no AC and since it is summer the room was stiflingly hot and the window barely opened. The continental breakfast is a limited selection “to go bag”and must be pre-ordered before 11pm the night before and our flight was late arriving so we couldn’t get breakfast the next day which is just dumb. The room itself was clean and the bed was comfortable but was a double instead of the queen we booked. Basically, it was a place to sleep and we got the hell out. Spend a bit more and stay somewhere else is my recommendation.",
      "rate": 1.0,
      "tripDate": " June 2022"
    },
    {
      "title": "KEEP AWAY",
      "text": "I am only giving this company a 2 rating because the reception was fair.  I stayed in this hotel from 19-21 August 2022.  To get to the reception area you have to walk through the active construction area.  The initial room I was placed in was dusty.  While sitting there I saw a mouse running through the room.  I immediately went down stairs to alert the front desk.  I was placed in a new room  It was also dusty.  I went out and purchased Lysol spray and rat trap to secure a temporary healthy environment.  On pulling back the sheets, there was a long strand of hair on the sheet and the pillow case was dirty.  We stayed there for three days, We requested clean sheets which we did not get.  We requested clean towels we did not get.  In the coffee pot there was a dirty tea bag.     We were promised hot breakfast we did not get.  FALSE ADVERTISING",
      "rate": 1.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Average Accomodation.",
      "text": "It was average but good enough for my purpose.   Room and bathroom is clean.  Sheets are clean.  They were having renovations in the front so I didn’t get a chance to see it.  The reception was in a small room. Breakfast was grab and go.  Am not sure if this is because of covid or the renovations.  The breakfast sandwich is one of those frozen one’s you need to microwave.   Did not appreciate the heavy traffic due to heavy construction along Finch Ave.  I would avoid this area right now if you are on vacation. You won’t enjoy the scenery that’s for sure.",
      "rate": 3.0,
      "tripDate": " January 2022"
    },
    {
      "title": "Horrible experience!",
      "text": "We had a really bad experience with their Night Auditor who kept stating \"its not my problem\" every time we tried to address our concerns. Given all the confusion, we never ended up staying at the location. When we called again to speak with Mazie (the assistant general manager), her rude demeanour explained her staff's behaviour. She not only was extremely rude and difficult to deal with, but I am on hold as we speak still trying to resolve the situation. I can hear her laughing and joking around in the background. Haven't had a worse hotel experience!!",
      "rate": 1.0,
      "tripDate": " May 2015"
    },
    {
      "title": "Stay away",
      "text": "This comfort inn should actually be condemned or closed down and quarantined , it was the most disgusting , dirty, unorganized building of filth.My comforter on the bed was absolutely covered on unwashed stains, when I removed the comforter with care and not with my hands. My white sheets were covered with human pubic hairs, please people who read this. I can hounestly say, it turned my stomach and this isn't a joking matter.I'm shocked that the health department hasn't shut it down, it was a very bad experience for my Father and I . I hope something comes out of this review, I'm going to do my best to get the word out there.I'll be contacting the Heath department first, avoid the hotel.When we asked for our refund and checked out, I assure you. They weren't surprised, then the 350$ ,,, 129$ for room and a 200$ security deposit  is held for 3 business days. Very,, very scary place. If you like sleeping with one eye open and in a complete starized boys suit on. Knock your socks off ,",
      "rate": 1.0,
      "tripDate": " July 2016"
    },
    {
      "title": "Pictures do not mean anything",
      "text": "when we arrived the frontt desk people where nice. we got our keys to the room and they did not work.we found a maid and she could not open it as well so she got the master key. It did not work very well but got it open. so we went down to the front desk and said we could change rooms or wait till the morning to get it fixed. we were behind sceduale because we got in traffic and we were coming from North Bay and we needed to go to the willcall at the Rogers Cup tennis and the game started at 6:30 and it was after 5 oclock and the gates opened at that time. so we changed rooms. then we decied to either walk or take a taxy. well they said the taxi would be in 5 min. instead it was 15 min and we had to get our tickets and not miss the tennis. we got into the taxi and because there was so much traffic we paid 15.25$ for the taxi drive. I realized that they charged me a deposit of 150$ for incase someone ruined things. I paid in advaance on the credit card. I have been to hotels before and have never been charged this fee. on the halways and doors they appoligised for the repairs. but the place was disgusting. the car port looked like it was going to fall apart and land on someone or something. there was no swiming pool. we arrived at 5 oclock pm and there were maids still cleaning the rooms. if there is so much renovations to be done. close it downand then reopen. do not know who owns it but shut it down before someone gets hurt. fix it or tear it down. will not be retuning ever again",
      "rate": 1.0,
      "tripDate": " July 2016"
    },
    {
      "title": "Dangerous. Only party rooms.",
      "text": "This place is where major drug deals happen and where thugs go to hide from other thugs or the police who have a station only a few doors down. PiZza delivery refuses to exit their vehicle for fear of being robbed. Both times we stayed (5 nights total) we hardly slept due to the noise. But not just noise like \"oh i think i heard the neighbour\".. Its the kind of noise that makes you think someone is being murdered or a famous rapper has taken over the building. Which is probably very possible judging by the amount of blood and signs of violence and what must have been some truly wicked parties. How did someone manage to put cigarette burns into a toilet seat? The entire place smells of mold and fresh smoked marijuana. Day time staff is generally rude and inefficient in both customer service and the English language. Night time staff (which seems to always be the same older gentleman ) is especially rude and cold. You can forget all the regular conventions of a normal business that respects its customers. He sat at his desk for approx ten minutes calmly reading and browsing his screen before serving us and making it very clear that we had disturbed him at 4am while a small crowd of thugs gathered before what looked like a fight or a large drug deal near our momentarily parked vehicle. We later investigated the contents of our room purely out of boredom due to a bad signal on the only two working tv channels. The impromptu scavenger hunt found  1 zigzag rolling paper, 1  bra, 1 girls shirt, 1 store receipt from two days prior for the shirt. 1 pair of girls leggings, 1 elastic hair band, 1 condom wrapper, a dozen printed pages of hotel recipes for months spent in our room. Blood stains, burnt incents, melted candle wax on the base of every lamp. Another night the music from the party next door carried threw the wall and emanated from the wall plug has if it had a set of built in speakers playing directly into our room. It was only turned down when the fight broke out over someone's missing drugs. Which in all fairness would have been avoidable if i had told them about the two prostitutes who i witnessed removing it from a back pack in the hallway after they mistakenly tried to open my door.  However I chose personal safety and minded my own business while forming a mental plan of escape incase of stray bullets from their \"ghats\" suddenly coming threw the wall. Then there was the nice sobbing couple across the hall who screamed and wretched in emotional pain the entire night.   I found the experience generally entertaining but realistically this place is dangerous and generally disgusting. We decided to complain upon checking out after the second visit just to see what would happen and if we would receive discount considering the noise was impossible to deny.  The response was \" yes, we had many complaints and tried to tell them to turn it down but no one would come to the door, so we're just waiting for them to check out and we'll likely ban them from staying here\" .  Really? A police station is literally a few buildings away from this location and the back door to the ground floor room was openly spilling people and alcohol all over the parking lot. But the reason you didn't stop them for your paying customers is no one came to the door? .. Really!?This place is really \"special\" and not in a good way.  Don't bother complaining because your business isn't necessary when there are more than enough criminals to keep it going.",
      "rate": 1.0,
      "tripDate": " December 2015"
    },
    {
      "title": "Disgusting...run fast and far away",
      "text": "We booked a room for 4 days ...arrived to find the only room available wasn't what was booked...was very dirty..burn holes in the blanket and pubic hairs on the sheets..the staff didn't care when we complained and we're surprised when we cancelled our reservation to go elsewhere...clueless.  the only positive thing was  they did not charge our card for the almost stay saving us from an unpleasant argument.  Do not even think of booking here...not even close to the comfort in standards and if I were managing this chain would fire the management and gut the place.",
      "rate": 1.0,
      "tripDate": " August 2015"
    },
    {
      "title": "AWFUL AND DISGUSTING",
      "text": "booked rooms for a wedding with 3 other couplesrooms were not ready on time nor together as per a month previous request hallways we full of garbage bags, food stains and debrisstairwells had large garbage bins which smelled awful through the hallwayshotel room door did not work had to use card 6+ times to get incarpets in room were wet bathroom shower sink and toilet had hair stuck to them, was not cleaned thoroughlyair conditioner not working properly ceilings had water stains and stucco was falling to groundbreakfast in morning- plates not clean, small stuffy room.called front desk to address issues and no answer.made complaint online to management and was given 16 dollars back of the over 100 we spent on the night. poor establishment, experience and customer service",
      "rate": 1.0,
      "tripDate": " July 2015"
    },
    {
      "title": "Digusting",
      "text": "I usually can find the good in most situations but this hotel has left me with a sour taste. The hotel claims to be non smoking but i could smell stale smoke in my room. I have asthma which made it all worse. I was up all night coughing from the disgusting smell. The phone in the room did not work and when i informed the front desk they responded with there is nothing they could do. The bed sheets were so old and thin and the wash clothes were full of holes. I should have taken pictures to show. 95 dollars a night i got what i paid for. I should have paid the extra 50 dollars and stay at the holiday inn express. Do not stay here!",
      "rate": 1.0,
      "tripDate": " July 2015"
    },
    {
      "title": "Loud and lots of pot",
      "text": "Could not sleep all night loud music till 4:30 am and a heavy smell of pot in the hall. Lots of non guests partying there. The man at the front desk was nice but had his hands full trying to kick them out he should of called the police I was going to. I will be calling comfort inn head office.",
      "rate": 1.0,
      "tripDate": " May 2015"
    },
    {
      "title": "Could have been better",
      "text": "This hotel is a bit older and could use a renovation.  The colour scheme is old and the carpet in the room felt damp. The room was clean, although there several large cobwebs hanging from the ceiling above the bed.  Had to ask for a remote control for the TV, but it was prompt and the staff were friendly.  So friendly that they feel free to help themselves to breakfast and sit among the guests, even though one fella was ill with a cold - yuk to that!  Convenient location and affordable but not one of my favourites.",
      "rate": 3.0,
      "tripDate": " April 2015"
    },
    {
      "title": "its ok",
      "text": "Staff was friendly and helpful. Bed was very comfortable. Room was clean ----- BUT --- bathroom was kind of dirty --- had to wait on towels for an hour , only had one for two people ---' only coffee in room for one---- TV reception was fuzzy on almost all channels --- but if your a smoker , they have smoking rooms !!!!!!the rates where affordable n fair .",
      "rate": 3.0,
      "tripDate": " February 2015"
    },
    {
      "title": "Good Stay",
      "text": "I had stayed here for a business trip recently, and it is pretty much what you would expect from a Comfort Inn. The room was clean, lobby seemed nice, and when I checked in, the staff was friendly.  The breakfast is good and served the purpose, so would probably stay here again if need be.",
      "rate": 4.0,
      "tripDate": " August 2014"
    },
    {
      "title": "Exactly What We Expected",
      "text": "We wanted a hotel close to Hwy 400 with less than a 10-15 minute drive to both Downsview Station and Canada's Wonderland.  We were only at the hotel to sleep so a pool, gym, or other such amenities were not necessary.  The hotel is a little old and is a bit musty/smokey smelling but overall it served the purpose.  Check-in was quick and easy and the service was great.  For $85 a night with free parking and breakfast, you can't go wrong.",
      "rate": 3.0,
      "tripDate": " August 2014"
    },
    {
      "title": "Worst Hotel Ever",
      "text": "Fantastically dirty. There were cigarette burn holes on my comforter. Loud. Hallways had teenagers running up and down all night. Breakfast is non-descript, sort of like sawdust fried in grease. Spend the extra and go to Vaughan instead.",
      "rate": 1.0,
      "tripDate": " January 2014"
    },
    {
      "title": "Comfortable and easy access to hwy",
      "text": "Stayed at this property in Feb. 06.  Looking for the best rate in the area and this was definitely the cheapest we can find.  Staffs are very friendly including the housekeepers.  They actually speak to us... Rate includes with continental breakfast.  Healthy selection and if you want a bit of grease there is Perkins next door offers us 10% because we're staying at Comfort.   Location is amazing right off Hwy 400 and skip away from 401. Make it easy to travel around town.",
      "rate": 4.0,
      "tripDate": " February 2006"
    },
    {
      "title": "Okay, if out this way",
      "text": "Stayed there for two nites.   We had rental car and were doing collge campuses that included North York area and downtown.   Generally took car to park and ride Downsview and took subway downtown which worked out okay.Hotel itself is a little dated.  It was quite full when we were there and they gave  us a queen with a sofa pullout that was a tough sleep.  But otherwise the free parking and overall price can make this a viable option unless there is a need to be right downtown.   Traffic can be bad and parking to take subway takes a while . . .",
      "rate": 3.0,
      "tripDate": " September 2005"
    },
    {
      "title": "vary diapointed",
      "text": "This place I stayed at 15 years ago and had a good stay. This time the outside was not bad, the lobby was nice, as I started to go down the hall I noticed there was no base boards, and the carpet was stained in a few places, Ok I could deal with that because I don't spend time in hallways get to the room opened the door and it smelled damp and musty, the only new thing in the room was the flat screen TV everything else was old and well used. The chair I was afraid to sit on the mattress was old and used a lot looking around the room it looked like they had a flood at one time there were big stains on the roof. the bathroom well open the toilet seat and someone used it and did not flush the wall behind the toilet was patched in 5 or 6 places and vary filthy. the tub looked like it was not clean and stained also. I was not impressed I asked for a different room and they said sorry all we have is one other room on the second floor but my lady cant walk up stairs so we had to settle for the room that reminded me of a pig pen. we also got bed bug bites we needed to clean all our stuff even our car when we returned home .",
      "rate": 2.0,
      "tripDate": " June 2016"
    },
    {
      "title": "Disgusting!!!!",
      "text": "The most disgusting place I've ever been.... The rooms smell like urine, stains on everything... Wish I never stayed here! There's people pulling into the back shining lights on our room every 10 mins, you won't feel safe at all. I seriously wish we would of known this we would of never of come here.",
      "rate": 1.0,
      "tripDate": " April 2016"
    },
    {
      "title": "Okay",
      "text": "Not being happy with what we were getting for our money at the hotel where we were staying at the time (see my previous review), and in spite of having read the negative reviews here on TA, we walked over to the Comfort Inn next door and asked to see a room. The disorder of the front desk was not very promising, but an enthusiastic  young man very willingly showed us a room. And we were nicely surprised with what we saw.So we checked in the next day and were given a spacious room on the ground floor with two queen beds and a patio door that opened for fresh air, which was a relieve from the musty air in our room at the previous hotel.True, the furniture is old but we could not find any fault with the cleanliness. The bathtub had traces of a bath mat that had been removed: it did not look nice, but again, it was clean.Although the hotel sits right next to a busy highway and beneath the flight route of the nearby Pearson International Airport, the room is very quiet. The location, though in a neighborhood with little to offer, was perfect for the purpose of our trip.There is a coffee maker with coffee pads in the room, as well as a fridge and a microwave.Free wi-fi everywhere in the hotel. I used it intensively and it never failed. Fast too.Breakfast is included in the price. Breakfast looks basic but there is white and brown bread, different kinds of muffins and bagels and a waffle machine with dough to make your own waffles. There is juice, two types of (prepacked) jam and a prepacked cheese spread. There are cornflakes, boiled eggs, yoghurt and fresh fruit.Bottom line: not bad at all for this price.",
      "rate": 3.0,
      "tripDate": " August 2015"
    },
    {
      "title": "Dissapointing ",
      "text": "I booked a smoking room online nearly 1 month in advance, upon arrival we were given a non smoking room and told there was no guarantee for the room we initially booked and to just go outside because we had a ground floor room (which was very unnerving for me being in a big city right beside the 401). I checked the guarantee policy and it said nothing about this. The bathroom was not properly equipped for guests - there wasn't even a shower curtain, shampoo, conditioner or washcloths. The only good thing about our stay was the breakfast and the wonderland package was great value but next time I'll just put out the extra few bucks for season passes and stay somewhere else.",
      "rate": 2.0,
      "tripDate": " July 2015"
    },
    {
      "title": "not very clean",
      "text": "Hotel in general (rooms, hallways, etc.) were filthy compared to most Comfort Inn's we've stayed at.Biggest problem was I was quoted an incorrect price to purchase add on's for Canada's Wonderland.  I purchased a one night stay with 2 days at Canada's Wonderland and received prices for 2 days of parking and 2 additional kids for 2 days at Canada's Wonderland.  The price I was given for the 2 day park experience was incorrect.  The man I booked with actually quoted me a one day price.  I am still trying to work it out with the manager because NOTHING  was done when I was there about this problem and 3 shifts of staff wasted my time asking about the problem even though in the end they could do nothing.  I'm feeling extremely dissatisfied with the whole process and wasted so much time.",
      "rate": 1.0,
      "tripDate": " July 2015"
    },
    {
      "title": "Horrible. To put it lightly.",
      "text": "This hotel is overrun with gang members and pimps. Loud noises and screaming filled the halls and echoed into our room during each of our 3 stays.Housekeeping staff were quick, efficient and polite.Pizza men would ask us to come out to their cars because they feared being robbed in the hotel.",
      "rate": 2.0,
      "tripDate": " February 2015"
    },
    {
      "title": "OK if your there just to close your eyes",
      "text": "We paid about $85 for this room and I still felt the sting. The room and property itself was VERY clean. Yet, the decor both in the room in out felt like a time warp back to the 1980s... early 90's at best. We had a smoking room with double beds on the ground floor (I know I know hotels still offer double beds, it was either that or 1 queen) but we had 4 people in our room. This Comfort Inn is more like a motel, 2 floors... drive up to the sliding door.Your rate includes continental breakfast and you have access to the pool at the adjoining travelodge hotel. Travelodge hotel also has a Perkins Restaurant which was good (Denny's style) for a quick dinner. The front desk staff was nothing at all special. \"Jen\" from the front desk \"supposedly\"  the front desk manager was rude and called us at exactly 11am to ask when we were checking out! (check out is at 11am). I asked to stay until 12pm but she insisted she needed our room., the hotel was not even busy that night we stayed! Oh well, thats what you get for $85.... if staying in this area and you want to do the whole Wonerland/ Vaughan Mills mall stay at the travelodge or spend a well worth couple more dollars to stay at the Hilton Garden Inn which is what we did. Brand new hotel only open a couple of months. In that area was also a Courtyard By Marriott, Residence Inn and Monte Carlo Hotel. All of these places were much closer and NEWER!",
      "rate": 3.0,
      "tripDate": " July 2006"
    }
  ]
}