{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Comfort Hotel Airport North",
    "url": "/Hotel_Review-g155019-d188443-Reviews-Comfort_Hotel_Airport_North-Toronto_Ontario.html",
    "priceRange": "$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.5",
      "reviewCount": 400
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "445 Rexdale Blvd",
      "addressLocality": "Toronto",
      "postalCode": "M9W 6P8",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/26/a9/00/78/hotel-exterior.jpg?w=500&h=-1&s=1"
  },
  "description": "Business-friendly Toronto hotel with a roundtrip airport shuttle close to Pearson International Airport. This business-friendly hotel is located in the business district, close to Woodbine Centre, Fantasy Fair, and Woodbine Racetrack. Local attractions also include Toronto Congress Centre and The International Centre. In addition to a restaurant, Comfort Hotel Airport North features an indoor pool. Other amenities include a 24-hour business center and a bar/lounge. Free Wi-Fi, local calls, cable television.",
  "featues": [
    "Free parking",
    "Parking",
    "Free High Speed Internet (WiFi)",
    "Wifi",
    "Heated pool",
    "Free airport transportation",
    "Non-smoking hotel",
    "Laundry service",
    "Free shuttle or taxi services",
    "Airport transportation",
    "Air conditioning",
    "Flatscreen TV",
    "Non-smoking rooms"
  ],
  "reviews": [
    {
      "title": "Hotel is being renovated so most amenities were not available.",
      "text": "The website suggests parking is free but after I got home, I found a separate $20 charge added to my Visa in addition to the charge for the room.  At no time was I told there was a fee for parking.   I think this is an unfair practise and feel my $20 should be returned to me.",
      "rate": 3.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Clean but under construction",
      "text": "Decent hotel for the price but undergoing a major renovation.   Breakfast was strictly continental.    Comfy bed, lots of pillows.  Nice that it had a free shuttle to airport.  Within walking distance of Woodbine Mall and Racetrack.",
      "rate": 4.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Good Hotel for overnight stay",
      "text": "Stayed at this hotel for one night on the way from Newfoundland to Florida. We found the rooms clean and the service excellent. Right across the street is Woodbine Mall, a good place for us to browse while we we waiting to go to the Airport.",
      "rate": 4.0,
      "tripDate": " March 2006"
    },
    {
      "title": "Park and Fly hotel",
      "text": "Hotel was under construction but it was reasonably priced for a park and fly hotel. Also included a nice continental breakfast. Lady who works in the breakfast room was so very pleasant. Rooms were large and clean. Will return. Always the go to place for park and fly",
      "rate": 5.0,
      "tripDate": " April 2021"
    },
    {
      "title": "Loved this hotel!",
      "text": "My best friend and I had decided to stay at this hotel for a night because of a bad experience at another hotel. We should of chose this hotel from the start. The hotel room was very clean and the staff was very friendly. This hotel comes with a gorgeous pool and jacuzzi (that was unfortunately not working at the time) and a fitness room. It's also connected to a restaurant / bar and pretty close to a mall.I had paid about $95/night last minute which was comparible to the other hotel I left the night before, whereas the other hotel didn't have 1/2 the features this one did.The wireless hi-speed internet was also very reliableI would definately stay at this hotel again the next time I'm in Toronto.",
      "rate": 5.0,
      "tripDate": " June 2005"
    },
    {
      "title": "Favourite Airport spot",
      "text": "I love the Comfort Hotel Airport in Toronto and would recommend it to anyone. It offers more than the typical Comfort Inns, but at relatively the same price. Its a great deal with friendly efficient staff, clean facilities and great location near the airport. If you're looking for airport accomodation, this is the place!",
      "rate": 5.0,
      "tripDate": null
    },
    {
      "title": "Good Experience",
      "text": "The Comfort Inn is undergoing renovation but was still an excellent place to stay.  The room was roomy, comfortable and clean.  The staff was friendly and helpful.",
      "rate": 5.0,
      "tripDate": " April 2005"
    },
    {
      "title": "Disgusting Customer Service",
      "text": "I booked one of your hotels the comfort inn on airport Road in Toronto for the night of May 21st. I booked a park and fly package. When I got back into Toronto from my vacation the night of May 27th I called the number the hotel had given me to be picked up at the airport and brought back to my vehicle. My wife and I proceeded to the area we had been advised to go to (C22). After about 10 mins of waiting a comfort inn van pulled up. I lift my wife's bag and mine into the vehicle while the driver stood and watched, never offering any assistance. My wife climbed in the backseat at the same time. The driver then asked me the address of my comfort inn hotel and I told him the airport road location. As soon as I said that he starts to yell at me, \"get out, leave now\". My wife and I were quite confused. I told him I didn't understand why he was telling us this. They he proceeds to start yelling at me to get my bags out. They starts to yell at my wife in the backseat \"get out get out now\". At this time there are about 20 people in the area waiting on pick-ups all watching this man in a comfort inn van yelling and screaming at us. As I'm grabbing my bags out myself, I'm asking him what is going on and then he gets in my face and continues to berate me for reasons unknown to my wife and I.As we finally have our bags out and are back on the sidewalk he is standing beside the comfort inn van yelling at us about the address on the side of the van which can be seen in the picture below. We were both unaware that there was different vehicles for comfort inn pick-ups. Had he asked us before or mentioned it when he pulled up this all could have been easily avoided. After I point this fact out to him he proceeds to get in my face again, my wife now becomes frightened that he is going to become physical with me and I begin to back away from him. Please understand that this is after a full day of travel, all we want to do is get to our vehicle and there is now over 20 people watching this unfold. I'm embarrassed and disgusted by this man and his representation of Comfort Inn.He then speeds off with nobody in his vehicle as I assume it final clicks in that all these people were watching and I had taken a picture of him.After all of this I called back our hotel and waited 45 mins without ever being picked up, I ended up taking a taxi from the airport to the hotel I had paid for a park and ride. I called the manager of the hotel from the address in the picture below this morning. Advised him what happened last Thursday at 8:30pm. He apologized and then proceed to laugh at me when I told him the rate I paid to stay at the airport road location and had the nerve to tell me to stay with him next time I travelled. He was arrogant and seemed like he just wanted to blame the third party company that supplies the drivers.At the end of the day this driver is still a representative of Comfort Inn, as people looked on at this all unfolding all they saw was a comfort inn van accosting a man and his wife. Bottom line is I would like an apology from both hotels and to be refunded my room rate for the night for this disgusting and outlandish treatment of paying customers.",
      "rate": 1.0,
      "tripDate": " May 2016"
    },
    {
      "title": "Terrible Experience",
      "text": "Our family stayed at this hotel on June 12-14 on Choice Hotel Privileges Points (8000 per night).  Upon arrival we were informed that there would be a $10.00 per night charge for our requested rollaway.  I mentioned that we have never been charged for a rollaway during a customer loyalty program stay in the past at any Choice Hotel.  At that point, another person, whom I believe was the assistant general manager, came out and harshly stated that he has worked in hotels all over and that there is always a charge for a rollaway.  I indicated that any additional charge for a pre-booked rollaway should be indicated during the reservation and reiterated that I'd never been charged at any Choice Hotel before when staying on loyalty points.  I told him to just remove the rollaway.  He told me that they would comp the rollaway this time but to remember their policy in the future.   My credit card was swiped for incidentals.  Upon departure the surly receptionist informed me that everything was taken care of and that there was no charge for the stay.Upon returning home and receiving my next credit card statement, this hotel had charged me $114.95 for our complimentary stay.  I checked my Choice Privileges Account to make sure that our points were deducted for this stay and they had been. It took 3 phone calls to US Choice Hotels Customer Relations, 2 calls to Choice Hotels Canada Customer relations, a \"can you call us back as we are busy with customers\" (It funny that when I'm standing at a hotel desk the phone always seems to be the priority) phone call to the hotel and a letter to the Hotel General manager over the course of one month to get this matter resolved.  No apology for the hotels billing error was received.  I even lost a few dollars due to fluctuation of the exchange rate over the month.The hotel itself was very nice.  No fridge or microwave but nice modern rooms in a great suburban location near the Airport.  We were solely in this area to attend Canada's Wonderland and it was a good location for this.  A mall was just across the street.  My wife and I even won a little money at the Woodbine Slots, which we could view from our hotel window.  Nice hotel physically but  terrible service with no accountability for billing error.  I would never stay at the Comfort Inn North Airport again.",
      "rate": 1.0,
      "tripDate": " June 2006"
    },
    {
      "title": "Dreadful place to try and sleep",
      "text": "We stayed here on a park and fly deal. The intention was to get a decent night's sleep and not be too tired for a morning flight. Worst decision we could have made. Should have just stayed at home and left a couple of hours earlier in the morning. The noise was ridiculous. It seemed like every time anyone in the whole building flushed their toilet it caused a terrible noise like a jet engine to sound throughout the room. It happened so often it just couldn't have been only our nearby neighbours causing it. Then on top of that the air conditioner made the most incredible noise all night. The compressor must be shot. It was unbearable. We had to turn it oif and open the windows, but then trucks backing up and horns and car alarms blaring outside all night kept us awake. If it had been any later in the summer and use of the air conditioner been an absolute requirement then it would have been impossible to sleep at all. No exaggeration - I think we would have had to leave and drive home for the night.You may be wondering why we didn't ask for a different room? Well, the front desk staff made it quite clear to us at check in that they were full and our party being split up between 2 floors was because they had no spare rooms at all.Overall not a pleasant stay at all. I would definitely not recommend this place to anybody. They seem to exist solely for the airport parking deals they provide but unless you're absolutely desperate, don't bother with this particular Comfort Inn. It was probaly the worst night's 'sleep' I've ever paid for.The bed and furnishings were 'ok' - dated  and small, but just about acceptable under the circumstances. The shuttle was fine. But the most important thing -  the quality of sleep - was absurd.",
      "rate": 2.0,
      "tripDate": " May 2014"
    },
    {
      "title": "Too much renovations",
      "text": "This hotel has too many renovations happening. The lobby is quite dirty and the washroom downstairs look like not attended by cleaners. We checked in and sent to a room not cleaned with bedding laying on the floor. The only good comment is the shuttle driver was very professional and helpful. Did not get his name but he was young and on duty the 17th at 2100 hrs.",
      "rate": 2.0,
      "tripDate": " December 2019"
    },
    {
      "title": "Park and Fly hotel",
      "text": "Hotel was under construction but it was reasonably priced for a park and fly hotel. Also included a nice continental breakfast. Lady who works in the breakfast room was so very pleasant. Rooms were large and clean. Will return.",
      "rate": 4.0,
      "tripDate": " August 2019"
    },
    {
      "title": "Nicely Renovated Rooms",
      "text": "We had a late flight  and didn't get to the hotel till after 3 am.  We had a quick check in and were assigned a room on the 6th floor.    The hotel was being renovated and our room was very nicely done and had a big screen tv  and a Keurig coffee maker     The bed  and pillows were comfy as always .  The only problem was there were no drapes to pull across the window.  First time I had ever been in a hotel with no drapes.   They were just there for show.  We were hoping to get a little more sleep then we did before the room was bright .  Unfortunately a pipe had burst and there was no water when we woke up.  It did come on  about 9:10. (  no fault of the hotel.   )  Things happen.   Clerk at the front was very nice when we checked out.   A nice hotel and handy to the airport .",
      "rate": 5.0,
      "tripDate": " February 2019"
    },
    {
      "title": "Not a good option",
      "text": "It's only good for stay 1 night when arrive or leave, to the airport, but no more than that. The breakfast is not complete, they have some coffe reg and decaf, teas, some bread, jams, donnuts, no good. The reception and all the corridors are dirty seems to be an really old building, inside the rooms is better. The personnel at reception is not so nice, and not helpful,it's neccesary to ask more than once what you need. The laundry service is not driven by them, I sent the laundry and 2 days after I asked in reception for knowing if they had it, the answer was that they just deliver the laundry to the other company and are not responsables for the delays, in the laundry document it say that the clothes will be returned in the same day, in my case not like this. The shower in the bathroom were not working correctly, leaking everywhere and spraying everywhere, after asking them to solve the problem is gets a little bit better but anyway not working correctly. At the end it's not a good place to stay for more than 1 night, they put 3 stars in this hotel, but is really far away from others 3 stars hotels, is even really far from others Comfort hotels.",
      "rate": 2.0,
      "tripDate": " September 2018"
    },
    {
      "title": "exceptional staff",
      "text": "We were stranded overnight and randomly choose this hotel from the list at the airport.  The free shuttle picked us up promptly. The reception at the front desk was excellent. Our room was clean.  We got the shuttle to go back to the airport in the morning.  We were well on our way when I discovered that some valuables had been left in the room. We called the hotel immediately.  After dropping the other passengers at the airport, the shuttle driver took us back to the hotel where the lady at the reception desk handed me a package with our items.  I asked when the next shuttle was booked and the driver said he would take us back right away.  I was very thankful that the staff was so honest and accommodating.",
      "rate": 3.0,
      "tripDate": " February 2018"
    },
    {
      "title": "Great spot so handy",
      "text": "If you cant or wont drive on the major highways it is perfect. So easy, on the corner of airport road and rexdale. Not all of us are used to city driving. We used it for park and fly and it was perfect. Definitly be back.",
      "rate": 4.0,
      "tripDate": " February 2018"
    },
    {
      "title": "STAY & FLY - STAYED BEFORE TRIP & USED AS PARK & FLY - A++",
      "text": "- Stayed December 4th, 2017- Used as Park & Fly and stayed the night before a 7 day trip- $40 for 8 Day Park& Fly Service- Booking in Was Fast & accommodated Fridge request- Any Floor 5 and above includes refrigerator- Had used this hotel 2 years ago and seen that the rooms had been upgraded with more modern decor- Shuttle service was excellent and timely- Automated wake up Service was perfect - Keurig Coffee in Room was nice to start the day - Many Varieties- Downstairs Van Houtte  Coffee Machine was nice for 2nd Cup - Maybe Not For Those expecting Lavish but I doubt you could find better for the price- Will definitely use again",
      "rate": 4.0,
      "tripDate": " December 2017"
    },
    {
      "title": "Terrible experience",
      "text": "Arrived to no elevators working!  I get these things happen!  Still charged full price for room that was less than mediocre!  Will never stay there again nor do I suggest anyone else do so either!  I was only on third floor, o felt for others that were on the 10th floor and had to lug their own bags upstairs!",
      "rate": 1.0,
      "tripDate": " August 2017"
    },
    {
      "title": "worst Hotel in the world",
      "text": "I don't know why peoples are staying losing their money in this hotel while its always been over booked, no elevator services, no swimming pool, no hot tub, bed buggs, no entertaiment ( most of the time TV and free WIFI are not working, smelly rooms, used bed cloths and thousands other problem there. beside this, if you have any housekeeping or security issue no one will be help you out at night time.I have been staying this hotel very frequently and always facing these problems and continuously complaining to GM name Savitri( an Indian girl), who her herself has an attitude issue and lack of required skills, so finally, I decided not to stay here anymore. Plz careful before making your reservation for this  hotel",
      "rate": 1.0,
      "tripDate": " August 2017"
    },
    {
      "title": "very good experience.good airport shuttle service",
      "text": "The hotel and room were clean, modern and efficient. The shuttle service took 10 minutes to get to the airport and the return trip took 20 minutes for the shuttle to arrive and 10 to the hotel. Very respectable. Will stay again.",
      "rate": 4.0,
      "tripDate": " April 2017"
    },
    {
      "title": "Getting tired",
      "text": "I was in Toronto by myself for a combination of business and high-school reunion.  I drove, so parking was important.The location of this property, at least with a car, is very convenient, located at the intersection of Highway 27 and Rexdale Blvd directly across from the Woodbine Race Track. Within a 2 or 3 minute drive are several restaurants (including a coffee-shop style restaurant and bar on the property), a pharmacy and gas stations.  It was a 10 minute drive to the airport and the Royal Woodbine Golf Course, where one of my events took place, and a 20 minute drive to the Kipling or Islington Subway Station (both of which have all-day parking for $5.00).The staff were friendly and helpful at every encounter, my room was huge, the bathroom amenities were fine, there were lots of linend, and for the most part, I didn't have concerns about cleanliness.  While I didn't use it, there is an airport shuttle. There was a fridge, microwave and coffee-maker in the room (and complimentary all-day coffee in the lobby).  There is no breakfast provided, but the restaurant is open for breakfast ($7-$12).  The flat-screen TV had a good selection of channels and specialty pay-per-view movies.But....This is a mid-life property that is getting tired.  Minor maintenance issues (eg a toilet that dripped continually, a bathroom fan that made a rich variety of noises, and worn carpeting) don't make a good impression.  I don't think corners, the areas behind the bureaus and beds or by the window were regularly vacuumed.  The key cards did not hold their charge very well (and I use a card-wrap).  There was no armchair in the room, just two \"dining room\" style chairs.Because I reserved through priceline.com, the rate was fair and I felt I got reasonable value for for what I paid.",
      "rate": 3.0,
      "tripDate": " June 2014"
    },
    {
      "title": "Great Budget Hotel when flying out!",
      "text": "We stayed at this hotel in late September 2013, bound for the sun the following day.  After driving 7 hours this place was a clean, welcome spot to lay our heads!  Check in was easy as they were expecting us; we had reserved the room via iTravel.  We choose this location as it was close to the airport and parking for up to 3 weeks was included.  The receptionist was very pleasant.  Our room was more then sufficient including both a microwave and a fridge in the room.  3 of us were comfortable in 2 queen sized beds.  There was a licensed restaurant attached to the hotel.  It would have been nice if they had been open late as a beer would have been appreciated!  That being said if it was that important, Woodbine Racetrack is right beside this place, but after a 7 hour drive, I didnt want to go to the Casino!  Beds were very comfortable and there was lots of hot water in the shower!  A later check out was no problem, and the coffee provided in the morning, though week, was a nice gesture.  Breakfast service at the restaurant was great.  As we were the only people in the buffet at the time they simply asked us to order a la carte style ( a plate of eggs, some bacon, a plate of homefries etc) all charged at the buffet price...great customer service!!!!!!!!!!!  The shuttle to and from the airport was a wonderful convenience.  A simple phone call when clearing customs and the shuttle was back at the airport to pick us up...post S5, 1 floor below where you come out of the airport (clear customs, enter arrivals, turn right.  elevators are about 50 yards to the right, go down 1 floor) even at 1 in the morning (terrible cheep redeye sunwing flight times ha ha ha ha).  All in all this place was worth far more then the 100.18 CAD taxes included I paid for triple occupancy with 2 queen beds, non smoking, including shuttle to and from YYZ and up to 3 weeks parking!  If available I will certainly stay here in April when we are off to the Sun again!!!!!",
      "rate": 3.0,
      "tripDate": " September 2013"
    },
    {
      "title": "Don't rely of free shuttle service",
      "text": "We arrived to Toronto around 9:30 pm for an overnight stay at Comfort Hotel before getting our connection the following morning.  Hotel advertises free shuttle service on their website, so we thought this would be good for us as we would not have to spend money on taxi. We called the hotel around 9.30pm when we landed and could not get through. We called again 5 minutes later. The receptionist told us where to go and wait for the shuttle and that the shuttle will be there in 20 minutes. 30 minutes later, no sign of the shuttle. We called again and were told to wait another 10 minutes. Nothing. Called again. We were told to wait another 10 minutes. At the end, an hour later the shuttle had arrived.  If we would have known it would be such a long wait, we would have ordered a taxi. Too bad the hotel was giving us incorrect and misleading waiting times. Really disappointing.",
      "rate": 2.0,
      "tripDate": " July 2013"
    },
    {
      "title": "Terrible.",
      "text": "This is the worst hotel in the area.  The room was dirty and smelled strongly of cigarettes, even though there were signs everywhere claiming to be 100% smoke free.  The bathroom was freezing and the beds were saggy.  I would never, ever stay here again.  Even if it was free.",
      "rate": 1.0,
      "tripDate": " January 2013"
    },
    {
      "title": "Not a good value...there is a reason they need to run discounts...avoid...",
      "text": "What a dump....Ok..it isn't THAT bad...but certainly not worth what I paid...even through Hotwire....(especially after they charged me extra to get two beds in the room even though that was what I reserved and the property appeared to be empty based on the barren parking lot)...This is a VERY tired worn out property...probably family owned given that the two persons at the front desk looked related...and you can see where corners have been cut EVERYWHERE...dirty carpet in hallways...room was ice cold when we walked in (can't be heating empty rooms...even in winter)...old tube TV...worn comforter on the bed....cheap and aged / worn furniture...old and tired fixtures and tiles in the bathroom.I seem to be on a losing streak with hotels booked via Hotwire....",
      "rate": 2.0,
      "tripDate": " November 2012"
    },
    {
      "title": "Unclean hotel, wouldnt return",
      "text": "I stayed here one night after a late flight.  There was a long black hair in clear view on the bathroom counter, this couldnt be missed by a cleaning lady.  When I pulled back the bed sheets there was a long brown hair between the sheets.  Neither of us staying in the room have long hair.  This was such a turn-off that it makes your skin crawl.  I wonder if they even change the sheets between guests.  They need to pay attention to the details and clean this place up, inexcusable!",
      "rate": 2.0,
      "tripDate": " June 2012"
    },
    {
      "title": "Stay here only if you can find a great sale",
      "text": "Just spent one night here. My biggest concern was the cleanness. A lot of spots in the room were kind of disgusting. However I found a good deal on hotwire for this place @  65 a night. I think for the price I paid this place is tolerable and serves the purpose of sleeping here one night before my early flight the next morning. However if you have to pay for the retail price of 100+ dollars a night I would say you can definitely find a better place.",
      "rate": 3.0,
      "tripDate": " June 2011"
    },
    {
      "title": "Great Value!!!",
      "text": "5 day stay at Comfort Hotel Airport North was excellent!!  Entire staff at the hotel were very courteous, friendly and exceptional at their role within the hotel (i.e. check in, cleaning staff, etc),  Airport shuttle arrived shortly after I called (excellent service) and all of the requests I had made in terms of my reservation were acommodated.  The room itself offered a good view, had some upgrades and a comfortable bed.  The cleaning staff did an amazing job each day and I felt they really went \"above and beyond\".  The pool area is very clean as well.  The location of the hotel is nice for visitors who do not have transportation as several shopping areas, and places to eat are within a couple min. walk of the hotel.  We ate at the swiss pick twice while visiting....the food and service was excellent on both occassions.  This hotel offers great value and fantastic service, will definitely be staying there for future trips to Toronto.",
      "rate": 4.0,
      "tripDate": " May 2012"
    },
    {
      "title": "An Embarrassment to Hospitality!!!",
      "text": "Due to airline connections we had to spend the night in Toronto.  So we researched & called several hotels - this one had the best 'telephone presence' so we booked.  The close proximity to the hotel is really a 15 minute drive.  Upon arrival the evening desk clerk took it as an affront we wished to check in, but eventually managed to get us a room.  We entered the old elevator, wandered down the old hallway and found our room.  The only working light was in the bathroom.  After checking the bulbs (one was broken) and determining the lamp was plugged in we called down to the desk and were advised by a different clerk to return and we would get a new room.  Down we went.  Wherein we met the original grumpy desk clerk who advised us we \"should have called\" \"he would have come up to make the lights work\".  Once again they searched and finally found us a room, the beds were moderately comfortable. As for the full menu until 11.30 pm, at 10 pm the restaurant was closing - we were able to get a couple of burgers and that was dinner.  Before returning to our room we asked about the return shuttle to the airport and were advised to \"just come on down\".Since we had to be at the airport at 9:00 we arrived in the lobby at 8:00 to find out the shuttle had just left.  We were advised the shuttle would be there shortly.  After a 45 minute wait (without breakfast) we were finally advised it was an hourly shuttle. We were late for check in - thank you Comfort Suites.This hotel seems like it has been retrofitted poorly from an old run down dive.",
      "rate": 1.0,
      "tripDate": " November 2010"
    },
    {
      "title": "Receptionist charges you double and don't resolve the their wrongs!",
      "text": "The service is very poor and the receptionist charged me twice in my two different credit cards and I didn't get my refund!here was no reason for this double charge and they were just charging me with NO EXPLANATION!!!During the check out I realized about it and have to struggle for the refund! So shame!!!I am trying to reach Ms. Savitri Bhajan and no answer at all.I want my extra (wrong charge), you guys did, back!",
      "rate": 1.0,
      "tripDate": " December 2019"
    },
    {
      "title": "Get the shuttle information before you leave!",
      "text": "We stayed at this hotel for one night and left our car there while we travelled in the U.S. The room was adequate; it seemed fairly clean, but the decor is old and spartan (worn bedspreads and the identical framed print was hung on two walls). Breakfast at the adjacent restaurant was OK, however, the young server's English was poor and she did not write down our order, so some items were missed.The airport shuttle arrived at the hotel promptly at 8:30 am. The driver assisted a little with our bags and the drive to Pearson airport was swift. However, he dumped us and our bags on the sidewalk at Terminal 3 and took off before we could even ask about how to contact the shuttle on our return! The hotel staff had not volunteered this information, either.We were able to find out the contact information online while we were away. But, it took two calls to the hotel and a long wait before we were actually able to board the return shuttle at Terminal 1. On his arrival at the Terminal, the driver didn't move from his seat to assist people with their bags. It was a stark contrast with the courteous and friendly shuttle drivers we observed from the other hotels; the Comfort Hotel drivers are in far too much of a hurry to provide good customer service.We would not choose this hotel again.",
      "rate": 3.0,
      "tripDate": " August 2012"
    },
    {
      "title": "This Hotel is in need of some major TLC",
      "text": "We were only staying over night prior to catching a flight to Punta Cana, and this hotel was booked by our travel agent. (We've since let our agent know that this hotel should not be utilized in our opinion.) The hotel didn't have rats or anything, but the building and the rooms were falling apart. Missing ceiling tiles, water stains, crumbling walls, missing trim, ect. We didn't use the pool but seen it and it looked like something you would expect to find in a 1 star hotel in Haiti. (If there was even such a thing)The staff were accommodating and the restaurant staff were excellent - and food was surprisingly great. There were no issues with check-in etc, but the building itself was awful. I would not recommend staying here unless you have no other choice. It's cheap, but you get what you pay for.I'm not a very fussy person when it comes to traveling; and I'm usually happy with whatever's presented to me, but this place has been left too long and is in desperate need of repair.",
      "rate": 2.0,
      "tripDate": " October 2017"
    },
    {
      "title": "Over charged and a two red splatters on the wall... swerve",
      "text": "I used booking.com to book this hotel last minute due to a change of plans.  The hotel listed at 125 Canadian.  During the booking process the price switched, but I was rushing and did not catch it.  I was only aware when I reviewed my emailed bill the next morning at the airport.  The price including tax was 180 Canadian.  This would not be so bad if the property was nice and the customer service good.  The halls were filthy, but the room was clean with the exception of the red splatters on the wall behind the beds.  It was late and our flight was early, so I did not complain.The shuttle was prompt, but the check in was slow.  I would not advise to stay here.",
      "rate": 2.0,
      "tripDate": " August 2017"
    },
    {
      "title": "Clean, comfortable hotel",
      "text": "I needed a room for one night in the toronto airport area for myself and a buddy. I used Priceline to get a room at a cheap rate. I did not know which hotel I was going to get until after my bid was accepted, Immediately after I discovered it was this hotel, I went to tripadvisor to check out the reviews. Needless to say I was quite concerned about all the terrible reviews that were posted recently about this hotel.However, my experience was somewhat different than most, but I only stayed the one night and the rate I received was very good. I called the hotel directly to request a particular room type once I won the bid and got this room. I was greeted in a courteous manner and told that the two-bedded room I was requesting was already assigned to me.Once I arrived at the hotel we were greeted by the front desk staff. He was courteous and efficient, quickly gave us our room keys and answered all our questions. The lobby was clean and spacious.Once we arrived at our room, I was impressed by how spacious and clean it was. Remember I was expecting the worst after reading some of the reviews. Also, the room looked like it had been newly renovated. The bathroom has definitely undergone a renovation as everything looked new and shiny. The bathroom door did not close properly, but it was a minor issue and I did not even mention it to the staff.The beds were very comfortable and the pillows and sheets were clean and cozy. No complaints there. We never heard any outside noise from the airport nor were we disturbed by any of our fellow guests. Used the pool and hot tub once. It is quite small but was clean and met our needs.We did not dine at the restaurant so I cannot comment on the food at this hotel.Overall this is a nice, clean, comfortable, yet basic two star hotel with a pool and free parking. You have to remember when booking a hotel what the star rating is and judge it accordingly. If you are expecting the Hyatt or the Sheraton you are going to be disappointed. If you need basic accomodations at a reasonable price near the airport, then this is an excellent choice in my opinion.",
      "rate": 4.0,
      "tripDate": " February 2013"
    },
    {
      "title": "Very Clean and Comfortable",
      "text": "After a 7 hour drive to my Christmas party at the Woodbine Race Track in a snow storm, I was pleasantly surprised with the clean, updated accomodations. I have extremely high standards of cleanliness when it comes to staying in hotels. Esspecially after watching the marketplace \"Dirt on Hotels\" I check everything. My son and I got a room with two queen beds and everything was perfect and clean. The value, I think for $109 for the night was worth the comfortable, spacious, clean, quite and cozy warm room that we got. We even visited the restaurant that is attached to the hotel and it happened to be Latin night. So the music was a great end to the night with a pitcher of beer.And two thumbs up for taking my reservation at the last minute, service was fast and friendly. No hassles what so ever.",
      "rate": 5.0,
      "tripDate": " November 2012"
    },
    {
      "title": "Literally the WORST hotel I've ever stayed in!",
      "text": "I have to say the Comfort Hotel Airport North is literally the WORST hotel I have EVER stayed in in my entire life! When we arrived there was NO elevator service AT ALL and the lowest floor they could put us in was 9! We had to carry our bags up 9 floors of stairs because the bag line for others was 5 people ahead and we needed to go to sleep immediately. The final insult was that the person checking us in told us the shuttle to the airport leaves on the hour and the half hour. It does not. It leaves at 50 and 20 after the hour so of course we go down thinking we'll catch the shuttle and we've just missed it. Based on this experience I will NEVER stay at a Comfort Hotel EVER again!",
      "rate": 1.0,
      "tripDate": " August 2017"
    },
    {
      "title": "OK hotel",
      "text": "This is very close to the Toronto International Airport. The staff was friendly. Unfortunately the pool was closed so a refreshing dip was not possible (with 30 degrees Celsius this would have been welcomed). All in all eveything is OK and working, but a bit rundown by usage over time. Trip to the city of Toronto by car is approximately 30 minutes. Not much to do in the neighborhood of the hotel itself.",
      "rate": 3.0,
      "tripDate": " June 2017"
    },
    {
      "title": "Reasonable Out of Town Hotel",
      "text": "Overall comfortable stay. Initially we were allocated a room without a refrigerator and microwave which was unacceptable. This got resolved after three days when the front desk changed our room. We found the front desk staff namely, Navit, Jane, Harjit, Daniel and Jimmy friendly and courteous. For the room rate we paid a decent continental breakfast should be included which would be a reasonable value for money hotel. Having airport transfers included and supermarket walking distance away are factors in selecting the hotel. However, downtown Toronto is far and difficult to get to by public transport.",
      "rate": 3.0,
      "tripDate": " May 2016"
    },
    {
      "title": "trip",
      "text": "this hotel is full  of bedbugs stay away my wife and I stayed here onenite to be woken up full of bites of bedbugs toke some of them to the front desk they just said owell so stay away as far as you  can if you don't won't them at your home",
      "rate": 1.0,
      "tripDate": " January 2016"
    },
    {
      "title": "New management",
      "text": "I have stayed at this hotel weekly for the past 2 years and you think that you would be a valued Costomer , well let me tell you since about 3 months ago when a new manager was hired from the new management all agreements between us have fallin apart . Promises have been broken that he had mad to me personally and all deals that were not to change have all changed , when the manager Atul was there it was a great place to stay and we were looked after and treated well because he knew we would always stay there every week now new management treats us TOTALLY like a number !! Would not recommend !",
      "rate": 1.0,
      "tripDate": " June 2015"
    }
  ]
}