{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Comfy Guest House and Suite",
    "url": "/Hotel_Review-g155019-d1544333-Reviews-Comfy_Guest_House_and_Suite-Toronto_Ontario.html",
    "priceRange": "$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.5",
      "reviewCount": 673
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "250 Gerrard St E",
      "addressLocality": "Toronto",
      "postalCode": "M5A 2G2",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/17/cc/d3/4f/photo0jpg.jpg?w=500&h=-1&s=1"
  },
  "description": null,
  "featues": [
    "Paid private parking on-site",
    "Street parking",
    "Free High Speed Internet (WiFi)",
    "Wifi",
    "Baggage storage",
    "Non-smoking hotel",
    "Shared bathroom",
    "Shared kitchen",
    "Air conditioning",
    "Desk",
    "Iron",
    "Wake-up service / alarm clock",
    "Kitchenette",
    "Flatscreen TV",
    "Complimentary toiletries",
    "Hair dryer",
    "Non-smoking rooms",
    "Suites"
  ],
  "reviews": [
    {
      "title": "My favourite place to stay!",
      "text": "I've stayed at the Comfy Guest House several times now and am never disappointed.  It has become my preferred favourite place to stay when I am in Toronto.  The cost is very reasonable and affordable, the location is great, it is clean, comfortable and quiet.  This is a guest house experience and not a hotel/motel experience.  Comfy Guest House does have a comfy, warm and homey feeling.  You are warmly greeted and welcomed.  Your initial welcome may take some time to get acquainted with Comfy, but if you return it becomes more and more like home.  The shared washrooms and kitchen are kept clean.  And the shared kitchen always has coffee/tea available, you can make your own meals, and visit with other guests.  My only suggestions are to be prepared to pay cash at check in, bring your personal items such as soap, shampoo, etc., and I now bring an extra towel for myself.  I already have my next reservation made and looking forward to my next stay.",
      "rate": 5.0,
      "tripDate": " December 2022"
    },
    {
      "title": "Luxury at a Budget Price in Old Toronto",
      "text": "Can you imagine a luxury suite in a gracious redbrick three-story in CabbageTown, Old Toronto, at the cost of just over $100 per night? That includes a sitting awith large flat screen TV, a large bedroom with double closet and two windows looking down onto a local street as well as up and out to the Toronto skyline, a small eating area with fridge and microwave, ensuite bathroom, a large balcony up among the leafy treetops again with views of the Toronto skyline, plus shared access to a full kitchen. You do need to climb two flights of stairs to access the suite, but it's definitely worth it! All the convenience stores you might need are nearby, as is public transportation along both Gerrard Street and nearby Parliament Street. The local streets are full of history and the nearby parks full of beauty. This is a \"go to again\" place to stay in Toronto. I highly recommend it.",
      "rate": 5.0,
      "tripDate": " November 2021"
    },
    {
      "title": "Great short stay at hospitable house",
      "text": "I stayed at the comfy guest house for a couple of days because I came to Toronto for a course that I had to attend at the nearby hospital.  I arrived and was greeted by the housekeeper, she showed me my room and we talked for about 30 minutes. She was super friendly and the place was very clean. She explained everything to me in detail which I appreciated and it helped me from running in to any issues later. I would have preferred to pay by credit card at check in  (because I have to apply for some money back from my local hospital) but had to pay in cash.. in the end it was not that big of a deal because there are many ATM's on the way from Union to the guest house and I got a paper providing proof of my payment. I liked the shower which was at a comfortable temperature fast and blasted you with water. The bed wasn't very sturdy but it was allright and the blankets were comfortable. I slept well duirng the days I stayed.The location of the guest house is very convenient and everything in the downtown area is within walking distance (or take the subway for things a bit further). There are lots of good restaurants nearby, even right across the street.  The house owner also checked in with me if everything was okay for me. They had USB outlets for charging electronics in the room. I enjoyed my stay there very much and if I visit toronto again will definitely see if the room is available again at that time.",
      "rate": 5.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Bob Ross Painting",
      "text": "Great value for the price. Clean and the hosts are sympathetic. You can walk to the city center easily from the hotel. Nice taco joint (Pastor Tacos) right across the street. I sketched a lot of the lovely old buildings in this the Cabbage Town area of Toronto. In the morning I walked over to Carleton street to get a coffee at Tim Horton's. There is also a large Loblaws on Carleton (a short walk from the hotel). Also Allen Gardens is nearby and you can visit the lovely plants in the conservatory or watch the locals and dogs in the surrounding park...Was it Gordon Lightfoot or Duncan Mercredi who once sang:Be one ever so weary as a wandering mouse,There's really no place like the Comfy Guest House.The sight of the homeless in Old Cabbagetown,Means there's always a beer store not far around.You'll always feel welcome at this old comfy inn,by placing your bumwad in the waste paper bin.So next big vacation for you and your spouse,Spend a few nights at this Comfy Guest House.(Cash only upon arrival.)",
      "rate": 5.0,
      "tripDate": " February 2022"
    },
    {
      "title": "Spotless  Guest House  / close to all amenities",
      "text": "Stayed at the Comfy Guest House while visiting the city for a concert and ball game . House was spotlessly clean , Vivian was lovely to deal with as was the owner . Luxury room was a nice size , beds were extremely comfortable and walk out deck was an added bonus . Despite being so close to the down town core , it was nice and quiet for sleeping. House is within a 3 minute walk  to great places to eat ( Chew Chews Diner and House on Parliament) and is within a minute walk to hop on a street car to bring you down town . Highly recommend this place to stay. It has everything you’d  need or want for a fraction of the cost of other accommodations .",
      "rate": 5.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Clean and friendly",
      "text": "Have stayed multiple times while visiting family nearby, and will continue to do so. Place is always clean and quiet, the hosts friendly, and clientele interesting. Fully equipped kitchen with refrigerator and freezer space, plus two markets within walking distance are helpful during multi-day stays.",
      "rate": 5.0,
      "tripDate": " December 2019"
    },
    {
      "title": "Good value!",
      "text": "I don't usually leave reviews but I am doing so at Tahir request. We stayed for eight nights  in a single room with a shared upstairs bathroom. I did my research ahead of time and was aware of some of the lesser desirable conditions at this Comfy guesthouse. Payment of balance in Cash upon arrival and taking shoes off were certainly made very clear on their website so should not have been an issue for others. However, when you consider the $Price you must lower your expectations. For us the important things were a clean room, comfortable bed, hot shower and location to our venues of choice. The comfy Guest House did just that and we would recommend staying here especially if you are on a limited budget as it is good value for the $Price.",
      "rate": 4.0,
      "tripDate": " April 2023"
    },
    {
      "title": "Clean and Quiet Guest House",
      "text": "If you want a clean and quiet place to stay in Toronto, this is the place. The owners keep everything clean including the washrooms and shared kitchen. The guests are quiet as well (because they tend to stay in their rooms). If you feel like chatting with other guests, you can sometimes see them in the kitchen, but there is no living room for that purpose. So, if you're looking for a party atmosphere, this place is not for you. I really enjoyed staying here, so I hope to book it again someday. The only simple advice that I would give to guests is to bring a box of your own facial tissues because they are not provided in the room. You will also need to pay your room fee in cash when you check in, so do prepare that too. Enjoy your stay. By the way, If you want a cheap breakfast, there is a Tim Horton's coffee shop near the guest house. Walk east on Gerrard street to Parliament street and turn right. Then, walk about 3  blocks. Tim Horton's is on the left side.",
      "rate": 5.0,
      "tripDate": " January 2023"
    },
    {
      "title": "Exceeded my expectations ",
      "text": "The guesthouse is located just a couple of blocks from the city's heart still it is situated in the quiet residential street with little traffic. The host is highly considerate: it was rather cold in my room and she has provided me with a portable heater for the rest of my stay. The kitchen is equipped with everything needed for cooking, and the house generally has exceeded my expectations.",
      "rate": 5.0,
      "tripDate": " March 2023"
    },
    {
      "title": "The other reviews must be old or from a different place...",
      "text": "The location is good(ish) and the price is great, that much is given. For everything else that is promised and raved in the other reviews, not so much.Starting with the check-in, as you have to state with two hour margin when you are coming. That is fine, but when we arrive and have to call again and wait, that is not ideal. They don't have any indication about their location, so you have to pay attention to the door numbers.For some odd reason they needed our credit card details again (we paid deposit with credit card at the reservation site) and they needed us to pay with cash and did not even have change right away, had to wait for that too.After the \"great\" welcoming followed the tour full of rules and oddities, felt like she was treating us like children and told us about every single incident that has ever happened in the hotel (like we would be as bad or something?). It was breathtaking to listen to that for 15 minutes and then finally arrive to our room.Room was small, as it was promised in the description, but it also promised air conditioning, which in theory was there, but not really. They had central AC, which did not cover the second floor at all. That is why they already had a fan there instead and everyone knows the difference between a fan and proper AC. Beds were hard and squaky, pillows were awful, towels were cozy and surprisingly good for what they looked.The shared bathroom was fine and there weren't so many guests for it to be full all the time. But the shared kitchen... our room was just outside of it and I can say the soundproofing of the rooms is nonexistant. We could hear everything and boy do people like to cook in the middle of the night even though it was forbidden. The traffic outside was not so bad, but it was also clearly audible even with earplugs.The best part was though when we were going to bed our second night, suddenly the manager knocks on the foor at 11pm, with a phone in her hand. We are just standing there like what the hell is this. \"Owner wants to talk to you.\". Mm, ok, so we talk to him and he just wanted to know if we had a good stay. We did not really have the energy or patience to answer at that point so we just said everything was good as we wanted to sleep. But this really gave the impression that she was always watching.So all that in mind, if you want cheap hostel-like place to stay in a neighbourhood full of homeless people, this is your pick. Otherwise, stay away, even though the old ratings are very good.",
      "rate": 2.0,
      "tripDate": " August 2022"
    },
    {
      "title": "A Delightful Retreat at Comfy Guest House",
      "text": "I had an amazing experience during my third stay at Comfy Guest House. The guest house was well maintained. It is located in a safe neighbourhood and has an ideal location which is near to the public transport which I needed. The staff was also coperative.",
      "rate": 5.0,
      "tripDate": " December 2023"
    },
    {
      "title": "Excellent budget stay at Toronto",
      "text": "The Comfy Guest House was perfect for what I was looking for and within my budget for when I needed to be in Toronto for work for 5 days. Thank you to the owner for the smooth check-in process and for hosting me so well. Much appreciated!",
      "rate": 5.0,
      "tripDate": " May 2022"
    },
    {
      "title": "Nice atmosphere",
      "text": "Comfy Guest House is a charming place to be near downtown. Mr. Tahir and his assistant manager are very friendly people. Rooms, washrooms, and kitchen areas are clean. It has a nice atmosphere and the transit public is very close to comfy.",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Great experience",
      "text": "Very gud stay here. Comfortable bedding , clean bathroom and very nice staff. Kitchen asssibility also there. Overall great stay. Located at city centre very easy to locate. All hotels malls and shopping centres within 1 km of distance.",
      "rate": 5.0,
      "tripDate": " September 2020"
    },
    {
      "title": "Old Downtown charm at affordable prices",
      "text": "A clean wonderful place close to all major amenities like parks, TTC, subway, No frills and Dollarama.15 mins walk to Eaton Centre and the entertainment district.The building has classic 150 year old charm with all modern amenities.Met diverse and interesting guests from within and outside Canada.",
      "rate": 5.0,
      "tripDate": " December 2019"
    },
    {
      "title": "Delightful stay in Toronto",
      "text": "We stayed two times & found safe, clean & affordable. Staff is also very helpful. Public transportation is at walking distance. We used kitchen for cooking of our breakfast. Heating is very good. Highly recommended.",
      "rate": 5.0,
      "tripDate": " November 2023"
    },
    {
      "title": "Great place",
      "text": "I two nights at the guest house in a wonderful room overlooking the street. The location is excellent, a short walk to train station, and tram stop right around the corner. The place is very safe and owner is very helpful.",
      "rate": 5.0,
      "tripDate": " March 2020"
    },
    {
      "title": "Great place very close to downtown.",
      "text": "It was my second time staying here, and the experience was great as before, the room was very clean and it had everything I needed.Tahir and Vivian were very helpful.It's close to College Station and a 30-35 min walk to Union Station.",
      "rate": 5.0,
      "tripDate": " August 2023"
    },
    {
      "title": "Comfortable Stay.",
      "text": "The stay to my guest house was fabulous. The staff was very welcoming. Room in the hotel was decorated and elegant. The aura of the guesthouse was pleasant and charming. The kitchen service available to guests was quiet exceptional.",
      "rate": 5.0,
      "tripDate": " November 2023"
    },
    {
      "title": "Excellent Services",
      "text": "Very clean,conducive environment for relaxation and stress management .Polite,understanding,flexible kind staff .Truly a home away from home.Keep up the spirit Will be back .Godbless you.Kind regardsIsaac & Sheila.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "A gem in the heart of Toronto: Comfy Guest House ",
      "text": "I stayed at the Comfy Guest House for 4 nights . Loved my room with private ensuite bathroom. This place in a residential area . Newly renovated with nice hardwood flooring. It is clean and was quiet enough for me . The owner and staff are very friendly and welcoming and helpful with answering any questions. It was perfect to have kitchen with dining area available.  It was also nice to meet other travelers and have conversations. I would definitely recommend this Guesthouse and will stay there again on my next trip to Toronto. Thank you Thahir and staff ( Vivienne)",
      "rate": 5.0,
      "tripDate": " February 2023"
    },
    {
      "title": "4 Day stay in November 2022",
      "text": "Nice quiet house with use of full kitchen, we had private bathroom, but some rooms share a bathroom.  The neighbourhood is full of interesting character homes, and very walkable, with frequent buses/streetcars if needed.  The owner and the lady managing the house are very friendly and helpful when needed.  Will definitely be coming back!",
      "rate": 5.0,
      "tripDate": " November 2022"
    },
    {
      "title": "Felt at home ",
      "text": "Vivian was very kind to me. Showed me how everything worked at the guesthouse, where the nearest shops were, how to get from one place to another etc. Tahir has also been very responsive with emails and called me to make sure everything was ok.The location is perfect! Everything was walking distance. The room had everything I needed a desk, a comfortable bed, good lighting, a closet and a window.The shared kitchen and bathroom were always spotless and clean.I really felt at home and enjoyed my stay as well as the little chats with vivian and other tenants. I would definitely stay there again.",
      "rate": 5.0,
      "tripDate": " December 2022"
    },
    {
      "title": "Wonderful place! We loved our stay!",
      "text": "We stayed in a suite with my 2 girls. The checking-in was a bit long since they had to fully explain to you every single detail. And no early check-in or checkout is allowed on this property as we were informed at check-in. They have very clean accommodation. It is a very nice location. Close to transit. I would highly recommend it and will definitely consider staying there again in the future. Pictures attached for reference.",
      "rate": 4.0,
      "tripDate": " January 2023"
    },
    {
      "title": "Great Value and Friendly People",
      "text": "Great value for money here, the property has recently been renovated, and friendly service. Just FYI you have to arrange a time to check in with the property manager(since there's no traditional reception) but this wasn't a problem for me.The location isn't particularly near any tourist sights, but not far from them either. I would definitely go back!",
      "rate": 5.0,
      "tripDate": " March 2022"
    },
    {
      "title": "comfortable, helpful, great location",
      "text": "Our family stayed 3 nights in the Luxury Suite as we prepared to move my daughter into residence at university. It was clean, comfortable, nicely appointed. They were super helpful with our many questions. You couldn't ask for more, and at a very friendly price! It is a guesthouse, not a hotel, and has an informal atmosphere with people from all over. I highly recommend it!",
      "rate": 5.0,
      "tripDate": " August 2020"
    },
    {
      "title": "Beautiful stay",
      "text": "The staff at Comfy Guest House was kind, welcoming and very helpful. The suite was clean, private and comfortable. I lacked nothing during my stay and would recommend Comfy Guest House to those planning a trip to Toronto.",
      "rate": 5.0,
      "tripDate": " September 2021"
    },
    {
      "title": "great choice",
      "text": "absolutely zero complaints. clean, quiet, amenities, communicative and kind, feels safe and secure despite the area. astronomically better than anywhere else you would be able to get for the price ( i stayed in the small room)",
      "rate": 5.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Excellent",
      "text": "Excellent host. Clean, quiet and safe space. I enjoyed my stay at comfty guest house in TORONTO. I stay in TORONTO for business,it is the second time I stay at comfty guest house. The name definitely reflects the environment inside the house.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Wonderful stay at The Comfy Guest house",
      "text": "When they say Comfy believe it's Comfy!The owner Tahir is absolutely great very caring, accommodating and kind. The suite I stayed in was awesome lots of space own little Terrace the staff is very kind greetings with a smile. Definitely staying here again and I highly recommend this place!!",
      "rate": 5.0,
      "tripDate": " November 2022"
    },
    {
      "title": "Excellent guesthouse",
      "text": "The owner Tahir and manageress Vivian are very welcoming and I was made to feel at home right away. My room with shower room on the ground floor was very comfortable and clean. The kitchen on the first floor is very well equipped and I stored my frozen food in the freezer there. Smaller items such as fresh fruit, I kept in the fridge in my room. Made some new friends in the kitchen/dining room too. When I next come back to Toronto, I will definitely be staying there again. It’s a first rate Guesthouse and I was sad to leave as I really enjoyed my 11 nights there.",
      "rate": 5.0,
      "tripDate": " February 2024"
    },
    {
      "title": "Clean, quiet and with a personal touch!",
      "text": "Loved my stay in my queen room with shared bath. Ms. Vivian is on top of the cleaning in this house!! She was so welcoming and friendly. The house has a nice quiet, safe vibe ...... everyone was so respectful. The neighbourhood is excellent- great coffee at Jet Fuel on Parliament, a great little bakery for amazing cheese croissants just a block or 2 past that....amazing pen/ink/stationary store ( Wonderpens!!) a few doors down from Comfy, and you can walk to downtown or to The Distillery District!  There is also a street car that runs along Parliament so that's a great option for getting around, too! I will definitely stay here again next time I go to Toronto.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "A nice and comfortable guest house",
      "text": "This is my second stay at this nice and comfortable guest house, which is located in a residential neighborhood. The guest house has been renovated and provides all the necessary amenities including a well equipped shared kitchen. The room with shared bath was clean and very quiet at night. The bed was comfortable. The guest house is not far from the 506 tram line, which provides good access to the Metro conference center via the subway in less than 30 min. It provides excellent value in the Toronto Metro area.",
      "rate": 5.0,
      "tripDate": " June 2023"
    },
    {
      "title": "Cheap and close to everything!",
      "text": "I had some fears with the reviews I read about this place, but I really liked it.  The rooms are small but comfortable, the bathroom is clean, sometimes you need to wait for your turn because is shared but if you are not in a rush is okay.  Vivian is very nice and I had the kitchen available with appliances like refrigerator, you can have coffee and a table to eat. I felt like in house. Be aware that you need to pay with CAD dollars at the check in. That was my only problem but we solved it.  Thank you for your hospitality.",
      "rate": 5.0,
      "tripDate": " December 2022"
    },
    {
      "title": "Very clean, great location",
      "text": "We stayed at the \"Comfy Guest House\" from August 1st to August 4th.  The room was very big and very clean (top floor), with an outside private terasse and very nice and quiet for sleeping.  The owner was very nice and took time to show us around and make sure everything was perfect for us. Its close to Toronto Square (we walked) and there are great restaurants close by on Parliment St. too..   I highly recommand, especially for that price!",
      "rate": 5.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Amazing !",
      "text": "We had an amazing stay. The owners are so nice and they’re always available whenever you need them. The guest house is also well located to visit the city, with public transportation and bike stations nearby. I’ll for sure go back to the guest house if I come back to Toronto.",
      "rate": 5.0,
      "tripDate": " March 2023"
    },
    {
      "title": "Amazing !",
      "text": "A super clean, comfortable, and safe house.  perfect to spend a few days there, the people who received us were super kind and helped us feel safe on the trip.  It is also located very close to the center so getting around is very easy, I recommend it infinitely❤️",
      "rate": 5.0,
      "tripDate": " December 2022"
    },
    {
      "title": "Fabulous find!",
      "text": "This place is a complete gem. The people are wonderful and kind and helpful. The location is outstanding, and it is quite close to all the activities available downtown. It is extremely close to the Allan Gardens Conservatory, which is an incredible place to see flowers and plants. The place itself was super clean and had everything needed to feel right at home. Highly recommend!",
      "rate": 5.0,
      "tripDate": " July 2020"
    },
    {
      "title": "Great location",
      "text": "Beautiful home. Has everything you need. Very clean and comfortable. Public transit is within one long block, tram 505 or 506 to get anywhere. But if you like walking, as I do, you are within 15 to 45 minutes of all the great recommended areas to see.",
      "rate": 5.0,
      "tripDate": " June 2024"
    },
    {
      "title": "Family visit ",
      "text": "We stayed at this lively home the end of November/22 and would definitely  book again .It had a lovely shared kitchen where we could make a couple meals so we didn't have to eat out all the time .There was pretty much everything we needed except some things certainly needed replacing like frypans and pots.We had the upstairs room which was very large and cozy .and decorated nicely .The only thing I could complain about were that two bath towels and no hand towels are not enough for 4 days .By the time you keep drying your hands in your bathtowels,they are not clean to use for showers!!! The bed was comfy .We would definitely  stay there again .It was really in the heart of most things ,very walkable  when the weather is nice,and nice to have a poarking space at the back of the house .",
      "rate": 4.0,
      "tripDate": " November 2022"
    }
  ]
}