{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Crowne Plaza Toronto Airport, an IHG Hotel",
    "url": "/Hotel_Review-g155019-d182004-Reviews-Crowne_Plaza_Toronto_Airport_an_IHG_Hotel-Toronto_Ontario.html",
    "priceRange": "$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.0",
      "reviewCount": 364
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "33 Carlson Court",
      "addressLocality": "Toronto",
      "postalCode": "M9W 6H5",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2c/7d/e4/03/welcome-to-the-newly.jpg?w=500&h=-1&s=1"
  },
  "description": "Our redesigned business hotel near Toronto International Airport features modern guestrooms and great amenities, such as free Wi-Fi, a heated indoor pool, ample guest parking and onsite dining. Crowne Plaza Toronto International Airport also features 12,000 square feet of flexible event space and a free airport shuttle, making it easier than ever to get to and from the YYZ airport.​Woodbine Casino and Racetrack and Square One Shopping Center are just a short drive away, while downtown Toronto is easily reached by hopping on the UP Express rail link. Guests in town for business will be minutes from Toronto Congress Centre. No matter if you're in town for work, leisure, or just a layover, Crowne Plaza Toronto International Airport is ideal for your stay.",
  "featues": [
    "Paid private parking on-site",
    "Free High Speed Internet (WiFi)",
    "Pool",
    "Fitness Center with Gym / Workout Room",
    "Bar / lounge",
    "Aerobics offsite",
    "Archery offsite",
    "Kids stay free",
    "Secured parking",
    "Wifi",
    "Pool / beach towels",
    "Indoor pool",
    "Heated pool",
    "Shallow end in pool",
    "Restaurant",
    "Breakfast available",
    "Breakfast buffet",
    "Breakfast in the room",
    "Complimentary Instant Coffee",
    "Complimentary tea",
    "Happy hour",
    "Kid-friendly buffet",
    "Kids' meals",
    "Snack bar",
    "Special diet menus",
    "Wine / champagne",
    "Bowling offsite",
    "Canoeing offsite",
    "Patio",
    "Raquetball offsite",
    "Squash offsite",
    "Tennis court offsite",
    "Water park offsite",
    "Children's television networks",
    "Highchairs available",
    "Pets Allowed ( Dog / Pet Friendly )",
    "Free airport transportation",
    "Free shuttle or taxi services",
    "Airport transportation",
    "Shuttle bus service",
    "Car hire",
    "Taxi service",
    "Business Center with Internet Access",
    "Conference facilities",
    "Banquet room",
    "Meeting rooms",
    "Photo copier / fax In business center",
    "24-hour security",
    "Baggage storage",
    "Concierge",
    "Convenience store",
    "Non-smoking hotel",
    "Picnic area",
    "Shared lounge / TV area",
    "Shops",
    "Sun umbrellas",
    "ATM on site",
    "First aid kit",
    "Umbrella",
    "24-hour check-in",
    "24-hour front desk",
    "Express check-in / check-out",
    "Private check-in / check-out",
    "Clothes dryer",
    "Dry cleaning",
    "Laundry service",
    "Washing machine",
    "Ironing service",
    "Blackout curtains",
    "Air conditioning",
    "Desk",
    "Housekeeping",
    "Room service",
    "Coffee / tea maker",
    "Cable / satellite TV",
    "Walk-in shower",
    "Safe",
    "Telephone",
    "Iron",
    "Private bathrooms",
    "Wake-up service / alarm clock",
    "Flatscreen TV",
    "Bath / shower",
    "Complimentary toiletries",
    "Hair dryer",
    "Non-smoking rooms",
    "Smoking rooms available"
  ],
  "reviews": [
    {
      "title": "Several issues and/or concerns",
      "text": "Upon checking into our JrSuite King bed we wondered why the pull out couch was made into a bed rather than a couch (which was supposed to be a sitting area). We shrugged it off at first even though we had no intention to use this couch as a bed in the first place. Ready to put some of our food into the fridge, little door to access fridge had a broken hinge not allowing to close it properly and then we see food residue outside the front door of fridge. It was only when we were ready to settle in to sleep for the night as we arrived into our room very late, we noticed that the night stand was very dirty with sticky something, so gross! This last discovery was the icing on the cake for us, we couldn’t bring ourselves to sleeping a night in a room that didn’t appear to have been properly cleaned and sanitized prior to giving it to us?Fortunately, the front desk clerk was very understanding and found a way to switch us out into another (upgraded) room, very grateful for this especially since it was midnight and we really needed to settle in to sleep. This new room appeared to have been cleaned. The next morning we noticed a few little things missing in the room (no iron board, no chairs for dining table, 4 of the 6 lamps didn’t work, no hot water from bathroom sink and fridge not working). Maintenance call was sent in and hours later the fridge was fixed by the very nice maintenance worker. It was only on the last day of our 4 day stay that 2 dining chairs appeared but lamps and hot  water remained unavailable to us for these 4 days. Pool was also shutdown for maintenance during our stay (disappointed). Outside of the room, shuttle service had us waiting in the wrong pick up location for approximately an hour at the airport because the driver told us to return to the same spot as to where he dropped us off. That was a huge waste of our time to stand somewhere that we weren’t going to picked up at. It was only by calling the hotel that we were redirected to the proper pick up location. Be ready to stand in line and wait for service at front desk, line ups have been long all week, perhaps more staff should be hired? Not sure that we will consider staying here again, since we have stayed at several other hotels in this same area with none of the above issues/concerns.",
      "rate": 3.0,
      "tripDate": " April 2024"
    },
    {
      "title": "Short but great stay",
      "text": "Late night pick up, shuttle driver took great care of us . Even made sure we had snacks with our 2:30 AM arrival. Receptionist also accommodated us with our special requests even though the hotel was sold out. It was a short but good stay. Place was clean and convenient for our needs",
      "rate": 5.0,
      "tripDate": " April 2023"
    },
    {
      "title": "Great stay",
      "text": "Let me start by saying that we have stayed at the Crown Plaza Toronto airport before but the changes they have made has made to the rooms is both welcome and improved the quality of the property. We stayed for one night at the end of March 2022 as we had a early morning flight to Barbados. By shopping around on the internet we found a queen bed room for 99.00 CND. The room was modern clean and fresh and the check in and out was fast. If you are thinking of staying at this property there are 6 or so places to eat within walling distance of the hotel as well as a bar and a swimming pool on site. If there was a down fall to our stay it would be the shuttle. The hotel has a first come first serve policy for there transport to the airport every 30 min's but when I wanted to get on one my wife was able but me and the luggage were very rudely told by the driver to \"go back inside I am full\" Other than this ignorant driver our stay was great and we will stay there again it the price is right!!!!",
      "rate": 4.0,
      "tripDate": " March 2022"
    },
    {
      "title": "A Prisonnier than a guest",
      "text": "I am spending my two-week mandatory quarantine in this place. I will NEVER put my feet in this place again. Here is why:1. Though I paid for my breakfast included in my room charge, they served all of us like prisoners with a pre-packed food. And everyday less items than the day before.2. Out of many many times calling The Front Desk, I get once through. I hardly get room service or housekeeping on the phone as well. When I left a message for the manager, I never got reply. 3. They mess up orders, they are late in everything and the staff are very stressed and impatient. I had hand sanitizers purchased from Amazon, after two attempts from Canada Post, I am still waiting, because they can't get through the hotel line up. 4. I had trouble with the fruit flies in my first room. They changed it to this new room and the very first thing I saw in the new room was a dirty rag on the TV stand left by the cleaning staff.. A very welcome sign! I saw hair way longer than mine in both bathrooms. When I put garbage out of the room, I have to beg them to remove it. That also explains the fruit flies everywhere.",
      "rate": 1.0,
      "tripDate": " August 2021"
    },
    {
      "title": "Nice hotel, reliable shuttle, but Poor Customer Service that really makes me not wanting to return",
      "text": "Crowne Plaza Toronto Airport looks good on paper for an airport hotel.  It has a reliable shuttle that runs twice per hour and the location is pretty good with access to two major chain restaurants within walking distances along with a decent on-site restaurant.  The rooms are all renovated and are pretty spacious, but putting your elite floor on the second floor is bizarre given my room overlooking the water heating system or whatever pipes is not exactly nice.  However since the hotel is located under the landing path, I presume it is quieter in the lower floors.  But these factors all don't matter when customer service fail miserably.  Its telephone system is totally messed up and I called the hotel 27 times trying to locate the shuttle stop.  In the end, no one answered and I found the shuttle stop on my own.  Check in was fine and Roger was friendly enough.  I was able to get a room at noon so that was not bad.  When I asked about the operating hour for fitness center, I was told it opened at 6am.  Of course it was not opened at 6am and the receptionist on duty refused to open at 6am and made me come back at 7am.  I honestly still don't understand why the gym is not 24 hours because it is unsupervised anyway.  It is basically a small room with fitness equipments.  They check your vaccination record before letting you in anyway so it can remain opened 24/7 as there will always be a receptionist on duty anyway.  There is a capacity control but I don't think you need to worry about capacity at 3am, but sometimes for an international airports like YYZ, there will be guests who are jet-lagged and up early.  I preferred going to the gym at quiet times.  I felt that the concept of customer service really did not exist here.  I seriously will try to remind myself not to book this hotel in the future again.  There are plenty of choices especially when Canada is now opened to the world.  I will urge you to do the same.  You have choices and don't need to put up with the incompetence of the hotel.",
      "rate": 2.0,
      "tripDate": " October 2021"
    },
    {
      "title": "Terible experience, The Worst hotel I've ever stayed",
      "text": "I came from outside of Canada and stayed at this hotel for my 14 days quarantine (I pre-paid for two weeks).My stay in this hotel became my worst experience ever. I expected a place to enjoy and have good sleep at nights but unfortunately, they ruined my stayFirst of all, the staffs are courteous and nice but they have designated this hotel to accommodate huge numbers of refugees regardless of their staff and facility sufficiency. They have accommodated refugees more than room capacities in each room so people noise and children screaming at night or during day is extremely annoying.I couldn’t sleep neither at nights nor in the mornings. At nights the sounds of babies crying wake you up and early in the mornings hotel staffs come door to door knocking and shouting “hello , room service” to give the guests packaged breakfast and two times they knocked my door wrongly.Refugees are freely walking in hotel lobby, halls and elevators ignoring quarantine rules and health issues.There are lots of garbage in the hotel halls and it takes a day or two they come and clean it.No housekeeping and cleaning service is provided here at all. No one cares for your basic needs. Maybe Covid will be a good excuse but I had to dial the housekeeping line ten times from morning to evening to bring me a small shampoo or change a towel. Most of the times no one answers so you have to go down to reception and take some shampoo or what ever you need.On the last day of my stay, in mid noon the hotel fire alarm activated wrongly and the alarm was sounding aloud for more a couple of minutes making everybody in hotel shocked and stressed.Totally, based on this terrible experience, I would not come back to stay at this hotel or even IHG hotels in the future and don’t recommend this hotel to anyone.",
      "rate": 1.0,
      "tripDate": " August 2021"
    },
    {
      "title": "Terrible Terrible Terrible Stay",
      "text": "Booked this hotel for 3 nights quarantine and it happen to be worse decision ever. From Airport pick till checkin was good. But there onwards it was nightmare, starting with luggage, We had many pieces of luggage and nobody helped with that, i understood it to be covid precaution but there were 3 hotel staff with security tag on them but none of them will even smile, greet or even help you with cart or smthg. How can hotel staff just watch their guest suffer and say nothing. Strange!Room was ok. Food was terrible. It was never served on time and mostly cold. Rice portion was very limited and taste was nowhere to be called as crown plaza standard. And funny thing those who couldn’t help with luggage now can knock ur door and pass you a food hand to hand. Lastly , $ 3.85 was over charged to my card. And instead of them apologizing for it i have to make them understand and ask for it. It was embarrassing. I would have no hesitation to mention her name but she have her name tag  covered with her hair. They made addition $1100 pre authorization in my card I wonder why was it done without my approval ? My all meals were paid for already and as a quarantine guest we were not allowed to use any other facilities in hotel anyway. On top I wasn’t informed about pre auth that was being taken. And even if pre auth was taken why wasn’t same pre auth completed rather than making two different transactions? Nevertheless I asked her when will i get it unfreeze she replied me rudely to ask my bank? She has to understand that each guest doesn’t have to call bank to request to unfreeze pre auth each time they stay in hotel but instead  hotel has to sent an email to their credit card partner to release . Very poor knowledge of operation and impolite on top! I would like to hear from operation management team about it.",
      "rate": 1.0,
      "tripDate": " April 2021"
    },
    {
      "title": "Quarantine Hotel - Enforced Stay",
      "text": "Where do I start. The first room we were given had pubic hairs on the bathroom floor. I thought that these hotels were chosen becasue they had \"the highest levels of cleaning', that's a joke, right? The food was terrible, one choice, take it or leave it. No cleaning products in the room as stipulated on the Gov of Canada website. Unhelpful staff, unless you wanted to pay for room service. We were charged almost $1,400.00 for a 3 night stay and when we got our results back the next day, they refused to give us a refund. A typical room in this hotel, not quarantine related, is $127.00I asked to speak to the manager and was told that she would call me back. Never got a call back - surprise, surprise.I will NEVER EVER stay in one of their hotels again, either for enforced quarantine or otherwise. Do yourself a favour and book elsewhere.If I test positive for Covid on my day 8 test, I know where I caught it from",
      "rate": 1.0,
      "tripDate": " June 2021"
    },
    {
      "title": "Terrible stay , book elsewhere",
      "text": "Recently stayed here on a park and fly rate.Check in was fine along with parking but that’s it. We were accidentally put on the 7th floor which is the refugee floor . We were told this was an error due to staffing issues. Where do I start ,I’ve stayed at many hotels and this was one on the worse experiences of my life and only negative review I’ve ever written. The corridors were littered with food and garbage and running children everywhere . We called the front desk and they said they would take care of it .nothing  happened ,we called again and still the noise and running kids and slamming of doors kept going on.They have security on this floor , not sure why as they seem more interested in there phones than paying customers . After 3 hrs of this happening I went to the front desk and all they could say was we can move you , not that easy to do when you have a 2 year old sleeping and have to be up at 4 am. The manager on call did not seem to care that this was the 3rd time we complained and had not interest to resolve the problem by warming the noisy refugee clients and it’s government funded guarantees money for them. She did say she would discount the room rate but that did not happen .After a 4 th time and it’s now 11 pm they sent 3 security guards and a lady who spoke their language to the room across from ours to tell them to stop. A Total of 17 people came out of 1 room . It’s pretty SAd that it took 4 complaints and 4hrs for them to finally address the issue . They still didn’t clean any of the garbage all  over the floor even though they said it would be addressed . When we woke up in the morning garbage still littered the hall ways , when we checked out they told us we had a movie charge , not sure how that is possible as we spent all night trying to resolved a issue that they did not seem to want to resolve . They night auditor who was very arrogant told us it was not their issue also said he would remove the movie charge but that never happened .also told us that rooms are assigned at time of check in and that was the only park and fly rate room left available, very different story from the training bs story we were told . I work for a travel agency and we have a contracted rate for our clients . I will never book another client to this hotel if this is how they treat paying customers. They obviously prefer the government funded dollars. Travellers beware!!!!!!",
      "rate": 1.0,
      "tripDate": " April 2022"
    },
    {
      "title": "Expensive, Dirty and Disappointing",
      "text": "Very disappointing, as we found the bathroom dirty having someone else's hair all over the floor, rip in sheet and no coffee packs - really felt like housekeeping had done up bed, changed towel, emptied garbage and considered the room clean.  The room was charged out at a higher rate than shared on the phone when we call only moments before from the airport. Best feature was Airport Shuttle, prompt and courteous.",
      "rate": 1.0,
      "tripDate": " April 2022"
    },
    {
      "title": "Average, noisy and unclean",
      "text": "My family and I stayed at Crowne Plaza in September. The hotel staff were lovely and very helpful. The courtesy shuttle was great too. Unfortunately the other guests were very noisy- large groups of families that didn’t seem to have regard for anyone else in the hotel, particularly at night (the walls are very thin!). The cleaners were quite poor- we asked to have our room serviced and had to ask twice for the right number of towels. The sheets put on the bed were also stained and dirty. Would recommend booking elsewhere.",
      "rate": 3.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Great experience.",
      "text": "Staff are wonderful! They did their best to accommodate multiple people who showed up way before check-in due to a cancelled flight. The cleaning staff worked extra hard to get rooms ready and the front desk staff provided water and took luggage to help with you our wait. Highly recommend.",
      "rate": 5.0,
      "tripDate": " February 2024"
    },
    {
      "title": "DONT STAY HERE ITS AWFUL!",
      "text": "Looks nice in the foyer but the rooms are small and dark with no proper lighting, that’s so you can’t see the stains on the sheets, my son and daughter had to change rooms three times to try to get a clean bed but the top cover still had stains on it. They took of top covers and the blankets had dirty marks. Towels smelt of cooking and ours weren't changed for the five days we were there, had to argue with the maid to get clean ones. Had to ask for extra toilet paper at reception, security guards patrolling and noisy people running around at night. They said you can’t hear planes from your room but you can, they fly past your window. They gave me ear plugs that made no difference, hidden charge of parking not included in your hotel room. The lifts smelt of BO, lots of refugee looking people walking around, worst hotel we’ve ever stayed in but we were in Toronto for a wedding so couldn’t find anything else.   Book somewhere else even if you have to pay extra, I thought the Crown Plaza sounded impressive but it was dirty and horrible.",
      "rate": 1.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Awesome place to sleep for an early flight out of Pearson",
      "text": "Nice & quiet hotel within minutes of Pearson Airport. Rooms are small but cozy and dark. Easy to navigate once you realize that your room key lets you out of the parking lot, not the ticket stub that you received upon arrival. Highly recommended.",
      "rate": 5.0,
      "tripDate": " December 2022"
    },
    {
      "title": "Odd stays are often the funnest!",
      "text": "Stayed on the 12th floor which was an adventure! You take the main group of 4 elevators to the 11th floor, then a single mini elevator takes you to the 12th! Great clean room, very standard. Microwave+Mini fridge. Standard king room had the exact same layout as my home apartment, without the kitchen/living room half! So I felt right at home! Don't let the pictures online fool you, there was never a hottub to begin with! Whoever did the photos used small+large chairs, and forced perspective, to make it look like 2 different pools! Not that it was listed as including a hottub, but the photos online make it look like one haha.Small note for the hotel, test your plugs. Bedside table only the plug that had the alarm plug would work. Same with the opposite side. Pressure for bathroom tap could be much stronger, couldn't even rinse my toothbrush. Shower was fine so I know the pressure is there!",
      "rate": 4.0,
      "tripDate": " March 2024"
    },
    {
      "title": "Horrible Experience",
      "text": "I had to book this hotel last minute due to a flight delay.  I waited over an hour for a shuttle that never arrived, I called the hotel over and over again with no answer.  Once I arrived at the hotel by Uber I was then charged again by the hotel after I had already paid through Expedia.  The next morning I arrived downstairs at 5:15am and was told I had to wait until 5:30am for a shuttle, which was not a problem.  At 5:30am the shuttle did not arrive, I went in and asked again where it was and was told oh you will have to wait until 6am.  This would have caused me to miss my flight.  I then had to use Uber once again to get to the airport.  This is horrible customer service, I am still trying to get my money back but again they are not answering the phone.  Do not use this hotel.",
      "rate": 1.0,
      "tripDate": " August 2021"
    },
    {
      "title": "No More Crown Plaza!",
      "text": "The rooms were the smallest I have ever had. The lobby furniture was an attempt to look modern, and was utterly uncomfortable. There was no complementary coffee in the lobby. The lobby coffee vending machine was broken The front desk staff was condescending and rude. I was with a hockey team traveling and brought in 25 rooms, but were told to leave the lobby one evening when meeting. I have stayed at Crown Properties before and been pleased, not here. I asked a maid if she could diret me to a luggage cart and she replied \"No English\" but rudely pointed to a clip board asking which room I was checking out of! I have had better stays in a Motel 6! Back to Hilton Properties from now on!",
      "rate": 2.0,
      "tripDate": " April 2024"
    },
    {
      "title": "Great experience at Crowne Plaza",
      "text": "Everything about our stay was excellent. The hotel was beautifully renovated and we were given an automatic room upgrade based on our IHG Platinum status. All the staff we encountered was fantastic - from the night auditor, to the restaurant staff, to the front desk staff - and were both friendly and professional. The food in the restaurant was good and served quickly.  The treat bag for guests containing a water bottle, granola bar and bag of chips was a nice touch. I would definitely stay here again when requiring an airport hotel.",
      "rate": 5.0,
      "tripDate": " March 2024"
    },
    {
      "title": "Great layover",
      "text": "The king bed was perfect annd very comfortable. The shower was hot and loved having plant based shampoo, conditioner and lotion. The shuttle was right on time both directions and so easy to catch. I will come again. I didn’t use the pool but it’s very nice with chairs around to sit on.",
      "rate": 5.0,
      "tripDate": " January 2024"
    },
    {
      "title": "Crowned for a Queen",
      "text": "The shower was good and clean but needed more towels. Pillows and bed were quite comfortable and I sank into them making for a great sleep. I also enjoyed the fact that you used plant based products in the bathroom making it environmentally friendly.",
      "rate": 4.0,
      "tripDate": " April 2023"
    },
    {
      "title": "Exciting",
      "text": "Nice comfortable rooms and clean. The hotel was overwhelmed with young hockey players and kids running through lobby with just bathing suits on. The crew eventually got it under control. I wonder where the parents were. If something bad happened the hotel would be blamed",
      "rate": 5.0,
      "tripDate": " May 2024"
    },
    {
      "title": "Great stay! Comfortable beds!!!",
      "text": "These were Nice rooms & very comfortable beds!! Great restaurant downstairs too. So convenient to the airport. For the price I’d definitely come back. The only thing is could sometimes hear other ppl in the rooms but other than that it was good.",
      "rate": 5.0,
      "tripDate": " June 2024"
    },
    {
      "title": "Awesome experience.",
      "text": "Stayed for five days on a trip to attend a conference. I have been traveling a lot and have seen many hotels, but this one was too of the line. The staff was great, the room was great, the location was awesome! They even gave me a free upgrade. The view from the 12th floor is breathtaking. The bed was comfy, the room has perfect temperature, the toilet was spotless, housekeeping was prompt in every day. The parking was busy but I knew that from reading prior reviewed but it wasn’t at all a problem on any days. They emailed me at least a week early to welcome me and asked if I had any special requests. The check in was smooth and so was the check out. I have recommended this hotel to my friend.",
      "rate": 5.0,
      "tripDate": " June 2024"
    },
    {
      "title": "Hit or miss",
      "text": "Dirty washroom, sheets had some stains, counter tops were not wiped down. It’s not usually like this as I’ve stayed multiple times but the cleanliness of the rooms has really gone downhill. They were nice enough to let us switch rooms two times and the third room was a better.",
      "rate": 3.0,
      "tripDate": " June 2024"
    },
    {
      "title": "Awesome Staff, Great Hotel - But Very Noisy Location",
      "text": "Hotel was good, nice, clean ambience, staff was very courteous, Mohit and others. However, as it was near airport, and my room was facing road side, it was very noisy, can barely get to sleep.Lesson learned for me is to never take hotel near to airport for the sake of easiness.",
      "rate": 5.0,
      "tripDate": " June 2024"
    },
    {
      "title": "Making the best of a bad situation",
      "text": "We really weren’t at your hotel for very long due to catching a rescheduled flight the same evening we arrived. The staff did a good job of accommodating us last minute. Our rooms were available immediately (for those of us in economy that meant around noon). The lunch choice of meal was only a fried chicken sandwich. The beds were comfy for the 2.5hrs my son and the 1hr I napped. If we ever get diverted from a flight to the UK we’ll definitely stay with you. 🤣 Seriously, we were cranky and miserable and the staff was great. Lunch options, sorry - option was very limited to a single item which was annoying but, I guess, understanding when 400 people descend on you at the last minute. Thanks to everyone at your hotel for trying to make a very bad situation not as miserable as it could have been.LTC (ret) Michael Koznarsky, MD",
      "rate": 4.0,
      "tripDate": " June 2024"
    },
    {
      "title": "Crispy clean and quiet",
      "text": "After my flight was cancelled, I was shuttled to Crown Plaza. Exhausted and sleep deprived, I only wanted to sleep. I was pleasantly surprised by the hotel. Greeted by welcoming staff, offered complementary water and speedy service. The room was clean, spacious, with crispy clean linen and towels. It smelled really nice and the floor was quiet. The pillows of different softness allowed me to fall asleep in seconds (besides me being really tired 😊). Highly recommend, if I ever find myself in a similar situation again, I’ll be staying here again.",
      "rate": 5.0,
      "tripDate": " June 2024"
    },
    {
      "title": "Pricy but Not bad!",
      "text": "Friendly staff. Early check out was somewhat easy.  Advance charged your credit card with no chance to refund and then they take security deposit when you arrived but takes time to process back to your credit card. Restaurants nearby, walking distance, that’s convenient for solo travellers.",
      "rate": 4.0,
      "tripDate": " June 2024"
    },
    {
      "title": "Would 100% stay again",
      "text": "Super friendly, very accommodating and helpful. Elevators are very quick and feel very smooth. Rooms are super clean and have a modern feel. Food is fantastic. Not too close to downtown Toronto but all in all especially for the price this hotel I’m sure would be hard to beat. Very close to the airport on top of many popular stores and great food places as well! 10/10.",
      "rate": 5.0,
      "tripDate": " June 2024"
    },
    {
      "title": "Ok in a jam, but not an ideal stay",
      "text": "Air conditioning was noisy and stopped and started many times.  We were very tired and thus able to get some sleep for the one night stay, but an upgrade of the unit in the room was overdue.We were in room not far from the elevator doors which resulted in some noise from the hall.  Staff at front desk were helpful and reasonably efficient.Shuttle bus driver to/front airport was quick and hardworking.",
      "rate": 3.0,
      "tripDate": " June 2024"
    }
  ]
}