{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "DelSuites Furnished Accommodations",
    "url": "/Hotel_Review-g155019-d1638564-Reviews-DelSuites_Furnished_Accommodations-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.5",
      "reviewCount": 207
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "Head Office: 4800 Dufferin Street",
      "addressLocality": "Toronto",
      "postalCode": "M3H 5S9",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/15/a4/e9/55/the-livmore-downtown.jpg?w=500&h=400&s=1"
  },
  "description": "DelSuites - Furnished Apartments & Short Term Rentals in Toronto. DelSuites has been the trusted name in extended stays, offering furnished short term rentals throughout Toronto and the GTA. As a hotel alternative, DelSuites provides a cost effective solution for any type of temporary living requirement. With our commitment to provide personalized service, our goal is to ensure you feel right at home because we know you expect and deserve more! Our rates include: A fully equipped kitchen (essential kitchen amenities included) Welcome starter package (toilet paper, kleenex, garbage bags, paper towel, dish soap, hand soap) En-suite Washer & Dryer, Iron/Ironing Board Upgraded Wireless, Secured Internet Local and Long Distance calling within Canada & USA (some areas excluded) Separate bedrooms offering privacy and comfort Designated work space (most suites) Personally encoded suite intrusion alarm system (select buildings) The privacy & luxury of a residential condominium - A sense of space to call your own All Utilities Tax-free accommodations DelSuites is also less expensive than a hotel! When in the Greater Toronto Area, let DelSuites be your home away from home! Everything you need and more - A perfect balance of comfort, space and privacy! Suites are professionally cleaned, disinfected and sanitized LCD flat screen TV with HD television package including premium channels DVD and CD/Stereo System Full size refrigerator/freezer, stove/oven, dishwasher, microwave and toaster Comprehensive kitchen content package (coffee maker, bakeware, glassware, cooking utensils, dishware, cutlery, cookware) Double pull-out sofa-bed with linen package (most suites) Supply closet with spare light bulbs, boot tray, vacuum and broom Bathrobes, nightlights, hairdryers, bathroom/bedroom linens, wooden hangers A customer-focused billing and reservation system 24-hour building security, in-suite alarm and 24-hour On Call Manager for Guest Emergencies Underground, indoor, secured parking (charges apply at Downtown & Midtown locations) Exceptional building recreation facilities 'Points of Perfection' - Our proactive approach to inspections and maintenance Additional Services Available ($) Family Friendly Stays: Cribs, Highchairs, Playpens, etc. Pre-Arrival Grocery Services Airport Transportation Services Housekeeping Services Find a Short Term Rental Location in these locations:Mississauga | Etobicoke | North York | Midtown | Downtown Toronto | Scarborough | Markham",
  "featues": [
    "Secured parking",
    "Free High Speed Internet (WiFi)",
    "Fitness Center with Gym / Workout Room",
    "Pool",
    "Kids stay free",
    "Pets Allowed ( Dog / Pet Friendly )",
    "24-hour security",
    "Concierge",
    "Wifi",
    "Non-smoking hotel",
    "24-hour front desk",
    "Clothes dryer",
    "Laundry service",
    "Self-serve laundry",
    "Washing machine",
    "Bathrobes",
    "Air conditioning",
    "Dining area",
    "Sofa",
    "Telephone",
    "Coffee / tea maker",
    "Cable / satellite TV",
    "Bath / shower",
    "Iron",
    "Dishwasher",
    "Microwave",
    "Oven",
    "Refrigerator",
    "Stovetop",
    "Electric kettle",
    "Kitchenware",
    "Flatscreen TV",
    "Hair dryer",
    "Non-smoking rooms",
    "Suites"
  ],
  "reviews": [
    {
      "title": "Best Luxurious Stay in the Heart of Toronto",
      "text": "I googled for service apartments in Downtown Toronto, and am very glad I came across DelSuites.  I had great service from Suelyn Boyle, and the residence team, who answered many of my questions pre arrival. I chose a 1 bedroom suite at 10 York, was impressed with how the apartment was outfitted with many appliances, crockery; they even added a crockpot, rice cooker, and extra items that I requested for.  The residence team showed me how the appliances, TV channels worked.  Compared to airbnb and 4 star hotels, Delsuites was cheaper than those options except that there is a 30 day minimum stay.  I was in town to visit family, and I managed to cook Thanksgiving dinner and have family visit from different provinces. I was close to Union Station; I loved being close to Lake Ontario, and enjoyed walking to many attractions within downtown Toronto as a tourist, watched a ice hockey game, caught several movies and tried out foodie haven destinations. I've had a few unpleasant stays in Toronto hotels, airbnbs and was absolutely hoping that I wouldn't get scammed, flying in from abroad once Canada opened up on Sept 7, and Delsuites really offered an apartment that was warm, convenient to several supermarkets, safe, had lovely amenities, with great wifi, well appointed laundry and kitchen facilities.  Thank you for giving me a home away from home. 10 York was quiet, you would need to check with the marketing team on which apartment building or neighbourhood suits your needs.",
      "rate": 5.0,
      "tripDate": " October 2021"
    },
    {
      "title": "Great Location!",
      "text": "We spent  nearly 3 months in the Hullmark Centre at 2 Anndale and we couldn’t have stayed in a better place! The apartment was furnished beautifully and came equipped with every possible thing you could think of, besides the usual  furnishings: coffee maker,  blender, lovely dishes, pots and pans, bowls of very size and shape etc. etc.  We also had a bi-weekly cleaning service that replaced our linens, towels, toilet paper and Kleenex! There is also a gym though I didn’t use it.Though we had to be out of our home for renovations, we felt perfectly comfortable and at home. The subway can be accessed from the building and, as an added bonus, we were able to get fresh bread and groceries from Whole Foods without going outside. All the staff were wonderful and helpful. Charo Bond, the Guest Services Specialist was amazing!  She was so patient and always helpful, going above and beyond! No matter how many times I called, she never made me feel like a nuisance.  She was always pleasant & cheerful. I can’t think of a better place for a short-term stay!",
      "rate": 5.0,
      "tripDate": " November 2021"
    },
    {
      "title": "Excellent",
      "text": "I stayed with my family at Del Suites for almost two months (300 Front Street W). The stay was fantastic. The location was in downtown, steps away from Ripley’s aquarium and all other basic necessities. We booked initially for a month and then when we were required to extend, the Del Suites team was super flexible and cooperative. I would definitely recommend it to everyone.",
      "rate": 5.0,
      "tripDate": " July 2020"
    },
    {
      "title": "Extremely disappointed ",
      "text": "My personal experience at 70 Roehampton Ave. was very disappointing.  Del Suites is extremely fast at charging money and sending emails to remind of payments due, but when it came to quality, the suite is substandard.  I would say the building rates as a 3 star hotel and the unit & customer service rate as a 2 star hotel at most.  The carpet was stained, broken bathroom fixture, furniture scratched, mold & mildew in the shower, and the peel and stick kitchen cabinets were peeling.  The suite was also dirty as the dust lines the bed frame; I didn’t see the “deep cleaning” in any manner.I failed to see the “luxury” in “luxury furnished suites”.  The kitchen pots are dollorama standard and  impossible to cook/heat food.Amenities were closed due to covid and no price adjustment.Cleaning was cancelled and there was a minor adjustment.  All stores are open, but cleaning with a mask and gloves are for some reason not possible - that I don’t understand. When there is a problem like a sign that says elevators will be grounded for one hour on a busy move day, NO staff member, including concierge, knew what that meant.When I complained all my concerns with respect to the room, Kimberly said she addressed my issues and I said replacing the broken coffee pot and getting the microwave &  TV to work was the smallest part of the list of defaults.  Years ago I rented via Minto and was much happier.  I thought del suites might be better, but I was very disappointed.",
      "rate": 2.0,
      "tripDate": " August 2020"
    },
    {
      "title": "Long stay at Icon 1",
      "text": "I stayed at the Icon 1 from March 3rd till end of June. I thought the room, building and location were fantastic. For long term stays it should be a no-brainer to choose Del Suites over a hotel. Moreover the flexibility on offer (in particular with regards to amending the dates of stay) also makes staying with Del Suites well worth the slightly larger expenditure compared with Air BnB (the cancellation/early departure policy with Air BnB is very opaque).",
      "rate": 5.0,
      "tripDate": " March 2021"
    },
    {
      "title": "Average apartment",
      "text": "I stayed in 20 Blue Jays way in Toronto. The building is very impressive with wonderful views of CN tower and the downtown. It has a beautiful gym and party room and a dog park right in back of the building. Almost everything is accessible at walking distance.. the grocery,parks, Go station, CN tower, Rogers center, Chinatown. The suite itself was not so great. It had lot of space with 2 full bedrooms and bathrooms but old-time amenities like washer dryer was tricky to operate, cooking stove was coil one, sofa and rug was overused, patio furniture was old and made of cheap plastic (it was too dusty when we saw it first), pillows were not too great and comforter was heavy, but the biggest challenge we faced was the TV which made our stay unpleasant. It wasn't such good picture quality and the remote was too hard to operate.. even though it was a smart tv with Netflix and YouTube etc. But we couldn't ever scroll through anything properly because remote had some mouse like operation which made it really difficult to make a selection.. sometimes it'd just hang any moment.. so we hardly watched it.The good points are that it's spacious with comfortable beds with lots of storage and comforters.. kitchen has almost everything you need for a small family. Overall an average stay!",
      "rate": 2.0,
      "tripDate": " June 2021"
    },
    {
      "title": "Luxury suite in Downtown Toronto",
      "text": "Fantastic unit. Extremely well furnished. You had everything that you need for a comfortable stay. We were traveling with our retriever puppy and they have a dog play area on the 5th level..so convenient.Location is great and parking is ample. This is an excellent option for folks staying for extended durations. Washing machine, well stocked kitchen and linens make it a compelling option.Well done Delsuites!",
      "rate": 5.0,
      "tripDate": " October 2020"
    },
    {
      "title": "Great Location, clean and well arranged",
      "text": "We stayed for 2 months at the 270 Wellington St location. It was a fantastic place and great location, everything worked great. Because of COVID , I was worried about checking in and checking out - but the were always responsive on the phone and made arrangements. When we moved in, we found it to be professionally clean with every amenities. It was fully quipped with all kitchen utensils (something we were worried about). The bed was very comfortable, and had TV and phone service. The concierge was friendly. Having a in-suite washer and dryer was a complete lifesaver.For us, the location was extremely convenient and frankly, we enjoyed staying here thoroughly.  If I have to stay in toronto again - I'll definitely use DelSuites in the future.",
      "rate": 4.0,
      "tripDate": " August 2020"
    },
    {
      "title": "So so,  no value for money",
      "text": "Stayed in Del Suites 300 Front st a location for about a month from 15th March till 14th April. A bit underwhelmed with facility for the price they charged. It’s quite an old building and I could see the same in the units. I got a dust mite allergy attack days after moving in. I don’t know how often they clean the carpets in the rooms thoroughly. TV cable wouldn’t work on day 1, I had to raise a maintenance request to have it fixed. Rooms were kinda cramped so if you need space you won’t like these units. The cutlery provided were all really heavy and not easy to use. So if you want to eat at home regularly, you will be irritated with the heavy cutlery. Housekeeping was only once in 2 weeks. This was a bummer.   Building has elevator issues. 50% of the time I could see people waiting in long lines for the elevators.  The staff is pretty indifferent. Reception staff behaves like they have nothing to do with the residents. They don’t assume any responsibility and pass the buck to some unknown building maintenance team whom we can’t reach. Location is central. It is an ok facility if you are not too picky about mediocre amenities, lazy staff, cramped rooms, and old building. Overall not that happy for the price i paid ($5300 for 30 days for 2 bedroom suite). I would have been better off spending money staying in Marriott residence inn on Wellington st renting 2 interconnected rooms. At least they would have provided daily housekeeping and address maintenance issues immediately.",
      "rate": 2.0,
      "tripDate": " March 2022"
    },
    {
      "title": "Wonderful apartment and great location",
      "text": "I stayed in Delsuite in Grand Ovation \"Square One\". It was very nice, clean, organized and equipped with all what we need. Del team is very helpful and supportive.Location is great with Ontario lake view and you can reach shopping mall or restaurants  just by walking.The cost is considered high compared to other furnished apartments but still lower than hotel.",
      "rate": 5.0,
      "tripDate": " September 2020"
    },
    {
      "title": "Skymark West - very comfortable for two people",
      "text": "We initially booked at the Republic but after 5 days asked to be relocated to Skymark West to be closer to family. The relocation was absolutely seamless thanks to great service from Brenda. The apartment was just right for a couple, clean and with all the necessities required for a 5 weeks stay. Will definitely be using DelSuites again in future.",
      "rate": 4.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Two month stay for cancer care at Princess Margret Cancer Centre",
      "text": "Great location for Hospital Care at Prince Margret, Sick Kids and Toronto General Hospital, a very quite building, well maintained, well managed with remarkable service.Friendly, caring staff... A wonderful find!!!",
      "rate": 5.0,
      "tripDate": " December 2019"
    },
    {
      "title": "Feel at home !",
      "text": "Pleasant and well furnished large 1 bedroom suite with good rate per night. It’s fully equipped with all the essentials a home away from home would need for long stays. Comes with a fortnightly complementary house cleaning services. Overall the apartment has Good vibes and location is well connected to TTC, restaurants and shops around.",
      "rate": 5.0,
      "tripDate": " March 2024"
    },
    {
      "title": "Very Convenient",
      "text": "Clean, quite and great location.  Very helpful staff and nearby stores for anything you may need.  Close to local hospitals and easy access to all of downtown.  Was easy to extend the stay when I needed to.",
      "rate": 5.0,
      "tripDate": " June 2020"
    },
    {
      "title": "Stay at DelSuites condo",
      "text": "It was great experience to stay at DelDuites condo. Very clean, fresh, everything was working . Management was very responsive and kind, all my questions were solved in timely manner. Which I very value. I would recommend to stay with them.",
      "rate": 5.0,
      "tripDate": " June 2021"
    },
    {
      "title": "Business Short trip",
      "text": "Good place to stay in Toronto. Budget friendly, clean, helpful staff, placed in good location in toronto. olid security 24/7, practical appliances , easy access to parking, a very quite building, well maintained.",
      "rate": 5.0,
      "tripDate": " March 2020"
    },
    {
      "title": "Great place to recover!",
      "text": "We thoroughly enjoyed our stay at The Livmore.  This has been a great place to recover following surgery.  Your proximity to the Toronto General Hospital and amenities in the suite have been much appreciated.   The suite was clean and well equipped with everything we needed to make our stay comfortable.  Definitely appreciated all the COVID protocols in the building.",
      "rate": 5.0,
      "tripDate": " February 2021"
    },
    {
      "title": "Loved my stay",
      "text": "Just get your suitcase and stay without any worries or hassles. Top of the notch suites, great quality and all amenities taken care of. Loved my stay here. You are in the heart of downtown, public transportation is at your doorstep and the building is great.",
      "rate": 5.0,
      "tripDate": " March 2021"
    },
    {
      "title": "Perfect accommodations & Service!",
      "text": "We stayed at the Livmore for almost a year from October 2020 to Sept 2021 as our daughter was at SickKids. We had the best experience and our representative, Suelyn was beyond helpful and kind. The apartment was nicely furnished, it had a modern decor and was clean and well stocked with kitchen supplies. Any issues we had were always dealt with efficiently despite the challenges that covid brought with in-suite access etc The only issues we had have nothing to do with DelSuites but with the building itself. The elevators were a challenge and would be out of service often leaving long lines during peak times and accessing the stairs was tricky as they do not have an access point inside the building. You have to exit the building and go through the garage which is annoying.Overall we had a very good experience with the unit we had and with DelSuites and their services. Would definitely stay again if in Toronto for a long period of time.",
      "rate": 5.0,
      "tripDate": " November 2020"
    },
    {
      "title": "Great stay",
      "text": "The complimentary airport pickup was great.  Check in was a breeze.  The suite at 360 was very clean and comfortable.  I stayed there one month and it was like home away from home.  Great, convenient location.  Five minute walk to Scarborough Town Center.  Kitchen had all utensils except I had to go out and purchase a frying pan to make my breakfast as there was none.  Not a big deal though.  Very professional staff at DelSuites.  Would certainly stay there on my next visit to Toronto.",
      "rate": 5.0,
      "tripDate": " January 2024"
    },
    {
      "title": "A great escape while our home was being renovated.",
      "text": "Had a wonderful stay while we were waiting to have our home renovated after water damage. It was just at the beggining of our summer holidays so it was stressful to have to move during this time. The del suits location at forest vista was a great place to rest while our home was in chaos. The rooms are very large, the beds are large and the view was wonderful. We were able to stay as a family with two kids ages 8 to 13. They had a great time since we were located in a building with plenty of amenities.  Being located so close to the STC and grocery shopping changed our driving lifestyle to a walking lifestyle since everything is walkable!The movie theater and close restaurants were a great escape for us during our stay. The kitchen was well equipped and lovely for space. In suite laundry was so helpful along with the by weekly cleaning service. It made our summer away from home a fun vacation. I will miss the view and the sky over the woods.",
      "rate": 5.0,
      "tripDate": " August 2023"
    },
    {
      "title": "EXCELLENT STAY",
      "text": "Was staying at DEL SUITE last year 2020 during COVID, staff been very caring and helpful and diid everything to make our stay comfortable .Was always trying accommodate our need .Will stay again in the future .",
      "rate": 5.0,
      "tripDate": " April 2020"
    },
    {
      "title": "Excellent and convenient",
      "text": "I stayed at Viking Lane, a very nice place to stay in Toronto. The suite was clean, well-furnished and felt safe with 24/7 security in the building. The staff was also very helpful from the check-in process to the check-out.I’d recommend the place for anyone planning a trip to Toronto.",
      "rate": 5.0,
      "tripDate": " May 2021"
    },
    {
      "title": "Fantastic!",
      "text": "We stayed in room 619 of 70 Roehampton avenue, Toronto for 1 month. It was very clean and safe. Everything worked great. The beds and linens were wonderful. Could not have asked for anything  better! We highly recommend this business and location. They made everything easy. This was a very quiet building with very few people who used it or at least it seemed that way to us.",
      "rate": 5.0,
      "tripDate": " February 2021"
    },
    {
      "title": "My stay at DelSuites 70 Roehampton Ave, Toronto, ON",
      "text": "Clean, comfortable space located in the heart of Yonge and Eglinton area, great walk-score and close to all the conveniences. Everyone from administration (shout out to Charo Bond..!) to the front desk, cleaning staff and the residents that stay there…and the many great doggies…!  My unit was spacious with a living room, separate bedroom, fully stocked kitchen utensils for cooking, balcony and updated bathroom. 2 TV’s, in-suite laundry and an office area with a desk and phone. Underground parking with access to your suite with nearby elevators. Rates are very reasonable. One month minimum required. If I could sum it up with once phrase, I would say “a friendly place to stay.”",
      "rate": 5.0,
      "tripDate": " November 2022"
    },
    {
      "title": "Excellent Experience",
      "text": "Del Suites are very professional, and very quick in their responses.  The apartment I rented on 300 Front Street is really elegant, nicely decorated and has everything you basically need for a good stay.  Location is absolutely great, such a prime location.  Renting through Del Suites is highly recommended.",
      "rate": 5.0,
      "tripDate": " August 2022"
    },
    {
      "title": "My experience with DelSuites",
      "text": "I have stayed at one of the Delsuites Condo located on 300 Front Street West for one month.  It's a great location as it's right at the downtown area with great convenience whether it's to super market or train station.  It's also very close to the lake front like 10 minutes walk and 5 minutes to CN Tower.  Lots of nice restaurants around too!  I really enjoyed my stay.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Excellent, cozy, convenient, great place!!",
      "text": "Anyone coming to the Livmore should be happy! It is a great condo located on Downtown, very close to Toronto Eaton Center and with access to public transportation. The facilities are great and the apartment includes everything to make your stay comfortable. We are newcomers in Toronto, and we rented this as a temporary housing to start during our first 3 months and the decision couldn't have been better. I strongly recommend this apartment to anyone who wants a great experience when arriving to Toronto. My family and myself are highly satisfied! =)",
      "rate": 5.0,
      "tripDate": " March 2021"
    },
    {
      "title": "Couldn’t be more satisfied!",
      "text": "We stayed at The Livmore for 9 months with Delsuites for our provincial allocation. Best services from both reservation and guest service team. Especially Shirley and Sophia who always response to our request promptly, friendly and very helpful. Comfortable furniture and well equipped kitchen amenities makes our 9 months stay just like a sweet home. Couldn’t be more satisfied. Highly recommended.",
      "rate": 5.0,
      "tripDate": " December 2021"
    },
    {
      "title": "Comfortable and convenient",
      "text": "I spent 4 months at 70 Roehampton and have nothing but positive reviews to share! The location was excellent (near restaurants, pharmacies, grocery, shopping etc...). The bed comfortable, there was a comprehensive TV package, and plenty of storage in the kitchen. I highly recommend that if you need to rent a furnished condo this is the ideal spot!",
      "rate": 5.0,
      "tripDate": " June 2021"
    },
    {
      "title": "Great stay and extremely accommodating staff!",
      "text": "My stay with Del Suite's was fantastic, and the staff were extremely accommodating. Initially I booked a unit in the Icon building. I checked in at the beginning of January, but unfortunately the particular unit I was assigned had a musty or smokey smell. Within days of communicating this to the Del Suites staff, they offered to move me to a different building within their portfolio - at no extra cost. Shirley was fantastic to deal with, and made the process very easy. I moved into a unit in Qwest and could not have been happier. The unit had a separate working space (which was very important during WFH circumstances),  it was fully equipped with all cooking utensils and appliances, and two TV's (one in living room and one in bedroom). The bed was very comfortable, and everything was very clean. The building concierge was also very friendly. I highly recommend this building to anyone, and booking through Del Suite's altogether. I will certainly be using them again in the future!",
      "rate": 5.0,
      "tripDate": " January 2021"
    },
    {
      "title": "Excellent Suited, Neat and Clean.",
      "text": "The suite I stayed in was excellent and I enjoyed my trip thoroughly. The suite was clean with all linen, towels, etc lined up. All the necessary cookware, utensils and crockery was there for me to use. The unit is equipped with a full-fledge working kitchen, washer dryer, high-speed wireless internet, telephone, and TV cable. There are two TV's in the unit with one in the bedroom.  The location is excellent. It is literally opposite the CN tower with a lot to do nearby. Grocery stores are a stone throw away and there are some really good restaurants nearby. Queen Street and bars are all at a walking distance making this one of the best locations downtown. The unit has a big balcony and the building has all amenities such as a full-fledge gym, swimming pool, etc. The management is good. They inquired about my stay and kept me informed of any upgrades pertaining to the building via email. I will definitely be staying with Del Suites again. Thank you for everything.",
      "rate": 5.0,
      "tripDate": " July 2020"
    },
    {
      "title": "Amazing stay!!",
      "text": "Had an awesome experience while renting with Delsuites at 300 Front Street. Apartments are very spacious and beautiful with high hygiene standards. Everything from check in to check out was very smooth and the guest services team did their best in helping the guests during the time of COVID-19. They also considered our requests regarding the work area in the apartment and allocated the best one to us. The building is located at a walking distance from CN tower, waterfront and many other attractions. Thanks for having us!! We have already booked there for our next stay and hoping to get the best apartment again!!",
      "rate": 5.0,
      "tripDate": " March 2020"
    },
    {
      "title": "Great accommodation for working from away from home !",
      "text": "I stayed at 10 York St . The room had everything I needed to be able to live and work away from home for nearly 3 months . The apartment was was clean and comfortable. The building was close to food shops and also located close to the lake for daily walks. They del suites booking staff were very friendly and were very efficient at dealing with any requests . Would definitely recommend.",
      "rate": 5.0,
      "tripDate": " January 2021"
    },
    {
      "title": "Super convenient, great location, clean and comfortable accommodation, friendly staff. We will definitely return.",
      "text": "We stayed in a DelSuites condo for two months over the summer. We choose DelSuites over AirBnb because the reservation process was more flexible and the cost was more reasonable. Price included a weekly cleaning service. Great experience. 10/10.",
      "rate": 5.0,
      "tripDate": " July 2023"
    },
    {
      "title": "Negative experience, dated unit  and overpriced short  term rental  ITS NOT LUXURY RENTAL .",
      "text": "Did stayed at Del suite - 70 Roehampton Avenue. Units are in  very, very dated, bad conditions, very old furnitue    , appliances are old . They do advertising it like luxury rental and overcharging   for this conditions of the units is below average.We will not return to this rentals ever as they taking advantage not fixing or not taking care about the rentals unit .",
      "rate": 1.0,
      "tripDate": " April 2022"
    },
    {
      "title": "Couldn't have asked for better accomodations",
      "text": "I stayed at 55 Gerrard St. W. It was a fantastic place with an excellent location. Amenities were amazing and all staff were very friendly and helpful. I would highly recommend this location (and Delsuites) to any travellers in the city.",
      "rate": 5.0,
      "tripDate": " July 2020"
    },
    {
      "title": "Suites at Yonge/Eglinton Republic NOT up to par! Need new furniture STAT",
      "text": "I have stayed with DelSuites numerous times for business, usually a month at a time.  About 5-6 years ago the units were in very good condition BUT as of early 2023 they are a joke!  6k for a month is an embarrassment for what you get. Floors warping, stains all over pillows (nasty), carpets are dirty, leather couch is so uncomfortable I used a patio chair to watch TV.  Everything is worn. Poor lighting.  It seems their locations downtown must be their priority but not here.  Very disappointing - everything needs an update and new furniture asap.  Mattresses -need new. The artwork in red and brown everywhere is depressing you could find something for $20 at homesense better than what you have. The bedside tables looked like a 2nd hand store and I won't go on.....   PS building itself is great and staff seemed excellent, however Del obviously has no quality control in place.  Book somewhere else if you care about quality.",
      "rate": 2.0,
      "tripDate": " January 2023"
    },
    {
      "title": "Would not hesitate to recommend",
      "text": "My wife and I found ourselves staying at one of the DelSuites furnished apartments at Kipling and Dundas for 3 months as we awaited the departure of the tenant from our home. Through this trying time, DelSuites was very professional to deal with and very responsive to our needs. They were also extremely accomodating as the date of our departure continued to drag forward indefinitely. The unit itself was very clean, modern and equiped with all the necessary amenities. I would not hesiate to rent from Del Suites again and would highly recommend them to anyone looking for short term or long term accomodations.",
      "rate": 5.0,
      "tripDate": " March 2020"
    },
    {
      "title": "Extremely convenient, close to Toronto General",
      "text": "Suite was comfortable, quiet and well-equipped for two seniors staying in Toronto for significant illness / hospital attention.  Easy walking distance to TGH even for those with limited mobility.  Hide-a-bed sofa was solid and comfortable.  Booking staff etc. were great: congenial, responsive, flexible.  Thank you. We'll stay again!",
      "rate": 5.0,
      "tripDate": " February 2022"
    }
  ]
}