{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Delta Hotels by Marriott Toronto",
    "url": "/Hotel_Review-g155019-d6678171-Reviews-Delta_Hotels_by_Marriott_Toronto-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.5",
      "reviewCount": 2938
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "75 Lower Simcoe Street",
      "addressLocality": "Toronto",
      "postalCode": "M5J 3A6",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/09/f2/46/24/delta-toronto.jpg?w=500&h=-1&s=1"
  },
  "description": "Stay, play and explore at Delta Hotels by Marriott Toronto. Our hotel in Toronto, Ontario, is located near the Metro Toronto Convention Centre, CN Tower, and Ripley's Aquarium of Canada. After a busy day, unwind in our 24-hour fitness centre, relax in our heated indoor pool, or enjoy on-site dining at SOCO Kitchen + Bar, Char No.5 Whisky & Cocktail Lounge, or The Roof at SOCO.",
  "featues": [
    "Electric vehicle charging station",
    "Free High Speed Internet (WiFi)",
    "Pool",
    "Fitness Center with Gym / Workout Room",
    "Bar / lounge",
    "Pets Allowed ( Dog / Pet Friendly )",
    "Conference facilities",
    "Banquet room",
    "Valet parking",
    "Paid private parking on-site",
    "Wifi",
    "Hot tub",
    "Indoor pool",
    "Restaurant",
    "Breakfast available",
    "Breakfast in the room",
    "Complimentary Instant Coffee",
    "Outdoor dining area",
    "Meeting rooms",
    "24-hour security",
    "Baggage storage",
    "Concierge",
    "Non-smoking hotel",
    "Outdoor furniture",
    "Shared lounge / TV area",
    "24-hour front desk",
    "Express check-in / check-out",
    "Dry cleaning",
    "Laundry service",
    "Ironing service",
    "Air conditioning",
    "Desk",
    "Housekeeping",
    "Interconnected rooms available",
    "Coffee / tea maker",
    "Cable / satellite TV",
    "Sofa bed",
    "Bath / shower",
    "Room service",
    "Safe",
    "Seating area",
    "Sofa",
    "Telephone",
    "Bottled water",
    "Iron",
    "Private bathrooms",
    "Wake-up service / alarm clock",
    "Refrigerator",
    "Flatscreen TV",
    "On-demand movies",
    "Radio",
    "Complimentary toiletries",
    "Hair dryer",
    "City view",
    "Non-smoking rooms",
    "Suites",
    "Family rooms"
  ],
  "reviews": [
    {
      "title": "If I could design a hotel room - this is it!",
      "text": "Desk lamp with switch on base – easy to findLots of plugs  beside bed, at desk, wall plugs – no furniture moving requiredTV doubles as computer monitor, free wifiDesignated wall shelf for all the stuff that usually has to reside on your deskNo arms on the desk chair – awesomeCloset with hangers – doors fold back flat and there are shelves in the closetDesignated spot for coffee and teaAnd there is tea kettle – hallelujah!Base on bed so you can’t lose things underneath and it is recessedSide tables are wall mounted – don’t stub toes and can’t lose things underneathNice big drawers  for storageBathroom is nice and spacious – not crampedThere is counter space in bathroom – awesome and they have wall shelves for the stuff they provide, leaving counter for your stuff.Handheld shower is fantastic – so much easier to wash your hair.Garbage bin in bathroom is accessible and not hidden, nice towel racks right at front of vanitySpecific reading lights by bed that tiltNice dark out curtains that overlap when they closeBathroom has pocket door so it doesn’t take up spaceI can honestly say that if I was going to design a hotel room, this room has everything that I would prioritize and it has nice contemporary wall art as well. Well done Delta!!!",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Six Star service in EVERY way!!!",
      "text": "Quite possibly the best hotel stay of my life, without any exaggeration!!!First, we were transferred here after a poor experience at another hotel.  Upon our arrival at 3 AM, Matt (the night receptionist) and Nick (the night manager) had everything ready for us.  They gave us a corner room on the 45th floor, access to the Club Lounge, upgraded internet, and all the amenities we requested free of charge.  Also, because they are part of the Marriott family, they gave us our room at the rates we paid for the previous hotel (which was less than theirs) and their entire management staff over the course of our stay repeatedly apologized for our experience at a Marriott group hotel.I cant speak well enough of the service here.  Room requests were handled immediately, and they more than made up for our experience during our anniversary getaway.  A bottle of wine and a cheese plate were delivered complimentary, and they followed up the next morning to see if we needed anything else.We wanted to see the play Anastasia, and the concierge team was outstanding.  Genevieve got us tickets to see the play that day, and also recommended a hairdresser for my wife on New Years Eve.  She made multiple calls to find her an appointment, and followed up to ensure we were satisfied.  When we wanted to hear live music, Dave hooked us up with a great live venue and then called to ensure it was what we wanted.  He also recommended a great men's salon and got me an appointment on New Years Eve for a haircut even though they were \"booked\" he got me in.This staff EXEMPLIFIES what a hotel experience should be.  When I visit Toronto again, there is no doubt that Delta hotel will be my only choice to stay at.  You will not be disappointed with any aspect of this hotel.  Dont take chances if you visit Toronto, just book at Delta and you will have no worries.",
      "rate": 5.0,
      "tripDate": " December 2019"
    },
    {
      "title": "Frequent traveler experience: Best hotel in Toronto - staff, location, service are all perfect",
      "text": "I’ve been staying at the Delta weekly Monday to Thursday for about a year and a half now, and I wouldn’t call this hotel less than my second home. I’ve tried almost all the Marriott Bonvoy properties downtown Toronto and Delta is by far the best of them all.The property is very recent, modern, vibrant and the rooms are impeccable. The view (whether you’re city, lake or CN tower side) is gorgeous. The facilities are very well maintained - the gym has the basic necessities with a beautiful view on the CN tower (workout with a view!), and they recently added a Fitness room with a projector and a “Fitness On Demand” program, allowing you to choose a class and do it. I find it amazing and very efficient. But what truly makes this hotel amazing is the whole staff, whom I would like to thank from the bottom of my heart for making me feel at home away from home. Thank you: \t⁃\tCatherine of course, for ensuring I always had what I needed.\t⁃\tThe lounge staff: Sarthak (SK) and Betty (who I can even call my friends), Alex and Jasmine. You were my favourite morning and evening conversations, always with a big smile.\t⁃\tThe front desk staff: Bradley, Lenard, Amir, Martin. My experience wouldn’t have been the same without your constant help. \t⁃\tThe Bell men staff: Kari, Coby, Passang, Michael. Thank you for making my ins and outs seamless with my many bags. \t⁃\tPillip: always so cheerful, whether arranging the gym or the lounge at closing time. These mentions are only a sample of the long list I could write here. Every single person has had a positive impact on my stay at the Delta and I can’t thank you all enough!I'm back home for the moment but I can't wait to have more business trips in Toronto to see you all again!!",
      "rate": 5.0,
      "tripDate": " November 2019"
    },
    {
      "title": "Great location for both the Rogers Centre and Scotiabank Arena",
      "text": "We reached the hotel around 1PM, I have informed the hotel about the earlier arrival time via the chat function on the Bonvoy App. Unfortunately the room was not ready and we were told that housekeeping would be cleaning it straight away and we were invited to go up to the lounge on level 46. An hour later my wife went to check and was told that the room was almost ready, At 2:50PM I went back to the reception and the room was still not available. At that point I was offered a room on a lower floor but I declined stating that this would defeat our whole waiting period for a room on a higher floor (after all I am a platinum member...) The check in person (believe Priscilla) was very helpful and made a few more calls, finally we got our room around 3:15PM only - so even after the official check in time.She took the initiative to arrange a curtesy gift for the trouble which was appreciated. Nevertheless such a long wait isn't acceptable for an elite platinum member.The rest of the stay was good. The location of the property is great for anyone attending sports events at either the Rogers Centre or Scotiabank Arena which can be accessed without going outside via the Path.The room was spacious and clean with a fridge instead of a mini bar, this can be useful. Bedding was okay but not as comfortable as at the Westin or Sheraton.Room keys are very temperamental, we had to replace 3 during our 5 nights stay!The lounge is nice with a good selection of breakfast spread as well as evening snacks. Unfortunately one does not get a note with the operating hours as breakfast on the weekend starts 1 hour later on the weekend and we were told about this only in a not so polite way when we went for breakfast on the weekend. Valet parking was efficient and friendly and the wait was never as long as indicated on the valet slip.However, the wait for elevators can occasionally take some time.Overall a nice property, about 5 years old, and would get a higher ranking if check in was not such an issue and the keys would be more consistent.",
      "rate": 3.0,
      "tripDate": " December 2019"
    },
    {
      "title": "Great location and view",
      "text": "We spent a long weekend at Delta, and it was a good experience. The room was spacious and the view from the room was great. We did receive dirty towels a couple of times (by dirty I mean on the first day one of the towels had short hair stuck on it, like after shaving, and on the second day one of them had a huge yellow spot on it) so that was a little bit of a turn off. Nonetheless they replaced it quickly. We also ordered room service, and the mac and cheese was really good. The location was also great, right in the financial core of downtown, walking distance from a lot of great eateries. It also directly connects to the PATH from within the building, so in cold weather you really don't need to go outdoors at all, which I also appreciated.We did try to go swimming, but the pool was extremely crowded. Not that it was a small pool per se, but it was too small for the number of people there. So we left without swimming. It was the middle of February, in the midst of crazy cold weather, so I guess that's why everyone was attracted to the indoor pool.Overall, it was an alright experience.",
      "rate": 3.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Great Birthday Staycation",
      "text": "I was given the gift of a nights stay within my city for my birthday. Due to the pandemic, I was not able to travel as I normally would, but this was just as good. I was welcomed by the concierge with smiles and laughter. Check-in was a breeze and finding the room was easy as well. The room was beautiful but what captured my heart was the floor to ceiling windows all around, but more importantly in the bathroom, all while having the view of the skyline, the city and the lake. It was so beautiful to have the view at night while soaking in the big soaker tub.  I was amazed.The concierge was super helpful as I forgot a lighter to light my candle while soaking. I also forgot my wine bottle opener, and they were able to provide that to me as well. The following morning, I was advised that breakfast was included in the cost of the room, and I had a $75 budget that I could use. The menu was easy to download and order. Once the order was complete, they called me down to pick it up.I was impressed by their safety measures pertaining to the pandemic. Sanitizer and signage were posted everywhere. All employees had on masks. We ordered Uber Eats the night we arrived and to prevent random people in and out of the building, we were advised to come down to pick up our food, which I appreciated.All in all, the grounds of the hotel are beautiful. The décor was very modern. I would definitely stay there again. In fact, I have a reservation coming up for valentines weekend :) I can't wait!!!",
      "rate": 5.0,
      "tripDate": " January 2021"
    },
    {
      "title": "Quite nice except for a couple of possible deal breakers",
      "text": "The Delta is new and therefore nicely appointed, the site is in a posh waterfront area adjacent to downtown (I was there to work at a bank), the CN Tower, Aquarium, baseball stadium, Union Station and ferries are all steps away. 90% of the staff were friendly and helpful and when I requested maid service or towels etc they arrived promptly. The tv selection was okay but they did have Netflix and Hulu for you to log into connected via network cable, so it was fast and reliable.HOWEVER: and these things might not bother you, but they will probably stop me from booking here again - the WiFi was some of the slowest and least reliable I ever experienced, and they do not offer an upgrade. When I called the desk to ask if there was a problem or if they could reboot the WAP, the front desk employee was kinda rude, saying nobody had ever complained before (I couldn't even use Google Maps or write an email it was that slow), she then connected me to their IT department who after a ten minute hold told me was not for guests, and they had no idea why she would have transferred me. I asked another concierge and they said sorry, but there was nothing they could do, would I like to try another room? I already had everything put away so I just had to use my phone data if I wanted internet access. When on business WiFi this slow is simply unacceptable. Maybe it was the WAP, but nobody bothered to attempt to fix it and I just let it go.There are six elevators for the entire hotel (46 floors) which was fine during the week when the place was nearly empty. But when the weekend came around and mobs of families and baseball fans and overseas tourists checked in, it became an actual queue to get to your room, up to 15 minutes wait time! I don't think I have ever seen that at any hotel and perhaps this was an unusually busy weekend, but standing with the food you picked up (no room service or delivery to rooms allowed due to Covid) as it gets cold, waiting to go up for what seems an eternity wasn't fun. At the very least an employee should have helped expedite the situation by directing traffic, but there never seemed to be enough of them. As I stated earlier all the workers were friendly except one, so no real complaints there, except maybe more should be on duty during the busy weekend.If those two issues don't bother you, you'll enjoy your stay. I recommend requesting a high floor overlooking the Lake or CN Tower, it truly is a spectacular view! But not enough to make up for the WiFi in my case. Toronto is great, so enjoy it :)",
      "rate": 3.0,
      "tripDate": " August 2021"
    },
    {
      "title": "My Go To Hotel in Toronto",
      "text": "This is my favourite hotel in Toronto for many reasons, clean and stylish rooms with amazing views of the lake/city, most comfortable beds, spacious and most of all, the staff. The level of professionalism and kindness from the staff is always above and beyond from the moment you walk in to the moment you leave. Chrissy at the front desk has sorted us the past few times and when I walk in and am greeted by name, it goes a long way! They’re great at acknowledging Bonvoy status as well. During this time of uncertainty it’s comforting to see the extra steps being taken to ensure guest health and safety by explaining how they’ve made changes including constant cleanings, hand sanitizing stations throughout the hotel, minimizing any need for unnecessary close contact, etc. The location of this hotel is also perfect. It’s attached to Union Station by a walkway, a block from Scotiabank Arena and Rogers Centre and the CN Tower/Ripleys are across the street. It’s a 5 minute walk to the harbour front, 15-20 mins walk to the Eaton Centre and Nathan Phillips. You won’t be disappointed by staying here!",
      "rate": 5.0,
      "tripDate": " April 2020"
    },
    {
      "title": "The location is great but the price is crazy for what's on offer",
      "text": "The location of this hotel is perfect if you're attending lots of downtown activities. But the price is incongruent with the offerings. The fitness center is just ok. Nothing upscale like Peloton bikes or yoga classes. Just the standard stuff. The pool is entirely indoors. Nice in winter, I guess, but disappointing in summer. There's no outdoor seating area at all in the hotel (other than restaurants). There was a major mishap during my stay – water pouring out of the ceiling light above my tub. Staff was quick to respond and, on my request, moved me to another room (though it was weird that I had to request this move vs being immediately ushered out). They upgraded my room and offered a complimentary breakfast.  But then I had to hassle with getting the charge removed from my bill. The breakfast buffet wasn't great at all, and it certainly wasn't worth the hassle. There were a bunch of other hassles as well. A maintenance man arrived unannounced when I'd been given late checkout and had the \"do not disturb\" sign on my door. MANY single-ring calls to my room –  extremely annoying. TV turned itself on. Finally, the harbor/CN Tower view from the bathroom/bathtub was gorgeous. But...the room design is idiotic. Apparently, the designer never heard of sleep hygiene. The room is bright all night – from the city lights and then from sunrise – because the bathroom shades aren't blackouts and the bathroom door is glass. This is an unempathic design.All in all, I'd have to be paid to stay here again. $2000 for 3 nights and all these hassles. Nope. Never again.",
      "rate": 3.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Even with a few things that could be improved, this hotel readily deserves 5 STARS!!",
      "text": "This hotel is straight up the best value for money for the mid-range traveler / group of travelers. The location is excellent (so close to Union station), the view is amazing, especially if you book a room facing the CN Tower. No other hotel, not even the ones that charge 3x as much, have a better view of the CN Tower. This hotel has the only picture perfect, Instagram-worthy view.There are a few things that others have touched on, but I don't think the hotel deserves a lower rating because of these, it's just the times we're in right now. Firstly, yes, the elevator wait can be a bit horrendous, even if the hotel isn't that full. My suggestion to the hotel would be to look into reprogramming the elevators so that they don't stop once they have someone in them. The elevators are new enough that should be super easy to get done. Otherwise, spend a tiny bit of money and get the \"Destination Dispatch\" upgrade (where you punch in the floor you want to go to before getting onto the elevator). So much of the wait is an elevator arriving with people already in it. Makes things slow for everyone.Oh, and despite being a 7-year new hotel, there could definitely be touch ups to the paint in the rooms, in the hallways, etc,. All in all, this hotel might not be priced like a Courtyard, but with what you get, it easily easily deserves the price they ask for. Will absolutely stay here again!!",
      "rate": 5.0,
      "tripDate": " September 2021"
    },
    {
      "title": "Grossly overpriced",
      "text": "In Toronto on business and needed a room for one night in the downtown core, so the location of this hotel was perfect. The hotel, though, turned out to be anything but perfect.The first problem was with the useless BonVoy app (not the fault of the hotel). I checked-in on the app to so I would not have to have contact with anyone – but when I arrived at 9:15 pm, the app would not let me check-in until 9:45 pm. What?! I inquired at the front desk and he asked for ID and a credit card (so much for contactless check-in) and gave me key cards (so much for a virtual key). This was the second time the BonVoy app has proven to be useless at a Delta property.For the price of the room ($237 + taxes & fees), I expected a much better hotel but it was immediately clear that I was paying for the view. There was paint splatter on one wall and several broken/missing things in the room. It felt more like a $100 Holiday Inn.At 5:19 a.m. I was woken up by a fire alarm that was followed by numerous announcements. Not the fault of the hotel, I suppose, but annoying just the same.If you stay here, you're paying for the location and the views.",
      "rate": 3.0,
      "tripDate": " July 2021"
    },
    {
      "title": "Delta bingo on st claire in Toronto",
      "text": "This Delta bingo location is truely outstandingThe staff here are amazing people and genuinely care about the customers.I have seen with my own eyes how they go above and beyond their jobThe staff at the lottery and snack bar are so bright and full of life They are always greet you with a beautiful smile .they are well manneredThey listen to the customersThey will bring the food to your table .Their are two staff members in particular that are amazing with the customersThere is a young man named SebastianHe is a security officer hereHe goes above and beyond his jobI have seen him wheel seniors in their wheelchair to their bus or taxiHe opens the doors for seniors and people with disabilities.He checks on seniors He is always so friendly and pleasant with the customersHe helps make the bingo experience safer for everyone He makes Delta bingo a very welcoming placeI would highly recomendthis bingo hall for a must go place for fun and good peopleTheir is another staff member that goes above and beyond she works in the cash office. She works all over to help fellow coworkers. Her name is Paige She is an amazing young lady that is genuine and caring she helps make your experience here a good one",
      "rate": 5.0,
      "tripDate": " February 2023"
    },
    {
      "title": "No breakfast in the lounge?",
      "text": "This has been my favorite hotel in downtown Toronto since it opened, something like 10 years ago.  I am not a road warrior, but I have probably stayed at this property 30 times and am a lifetime Silver member with Marriott.  I book Club Level when it's available, really for Club level access and the convenience of a quick breakfast.  Most other privileges associated with the room level have been stripped away for cost purposes, according to management.This time, on checking in, I was informed that breakfast was still included, but not in the Club Lounge.  Breakfast in the lounge was reserved for Platinum members due to capacity reasons.  Hmm...clearly the person on property who made that decision really didn't understand that people generally want breakfast in the lounge for convenience purposes.  It's a quick in and out buffet, and get on with your day.The kind people in the lounge let me in anyway for breakfast, even without Platinum status.  I attach a couple pictures here showing that yes, I was lucky to get a seat.Yes, the hotel still offered breakfast for non-Platinum members in the main restaurant, but honestly, I would just book a regular room and pay for that breakfast myself if that was what I was looking for.  The cost premium associated with Club level is far greater than the cost of breakfast in the restaurant.The rooms and views on three sides of the hotel are excellent (the east side is blocked by the neighboring building).  HVAC is quiet, bed comfortable.  Food is good and staff are mostly friendly.  This really is my favorite hotel in this part of the city, but there are 15 hotels right here, including 3 others within the Marriott brand.  If more odd decisions like this are implemented, it might be worth looking around.",
      "rate": 3.0,
      "tripDate": " March 2023"
    },
    {
      "title": "Truly Superb",
      "text": "Our family of four stayed here during a December trip to Toronto. Since I am a Marriott Platinum member, we were initially bummed that the lounge was closed for renovation. Then we were offered $30 worth of vouchers each morning and each evening to use in the sit down or carry out restaurant.We got two rooms that were side by side. We had a spectacular view of the bay, the Rogers Center and the aquarium.  The rooms we large and had a mini fridge and a safe. We could go to a number of places include Scotia Arena and Union Station without ever going outside.",
      "rate": 5.0,
      "tripDate": " December 2019"
    },
    {
      "title": "Poor value for Club Lounge offering",
      "text": "We stayed here on our last visit to Toronto before Marriott had taken over the chain, and were very impressed by the club rooms and lounge.  Having been very loyal to the Royal York, we didn’t regret our choice and decided to return on our visit this year for two nights, with a final night at the Royal York for old time’s sake.  Our club double double room was ready for us early, but it seemed strange to be asked if we wanted maid service.  Considering we were paying over $600 a night, maid service was not something we expected to be neglected.    Room was fine, with great views and a practical bathroom with separate bath and shower.  However where the hotel has gone downhill is with its club lounge offering.  Snacks during the day seemed to consist of pre packaged cookies and chocolate bar.  Gone are the complimentary drinks, but hey ho, that’s the same as most Canadian club lounges.  The selection in the evening was poor.  Three kinds of chips to dip in a strange thick, warm dip.  No other hot selection.  Some crudities, cold roasted vegetables, and some meat and cheese were the extent of the cold selection.  No comparison to our previous stay.   We thought we may have been unlucky, but the second night the choice was exactly the same.  We were told at check that the breakfast selection in the lounge was limited and that we could eat in the main restaurant instead.  When we did this the first morning we were told we could only have the buffet which did not even have fried or poached eggs.  Apart from some waffles, the selection was the same as in the lounge, so the second morning there didn’t seem any point in using the restaurant.  Swimming pool is nice with good views, but as last time was rather cold!  When we stayed the last night in the Royal York, on the Club floor and realised for the same price that we paid at the Delta we could have stayed there instead we wished we had done this.  There really was no comparison.",
      "rate": 3.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Poor",
      "text": "When you book a city centre hotel and pay city centre prices, you expect city centre experience. This hotel really lacks what is expected and needed for a hotel that attracts tourist who are transitioning through the city. When you arrive after a flight from the U.K. and you just want to have a beer and relax. We booked this hotel to experience the roof top bar, and the city lights of Toronto, but on arrival you are informed it closed at 10pm and even at 10.10pm, they make no exceptions!! Even the team who work there and tell you this is the rules are unsure of why. We are post covid, we are all hearing how hard it is to make money, yet the senior management team decide 10pm on a Saturday is time to close the bars??? I believe if you are charging city centre prices, you need to act and behave like a city centre hotel. We have visited Toronto numerous times, love the city and people. The guys informing us of the “rules” were very polite and understanding and this review is not aimed at them, just the short sighted managers who make these decisions. Well it’s back to the Fairmont for me, I pay top dollar but they give me what I need from a city centre hotel. We even had a local homeless guy doing press ups and dancing in the foyer for 20 mins, but not asked to leave or even noticed…..",
      "rate": 1.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Concert night out, awesome location",
      "text": "I picked this hotel for the closeness to Scotiabank Arena for a concert.  I have an injured hip and can't walk far, and the taxi/uber situation you have to get out and walk, so I was very pleased with the location, it was even closer than I thought.  Everything was top notch, the service, staff, room and location.  I read reviews and was told about the $100 incidental fee, I'm still waiting for them to remove it.  I booked the corner room with tub and we loved it!  Bathroom was roomy enough for two gals to dance and do makeup.  Everything clean. We will return to this hotel with my family. Very happy!",
      "rate": 5.0,
      "tripDate": " October 2021"
    },
    {
      "title": "Great location, bad sleep. ",
      "text": "When staying in Toronto, I don't need much in my hotel room other than a comfortable bed. While the mattresses at the Delta are very comfortable (Beautyrest recharge pillow top) the sheets are not the proper size. The result is you often wake up on a bunched up sheet pile, directly on the mattress cover (never washed) or under the uncovered duvet (also not washed). I had to get up in the middle of the night a few times to remake the bed. There is nothing else wrong with this hotel. The restaurant is your average downtown hotel dining experience. Decent but wildly overpriced. If you come to Toronto and want good meals, get out of the core to the west end, where you will find far better food for half the price. Other helpful info.Ask for a Lakeview room at check in. The view is excellent.This is as close as you can stay to Scotiabank  arena. It is also right beside Rogers Center. If you are in Toronto to do the touristy things (games, CN Tower, Ripley's) the location can't be beat.",
      "rate": 2.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Under staffed and expensive; is this the new normal?",
      "text": "Understaffed, long lineups and had to make reservations for everything from pools, dinner, breakfast, even getting our morning coffees took 40 minutes and everything cost extra. No thanks would prefer Airbnb with that type of service. Dinner was terrible and we ended up cancelling our breakfast reservation with an 1.5 hour wait.",
      "rate": 1.0,
      "tripDate": " March 2022"
    },
    {
      "title": "Great location",
      "text": "We stayed at this hotel for 2 nights and it’s in a wonderful location. It is literally right across the street from the CN tower and Ripley’s aquarium. The staff was very friendly and helpful even the valet staff was very helpful when I was self parking they directed me to the hotels parking in the garage. The room was nice and clean and modern and the shower had great pressure... better than any shower pressure in any other hotel I’ve ever stayed at.  A bit more money than I would normally spend but for being right in the city worth it.  Also right near the train station which makes it very easy to get around.",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Great location in the city",
      "text": "Our first visit to this hotel and we have to agree with other reviewers that this location is excellent. It made it very easy for us to visit the waterfront, Ripley's Aquarium, Rec Room, and just enjoy the vibe of the Blue Jays crowd. The staff was friendly and helpful, so check-in was easy. However, they only allow 1 hour per room per day at the pool but were completely booked. The concierge did get us in at night, so we were grateful. We would definitely recommend this hotel because of its location and staff.The lines for the elevator were crazy long at times because a sign stated only people from the same family or group could travel in the elevator together. But we (and other guests to us) began saying hop on if there was space in the elevator for the literally two-minute ride up. Our room was clean and comfortable, we had a fairly good night's sleep but there were some strange city noises and a yelling guest overnight that woke me up. We didn't try the onsite restaurant because I could never see the menu on their website and when we tried the QR code the hotel gave us, we got the room service menu (no PDF or PDF couldn't download) and got confused. So we got our breakfast at Aroma across the street, but just a warning that if you're looking for breakfast there's not a lot of options if you're early risers.I used the Bonvoy app to communicate with the hotel which was fast and convenient, even if my mobile key didn't show up until hours after check-in.",
      "rate": 4.0,
      "tripDate": " August 2021"
    },
    {
      "title": "The worst hotel in Down Town Toronto with poor service",
      "text": "We requested early check in as we came from Niagara on the lake. Checked in at 1.45 pm one person was on the check in desk after 8 minutes we were attended to. Got the passport details, credit card details , etc were told the room is not ready & that they will text me when it is. Came down at 2.50pm room wasn’t still not ready !!. We were asked to come back in 15 to 20minutes . By this time it was 3.0 pm & I asked her what is happening & told her I want my money back to check into Hilton & told her that I am not having it after being a member for over ten yrs. Then she produced a room for us on 26th floor. The hotel lift system operates as follows: three lifts from ground floor to 26th & another three from ground to 43rd floor. If you wish to come down from 43rd floor to 26th floor you either have to wait 20 minutes for a lift or take a lift to 27th floor and walk down the stairs as per the reception desk. The service from reception desk is nonexistent.The curtains covering two sides of the room requires ten minutes to draw & so in the bath & show room. The shower is hand held shower with poor pressure.All in all poor value at 900$ per night!!!.I will not recommend this poor value hotel at exorbitant  price.",
      "rate": 1.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Exelecnt value , great service and perfect location.",
      "text": "This was our first time staying at one of Marriott's Delta branded hotels and we were pleasantly surprised. Very similar to Marriott but its but with a more contemporary updated style and more business than leisure-oriented.We were fortunate enough to get upgraded to a corner Tower view room. The tower was smack center in our room and was even more phenomenal to look at at night. To the last was the lake and on both sides were many of the city's iconic skyscrapers.We requested housekeeping each day and they did a fantastic job of cleaning the room and replenishing the amenities which were of good quality. The soap is a little strange as it has ridges in it and it tends to fall apart after just one or two uses.The service at the front desk was fantastic, especially by Matt. The concierge, Russell, was extremely helpful and friendly. The pool was a very good size and very clean and the temperature was perfect. Covid protocols limited use to one family group at a time and you have to make reservations ahead of time. There was a wonderful hot tub next to the pool which we also enjoyed.We will definitely consider this property next time we visit Toronto.",
      "rate": 5.0,
      "tripDate": " November 2021"
    },
    {
      "title": "A little disappointing",
      "text": "My go to hotel before the pandemic for staycation when I had work being done at home or visitors staying there. I would always have a warm welcome email as titanium/platinum and told about benefits and room upgrade days before arriving. Two stays since the pandemic and standards have fallen for loyalty. No upgrade processed in advance or proactively offered, even when asked only to same room booked on a higher floor. Not asked at check in what I would like as a welcome gift (elite members can ask for $100USD automatic compensation for this oversight but I’m not that guest). Generally the pandemic and low occupancy should give a chance for more engagement with loyal members on discretionary personal stays, not less. Still a good spot, newer than other Marriotts in the city, breakfast always great from SoGo and service there was great and everyone was as always very pleasant. Note the doors to the airport train are locked. Such a fire hazard and almost made me miss train and plane. Nobody informed me about this inconvenience and no signage (such as in elevator) until you came up to the chained doors. There really is no reason for this at this point in the pandemic.",
      "rate": 4.0,
      "tripDate": " July 2021"
    },
    {
      "title": "Handy location and lovely quiet pool",
      "text": "Pool and hot tub were always nice and quiet. So that felt like a lovely treat during the day. Esp when it was very cold outside! Staff accommodating of our young child in an otherwise quite business-like hotel. Rooms are basic (felt like carpet needed replacing). Reception area is more upmarket and always beautifully decorated. More storage in the bedrooms would be needed for this to be enjoyable for a week or mores stay. You can walk indoors to Union station and on to Eaton Centre in the coldest days or to the water and Island-ferry in summer days so it’s a great all - rounder.",
      "rate": 4.0,
      "tripDate": " December 2019"
    },
    {
      "title": "Lovely visit to Toronto",
      "text": "We had a very pleasant and comfortable stay in this hotel. We stayed with 2 small kids. The rooms are very spacious. Staff are very nice from reception to room service. They always tried their best to meet our needs.The hotel is connected indoors from the Union station (direct to the airport) which makes it very convenient. The buffet breakfast at Soco has a good variety and spread and we really enjoyed it. Executive Lounge food and drinks were also good and the lovely lady working there was very helpful with my needs for my baby.We stayed here twice on our arrival and return to Toronto. First time we had a room with the view of Lake Ontario and on the next we had a view of the CN Tower. I would not stay anywhere else!",
      "rate": 5.0,
      "tripDate": " December 2019"
    },
    {
      "title": "Nice hotel close to Scotiabank and Union Station ",
      "text": "Stayed here since my husband and daughter were going to a concert at the Scotiabank Arena nearby. The lobby is modern and artsy, the room was clean and comfortable. I like the fact that the hotel room flooring was a hardwood look so it didn’t feel like you were walking on gross, old carpet. My husband said he prefers carpet since it’s softer on the foot though. Sliding bathroom door had frosted glass so it was a little annoying to see the light if someone uses the restroom in the middle of the night. Liked having a useable fridge instead of the mini bar type. Convenient to have the skywalk (3rd floor) to union station although it’s not a short walk as it zigzags out and then back in. A huge plus is the UP express train that takes you to and from the airport for a very reasonable price of about $25 for a family of up to five! Enjoyed a very tasty take out meal from SOCO to go on our last night there.",
      "rate": 4.0,
      "tripDate": " July 2023"
    },
    {
      "title": "Disappointing at best",
      "text": "I am very mixed about this hotel, it certainly should have received a 5 but there were so many issues I feel a 3 is high. Firstly we arrived at 3 (assigned check in time) left our truck with valet ($63) no issues parking our Silverado in the garage. This all went well. At check in there was a long line we finally got to us and there were no rooms available so they took our cell number to text when room was ready. While we waited we explored outside and sat in lobby. The lobby has flies everywhere. Staff were offering drink samples and bottles of water at the check in. 330 came and I saw many people checking in and walking straight to their rooms so I got back in the long line to be told still no rooms available. A few minutes late I got the text and got back in the line for the 3rd time. Many people were confused by the elevators as there are 2 sides and they only serve the lower floors on one side and higher floors on other many people lost. At our room we ordered room service from the QR code as we were running late for a concert. The order was incorrect messed up our burger toppings no big deal we ate it. When it came time to go to the concert (5 min walk on skywalk) we had no idea how to get to the skywalk so I tried to call the front desk, our phone buttons did not work Front desk, house keeping etc all did nothing when pushed, zero did nothing. So we walked outside. The hotel lacks information no signs for what floor the pool is on etc. ice on every other floor. The pool main fob access was broken you had to enter through the change rooms, our bathroom fan did not work, the phone did not work, there were no extra blankets and could not call house keeping, there were only 3 towels for 3 people. The pool was also very icky the floor was soaked with stagnant water full of hair, lint etc no way I was walking in it, there should be some one with a squeegee pushing it to the drains.  For convenience I give the hotel a 5 and would stay again for this reason but not for anything else.",
      "rate": 3.0,
      "tripDate": " September 2023"
    },
    {
      "title": "Dirty, uncomfortable, $90 parking ",
      "text": "I have been looking forward to staying at the Delta for a while and I have been so disappointed.Our bathroom was fairly dirty. Scum on the countertop. Carpet has a few stains. Bathroom door handle was gross.Aside from the cleanliness, the bed is not comfortable. No fitted sheet, so you're sleeping on a crumpled up sheet and lots of exposed mattress half way through the night , which is very gross in a hotel.Most obnoxious of all was the parking situation. Chose to self park as we were only staying for a night. The lot in the hotel is a public lot, with no in and out privelages, which was not mentioned during check in. We went out for dinner and were charged $45 to leave for dinner, and another $45 when we checked out the next morning.I believe valet is $55 and you would most certainly have in and out.On the bright side, if you are in town for a game at either Scotia or sky dome, at some point in the future, the location is pretty unbeatable.",
      "rate": 2.0,
      "tripDate": " September 2020"
    },
    {
      "title": "No recognition of Elite status",
      "text": "Hall of hotel is beautiful and that's about it.As Marriott Elite member (platinum) we always enjoy our stays at Marriott brand hotels but not this time. We tried several times to get an upgrade to a suite and for the first time it did not happen. The so call upgrade was a standard room with a view of the harbor that we couldn't care less. The swimming pool has nothing special and the jacuzzi is not in service. The worst is that we have to wait for everything. Wait lines for the elevator and then for the restaurant and again for the front desk… every time, all the time! Breakfast at the SOCO Kitchen is Ok but repetitive if you stay more than 3 nights and the service at this place is terribly slow and sometimes terrible. You have to reserve a spot for the pool and the restaurant and you better be fast because everything goes very fast.Last thing the room was not clean enough (full of dust) and even after requesting a cleaning, the lamp and everything on the night table was still disgusting.Anyway, we had extra nights to stay in Toronto but we choose to spend our money somewhere else where our loyalty to the Marriott brand was well recognized and appreciated (we got a huge and beautiful suite in the other hotel we went). Never again Delta Toronto and I don’t recommend especially during Covid period.",
      "rate": 2.0,
      "tripDate": " August 2021"
    }
  ]
}