{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Delta Hotels by Marriott Toronto East",
    "url": "/Hotel_Review-g155019-d186896-Reviews-Delta_Hotels_by_Marriott_Toronto_East-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.5",
      "reviewCount": 980
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "2035 Kennedy Rd",
      "addressLocality": "Toronto",
      "postalCode": "M1T 3G2",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2c/15/3c/70/tw-s-bar.jpg?w=500&h=-1&s=1"
  },
  "description": null,
  "featues": [
    "Paid private parking on-site",
    "Free High Speed Internet (WiFi)",
    "Fitness Center with Gym / Workout Room",
    "Pool",
    "Bar / lounge",
    "Game room",
    "Water park",
    "Children Activities (Kid / Family Friendly)",
    "Parking garage",
    "Wifi",
    "Sauna",
    "Hot tub",
    "Pool / beach towels",
    "Indoor pool",
    "Heated pool",
    "Restaurant",
    "Breakfast buffet",
    "Special diet menus",
    "Vending machine",
    "Table tennis",
    "Pets Allowed ( Dog / Pet Friendly )",
    "Car hire",
    "Business Center with Internet Access",
    "Conference facilities",
    "Banquet room",
    "Meeting rooms",
    "Spa",
    "Massage",
    "Solarium",
    "Baggage storage",
    "Concierge",
    "Currency exchange",
    "Newspaper",
    "Non-smoking hotel",
    "Shops",
    "Sun terrace",
    "ATM on site",
    "24-hour front desk",
    "Express check-in / check-out",
    "Dry cleaning",
    "Laundry service",
    "Soundproof rooms",
    "Air conditioning",
    "Housekeeping",
    "Room service",
    "Safe",
    "Flatscreen TV",
    "Non-smoking rooms",
    "Suites",
    "Family rooms"
  ],
  "reviews": [
    {
      "title": "Hockey Tournament",
      "text": "This will be our 3rd time our team has visited this hotel. The staff are very friendly, the rooms, hallways, etc are a little worn and dated. Some fix ups are definatley needed. The games room downstairs needs some work as well as the atrium. Main reason for our trips have been hockey tournaments so the main draw is the pool area for the kids which is great.",
      "rate": 3.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Good & Bad",
      "text": "Stayed for one night on 18/10 and have mixed feelings about the place.Location is excellent, just off the freeway but, given the suburban location, parking should be free to residents.  Had two rooms on second floor with internal windows overlooking the swimming pool atrium.  Both bedroom carpets were badly stained and our room was not as clean as I would have liked.  Bedrooms were slightly small but beds were comfortable and ensuite was well presented.  Bar grille had very poor table service.  Starters were delivered ten minutes apart and requests for drinks from the waitress, twice, did not arrive until we went to the bar ourselves.Breakfast was alright but the scrambled egg was overcooked.On the plus side the staff were very friendly and our children liked the pool although I found the water cold.  Whirlpool tub was ineffective.",
      "rate": 3.0,
      "tripDate": " October 2006"
    },
    {
      "title": "Perfect for visiting Scarborough",
      "text": "We stayed at the Delta on about a dozen consecutive weekends during the Winter of 2003 while visiting a sick relative. We chose the Delta initially because of its proximity to Hwy 401 and because it was situated only a short drive from the hospital (Scarborough General) where the relative was admitted. We've subsequently stayed there on several other visits to Toronto. I grew up in Scarborough, where the Delta is located, know the area quite well, and have relatives there, so the location is pretty convenient for my needs. Rather than driving downtown, we parked at the Kennedy subway station, which is just a mile or two south of the Delta, and we can be at Yonge and Bloor in less than 20 minutes. For many of the visits that winter our daughter came with us, so we selected a \"premier\" room, which had a king-size bed and a pull-out bed in a small sofa located near a bay window. We stayed at the Delta so often, in fact, that we got to know which room had the most comfortable beds and would request that room specifically (the bed in that room -- sorry, I forget the room number -- was very comfortable indeed). During that winter, a SARS outbreak in Toronto frightened away many travellers, so we often had the feeling we were the only guests (though I'm sure there were others). Occasionally there were the inevitable noisy hockey teams, but for most part the hotel was almost eerily quiet, which was exactly what we were looking for. The lobby of the hotel is quite attractive, and has some interesting features which result from the building of additions. As you walk away from the front desk toward the elevators for the tower, you cross a bridge over a large indoor swimming pool. Overlooking the pool are a number of balconies of rooms in what was probably the outside wall of the original building. The \"premier\" rooms are comfortably sized; as I mentioned, they have a small sitting area near a bay window with a couch. Furnishings were always in good condition with little sign of wear. Bathrooms were well equipped with shampoo, conditioner, moisturizer, mouthwash, and a small sponge in a resealable plastic case for cleaning shoes. The TV in the room is large and mounted on a pull-out rack so it can be viewed from just about any location in the room. Several telephones, including a cordless phone, are located in the room, and there are data ports accessible through a connection at the desk. The TV had a wireless keyboard and what I think was a game device, though I never used either. On one of our stays, we were upgraded to the \"signature\" floor. Rooms on this floor were a little smaller than the premier rooms (they had no sitting area), but they did have a few perks that were enjoyable: free bottled water; turn-down service with chocolates on the pillow and a little card with the next day's weather forecast; bathrobes; a CD player (CDs could be borrowed from the concierge on the floor), and a free hot breakfast (there were probably other perks which I've forgotten). The Delta has three restaurants, all of which we tried at one time or another. There's a sports bar which serves competent but unexceptional sandwiches and pub food. A slightly more upscale and pricey restaurant featuring a buffet and menu is located next to the sports bar. The food was reasonably good there, but better food at lower prices is available in one of the many restaurants in the area. The best restaurant is Sagano's, a Japanese restaurant located on the top floor of the tower. Sagano's is fairly expensive but worthwhile if you're looking for a special, slightly exotic treat and aren't frightened by chopsticks. If you're looking for something to do during your stay, there's a multiplex movie theater in a mall on the other side of Hwy 401 (the 401 is about 20 lanes wide there, so though the theater is technically \"across the street,\" it would be quite a walk on foot). For power shopping, the Scarborough Town Centre is a five minute drive away. The Metro Toronto Zoo is about 25 minutes away, and the subway station nearby as I already mentioned connects you to the rest of the city (Toronto has an excellent public transit system; I didn't learn to drive until I moved away because it seemed so unnecessary). The relative we were visiting passed away that spring, and I have many bittersweet memories of times spent late at night in our room at the Delta, coming to terms with her condition. The Delta was the perfect place to stay at such a difficult time in our lives.",
      "rate": 4.0,
      "tripDate": " March 2003"
    },
    {
      "title": "Horrible customer service!!",
      "text": "Omg! Would not recommend! The door lock broke while we were in the room! We were trapped inside our room for at least 30 minutes before anyone came. Thankfully we were able get out through the connecting room, which was so embarrassing! The family beside was were confused and also concerned for the safety of their children! The night manager was \"kind enough\" to \"upgrade\" our room to an elete room and set the expectations that our room and parking would be complimentary. This however was not the case! When checking out, the associate at the time Amber was rude, sarcastic and continued to roll her eyes at my family and my very angry partner. She reluctantly provided for us the managers card and contact information. The front desk managerAroon Gurung was not any better! Accusing my significant other of \"yelling, swearing and thretneing\" Amber which was not the case at all! All in all I did feel as though I was valued as a customer, would not recommend!",
      "rate": 1.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Not Anymore",
      "text": "I stayed here many times prior to Covid and at the time I was quite satisfied.  The location was very convenient for me and I \"thought\" the staff was nice. Id go there and spend christmas.   Since Covid, Not allowed to book any rooms until JUNE 2021 (til they change it again) all because theyd rather \"street people\" to stay there over paying guests.   So much damage was done to the hotel I once loved. street people bring bed bugs etc but delta prefers them.   Sadly I lost all respect for Delta.   I am happy however I found somewhere although its further, it is better, cleaner, quieter and alot cheaper than Delta.",
      "rate": 1.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Homeless shelter",
      "text": "Careful about staying at this hotel. They are currently housing the homeless and majority of their space is used for the shelter. Since the Delta has been turned into a shelter there's been increased garbage to the area, loitering, and safety issues.",
      "rate": 1.0,
      "tripDate": " August 2020"
    },
    {
      "title": "Deceitful ",
      "text": "Learned at check-in that they were housing the homeless. While I admire the initiative, I strongly believe that they should make this clear to guests *before* they arrive, so they can assess the risk and make other arrangements. Many people around the lobby, common areas and elevators - no masks, no social distancing and no evidence of sanitizing. The homeless people staying here and the paying guests deserve better.",
      "rate": 1.0,
      "tripDate": " July 2020"
    },
    {
      "title": "Good Hotel",
      "text": "Very nice hotel located very close to the highway, stayed in this hotel part of our Canada tour for 2 nights except that it is slightly located outside the city. Hotel was very good and comfortable.  Very nice breakfast and very comfortable rooms.",
      "rate": 5.0,
      "tripDate": " July 2019"
    },
    {
      "title": "Excellent Value",
      "text": "Excellent value! The hotel is very clean and the staff was very polite and helpful.  Our room was bright and clean with comfortable beds. The breakfast buffet was fantastic. We all really enjoyed the pool and our children loved pool slide.",
      "rate": 5.0,
      "tripDate": " March 2012"
    },
    {
      "title": "Watch for bed bugs!",
      "text": "Great service, salt water pool, etc... but we got bed bug bites!  It is a shame because otherwise it was very nice.  We got there late (10pm) and had great food and service, and had fun at the pool the next morning.",
      "rate": 1.0,
      "tripDate": " May 2014"
    },
    {
      "title": "Not what I had hoped for!!!",
      "text": "In a recent 2 night stay at the hotel, we were woken up by loud construction in the room above ours, and during our morning showers the water was abruptly shut off and I was stuck with shampoo still in my hair, while they worked on fixing the problem (approx. 90 mins).  We chose the Delta Toronto East to take a break from our busy and hectic schedules, but this stay just added to our stress.",
      "rate": 2.0,
      "tripDate": " July 2013"
    },
    {
      "title": "disappointing",
      "text": "I paid for what is called the Premier King suite.  The bed was not good and had a low spot in the middle that made us think we were sleeping in a tent, on a hill.  The hallway smelled strongly of smoke and there were late night revellers shouting at the top of their lungs at 2:00am.  I needed a nap the next day.  I think if a hotel is advertising comfortable beds, they should at least try them out periodically.  The sink had hair in it and the bathroom was quite dated. This room cost me $ 170.00 for one night and should have been better.    The tv movie rentals are a whopping $ 16.99 for what they say are \"still in theatres\". Can you imagine renting a movie for $ 16.99 ?  Most of them are available on iTunes currently.  The TV reception was snowy and I can't believe they don't have HD channels. I've stayed here before and found it pretty good but this experience had way too many negatives for me to consider going back.  The location is convenient but that's where it ends for me.",
      "rate": 2.0,
      "tripDate": " May 2013"
    },
    {
      "title": "Surprise $11 parking fee",
      "text": "We stayed at the Delta East for two nights and overall it was an enjoyable stay.  The $11.25 per night parking fee was an unpleasant surprise.  Everything in this hotel is pricey.  Beer at the lobby bar was $8+.  We never ate at the restaurants due to the price but there are several restaurants in the area.The rooms were clean and well furnished.  We had two queen sized beds with a full desk.  No fridge.  Bathroom is large. Kids loved the pool and water slide.  The hot tub is hot but some times there were  too many kids in it.The staff were friendly and competent.",
      "rate": 2.0,
      "tripDate": " August 2007"
    },
    {
      "title": "Stung by the parking scam",
      "text": "The Delta East is a fine hotel. It is a little tired around the edge and not nearly as shiney as it was in the past.I was surprised by the $9.95 parking charge (plus taxes). They don't tell you anything about it when you make the reservation. I've stayed at the Delta in Mississauga where the parking is free. The place is right in the suburbs - so they don't have any excuse for stinging you - except for pure greed. After the fact I looked at the website to see if they mention it anywhere - after quite a search I found a reference to it. Only it was listed as $8.65 - I guess they figured they could squeeze another $1.30 out of thier guests (saps?) Looks like the don't get much repeat  business.",
      "rate": 3.0,
      "tripDate": " July 2006"
    },
    {
      "title": "A warm hotel to stay.",
      "text": "Our group stayed at Delta Toronto East in Jun 2005. This hotel has one of its kind character: to get to our rooms we have to walk through an overpass above an amusement park type swimming pool. The hotel staff is very friendly and the gift shop that also sells ice cream open until 11pm.  The \"premium\" room on the tower has a very warm setting, with a very large and well designed bathroom.Services is excellent in this hotel and the bar and restaurants made people feel very relaxing.  There's also a game room for kids to play video games, a spa for relaxing, an indoor handball court, and a gym.. Parking is a bit expensive given all the free spaces around the property.",
      "rate": 4.0,
      "tripDate": " June 2005"
    },
    {
      "title": "A great hotel",
      "text": "One of my all time favorites. Excellent in everything, and the best part is the Japanese restaurant upstairs. Great food and service and view to highway below, which is quite nice in the middle of a snow storm. The only downside is location, downtown Toronto is at least 15 minutes away by car.",
      "rate": 5.0,
      "tripDate": null
    },
    {
      "title": "An old property that should not have a 4 star review or carry Delta/Marriott brand",
      "text": "We booked to stay one night - the front desk individual was not co-operative.  Asked for a room with a refrigerator - said they did not have - asked for a room on a higher floor - did not have.  Went back- then the second person managed to get us a room with a refrigerator but at the pool and very noisy.  Old rooms - need mega refurbishing - and cleanliness.  The coffee and the creamer in the room is as old as the hotel, I think. Big health hazard.  Somebody needs to seriously fix this.",
      "rate": 1.0,
      "tripDate": " July 2019"
    },
    {
      "title": "Weathered and old - they need renovations! Slow Wi-fi!",
      "text": "I stay at the Delta brand of hotels a lot and in recently years they've updated a lot of their properties and I now have a higher standard for their brand. This property has NOT been renovated and it shows. The rooms look very run down and the bathtub was absolutely disgusting with rust stains and an old stained shower curtain. The Wi-fi was SO slow and I had to work from the hotel room, it was impossible for me to do basic tasks such as email. I checked out early and went to a different hotel the next day.",
      "rate": 2.0,
      "tripDate": " January 2019"
    },
    {
      "title": "Quick Family Visit to Toronto",
      "text": "Our group of three adults stayed here for a family trip on a Monday, sharing a room with two beds. For the price and our needs the accommodations were ideal. The hotel was easily accessible by bus and we had only very short wait times on the occasions when we called an Uber. Our room was clean, comfortable, and modestly-appointed. We were disappointed that the room had twin beds and not queen-sized beds. The pool and slides were impressive elaborate; however, it looked a bit dingy. The staff were very friendly and helpful. The Whiteside restaurant on-site was mediocre, but had a good breakfast buffet, if you have a good appetite (however, the potatoes were tasteless and dry). Not bad if you need a convenient, modest place to stay.",
      "rate": 3.0,
      "tripDate": " September 2018"
    },
    {
      "title": "Stay somewhere else - awful service",
      "text": "Hotel placed a hold for two nights on my credit card immediately on check in. Two days later we checked out and they again charged for the whole stay and never reversed the hold. Three weeks later both charges are still showing. I have spoken to three different ‘managers’ at the hotel. The first told me it was my problem not theirs. The second seemed quite helpful but now is not responding to emails. The third refused to give me his name or provide anything in writing, but assured me credit would be applied by today (still no credit). They are quick enough to charge, there is no reason it should take 20+ days to correct their error and issue credit. The last guy told me I wasn’t the only one in this position - not sure if that was supposed to make me feel better?On top of that the front desk staff had no idea what they were doing, the bathrooms were in terrible condition and the shower leaked all night, and housekeeping did not restock anything on second day of the stay. Food in the sushi restaurant was bad - all rice, even the hostess apologized for the quality. So bad if was almost funny except it was so expensive. Similarly good in main restaurant was lukewarm, below average quality and selection and way overpriced. Three weeks later and still no sign of my sons orange juice either....Way overpriced for the offering combined with complete lack of customer focus - stay somewhere, anywhere else.",
      "rate": 1.0,
      "tripDate": " July 2018"
    },
    {
      "title": "Worst hotel experience of MY LIFE!  Never staying here again!",
      "text": "Upon check-in we were greeted by Chester who at first impression, appears to be a friendly employee concerned about the hotel's guests.  Our first night we decided to eat in the TW Grille and were approached by an unfriendly waitress named Aimee who acted the entire time as if we were an inconvenience.  She never smiled once, disappeared once our food was delivered and when we finally asked the bartender for the bill and some to-go containers, Aimee returned appearing annoyed.  My girlfriend and I decided to check our bank statements for our debit cards the following morning.  We noticed her's was charged $20 over the bill for dinner - which the manager explained happens with American cards, he's seen it 100's of times - well if that's the case, it's something that they should inform their American guests about.  I proceeded to check my account where I noticed a charge of $708 and some change had been put on my card.  Considering my daily rate for the room was $175 I was baffled and livid.  I called the front desk and Chester said he would look into the situations.  He then told me that they place a minimum $150 hold on your card per night which is policy - a policy that I was never informed of during the reservation period, check-in or my stay - until I found this outrageous charge.  It was not an 'authorization' as he described, because my account was CHARGED $708 and it was DEDUCTED from my bank account.  I checked out THREE DAYS AGO and the money is STILL NOT IN MY ACCOUNT even though I was assured by Chester and THE MANAGER the money is back in your account as soon as you check out.  Apparently my concern for the fact that I would've had major overdraft fees - as I was using this account for the room and spending money - was not a concern and they thought that a disingenuous apology was all that the situation solicited.  This took up 3-4 hours of my day trying to remedy the situation, tied up a great deal of funds from my bank account, cost me roaming charges on my cell phone while trying to remedy the situation with my bank\\family bank home - something that they couldn't have cared less about.  None of the employees were helpful during our stay.  The bell boy (an African American gentleman) and the room service staff were the only helpful people we encountered.  Beware - there are policies that they will not inform you of - like placing a $300 charge on your card if you're staying two nights - because they don't trust their guests to charge meals to the room and pay them upon check-out.  I have NEVER stayed at a hotel - American or Canadian - where my card was charged BEFORE check-out and where a $150\\night charge was placed on my card WITHOUT MY KNOWLEDGE.  I have also never had such an unsatisfactory experience and had nothing done to rectify the situation, except for an insincere apology.  I will never stay here again.  I will never recommend this hotel to family and friends.  This was THE worst experience I've had staying in a hotel.  We are NOT people who complain  - my girlfriend has been a waitress for 10 years  - we are THE easiest customers to wait on and never ask for anything even when we have an unsatisfactory experience however their lack of concern and lack of emphasis on positive customer experiences has motivated me to finally \"be that guy\" and write a negative experience.  Hopefully you don't deal with the same ordeal that we did.",
      "rate": 1.0,
      "tripDate": " September 2012"
    },
    {
      "title": "The Best of Both Worlds",
      "text": "This is a great hotel.On one hand, it caters to families.  There is a huge swimming pool along with workout room and arcade.  Squash courts.  There is a pub right next to a separate restaurant.   It is big and airy down near the lobby, with an overlook above the pool, which has a huge slide.  Kids will love this place, but beware it can be noisy like you wouldn't believe (especially during summer holidays or on weekends).  Lots of unsupervised kids running around.This is where the CLUB FLOOR on the 14th floor comes in extremely handy.  Private check in and private lounge.  Gorgeous rooms.  You pay for it, but it's heavenly.  Top service and usually very quiet.  Continental breakfast and evening snacks.  Honour bar.  And you can take the staircase up to the best Japanese restaurant in the city of Toronto - Sagano.  I've celebrated my wife's birthday there twice.  Unparalleled service.  If you want a nice romantic getaway, book the Club Floor and eat at Sagano.  The Hotel itself is in a great location.  It's not near the airport, but you are very close to Toronto (the hotel is not even a  block from the Kennedy exit at the 401).  Movie theatre, restaurants and book store just a few blocks away.  I will be staying there again.",
      "rate": 5.0,
      "tripDate": " January 2005"
    },
    {
      "title": "TERRIBLE!",
      "text": "I normally do not write reviews but my stay at this hotel was just terrible. First and foremost be forwarded that this hotel is located out in the middle of nowhere so you have to do a good bit of traveling to get downtown or to any of the attractions that Toronto has to offer. By the time you pay for the bus trips or taxis or trains, etc. you're better off spending a little more to stay closer downtown (where there is a lot more in the way of transportation to attractions outside of the city). Three out of the five days during my stay the cleaning staff replaced my body towels with bathmats/foot towels and only two of the five days I was given coffee, clean cups and complimentary water.  Everything was so inconsistent. My parents stayed in the next room over and always had fresh towels, coffee and water so I guess the room service is a crap shoot. What really tipped me over the edge was when the concierge ripped my entire family off on a day excursion, over-charging us as verified by the second concierge we spoke with on the following day. When I expressed my overall dissatisfaction (being overcharged and not getting half of what the concierge communicated to us), the hotel contacted the booking agent who promised some sort of compensation. The concierge as well as the booking agent promised to follow up by phone or email . However, we have yet to hear anything from either parties. The hotel concierge should be well informed on the amenities and excursions that are advertised by their hotel. It is, after all, their job to handle the bookings and assist guests in making their stay an enjoyable one. This particular incident just felt like a total scam from start to finish. Because the first concierge we spoke with was uninformed and simply did not feel like explaining the various options available to us, we suffered on all ends and no one is willing to accept responsibility or even offer a simple apology. Do yourselves a favor, if this is a vacation you are planning to Canada, AVOID this hotel and their staff at all costs.",
      "rate": 1.0,
      "tripDate": " July 2017"
    },
    {
      "title": "Hockey Team stay",
      "text": "Our team stayed here for a Pickering hockey tournament.  My son is 10.  The hotel was full of hockey families during the last weekend of March.  Here are the facts with less opinion.  Check-in ***** Service was excellent and attentive. The reservation was held (as one would hope for a 7pm arrival) and the transaction was problem free.    Parking ***** No issues with lots of spacesRoom 116 *** Average, Close to the pool and lobby, Clean, good Wi-Fi signal, good air quality, comfy bed, and problem free.Pool ***** Indoor pool with the water slide (Slide closes at 9pm to the kids disapproval) is what makes this place fantastic for Hockey teams.  This area is a fantastic social point and the staff are extremely accommodating and to the hockey parents.  Overall look and feel *** The layout is really cool, the hotel is getting on in years but is well maintained.  It’s not spotless yet it’s not filthy. Value**** It’s slightly above average for Toronto provided you intend on using the poolI would take my family back here in a heartbeat.  I would also recommend to those looking for a hotel outside of the GTA core.  Thumbs up please if you find my review format helpful. Thanks",
      "rate": 4.0,
      "tripDate": " March 2017"
    },
    {
      "title": "Disgusting!",
      "text": "This hotel is a disgrace for any business traveller.  It's worn out, shabby and filthy.  One of the elevators has been out of service for three weeks, resulting in long line-ups.  I normally stay on the 14th floor being a top tier Marriott member.  The bathrooms are dirty, with paint peeling off the ceiling.  Windows desperately need cleaning.  Carpets are worn, towels are thread-bare.  Mirrors are dirty.  Counters are stained and televisions are old - no HD here.  It's hard to believe this is a Marriott brand.  The only reason I stayed here is the location is close to our Toronto office, however most of our staff have stopped using this hotel for the reasons stated.  I will not return either.",
      "rate": 1.0,
      "tripDate": " August 2016"
    },
    {
      "title": "Not as good as we expected ",
      "text": "My family and I stayed for 2 nights in Toronto. As we got to our room, we were very surprised. The beds were narrow and small, certainly not big enough for our two boys. Thus, we had to take an extra folding bed, which costed us extra of 25$ per day. The Wi-Fi in the room was poor and kept turning off. The ceiling of the bathroom was full of cracks and mold stains. Unfortunately, our room was located above the pool, like many other rooms, so every day the sound of the children woke us up and kept us awake at night. Not the experience we expected from a 4 star hotel.",
      "rate": 2.0,
      "tripDate": " August 2015"
    },
    {
      "title": "More than Three Weeks stay....kind of like it... lets see???",
      "text": "We came to this hotel June 23, 2015 and staying in two rooms. So far we like it. I been in Sheraton Hotels (Star Wood) in most places.Good about this Hotel1. Very Friendly2. We asked for Microwave and Fridge for both rooms because of the long stay, we       got it for no charge. (Took a little time - they are busy with the PAN AM)3.  Room service is very Good. Kind of like the Chinese lady - forget her name. She is      doing very good job. She must get reward.(7th Floor)4. Very Nice Pool - I give 5 starBad:1. Need more friendly service like long time stay customers like free upgrade room.2. Expect more get lessOverall, I love this hotel. If any bad things happen to us during the stay we will update.Room Service Chinese Lady, Chris and William -  Very Good Service. Keep up the good Job.Gus",
      "rate": 4.0,
      "tripDate": " June 2015"
    },
    {
      "title": "Nice ambiance BUT a lot of fees!!",
      "text": "This hotel is good and has a very good pool, has a great restaurants. Service is good and employees are courteous. It was a good stay...please go for breakfast early as it becomes crowded by 9 a.m. It is also centrally located in Toronto and has a bus station close-by. Its on a busy street called Kennedy st. My only complaint is this hotel has alot of other fees as stated below:Breakfast fee 16.95Self parking fee 12/nightValet parking fees18/nightPet fee-35per petLate check out fee -60Deposit-75 per dayRefrigerator fee- 15/nightIn room microwave fee-15/nightRoll-away bed fee-25/nightYou don't see the fee till you make your reservation which is annoying. If you have a place in the area without the breakfast fee please put it out there !!! Enjoy your stay.",
      "rate": 4.0,
      "tripDate": " March 2015"
    },
    {
      "title": "Sasha at front desk, made the experience...",
      "text": "I am currently sitting in the room I am about to review, and brace yourselves for some praise...I showed up here, without a reservation, looking for a room for the night. I had come from Ottawa to spend the night and I had looked for a hotel the day before, but couldn't find any deals at all. I was doing some work literally 5 minutes drive away, and as I have stayed here in the past, I decided to give it a try. I walked in and was greeted by a big genuine smile, not one of those phony ones you normally see. I immediately felt like someone actually cared about helping me. I told her that I didn't have a reservation, but was hoping for a room. Sasha told me that they were pretty full, but that she could find me a room with 2 double beds. No big deal, its just me and I don't care about that. As I cheerfully agreed, she seemed to feed off of my response and said that if I gave her a minute, she would she if she could find me a King bed. She had quoted me a price for the room, which I agreed to, and then came back and told me she did find me a King Bed, and that it was going to be cheaper. I was all smiles. I agreed, and asked about the parking charge. She told me that it was going to be included. Holy smokes! Sign me up immediately...This initial interaction is what makes me be a return customer. I would honestly say that Sasha gave me one of the best customer service experiences I have ever had in my life. If only customer service staff realised, that all a customers want is to feel like they matter a little, it would change the way people are treated. Her kindness and sincerity was appreciated beyond words and I will return to this hotel as a result. A huge \"thank you\"  to this fantastic lady..As for the rest of the hotel...great all around. Room is awesome, great bed and TV. Restaurant has great food, staff are very friendly (I locked my keys in the room, and also needed a corkscrew: everyone very helpful).Thank you so much Sasha, and I truly hope that the Delta appreciates you. Great experience!!",
      "rate": 5.0,
      "tripDate": " September 2013"
    },
    {
      "title": "Always have issues w/ bill...",
      "text": "I regularly stay at this hotel (for the past 4 years) and with every visit I have issues with my bill.  I always have charges which I never incurred--something is wrong with this hotel.  I never had this issue until the hotel was taken over by it's new owners.  It's very frustrating that everytime I check out I need to explain the multiple charges which are not mine.",
      "rate": 1.0,
      "tripDate": " August 2013"
    },
    {
      "title": "Bloody Dust Mites! Haul Luggage Up A Flight of Stairs! Ripped Wall Paper!",
      "text": "I am usually a Hilton fan and this time at the Delta Toronto East, the stay was kindly paid by my in-laws as we flew up to visit them for Christmas so they could see their grandchildren. As I laid down at night to watch television after taking a shower, I noticed my legs were bleeding as there were bite marks on them. I was appalled and horrified. Since the room was paid for, I did not want to cause a hassle to the in-laws so I just let it go. However, I knew I had to say something so when I did, the manager said he would only shave off 15 dollars from three days and waive parking. The parking lot was the worst in its condition as the front lot of the hotel was closed due to construction. There was no elevator access at the garage parking where we were forced to park only at that location and therefore had to haul the suitcases up one long flight of stairs to the lobby. All guests should thus have their parking fees waived because of the terrible inconvenience especially when they have to haul up their young children as well. The manager is dim-witted to say that he would waive my parking fee to compensate for the dust mites. He dared to add insult by saying that he would deduct the rate of stay for three days when he only took off 15 dollars total. The manager responded to the dust mites by saying he would have a talk with the housekeepers. That's it? That was the best answer! He might as well give me a free hotel pen while he was at it which of course he did not. My wife took the pen for herself from the room. The room was such in awful condition with ripped wall papers throughout the room and an eroded old pipe in the closet. I think the situation of having dust mites is bloody serious and legal action should be advised. Please do stand up for yourself and your children if you have your legs being gnawed at by the microscopic beasts.",
      "rate": 1.0,
      "tripDate": " December 2017"
    },
    {
      "title": "Broken Promises & Poor Maintenance = Disappointment",
      "text": "We specifically booked a night (April 25th) at the Delta East in Toronto because it advertised (web site, brochures, etc.) that it had a pool with a waterslide. A functional waterslide. You know, with water in it that you slide down into the pool? Ya, one of those.It was our last night of a week’s vacation, and with our home bathroom under renovation (no functional bathtub, etc.), I had promised my wife (and myself) a little treat of this nature before heading back to reality.Despite being assured that the waterslide was open / working prior to making a reservation AND being told it was open by Front Desk staff on-site before checking in, we find only minutes later that big blue tubular structure might as well be a movie prop. THE WATERSLIDE IS CLOSED. This was early in the evening (before 7pm), during the times it was supposed to be open. No explanation, just closed off and a big red cone from a construction company parked in the chute. (We would NOT have stayed here if we had known this ahead of time.)Apparently the waterslide has been inoperative off-and-on for years. Frequently BROKEN. Out of service. Not watery. Not slidey.So my first impression is immediately not a good one.The hours the waterslide is supposed to be open seem to vary widely depending on conflicting signage, information booklets, the Delta website, etc. I had never stayed at this hotel before, but over the years having attending various functions there and having picked up others from out of town who were staying there, it strikes me that I had NEVER actually seen the waterslide operational.Also, as per the hotel's own published info booklet in the room, the pool area was supposed to be adults-only after 10pm. But, no, this has changed. Now kids of all ages are allowed late at night. It was like demonic munchkin summer-camp. Shrieking, wet, hyper-active kids everywhere. Great for families who like to let their offspring run amok.So much for the hoped for fun-romantic weekend getaway. So much for peace and quiet. The open-concept lobby / restaurant / pool / gym areas mean that the noise is everywhere.I actually like children. Really, I do. And I appreciate they have lots of energy to burn and they were having a blast. But after several hours driving in from New York, hordes of screaming kids leaping into the pool, running helter-skelter, tossing pool noodles and inflatable balls around, was not what I was looking for. Nor did I appreciate diaper-clad infants in the pool and in the (signed \"no children allowed\") hot tub. Aside from the safety issue for them, the idea of urine and feces floating around with us was less than appealing.Not that the hot tub was actually hot. Lukewarm at best. None of the jets were working properly either. Well, to be fair, that is because some were missing. Just big holes in sides of 10-person hot tub where they should have been. Other guests complained about the lackluster temperature, the lack of jets. One of the nozzles actually broke off in another guest's hand when she had tried to get it working. She and her beau left the pool area in disgust.The pool area was allegedly part of a major and expensive recent renovation. Um ... I think they should demand a refund from the contractor. Dunno what they spent it on.If the peeling wallpaper (a bad idea in any bathroom) in our hotel room’s bathroom, the mould / mildew / rust and water damage are any indication (I took photos), there are a number of maintenance issues which should be addressed but are obviously being ignored by the hotel staff / management.I wish I could get a refund for this stay.Our room in the Tower was quite nice (aside from the water-damaged bathroom). Clean. Decently furnished. Reasonably quiet. Comfortable bed. I did notice the lack of a refrigerator / microwave, although there was a single-cup coffee-maker and a hairdryer. Flat screen TV with variety of programming available. As Delta Elite members we had free WiFi but I think they now offer that to everyone. I got free parking but somebody else told me they were charged $18 a day.The view of Highway 401 is par for the course, and since I live in Toronto myself I am well aware of the issues with the hotel’s location. If you don’t have a car, this is not the place for tourists to stay. The AMC movie theatre at Kennedy Commons has been closed for years (and for its final year or so of operation mainly played Bollywood and various Indian and Southeast Asian language films only), so they should stop advertising it as a nearby attraction. This is not a pedestrian-friendly area, and really not a safe place to be out walking around at night. There is access to public transit, but it would take you forever to get downtown on the TTC from here.The uniformed (but unarmed) security guards inside the building were both reassuring and disturbing at the same time. There seemed to be a lot of them.We ordered room-service breakfast, which was quite good (not great, but good), and about the price I would expect for room-service. But it arrived slightly late, mainly because the waiter was busy for several minutes chatting to someone (very loudly) on his cell phone out in the hallway, while our food was getting cold.What staff we did have contact with were friendly and pleasant.At about $160 an night, this is not an expensive place to stay by Toronto standards. But I expected more from a Delta Hotel. My wife is being a good sport about this. But that promised waterslide being broken ... it is not nice to lie to and be deceitful to your customers.Curiously, after advising Delta HQ via Twitter that I would be posting a (negative) review on Trip Advisor, the waterslide was suddenly open this morning when we checked out (too late for us to use it, of course).I did get a call from \"Lindsay\" the Assistant General Manager. But I was put on hold forever trying to reach her. I tried her again at about 5:30pm tonight (April 26th) but after ten minutes on hold I gave up. So at this point I have no idea if they are going to offer any kind of compensation.Epic Fail on your part, Delta East.",
      "rate": 2.0,
      "tripDate": " April 2015"
    },
    {
      "title": "Wonderful place to stay in Toronto",
      "text": "We stayed at this hotel for four nights while on vacation.  We booked packages for each night...two nights Paramount Canada's Wonderland package (to get 4 tickets), one night Ontario Science Center and one night Shop and Dine package.  Each evening also gave us a $25.00 gift certificate to hotel's on-site restaurants and $20.00 vouchers to the Angel Spa on premises.  The Canada's Wonderland and Ontario Science package were $200 CDN/night.  The shop and dine package was $179.  The parking charge was $9 CDN per night but the lot was not secure for the price, anyone could walk or drive  right in.  The Toronto taxes are 15% and of those we were able to recoup the 7% GST ($13.00 CDN/night) at the duty free shop in Niagara Falls.We did not use the Spa vouchers because the vouchers had to be used individually and I believe most services were over $100.  The shopping package consisted of a $50 gift certificate good at various Toronto malls, plus the $25 gift certificate to the restaurants.The hotel had \"family\" dinner and breakfast buffets offered only to guests staying in the hotel -- $30 for breakfast for a family of four (children must be under 12, but they don't mention that until you have been seated, so be aware, they will charge your age 12+ children as extra adults, which I thought was ridiculous as most of the children barely ate anything at all) and $40.00 for the dinner buffet.  The breakfast buffet includes milk, juice and coffee but at the dinner buffet all drinks are extra.  With the vouchers we paid about an extra $13.00 tax and tip per morning for breakfast and an extra $25.00 for dinner.  The food was delicious.  At breakfast there were all kinds of breakfast meats, pancakes, cold cut plates, fresh fruit plates, croissants and other baked goods, toast, bagels, cold and hot cereals.  There was an omelette station and they would also make eggs any style.  Eggs Benedict were served daily.  The dinner was a Canadian buffet.  The three most Canadian dishes were: boneless Alberta prime rib (delicious) carved to order (they will give you the ribs if you ask for them) , huge, wild Canadian salmon beautifully cooked and laid out on the buffet so you could serve yourself, and Canadian ham with maple glaze.  There were also all sorts of other meats, salads, seafood (stone crab claws on one night) hot vegetables,fruit plates,  breads, and gorgeous desserts that were as tasty as they were beautiful.  The waitstaff were very kind and attentive.I should  say that there was also a lovely restaurant on the 14th floor, Sagano (Japanese) that offered a family dinner for four for $60, but it was not a buffet and we did not try it because the amount of food that was stated on the flyer seemed inadequate for my family members, particularly my very tall teenage son who is \"starving\" all the time.  That menu consisted of miso soup, a little tempura vegetable, some kind of mixed salad, some chicken and then ice cream.  I think I would have had to go straight from there to McDonalds, however it would be good for some other people and I have heard it is very tasty. We had a Premier  room in the tower and it was lovely, if small.  It looked over highway 401 and the city, and we were about 10-12 minutes from downtown Toronto.  The room had two double  beds, a table with two upholstered chairs in a bay window, desk and chair, nightstand, two phones (one cordless), armoire with TV, two-doored hanging closet, iron and board, hairdryer, large bathroom, in-tub clothesline and french collection toiletries.  The desk staff were very helpful, as were all the employees we encountered on our stay -- friendly and eager to help you in any way they could.  They clearly took pride in their workplace.  My children loved the pool, which is indoors in an atrium with a two-storey enclosed \"monster\" slide.  There are also a kiddie pool with a kiddie slide, a hot tub, exercise room and separate saunas for men and women.  All people entering the pool must first shower off in a changing room near the pool.  This changing room has all kinds of toiletries in dispensers on the walls....eg, shampoo, hair gel, etc.The best attraction we saw was the Ontario Science Center -- don't miss it.  Plenty to do and lots of space to do it in.  I would definitely stay in this hotel if I visited Toronto again,but I don't think I would choose Toronto for another family vacation, as there didn't seem to be enough there to make it worth another trip -- more for the business traveler, I think.",
      "rate": 5.0,
      "tripDate": " August 2005"
    },
    {
      "title": "top service, a great time",
      "text": "Just returned from a one night get-away with my husband and two children (7 and 3) to the Delta Toronto East. The service here was fantastic- front desk, housekeepers, pool staff all smiling and super friendly. Nice check-in pack for the kids and the pool area was worth the trip for them as well. Large and small water slides, sauna, hot tubs and incredibly clean. We had a problem with noise through an adjoining door and were moved quickly and without question- this could have wrecked the trip but thanks to caring staff it was a minor bump. I would certainly recommend a stay at this property.",
      "rate": 4.0,
      "tripDate": null
    },
    {
      "title": "Say BYE to Privacy, and Hello to LOUD Noise!",
      "text": "I have never hated a hotel so much. Look at my feedback. I like 95% of the hotels I stay in, and with the exception of one or two, I generally have no problems. Its tough to make me truly hate a hotel. If you get put in a 1st floor room next to the pool, good luck getting sleep or privacy. My windows had to be closed the entire 3 days I was there because the window faced the pool( full of dozens of people) who peer through my window. The pool also closes at 11pm, and was ridiculously noisy, noisy, noisy!!!!!! I actually RECORDED how noisy it was from my room. It was like trying to sleep in the middle of a party.At around midnight after the pool had closed, some wedding party was chatting and laughing in the hallway till 5am. I cannot believe this hotel didnt have security quiet them down. Out if control hotel, what a joke.We asked to be moved and they denied us, claiming the hotel was full(even though I saw plenty of empty rooms). We got very little sleep, and our trip to the zoo was ruined the next day due to lack of sleep.The room itself was missing soaps, hand lotion, and we found an empty coke can in the bathroom.Horrific experience. Just horrible. And I can promise you folks, that if you ever have a complaint about this hotel, it will be in one ear, out the other. Just read the vague, insincere responses by management on Trip Advisor. They were exactly like this in person as well.  \"Next time, we will make your experience better\". NEXT time?! Shouldn't they try and make up for your horrific experience THIS time? There wont BE a NEXT time. Of all my years reviewing hotels on Trip Advisor, this hotel goes down as the worst in my hall of shame.",
      "rate": 1.0,
      "tripDate": " August 2013"
    },
    {
      "title": "If you work hard for your money, spend on different hotel..",
      "text": "We are a family of 4 with a pet, and we stayed 2 nights.It is noisey , dated, and the reason I am very dissapointed is that I expect friendly , curtious staff, and only experianced it few times.Very sad that good , hard earned money was VERY WASTED on the 'delta toronto east'I am convincing my partner that we need never go to this hotel again.       Buyer beware.",
      "rate": 1.0,
      "tripDate": " February 2012"
    },
    {
      "title": "Enjoyable experience really depends on which side of the hotel your room is",
      "text": "I've stayed at this hotel a few times. If you are planning on staying here, make sure you get a room in the building on the left side (the higher building). The rooms are bigger and much nicer. The rooms on the right side (lower building) are terrible!! They are old and faded. The paint is peeling off the doors, the carpets are worn... and the room I got had a faulty modem (and front desk tried to blame it on my laptop... I had to change room to get internet access). The elevator to that part of the hotel is very small and very slow (you can always take the stairs as it is only 3 floors... but not when you have luggage). There is no outside view for these rooms... they look out over the pool (which can get noisy). I also had the misfortune of staying there when a rather noisy wedding was going on. Not a pleasant stay at all and I won't be going back, even if I get a nice room in the newer part of the hotel. The pool is OK... kids seem to like to slide. The location is good if you have a car and can drive downtown. Too bad there is a daily charge for parking. There are a variety of stores and restaurants a short walk away. So if you must stay there... make sure you get a room on the \"nice\" side!! It's worth the extra money.",
      "rate": 2.0,
      "tripDate": null
    },
    {
      "title": "Great Hotel!",
      "text": "I stayed at the Delta for one night March 15 to 16, 2004. This was during their March Break program. Both of my children , son aged 11 and daughter aged 13, loved the activities. We participated in the scuba diving program, for children 8 and up, the Repilia and Mad Science programs (both suitable for all ages). They also offered an arts and crafts activity, cookie decorating, balloon show, and two movies were shown nightly. We chose not to participate in these activities as we wanted some down time too! Our room was pleasantly decorated, the bathroom was roomy and the beds were comfortable. There were three restaurants availble that did look inviting but we chose to eat out. The hotel is located close to the 401 which made it convienent to easily reach many other attractions. We will go again should the opportunity arise.",
      "rate": 4.0,
      "tripDate": null
    },
    {
      "title": "Dirty hotel",
      "text": "This was the dirtiest hotel I ever stayed at. I think they never vacuum the carpet.  The hotel staff are really very nice. The hotel it self needs renovation. Fitness room big one but they have the basics.  Mattress really comfortable and you actually could sleep.  Restaurants are ok and reasonably priced. Swimming pools are in open area not appealing to swimming. Parking is sheep. ..",
      "rate": 1.0,
      "tripDate": " May 2014"
    },
    {
      "title": "Is checkout time really 11:00",
      "text": "Saturday September 14th I stayed at kennedy road delta. The room was clean and I slept ok, some late night arrivals were noisy in the hall.In the morning I went for a walk with one of my friends staying in the same hotel, we came back with coffee and were sitting in her room when housekeeping knocked on the door. They wanted to come in and clean. My friend said we are not leaving yet and I said I am in the next room and won't be checking out yet. This was at 9:45am. At 10:00 am we decided to get ready to go. I went to my room and the housekeeper was cleaning my room AND my suitcase was in the hallway.  I was beyond furious, housekeeper said you can still come in. I had planned to use the washroom to get ready and the floor was wet and all my things were in my bag. Then the phone rang and the person on the other end asked who I was I said who are you? This was the dining service manager telling me that two breakfast had been charged to my room. I blew my stack and told him I had not been near the dining room. I called down to the front desk and explained what had just happened and I would be right down to speak to the manager. I explained the whole story and the manager said he would give me my room for a 50% discount. I felt there should be no charge because I did not get the minimum service I expected. The front office manager would not relent and followed up with an email to come back again and he would upgrade my room and give me complimentary breakfast.WHO in their right mind would go back. My point is if checkout time is 11:00 and there is a suitcase in the room please respect this. If you wish guests to leave earlier please post this.Whenever I travel, for work or pleasure I always let the front desk know when I am checking out as a courtesy to allow housekeeping to get ahead of their day. Never in all my years of travelling have I had an experience like this.",
      "rate": 1.0,
      "tripDate": " September 2013"
    }
  ]
}