{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Deluxe Inn",
    "url": "/Hotel_Review-g155019-d1472363-Reviews-Deluxe_Inn-Toronto_Ontario.html",
    "priceRange": "$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "2.5",
      "reviewCount": 70
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "1554 The Queensway",
      "addressLocality": "Toronto",
      "postalCode": "M8Z 1T5",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/06/1b/bc/2c/chambre.jpg?w=500&h=-1&s=1"
  },
  "description": null,
  "featues": [
    "Free parking",
    "Free High Speed Internet (WiFi)",
    "Wifi",
    "Snack bar",
    "Vending machine",
    "Non-smoking hotel",
    "24-hour front desk",
    "Air conditioning",
    "Telephone",
    "Wake-up service / alarm clock",
    "Microwave",
    "Refrigerator",
    "Hair dryer",
    "Non-smoking rooms"
  ],
  "reviews": [
    {
      "title": "Good Location",
      "text": "Quick check in and Check out, friendly enough staff, great location for us, comfortable bed, not so much the pillows ( we forget to bring ours ). Our room # 142 didn;t have a nice view, next time I will inquiry about getting a room on the other side, found the bathroom too small and outdated, WiFi was on and off, but then again it was the weekend that the whole Rogers problems occured. After reading 1 review from someone stating that there are not enough electrical outlets I would definetly have to agree. Would recommend, will be returning in the fall and will probably book this hotel again",
      "rate": 3.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Better than Sleeping in the Airport Terminal",
      "text": "Flight from Toronto to Minneapolis was canceled, rescheduled for the next day. Normally airline would have hotel rooms on standby but a convention in Toronto caused room shortage. This room at Deluxe Inn with two Q beds was available for $117 CAD including tax. Our party of four adults arrived about 23:00, stayed until 6:45 the next day. Air very stale in this N/S room and smelled like scented spray, but did not smell of cigarette. Air conditioner worked and helped with staleness but very loud. Silverfish and spiders in bathroom and mold/mildew on bathroom ceiling. Water ran very slowly out the tub drain and pooled around ankles while showering. Entire room didn't feel very clean or well appointed. Sheets on bed came untucked easily exposing mattress pads, but we did get about 4 hours sleep. Beds reasonably comfortable. Entered the room through a door from the outside like a motel. It appeared there may be permanent residents living in hotel who entered through a small vestibule with stairs leading up from the inside 'lobby' area which was separated from the 'front desk' by a locked sliding barred wall that the front desk person slid back when we received our key. This person was cordial enough but not overly friendly or welcoming. The barred wall was retracted in the morning when we returned the key, so perhaps it is for night-time security. All in all, would never have chosen to stay here but it was better than sleeping in the airport terminal and we were glad to have it.",
      "rate": 2.0,
      "tripDate": " July 2016"
    },
    {
      "title": "ok place for fun",
      "text": "I liked the price and the area was convenient for us. My girl friend didn't really like the place at first. She said, she felt the neighbourhood was \"sketchy\". Was walking around the room uncomfortably in her high heels, tight short black skirt, stockings, a tight shirt, costume jewelry, and long blond hair. Kept saying this is a \"hooker hotel,\" the irony of her words not lost on me. But she settled in and we had an good time. The hotel was quiet and clean, and after her initial discomfort, it turned out fine. We'll probably stay there again. (btw I didn't think it looked like a hooker hotel).",
      "rate": 3.0,
      "tripDate": " September 2019"
    },
    {
      "title": "Good for the price, thank you !!",
      "text": "Overall it was a good experience for me staying for 4 nights. This is not a luxurious hotel and it is a bit old building, but it has everything I needed, comfortable bed, bathroom with hot water, air conditioner, refrigerator, microwave, TV with few channels, daily room service, power plugs and USB plugs for charging.It has Wi-Fi, but does not always connect and that was bit frustrating, please fix the Wi-Fi. The hotel is in good location with restaurants nearby. The attendants were friendly and helpful. If you are picky person expecting high standard hotel, this is not for you. This is great for budget travelers with managed expectations.Thank you Deluxe Inn, 🙏😊❤️ Budget hotels like these make travel affordable for many. I leave with great memories of Toronto !!",
      "rate": 4.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Relaxing Stay in Jacuzzi Room",
      "text": "We arrived late around midnight. Despite this, front desk was friendly. Upon entering the room, it was very clean. It is totally worth upgrading to the sauna and jacuzzi room. We stayed for 6 days. Front desk and housekeeping were always friendly. The room was quiet and very relaxing. The bed was comfortable. A lot of great restaurants down the road. My only nitpick was the loss of wifi for hours on two separate days. It was a very relaxing and enjoyable stay!",
      "rate": 5.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Hell hole!",
      "text": "Should have read the reviews before booking.  My husband booked on line and the only room available was a \"SUITE\" .  We were only staying a night and had to be up early, so we thought how bad can it be.  There was a smell of stale cigarettes camouflaged with some disinfectant.  We had a Jacuzzi in the room along with an sauna.  There were also mirrors all around even on ceiling. The sauna had not been cleaned from   previous guests, dirty towels and glasses left in sauna.  No way I was using either of these. Did not put us in a romantic mood at all.  When we checked out, my husband told the receptionist about the odor. All she said was \"you should have asked for another room \" .  they didn't have another room available.  She never apologized.  How can places like this be allowed to stay opened.",
      "rate": 1.0,
      "tripDate": " June 2014"
    },
    {
      "title": "All rooms raided by Police at 3 am - drug related raid",
      "text": "At 3 am my mother, as ALL other hotel guests, were woken waken up by police in a drug related raid at the hotel. She heard a knock at the window and outside she saw heavely armed police officers. The raid included ALL ROOMS of the hotel. Drug related raid in the middle of the night isn't really what defines a \"family hotel\". Who would really want to stay there other than those used to this kind of situation?",
      "rate": 1.0,
      "tripDate": " August 2010"
    },
    {
      "title": "Scam!! Rip off!!",
      "text": "My boyfriend and I checked in and asked for a non smoking room, when we walked in we could smell stale smoke in the air, we ignored it and turned on fan and opened door for a few mins. After we were there a few hours I started finding what I think are ants in the bed, I could feel them biting me on my stomach, I had also brought our 4 year old daughter to spend the night with us. She seen the bugs and started freaking she wanted to go home, I called the front desk to ask for another room and the manager said he had no rooms, mind you it was 6pm on a Monday so I'm sure the place was pretty empty, he told me that he would come and spray the room but we had to leave for 15 mins. Wtf!!! I couldn't believe that, he sai they have no problems at all here and maybe the bugs came from the cleaning lady's leaving the door open. He would not switch our room, I will never come to this place again and would recommend that anyone else come here either. I even took pictures of the ants to show him and nothing was done about this. I am so disgusted I will never ever come back here, it's a rip off. I might aswell took 70$ and thrown it in the garbage and slept out in te forest for the night.",
      "rate": 1.0,
      "tripDate": " April 2013"
    },
    {
      "title": "Really dirty",
      "text": "I'm a bit of a hotel snob, but this was booked by friends so I had to try it out. The room was really dirty. I saw a long hair in my bed sheet (wasn't mine), the shower was loud like a train passing by. Noise from airplanes at night, cigarette stains everywhere. I was afraid to touch anything. Worst of all, the room wreaked of cigarette smoke that they tried to mask with some deodorant. I seriously didn't sleep as I felt my lungs were getting bruised by the smell. Will never stay here again.",
      "rate": 1.0,
      "tripDate": " November 2015"
    },
    {
      "title": "Unhelpful and rude",
      "text": "A good friend of mine made a reservation for a night at this hotel before she left her home in Quebec. When she called from outside Toronto to confirm, she was told they had no record of her reservation but come anyway. She did and when she arrived, they had no rooms- but more importantly- after two errors on their part they made absolutely no effort to help her find another place or indeed even suggest another hotel in the vicinity. Rude and Unhelpful should be their name!",
      "rate": 1.0,
      "tripDate": " October 2014"
    },
    {
      "title": "OK hotel but wouldn't stay again.",
      "text": "I originally reserved this hotel through booking.com, as it had free cancellation and pay at hotel upon arrival, I choose here because it had easy access to Sherway Gardens mall and surrounding shops & it was close to downtown Toronto and the Islington Subway, perfect for me to keep myself occupied while my partner was out working during the day. Check-in wasn't the best i've ever experienced, as the hotel had actually cancelled my booking before we got there, it wasn't until after we had checked in, that i had realised this, as i received about 10 emails whilst in the air from booking.com saying they had tried to take money from my account, when it was a pay upon arrival, which made me unhappy to start with and i have never had that problem before. When we first walked into the room it didn't smell nice,  it was a decent size,one of the wall lights above the tv didn't work, The only good thing was the heater was pretty good and packed out a lot of heat very quickly, which was great when it snowed for two days and became very cold but it did have a smell to it at times. There was a fridge and microwave in the room which we used and they were fine but there wasn't any hot drink facilities in the room but luckily there was a  Timmie's right across the street. The room was clean so was the bathroom, the cleaners came in nearly everyday but sometimes not till late afternoon 3-4pm, also the walls are thin, we could hear everything in neighboring rooms, there was also a smell of weed coming from the opposite rooms at times, we noticed this whilst heading out in the evenings. The hotel is also between a burger king and a lorry loading facility, we were on the side off the lorry loading facility and would quite often be woken early in the morning by this.   The bed was clean and quite comfortable but they only supply two pillows which were not that good, so we had to buy an extra one from Walmart as they didn't have extras.The free wifi was pretty poor, it would often kick us out or we couldn't have more than one laptop or phone connected at a time or it wouldn't work and when it did it was very slow. There was only three plug sockets in the room and the ones they had weren't easily accessible and were also loose on the wall. we did have an alarm clock that i later found two days before we checked out, it had fallen down the back of the bedside cabinet. If it wasn't for the fact we didn't have a big budget and it was well located, we probably would have moved elsewhere, also if you have a car you might have trouble parking especially friday and saturday nights, if your on a tight budget it is somewhere to stay but if you can afford a bit more i'd go for Motel 6 on Argentia Rd, Mississauga.",
      "rate": 3.0,
      "tripDate": " March 2017"
    },
    {
      "title": "OK, don't expect much",
      "text": "Needed to be close to Toronto downtown. Stayed for one night, on major street, so there are food options close by. OK hotel for what I needed. Just don't have a lot of expectations. It was relatively clean and well kept. Bring your own shampoo/conditioner.",
      "rate": 3.0,
      "tripDate": " September 2015"
    },
    {
      "title": "Reasonable",
      "text": "Rooms were clean, good beds, small bathroom. Hotel is along busy road but we slept good. We were surprised to learn that adult moovies could be seen at different, changing channels. Boaring after a few minutes but some like it hot.. Distance to downtown Toronto is about 7 miles. High speed internet was highly appriciated. Nice staff.",
      "rate": 3.0,
      "tripDate": " May 2015"
    },
    {
      "title": "Good but...",
      "text": "The room was ok, the washroom too.  Everything was clean. But the breakfast's area is very small everybody is crashing with you, it's very uncomfortable to have a nice breakfast if everybody is hitting you. Hopefully this review helps the staff to improve that part, your hotel is amazing!",
      "rate": 3.0,
      "tripDate": " August 2014"
    },
    {
      "title": "Didn't book, but front desk extremely helpful",
      "text": "Not sure this will count as a valid review, because we didn't end up booking. But I'm reviewing based on the really, helpful service help we got from the front desk! It was late at night, and all the \"cheaper\" rooms were taken. We were about to turn around and leave, until he told us to wait a bit and he'd make some calls.He understand my price range and went out of his way to call up some buddies to make sure we had a room waiting for us available when driving there––all in the budget price. Cared for our safety as well, told us to call him when we arrived to ensure we were okay. Very kind and went out of his way for us, thank you.",
      "rate": 4.0,
      "tripDate": " June 2014"
    },
    {
      "title": "excellent room and friendly staff",
      "text": "Close to all shopping,highway,clean rooms and good price.we stay their on Monday night.wifi works great.motel staff is very good.downtown is very 15 minutes drive.bus stop and Tim horton accross the street.",
      "rate": 5.0,
      "tripDate": " December 2013"
    },
    {
      "title": "Awful recommendation from my own college",
      "text": "I booked two nights at this hotel, as it was recommended as a temporary option by Humber College. After the first night I did not know who to complain to, either the College for actually recommending such a bad hotel, or to the staff for having the dirtiest place I have ever been. The place smelled bad, the toilet had feces leftovers due to poor cleaning and the carpet was terribly dirty. Definitively a place you want to avoid by all means. Although the location is quite good due to its location It would have been way better to both stay at a further and/or more expensive place. Fortunately I was able to find a place to stay fast enough to avoid staying at this place one more night.",
      "rate": 1.0,
      "tripDate": " January 2012"
    },
    {
      "title": "Value meets expectations",
      "text": "When I was researching hotels in Toronto, my only requirements were for something close to the airport, and as inexpensive as possible. I have frequently been a hostel traveler, but didn't want to be around so many strangers for such a short amount of time. I was able to get a very reasonably priced room at Deluxe, which is just fifteen minutes from the airport by car. It is also on a big road called The Queensway, which has a few bus routes. Most of the hotel smells like stale smoke. This is inevitable for any hotel that allows smoking anywhere. It gets in and on everything. This was also true for the air conditioner. However, if you can deal with that (I can), the bed was comfy enough, the shower was strong and hot, the wifi was quick and, really, you can't beat the price. They seem to be doing some nice upgrades, including washable remotes for the tv and a newly reno'd lobby. Be aware that most of the rooms are upstairs and I did not see an elevator. I did appreciate the fridge and microwave, and found everything to be sufficiently clean and comfortable. If I am traveling through Toronto on a budget again, I would stay here again.",
      "rate": 3.0,
      "tripDate": " October 2012"
    },
    {
      "title": "Are you kidding me!!! We love this place!",
      "text": "I have travelelled more than the average person so I think I am quailfied to say that this is a great Inn for the money in Toronto. We have never encountered bugs of any sort. Our room is always clean and comfortable on the main floor. The room is a bit on the small side but honestly the beds were way more comfortable than the Airport Travelodge or the Punta Cana Princess in the Dominican Republic. The room is equipped with and air conditioner, microwave and fridge ( even freakin duvets1). The Inn is convienient to the hospital. We thought of trying another \"budget\" hotel on The Queensway but slid by when after we pulled in and took a gander at the sqaulid offerings. Honestly, this place is a real bang for your buck in Toronto on a budget. Close to Tim Hortons (across the road!) With stores, restraunts, fast food and buses just outside the door. I am having surgery at St. Joesphs Health center and will have to be in Toronto for a few days. I would not think of booking any place else. I never saw a bug or a germ or mold of any kind. The rooms may smel a bit musty at first but turn on the air or the heat which is more than sfficient and the odor will go away. The room may have been cosed up for a few days. We will be back and soon. Thank-you for giving us an affordable option while in Toronto Deluxe Inn!!!",
      "rate": 5.0,
      "tripDate": " July 2012"
    },
    {
      "title": "Yikes! Was I ever wrong...",
      "text": "I used to frequent this hotel with my boyfriend when we needed a night away from our busy house holds, and previously wrote a kind review on the place since I had seen it wasn't getting a very good wrap from other guests, and we hadn't had any problems there. Back then it seemed that they were making efforts to clean the place up and having stayed there the other night I can see it must have been a fluke, and we were by chance getting the nicer rooms. I actually asked trip advisor to remove my last post so I could update it to this one, because the room we got was so nasty I didn't even want to stay.The roomed smelled dirty and still reaked of the smoke from the last occupant. There was hair on the floor and walls of the bathroom, and the tables in the room hadn't even been wiped off of crumbs and whatever else. What are the cleaning ladies even doing in these rooms? My boyfriend felt like something was crawling on him in the middle of the night. The next morning when we were packing up to leave we saw a cockroach climbing on the wall above the headboard of the bed.The people running this place should be checking the rooms more often making sure that the cleaning ladies are doing an adequate job. I've complained to the management, and will never stay there again.Yuck!",
      "rate": 2.0,
      "tripDate": " September 2011"
    },
    {
      "title": "Ok for this $ in Toronto",
      "text": "Clean and renovated but scrapted matress, not confortable.  Don't ask too much for this price in Toronto. If you have kids,  be carefull while changing channels : there's some adult movies between usual channels..A pool is annonced outside but it seems to be a trap...",
      "rate": 3.0,
      "tripDate": " January 2015"
    },
    {
      "title": "Never ever again",
      "text": "- dirty room (foreign hairs on the pillows and in the shower)- noisy (directly at a major street with a lot of traffic)- far away from the centre of Toronto- smell of smoke in the hallway and in the room+ big and new fridge+ a lot of prospects about Toronto",
      "rate": 1.0,
      "tripDate": " July 2014"
    },
    {
      "title": "Hotel hell",
      "text": "Worst hotel ever they are homophobic run operations was harrased so much had to call cops because we didn't want cleaning in room they tried to force into our room. Than so called mgr refused to give real name called himself \"Bob\" than tried to kick us out of hotel because we didn't want out rooms to be entered",
      "rate": 1.0,
      "tripDate": " May 2014"
    },
    {
      "title": "Average",
      "text": "We stayed at this hotel because hotels downtown were either full or extremely expensive. The problem about this accommodation is that you will probably find yourself stuck in a traffic jam whenever you want to reach downtown. The room was fine, don't expect any luxuries. Staff at the front desk was a bit rude.",
      "rate": 3.0,
      "tripDate": " July 2013"
    },
    {
      "title": "NIGHTMARE",
      "text": "This place is ABSOLUTELY TERRIBLE.  They gave me... a single woman staying alone a room that does not lock from either the door or deadbolt to the outside hallway. I had someone come open and walk into my room at 5 and even with the staff knowing they do nothing to fix or help the situation.  When I spoke to the girl in the front desk in the morning since the overnight man was a useless POS she said oh maybe it was him as if having some random man walk into a womans room is normal?!?  Ps it was not him. After asking and asking to speak with a manager and being told no countless times, then the manager was on his way then he wasnt, then he was again but in 2-3 hours. then again you guessed it he wasnt coming. and although all I wanted was to speak with him and he called a good 10 times while I was at the desk she would not pass the phone. finally they said they would comp a new room for the night and like everything else within 5 minutes everything changed again, this time they changed their mind and told me I have to leave without them taking any responsibility or making any other accommodation.  The customer service is TERRIBLE the man over night is SO rude screams and hangs up calls, the manager is completely non existant coward and the girls are just useless.  The only friendly person they had on staff was the room cleaner. If you take your safety seriously stay FAR AWAY FROM THIS NIGHTMARE!!!",
      "rate": 1.0,
      "tripDate": " March 2020"
    },
    {
      "title": "dirty and noisy",
      "text": "no extra lock on door even though door opened to parking lot; both beds were noisy, squeaking and creaking; our plumbing was noisy when another room flushed; a used condom wrapper found beside bed. That was the straw. We left.",
      "rate": 1.0,
      "tripDate": " September 2019"
    },
    {
      "title": "Deluxe Inn",
      "text": "Rooms may not be luxurious, but they are simple, reasonably sized, and clean.  Ursula and Mahesh in the front office were incredibly courteous and helpful.  The value was great since I needed to be in Toronto for almost two weeks.  I would happily stay again.",
      "rate": 4.0,
      "tripDate": " August 2019"
    },
    {
      "title": "Good Value For The Price!",
      "text": "We stayed for one night, while we were in town for a concert at Budweiser Stage. For $95, it was a good deal. They didn’t charge us extra for the third person to stay in the room, but we still needed to get to the show.At first glance, the hotel-room floors looked clean, but after walking around in bare feet for 15 minutes, our feet were filthy black, and when we went to wash them in the shower , they only provided one, little piece of soap for all to use.The room was fairly tidy, smelled fresh, and provided a fridge and microwave oven.The Hotel was a 12km/$20 Uber ride to the show, but after the show, the Uber rates doubled.All in all, for $95, it was good value for the price.",
      "rate": 3.0,
      "tripDate": " August 2019"
    },
    {
      "title": "Okay.",
      "text": "Booked this last minute as I needed somewhere to stay for the night.I was told not to open the door if anyone knocks (okay that kinda freaked me out). About four time during my stay I would hear someone try to get into the room (maybe wrong door). I don’t know. But still when this happens at 3 am kinda freaky.Overall the bed was very comfy, good water pressure. The room was clean. Had a mini fridge and microwave in the room.  I was in a smoking room so of course the room smelt like smoke. Would I stay here again, no.",
      "rate": 3.0,
      "tripDate": " February 2019"
    },
    {
      "title": "Great location. Very central and convenient",
      "text": "This is a no frills motel. Don't expect bells and whistles because it's called Deluxe. Even though you request a non smoking room, if the person in the next room smokes and leaves their door open, you need to put a towel at the base of your door so the smoke doesn't enter. Only other issue is checking in sometimes long due to \"Ben\" not knowing what he's doing. Very incompetent and shouldn't be at the front desk as it reflects poorly on the motel. Best to deal with Ursula and the other girl with the British accent. I've stayed at this motel several times. Though it needs an upgrading, it's decent for the price. Staff are friendly.",
      "rate": 3.0,
      "tripDate": " June 2018"
    },
    {
      "title": "No refund for black bugs on pillows and sheets",
      "text": "**Do not stay at The Deluxe Inn at 1554 The Queensway.  Black bugs were found on the white pillows and white sheets of the room that I stayed in.  Patel (the night manager) was informed of this and he told me that he did not have the authority to provide me with a refund.  The white sheets and pillows were brought to his lobby from my room and he saw a few of the bugs crawling on the floor.  Patel told me that Mr. Brar (the day manager) was the person that would provide me with a refund after the time that he arrived in the morning.  I did not obtain any sleep at the room that was assigned to me and the pillows and sheets were thrown down the lower stairs by Patel.  Mr. informed informed me in three different phone calls that he would not provide me with a refund.  Four black bugs that I killed from the room were placed in napkins and in a plastic bag and I showed two of them to Patel.  Mr. Brar was adamant about not giving a refund.  DO NOT stay at The Dexuxe Inn at 1554 The Queensway.",
      "rate": 1.0,
      "tripDate": " September 2010"
    },
    {
      "title": "Excellent Value",
      "text": "The convenient location made me ignore the bad reviews and it turned out to be a gem. New beds, individual climate control, good free internet. Near fast food outlets and Tim Horton's. Smoking and non-smoking rooms with windows that open. Courteous staff.  The quietest rooms face east on 2nd (top) floor away from parking lot. Never mind online booking, call 9am-5pm and book directly for same price or less for longer stays. Beware that there is an adult tv channel included in the cable tv so don't leave children unattended.",
      "rate": 5.0,
      "tripDate": " June 2015"
    },
    {
      "title": "service/cleaning",
      "text": "most problems could be avoided by hiring a proper cleaning staff who take a little pride in thier job,a little febreeze also goes a long way ,if you do not want to pay for proper cleaning staff i suggest u lower the rate and leave cleaning supplies in each room for us to use ourselves, otherwise not a bad deal .",
      "rate": 1.0,
      "tripDate": " May 2013"
    },
    {
      "title": "Dirty and bad service",
      "text": "Hairs in the bed, mattress was sunken in the middle. stale smoke smell, felt dirty and gross staying here. Heard people going at it next door ALL night on a Wednesday, probably a prostitute. We thought it would be safe to turn off the tv at 7am only to hear moaning.Also the front desk wouldn't loan us a pen.Gnar.",
      "rate": 1.0,
      "tripDate": " January 2013"
    },
    {
      "title": "STAY AWAY !!!!!",
      "text": "Let me start off by saying I was a store manager for a fortune 500 company in Pittsburgh Pennsylvania.  My complaint and experience is this, had stayed here total of 3 separate weeks. First week was great accommodations for the room are fair, second week toilet had non matching nor fitting tank lid, sink stopper non working, internet randomly stops working at odd times.  Most of all went down to reception on Saturday the 26th and spoke with front desk personal.  Extended our stay till thursday the 31st as when my husband is flying back to the UK.  I was very clear as check out on the 31st as again that was the day of his flight.  This morning on the Wednesday October 30th were rung by front desk stating the room wasnt paid for the 30th to 31st.  Went down there and talked to front desk personal and the Manager/owner was also present. They then proceeded to state that the room wasnt paid for, then we explained that had extended till the 31st as thats the day he is flying out.  Went into a slightly heated debate over this.  As being in customer service, they need to understand within reason that the customer is always right.  Why would I book till the 30th to have to move to another hotel for one night!  The oddassity to call me a liar to my face as a paying customer is very repulsive. The room is decent but if you want to be treated as a human being I would steer clear of this establisment.  He needs to go back to business school to learn how to run a business and apparently some manners would be nice as well. On top of all of this their rate changes from weekdays (87CAD) to weekends(95) as all hotels/motels, but when we explained the situation, said to his front desk worker to take 20 dollars off of 120?????  So in short jack up the price to 120 then take off 20 to still make more even thought it was their own clerical error.  When in customer service it is common practice to own up to your mistake and take care of the customer within reasonable parameters.  Not to call the front desk worker while she was in College class and ask her side of the story.  Not to jack up price to make someone think theyre going to get a deatl when it was their own error. Not to be rude and through hate speach and slander about a gay couple. Worst mamagement and etsablishment.",
      "rate": 1.0,
      "tripDate": " October 2019"
    },
    {
      "title": "Jays game",
      "text": "Rented 2 rooms as we were 8. You get what you paid for, and the room did its job. It has a microwave and fridge, the toilet and shower worked, and it was clean. We asked for extra towels and the staff was friendly and readily handed us extra towels for our use. Beds were comfortable in my opinion, and it was agreed on by the rest of my group. 15-20 mins to Rogers centre by car when traffic is good. 2 mins or less to Gardiner expressway and Hwy 427.You can find a Cora's and a Tim Horton's across the street, and a Burger King right beside the hotel. There are other restaurants within walking distance from the hotel as well.We are not picky when travelling, but I will admit I had misgivings at 1st. Now, I would definitively stay there again if on a budget, and just need a quick place to sleep with no frills.",
      "rate": 4.0,
      "tripDate": " August 2019"
    },
    {
      "title": "Budget Friendly",
      "text": "Reasonably priced for the area. Fairly close to restaurants and shopping. The building is dated and has a musky smell. My room was clean. For the price that it is, don’t expect Caesar’s Palace. The only downfall was that the girl at the desk was a bit rude and sarcastic.",
      "rate": 4.0,
      "tripDate": " July 2019"
    },
    {
      "title": "Basic - no frills - not bad",
      "text": "This is a very basic hotel.  In the US I think I'd call it a Motel.  I needed a hotel in a pinch thanks to a canceled flight and wound up here.  The lady at the front desk in the morning is really helpful and nice - she was able to hold my suitcase for the day (which they don't normally do).  If you don't have a car, the bus can take an hour to get to the city center but a cab can get you there in about 20 minutes with traffic.  My view was of a building very close next door.  I do not think I could stay there for a week, but for a night or two, it was okay - and really good considering the price.",
      "rate": 3.0,
      "tripDate": " August 2018"
    },
    {
      "title": "Fantastic ",
      "text": "Room was clean. Great customer service.  Room was exactly as I paid for. Everything  was as described in the room . Definitely would come back . Bed was comfortable.  Nothing bad that we can say about the room or facilities",
      "rate": 5.0,
      "tripDate": " January 2016"
    },
    {
      "title": "Reasonable ",
      "text": "The hotel is about 40 min drive to the city. The room was clean and bathroon  was reasonable. Parking was just next to the room door. The bed was not so convenient. There are quite number of breakfast restaurants nearby. The Aircondition had either very hot or very cold positions and both were not acceptable. So only if there is no other choice.",
      "rate": 3.0,
      "tripDate": " October 2015"
    }
  ]
}