{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "DoubleTree by Hilton Toronto Airport",
    "url": "/Hotel_Review-g155019-d188412-Reviews-DoubleTree_by_Hilton_Toronto_Airport-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.0",
      "reviewCount": 452
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "925 Dixon Road",
      "addressLocality": "Toronto",
      "postalCode": "M9W 1J8",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2a/ef/bd/d7/exterior.jpg?w=500&h=-1&s=1"
  },
  "description": "Welcome to DoubleTree by Hilton Toronto Airport, a stylish hotel with contemporary comforts. Walk to major corporations, services and attractions in the Dixon Road area, and enjoy convenient 24-hour shuttle service to/from Pearson Airport. Business travelers are minutes from the Congress Centre and International Centre, and families will love the proximity to Canada's Wonderland. From the airport, it's just a 20-minute train ride downtown on the Union-Pearson Express. Kick off your stay with a warm DoubleTree chocolate chip cookie at check-in. Our modern guest rooms feature complimentary WiFi, a 42-inch TV, mini-fridge, ergonomic workspace and coffee maker, and some rooms offer premium views of the airport in action. Here a few days? Choose a suite for a separate living area and kitchenette. Treat your taste buds to our on-site restaurant, Turtle Jacks Grill & Bar, or grab snacks and drinks anytime in the 24-hour convenience shop.",
  "featues": [
    "Paid private parking on-site",
    "Free High Speed Internet (WiFi)",
    "Fitness Center with Gym / Workout Room",
    "Pool",
    "Bar / lounge",
    "Free airport transportation",
    "Business Center with Internet Access",
    "Conference facilities",
    "Secured parking",
    "Wifi",
    "Hot tub",
    "Indoor pool",
    "Heated pool",
    "Coffee shop",
    "Restaurant",
    "Breakfast available",
    "Snack bar",
    "Free shuttle or taxi services",
    "Airport transportation",
    "Shuttle bus service",
    "Banquet room",
    "Meeting rooms",
    "Baggage storage",
    "Non-smoking hotel",
    "ATM on site",
    "24-hour front desk",
    "Air conditioning",
    "Desk",
    "Room service",
    "Safe",
    "Telephone",
    "Coffee / tea maker",
    "Refrigerator",
    "Flatscreen TV",
    "Iron",
    "Non-smoking rooms",
    "Suites",
    "Smoking rooms available"
  ],
  "reviews": [
    {
      "title": "Excellent Accommodation",
      "text": "Double Tree by Hilton was really great - friendly and efficient staff, very clean room, fast elevator service.  I did not eat at their pub atmosphere restaurant as it was very noisy, but ordered from their menu, (which appealed to all tastes), to be delivered to my room.  Fast service and excellent food.  \"Starbucks\" in the large, comfortable lobby suited me for breakfast.Taxi service ordered by the hotel arrived around 5 minutes each time. I loved their huge pool with hot tub being open from 6 a.m. until midnight.  It meant that I had time to swim daily and could plan it when nobody else would be there.  Exercise room was well equipped.My only complaint, as with the many hotels near the airport, is that one could hear airplanes from 6 a.m. to 11 p.m.",
      "rate": 5.0,
      "tripDate": " March 2020"
    },
    {
      "title": "Convenient to the Airport and UP Express",
      "text": "Check in and check out were fast and easy and the staff were very pleasant.I found the lobby pretty quirky, but there was a lot of seating available.  There is also an in-hotel restaurant with really good food and an excellent breakfast buffet.  You can also pick up coffee, simple sandwiches and pastries in a Starbucks location just off the lobby.I had a single room that faced downtown Toronto, so the view was quite something, especially at night.  The room was clean and the bed was nice and firm.  I don't recall hearing much in the way of overflights, but I did see a number of jets taking off (I may also have been too tired to notice).  There is no bathtub, but the shower enclosure was fine and the water heated quickly.There isn't much around the hotel, but there are frequent shuttles to Pearson, where you can catch the UP Express to downtown Toronto.  That was very useful.All in all, I would certainly consider staying here again.",
      "rate": 4.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Nice",
      "text": "We stayed here so we were close to the airport for an early morning flight and could leave our car while we were out of town.  Beautiful hotel, rooms were updated and clean. My kids enjoyed the pool and the room service was what we needed to just relax before a very early morning.  The reason for the 4 stars is because when we returned we couldn't get our pass key to leave the parking lot as they told me my credit card wouldn't charge the rooms.  I had to bring up my bank statement and dig out the receipt to prove that everything was charged even after that, the manager did not seem to understand what the problem was and tried to tell me it was the room service purchase that wouldn't go through. I again showed her that the charges were there and our original booking amount so she could see that we were indeed charged for our meal.  After travelling for about 16 hours, this was not a something we wanted to work through. It took about 35 minutes to figure everything out.",
      "rate": 4.0,
      "tripDate": " February 2020"
    },
    {
      "title": "GAA hotel quarantine review",
      "text": "The front desk and other staffs are all friendly and accommodating. Our room is clean and crisp. Social distancing is well observed. Food is pretty delicious as well. Just bring your own toiletries like toothbrush, toothpaste, cotton pads and cotton buds - I don’t receive any from our room. Good thing I brought one.",
      "rate": 4.0,
      "tripDate": " May 2021"
    },
    {
      "title": "Many thanks to all staff of the hotel",
      "text": "On behalf of entire GetJet Airlines crew we would like to express our gratitude to  the staff of your hotel:receptionists,restaurant employees,cleaning staff.We are really thankful for your professional attitude and strong customer-service spirit!Especially we were impressed by attention  and helpfulness at the restaurant during our breakfasts.Many thanks to all employees,especially to Max for his friendliness,enthusiasm and devotion to his job!We wish you good luck in your business!GetJet Airlines crewVirmantas ArmonasDomantas VarnysStasė ImbrasienėDonata ValantinaiteJustina BaltramonaityteGreta Guminaite",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Excellent customer service by the staff",
      "text": "My husband and I stayed at Doubletree by Hilton on account of the mandatory quarantine stay. The staff at the reception went above and beyond to make our stay comfortable.Our check in process was very easy. And a welcome snack packet was given to us. We were escorted to our room breakfast was served within 30 min. A bottle of water with every meal was provided.Lunch and dinner was also very filling. There was a fruit included during breakfast and lunch, and dessert at dinner time. We were also given a bottle of juice and yogurt during breakfast. Our check out was a little delayed and the hotel sent us our breakfast and lunch for the extended duration. I wanted some extra coffee cups and new remote to be sent and called the front desk, it was addressed immediately and sent to the room. The staff is very helpful, polite and understanding that the quarantine period isn't easy for the guests.",
      "rate": 5.0,
      "tripDate": " July 2021"
    },
    {
      "title": "Awful staff interaction",
      "text": "Staff interaction was awful and unprofessional. There is no reason for them to throw stuff you ask into your face. The front desk and in room dining never answered their phones and you can imagine how hard it is for someone who needs to quarantine. Definitely don’t use this hotel this is a waste of money. If possible I would’ve asked for a full refund.",
      "rate": 1.0,
      "tripDate": " April 2021"
    },
    {
      "title": "Great Hotel Close to YYZ airport",
      "text": "Nice lobby a Starbucks. The Bar as great food and ambiance. The price are decent. Location of the hotel offers multiple dining option at less than 5-10 minutes of walking distance. Overall one of the best hotel option you can find.",
      "rate": 5.0,
      "tripDate": " March 2020"
    },
    {
      "title": "Quarantine stay",
      "text": "The 3 stars is only because the staff were lovely and the bed was comfortable with proper cotton sheets. Everything else about the hotel was simply dire. The Canadian government must be taking a big percentage as it should be illegal to charge a non refundable up front three days when one stays for a minimum of one day. Who pockets the profits for the other two nights? It simply cannot cost $300+ per room, per night to clean the room. But the most offensive thing was the food. Totally inedible, not nutritious in any way, greasy, fried, soggy, all one colour, indescribable slop. For over $1300 for 3 nights of which we only used 1 (negative test came early), it was a disgrace.",
      "rate": 3.0,
      "tripDate": " June 2021"
    },
    {
      "title": "extremely dissatisfied",
      "text": "entrance to hotel and parking is confusing to say the least, girl at checking blew off our suggestion that the entrance was hard to find and was condescending with her response.  We had to park across the street at the Sheraton and drag our luggage across the street in a blizzard still having difficulty finding the entrance even on foot. There were no cookies and no apologies offered for not having cookies. She stuck us on the 10th floor directly across from the vending and ice machine room.  The shower came out barely more than a trickle. If I could go back and repeat this experience at a cost of 18$ I wouldn't pay it so obviously at 180$ I feel totally ripped off.",
      "rate": 1.0,
      "tripDate": " January 2020"
    },
    {
      "title": "excellent Hilton brand hotel",
      "text": "On our recent 6 week sojourn we stayed in 9 different Hilton branded hotels.  Our final hotel before flying home was the Doubletree by Hilton on Dixon Road near the Toronoto airport.  They say \"save the best for last\" and it was true in this case.  We arrived at 10AM from our Pearl Mist cruise of 4 of the 5 Great Lakes hoping for the best.  They immediately gave us a wonderful suite on the top floor overlooking the airport with Lake Ontario and downtown Toronto in the distance.  The staff was, simply, outstanding.  One downer: the restaurant in the hotel is, at best, just OK.  The good news?  Delivery options delivered directly to our room were numerous.",
      "rate": 5.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Mandatory 3 Day Quarantine Hotel Stay",
      "text": "The hotel was nice and super clean but the food sucked. For what we paid for 3 nights, the hotel should have made arrangements for better food service. The food was so bad, we had to order out for every meal and that’s unacceptable considering what we were charged.",
      "rate": 3.0,
      "tripDate": " July 2021"
    },
    {
      "title": "Tired but happy",
      "text": "Arrived at 1.30am after a vey long flight and reception staff member was friendly, helpful and efficient. Room was very good and had a great sleep. When checking out the new staff was very helpful and anticipated our needs. Would us this hotel again.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Quarantine 3 Day Requirement",
      "text": "Sadly, this hotel is disappointing. Staying here after traveling for work, and I wish I had booked another hotel. The toilet seat was dirty, and so was the bathroom floor. First day I went to take a shower, and noticed the ceiling was leaking. Biggest disappointment is with the price you pay, the food is extremely bad. No meal was made fresh, and every dinner was some kind of curry based. Fruit would have been nice, as they didn’t offer healthy balanced meals.If you have a choice, don’t stay here.",
      "rate": 1.0,
      "tripDate": " April 2021"
    },
    {
      "title": "Overnight stay.",
      "text": "Great place to stay. Just be aware that they charge you extra for vehicle parking. Was not made aware of this when we booked. Clean rooms and pleasant staff. Upgraded showers. they have done away with the old bath tub and created a nice roomy shower.",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Excellent experience!!!!",
      "text": "Stayed at the hotel for a basketball tournament,  many amenities close within walking distance.   Hotel staff was very friendly and accommodating,  room was clean and beds/pillows were like sleeping on a cloud! Turtle Jacks restaurant attached to the hotel was A1!   Exceptional service and great food.   They were very friendly and accommodating to seat our whole team multiple times and the service was a 10.  Would definitely recommend and stay again!",
      "rate": 5.0,
      "tripDate": " March 2022"
    },
    {
      "title": "One of the Best Airport Hotels.",
      "text": "Hotel is ideally located about 10 mins drive from Pearson airport.Hotel provides free shuttle bus to airport , check schedule with front desk when check in.Hotel charges for parking on site @ cad $25 with 24 hrs in and out privilege.Front desk crew are very friendly and helpful. I checked in with Representative NiBell, who assisted me with choosing a quiet room for my sleep. And even went further to arrange some snacks to go for me because my early check out.The room was clean with a very comfortable bedding.Overall, it’s my first choice when it comes to airport stay before flight.Already booked another room for the stay.",
      "rate": 5.0,
      "tripDate": " October 2021"
    },
    {
      "title": "Will go elsewhere next time",
      "text": "I’m here now and so far have had a poor experience. The shuttle experience was absolutely awful. One doubletree shuttle, which was for a different hotel, told me where to wait. So I did and then saw the shuttle blow right past me so I waited in the cold for over 40 minutes.Then upon check in, no offer for this warm cookie they are famous for. I can’t eat them, but why did you offer everyone else checking in one, and not me?Get to my room and had wanted a view of the airport. Asked to move. Nope. Your room doesn’t accommodate an upgrade. Upgrade? I booked a king, what else would there be?I’d like to get room service. No menu to be found. I don’t know about a single amenity here because the front desk didn’t mention a single one.People are tired after flying and appreciate the extra service when they get to their hotel. I’m sad to say I saw none of that here.",
      "rate": 2.0,
      "tripDate": " November 2021"
    },
    {
      "title": "Absolutely horrendous hotel stay",
      "text": "The hotel staff are ill behaved. Service is late. Food is served cold. I could go on and on. Worst hotel stay experience ever for me. Please avoid this hotel at all costs to avoid some extra stress when you are travelling.",
      "rate": 1.0,
      "tripDate": " April 2021"
    },
    {
      "title": "The rudest Front Desk award for 2020 goes to this hotel",
      "text": "I had booked a day room before flying back to Bangkok.  in over 40 years of frequent international travel this check-in experience was the worst.  The lady, I believe Sophia was her name, was rude to the degree of being offensive.  No attempt to even being polite, no smile, - simply amazing ...and certainly not the usual Hilton Standard.Whilst I am at it ..I intended to have lunch at the hotel ground floor diner ..the place was almost empty ..and, as always, I tried to look for a table and have a relaxing meal. A rather dramatic waiter put himself right in front of me, preventing me from even making a step forward to have a good look where I could sit ...twice he did so ..and when I asked  him why he was so dramatic ..his drama queen response was: I am only doing my job.  Thats when I called the manager. I am aware that in North America hotel standards are not on the same top level as in Asia, but in both these cases ..this was simply unacceptable. ...too bad, otherwise the room and its amenities were impressive",
      "rate": 2.0,
      "tripDate": " March 2020"
    },
    {
      "title": "Horrible experience",
      "text": "We were charged twice and not permitted a refund. We only booked and used one room. The manage at this hotel would not permit expedia a refund for the extra room charge. Poor customer service experience. There was no parking spot available. The “queen beds” are actually double bed size. Very small. Would never book again.",
      "rate": 1.0,
      "tripDate": " April 2022"
    },
    {
      "title": "Would definitely stay here again",
      "text": "I’m a little late writing this review as we stayed the night of November 29 but here it is. Shuttle from the airport was great and took  us the short ride to the hotel, the driver was super helpful with the luggage. Easy check in and a lovely corner room. Dinner was at Turtle Jacks which was delicious and really put us in the holiday mood. Morning came really early as our flight to the sun departed at 9:00 am and we weren’t sure what to expect at the airport. The wake up call was on time and even though we only managed a few hours sleep, the bed was really comfortable and the room was extremely clean and quiet. If the world settles down, we will definitely stay at this hotel again.",
      "rate": 5.0,
      "tripDate": " November 2021"
    },
    {
      "title": "Average",
      "text": "We stayed here for anumber of nights, as an overnight stay for the airport it would probably have been ok but for extended nights not so much. The lounge area was blessed with seats but very uncomfortable ones and this area was used more of a transit area with people waiting for shuttles/Ubers.Parking was expensive at a daily rate of $28.Small shop in site. Starbucks in the lobby but again a bit of a soulless place. There is a restaurant on site which we visited a couple of times but it was loud and the menu average.Lack of information on opening times for Starbucks and restaurant over the holiday period was lacking so it was a bit of potluck whether they would be open or not which was frustrating.Housekeeping was not great and the room felt a little grubby with a lot of dust around.We will be back to Toronto as we have family in the area but we won't be back at this hotel.We stayed at the front of the hotel and the road noise was significant.",
      "rate": 3.0,
      "tripDate": " December 2022"
    },
    {
      "title": "Great place close to Airport",
      "text": "Greater by friendly shuttle driver then dropped off at the door of hotel and served by friendly staff and handed a warm chocolate chip cookie. In our lovely spacious clean room within a few minutes. They have Tiger Jacks attached to the hotel and the Keg right beside the hotel.",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Starting to get a little run down",
      "text": "We picked this hotel because it looked nice based on the reviews and it had a free airport shuttle. Overall, I was disappointed in our stay and would not stay here again.The free airport shuttle comes to S1 lower level of the YYZ airport (one below arrivals) every half hour. The shuttle came on time and it was clean.We were offered cookies upon check in. They do contain walnuts and I wish there was better signage for allergens. We stayed in a suite on the 17th floor and the room was clean for the most part I guess. There were dirty nose prints on the window and stains on the wall. The bathroom was aesthetically nice. There was a walk in shower and no bathtub. The sink drain did not work properly. It was jammed in the lifting mechanism and needs to be taken apart to be repaired. The pullout couch was horribly uncomfortable and you can feel every spring. The sheets on the bed were scratchy.The TV system was very 80s and doesn't allow you to flip through the channels. You have to go back to the hotel guide and change channels that way. Upon check out, the front desk person was rude and impersonal. I said to him, “Good morning. We are just checking out.” I hand over the keys. “Just wondering how the shuttle works? They just roll up? We pre-booked the airport shuttle last night but I just want to make sure we don’t need to check in for it or anything.” He just pointed to the sign. I said, “Yes we are already booked.” He didn’t say anything.I have stayed in hotels and hostels all over the world and this treatment was extremely rude and unwelcoming. Usually in nicer hotels like the Hilton, the front desk agent will at least ask how our stay was. The man did not say anything and just took the keys. I did bring these issues up to Hilton main customer service as well as the hotel directly. The best the main contact center could offer me was $50 worth of Hilton Honors points. Seeing how we paid over $470 for a \"suite\", I felt like this offer was pretty insignificant. Contacting the hotel directly, they were unable to offer a refund of any more than $50. For a hotel with such high standards, I was extremely disappointed in the quality of stay, rudeness of the staff, and inability to make things right.",
      "rate": 2.0,
      "tripDate": " October 2022"
    },
    {
      "title": "Room ok but service and food terrible",
      "text": "Food was awful. You don’t have a choice of food. I will try to upload photos.  Room was dusty and when I advised them they wanted to send cleaning supplies for me to clean the room. Alarm went off for no reason in the middle of the night. There is an extra security fee that they did not advise us about before we arrived. Staff not vaccinated.",
      "rate": 1.0,
      "tripDate": " March 2021"
    },
    {
      "title": "My airport hotel of choice so far.",
      "text": "I have stayed at hotels in the area over the past 6 months as I travel 3 times per month. This hotel is great in many ways; location, atmosphere in lobby, Starbucks onsite, nice clean rooms. Fairly sound proof from plane noise.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Confused between Average and Good - Above Average but a tad below good.",
      "text": "Rooms were not clean as per Hilton Standards dusty somehow. Safe would not work.Bathroom small for a hotel so far off from downtown. Location good for people having work near by but not for touristsReception staff was great and always helpful so that helped me increase the rating. They helped us plan a trip to the Niagara Falls which was great.",
      "rate": 3.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Clean and comfortable",
      "text": "Nice room, clean and good staff.EV charger was good but you need to ask to have the maintenance team turn it on. They go home at 11 so if you come in after that you might not get a full charge as they won’t be able to turn it on in the morning.",
      "rate": 4.0,
      "tripDate": " November 2021"
    },
    {
      "title": "Sad experience ",
      "text": "Poor experience.  I requested an upper floor close to ice machine and a early wake up call  I received a room with no working phone, not enough pillows for everyone,  not enough towels,  no ice machine on the floor, a lower floor   room was not clean. Too bad .there is so much potential for this location",
      "rate": 1.0,
      "tripDate": " November 2022"
    },
    {
      "title": "Poor Reaction to a Problem",
      "text": "I was originally booked into the Hampton but was transferred to this hotel as something happened at the hotel and would be upgraded. I was called and told to take the transfer bus from the airport. I didn’t mind but when I got to the hotel they didn’t have my booking. After a few minutes the agent  made a call and was able to book me in. I got to my room and it had 2 queen beds whereas I had a king size booked, but having been travelling for 17 hours I just wanted to sleep. Within seconds of getting into my room there were kids running and screaming up the hallways and banging doors that went in and in and I could not sleep. I went to reception to ask for a room change and to a king size bed and made the comment about all the kids running around. She said there were no more rooms as they were fully booked I told her I was not staying in that room with all these kids running about. She eventually did change my room but only 6 doors further away and I asked for another floor but was told there were no more rooms and she promised to send someone up about the kids screaming. The time was about 7pm so not very late but with all the travelling I was tired and wanted some sleep but have some respect for other guests. About 30 minutes later and still screaming and running and banging doors I called down to be told someone would come right away. Well 1 hour later they were still at it and no answer at all from the front desk. I decided I needed to take this into my own hands and was getting dressed as I had been trying to sleep when it eventually went quite. Completely irresponsible parents but also very poor customer service for not sending anyone to tell these parents to control their kids and respect others. Definitely would never come back if they can’t address a situation like this.",
      "rate": 2.0,
      "tripDate": " November 2021"
    },
    {
      "title": "NO...just NO",
      "text": "Oh My Gosh.... just NO, like capital N O  first off the digital card didnt open the pool deck then it worked and we got in and the rinse off shower was freezing and spitting everywhere the knob stuck so water was hard to turn on and then went off quick. the button for the spa jets was next to the big red emergency shut off button AND all the dudes working out in the fitness center could just look down and view my teenagers playing in the pool.  Room felt very 90ish beds were comfortable but everytime you moved they made a farting noise, sheets were horrible akin to hospital sheets to me. AC was in the window so when on it blew the black out curtains around so there goes any darkness and the air would just go right up the window making condensation and leaving water. burned my finger on the weird coffee machine, which for the cost of the room i honestly expected there to be a keurig which would have been much easier and more familiar.  Now the bathroom, holy hell thats a horrible shower there was zero and i mean zero water pressure and the door was glass and it was directly opposite the mirror and that is not what i want to see when i am showering (or really anytime) you had to hold the flush down on the toilet to get it to flush which is absurd. I took that all in stride but this morning at 6am when i went to take my daughter back to the pool for some swim lessons, WE COULD NOT GET IN!!!! AGAIN on either the digital key or the keycard so I packed those girls up and we went home.  All in all this was a fail I cant believe the place was renovated 6 years ago. Doubletree your cookies are good but cant make up for these failings we will stay down the street at the sheraton next time",
      "rate": 2.0,
      "tripDate": " July 2023"
    },
    {
      "title": "Absolutely terrible",
      "text": "I stayed here as part of the quarantine protocol arriving into Canada.  This is modern day prison.  The food absolutely is terrible, completely deep fried breakfasts and rabbit food lunches (if you ordered vegetarian).  They give you one bottle of water a day (and even when you want to order more, no one picks up the phone when you call room service).  If you want to leave your room to go outside, good luck trying to get a hold of someone at reception - phone just rings off the hook.  I stayed in my room for 2 entire days without leaving the room.",
      "rate": 1.0,
      "tripDate": " June 2021"
    },
    {
      "title": "Great stopover",
      "text": "After a 5 hour delay and missing a connection in Toronto, we needed an affordable place to stay for 2 nights until we could get a new flight out. Beds were extremely comfy, rooms were small but clean and comfortable. Would definitely recommend another day. Room service was excellent! The Starbucks and small convenience store in the lobby are an amazing addition to this hotel.",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Great experience. Very clean",
      "text": "This hotel was lovely. The only downside for me was the firm pillows and the parking was 25$ a night, but overall it was affordable so it wasn't a big issue. The room and hotel appeared to be very clean, quiet and staff were friendly. It was nice to see that they are taking extra precautions during covid to help us feel comfortable/safe. Also loved the warm cookies. We will definitely be back! Thanks for the great stay.",
      "rate": 5.0,
      "tripDate": " September 2020"
    },
    {
      "title": "Quarantine stay great",
      "text": "Stayed here for my 3 day quarantine and it was much better than I could have expected. They gave me and the other guests I arrived with dinner even though our flight arrived at 1 am and we didn’t check in until 2 am. All the meals came within the time frame and anything extra I needed (ketchup, milk, cutlery) they would bring quickly and were super nice about it. My only complaint was there was no microwave in the room and the food someone’s didn’t come as hot as I like it, but oh the whole the food was very good and good portions. (They did say you could get escorted down to microwave your food, I just opted not to take that option)",
      "rate": 5.0,
      "tripDate": " June 2021"
    },
    {
      "title": "3 Day Mandatory Stay",
      "text": "A total ‘rip’ off. You have to book AND pay for 3 nights despite being only needing to stay for 1 night. The price is exorbitant for the food you get. I paid over $800 for about an 18 hour stay, my evening meal was dried up chicken and rice and plastic cutlery to eat it with!",
      "rate": 3.0,
      "tripDate": " July 2021"
    },
    {
      "title": "Well run, clean hotel.",
      "text": "Well run hotel with clean, modern rooms and a clean, modern gym and pool.Starbuck in the lobby is an added bonus.Asking for a room facing the airport will likely provide interesting views during your stay.The unlimited supply of cookies, standard at most Doubletree's is a nice touch.",
      "rate": 4.0,
      "tripDate": " January 2022"
    },
    {
      "title": "Pleasant find after cancelled flight",
      "text": "Flights cancelled out of yyz due to weather and found this gem of a hotel.  Clean, quiet, quick check in/out.  After travelling all day was pleased to find the restaurant open till 1am on a Sunday night.  Staff were pleasant and food fresh and delicious.",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Really going downhill",
      "text": "This is the 3rd time we have stayed at this property this year alone. We have found the location excellent, the rooms tasteful and well maintained. But the last few visits the customer service has been terrible. On this trip we had problems checking in as the name was spelt wrong on the reservation and we were never emailed a confirmation. Although this was not our fault the front desk staff treated us as it was and gave us a hard time checking in. The price we were quoted for park and fly ended up being much higher at check in (MUCH HIGHER). If we had not just had such a long drive here we would have left somewhere else. Then the cherry on the cake. It’s my husbands birthday. We requested some wine glasses to the room. We have never had a issue with this at any hotel, even cheap roadside motels. After 3 calls to the reception, and getting different answers we were told that they are trying to locate glasses and will drop some off if they are able to find some, but if they can’t then oh we’ll tough luck for us I guess. How a hotel and restaurant runs out of wine glasses I have no idea. Defiantly won’t be staying here again.",
      "rate": 2.0,
      "tripDate": " May 2022"
    }
  ]
}