{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "DoubleTree by Hilton Hotel Toronto Downtown",
    "url": "/Hotel_Review-g155019-d186919-Reviews-DoubleTree_by_Hilton_Hotel_Toronto_Downtown-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.0",
      "reviewCount": 2959
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "108 Chestnut Street",
      "addressLocality": "Toronto",
      "postalCode": "M5G 1R3",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2a/f1/68/99/exterior.jpg?w=500&h=-1&s=1"
  },
  "description": null,
  "featues": [
    "Paid private parking on-site",
    "Free High Speed Internet (WiFi)",
    "Pool",
    "Fitness Center with Gym / Workout Room",
    "Bar / lounge",
    "Walking tours",
    "Children's television networks",
    "Highchairs available",
    "Parking garage",
    "Wifi",
    "Indoor pool",
    "Heated pool",
    "Sauna",
    "Restaurant",
    "Breakfast available",
    "Breakfast buffet",
    "Taxi service",
    "Business Center with Internet Access",
    "Conference facilities",
    "Banquet room",
    "Meeting rooms",
    "Photo copier / fax In business center",
    "24-hour security",
    "Baggage storage",
    "Concierge",
    "Currency exchange",
    "Newspaper",
    "Non-smoking hotel",
    "ATM on site",
    "Umbrella",
    "24-hour front desk",
    "Express check-in / check-out",
    "Dry cleaning",
    "Laundry service",
    "Self-serve laundry",
    "Allergy-free room",
    "Blackout curtains",
    "Air conditioning",
    "Desk",
    "Housekeeping",
    "Refrigerator",
    "Cable / satellite TV",
    "Bath / shower",
    "Room service",
    "Safe",
    "Telephone",
    "Bottled water",
    "Iron",
    "Laptop safe",
    "Wake-up service / alarm clock",
    "Flatscreen TV",
    "On-demand movies",
    "iPod docking station",
    "Complimentary toiletries",
    "Hair dryer",
    "City view",
    "Non-smoking rooms",
    "Suites"
  ],
  "reviews": [
    {
      "title": "Excellent Property - Great Staff",
      "text": "I spent two nights here in July.  The hotel was very nice.  I've stayed in all of the other Hilton brands in Toronto over the past four years, and the staff at this hotel was the best.  Everyone I encountered was very friendly and helpful.  Unlike the Hilton in Toronto, the DoubleTree still offers a wonderful breakfast for their Hilton Diamond members.  The buffet was really good, and the staff was very friendly.I had dinner at their hotel restaurant on my first night, and it was very good as well.I liked the ability to self-park in their garage underneath the hotel as compared to the valet service at other Toronto hotels.  It was nice being able to retrieve my vehicle as needed and not have to wait for the valet.Last but not least - their chocolate cookies are incredible!",
      "rate": 5.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Expectation is the Root of All Heartache",
      "text": "For our 10th wedding anniversary, I booked the 2 room premium suite. I normally wouldn't book a room in its price range but being a special occasion I thought it would be worth the extra expense. Also, given the hotel is in the Hilton chain, I had an expectation of a higher standard that would make this occasion extra special. However, when I arrived at the front desk, I had an unfavorable first impression which did not change through the duration of my stay. The first thing that I noticed is that the plexiglass covid-19 shields at the front desk were grimy. Then, when approaching our suite, I couldn't help but notice how dirty the carpeted hallway was. The carpet wasn't in bad condition, it just need a good vacuuming and maybe a steam cleaning. The dust looked like it had accumulated over months and debris that was scattered on the carpet remained so during my stay.  The building is in need of sprucing up. Doors and furniture have major scratches and scrapes and a fresh coat of paint would brighten up the common areas and rooms. Signs are posted all over about covid-19 protocol which is a good thing. However, waiters in the hotel's restaurant walked around with their noses unmasked. The restaurant layout is such that you can see in the kitchen. One chef was properly wearing his mask while the other literally wore it around her elbow.  There are some positive things though. The suite, including the bathroom, towels, and sheets, was very clean and was very quiet. The staff were very pleasant. The hotel's location is close to other restaurants and the Eaton Centre, City Hall, and Queen's Park and having its own parking lot made it easy to ditch our car during our stay and not have to worry about it. Would I recommend staying there? Well, it all depends on your expectations.",
      "rate": 3.0,
      "tripDate": " December 2021"
    },
    {
      "title": "Great rooms/staff/location",
      "text": "I stay at this hotel often. Centrally located downtown with up to date rooms, working ac/heat, decent water pressure, etc. Staff is always extremely accommodating. There is connected self-parking, but it is TIGHT in there. Be careful when entering or exiting.Thanks for the wonderful experience, as usual!",
      "rate": 4.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Assuming the price is right, location cannot be beat.",
      "text": "Temperature is always an issue with us in our room - and this place allows you to set it at will, not common! Big comfortable king bed and wide screen television good for late night watching after your night on the town. The location of this hotel is by Dundas Square, Kensington Market, King Street, Queen Street West, Front Street - all walking distance. Also right behind City Hall which holds big evens in their courtyard. Tip: don't use their exhorbitant parking, just drive half a block to said City Hall for $8 per day weekend parking. The bartenders are very friendly, and go out of their way to take care of you. Highly recommend!",
      "rate": 5.0,
      "tripDate": " November 2021"
    },
    {
      "title": "Excellent stay!",
      "text": "Wow! After reading some reviews, I was a little concerned about my booking.  After having stayed here, I wonder if some of the negative reviewers were at the same hotel as me?The staff were amazing!  So very very helpful...from a pre-trip phone call to address some concerns to the staff who checked us in to the awesome concierge Jing who went out of his way each time we asked him a question.  While the hotel shows some wear and tear, the rooms were very clean.  There was no strong deodorizer smell like so many places have.  It just smelt fresh and clean upon entering the room.  The beds were very comfortable, good pillows and lovely duvets.",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Comfortable and  great location.",
      "text": "Found the room clean and comfortable. Its greatest feature, however, is its central location downtown behind city hall. The contactless check in and check out worked well in these Covid times - and there was plenty of hand wash everywhere. If you’re staying there on a weekend, use the city hall underground parking close by - it’s much, much cheaper than the hotel’s parking.",
      "rate": 4.0,
      "tripDate": " October 2021"
    },
    {
      "title": "5-Star Customer Service",
      "text": "Customer service is everything to me and the staff at this location exceeded my expectations. I’m currently in Newfoundland and my President is staying at this Hilton location for meetings which happened to be scheduled on his birthday. Earlier this week, I contacted management with a special request to post some signs on his door the morning of his big day and to send him a birthday fruit basket - they certainly delivered! Thank you, Matt and staff for being so helpful and accommodating! You Rock!!! It’s those kind of gestures that go a long way and yet another reason why I love the Hilton. Keep up the great work ❤️👌🏻",
      "rate": 5.0,
      "tripDate": " September 2020"
    },
    {
      "title": "Comfy rooms & great service for our meeting",
      "text": "I stayed at this hotel for 2 nights on business. The bed was comfortable and the room was nice. I also was the organizer for a small group meeting in the San Francisco conference room. The hotel went above and beyond in terms of providing service and excellent catering food for our meeting. I had so many complements on the quality and variety of both healthy foods and treats. And one member who had a lot of allergies was very carefully catered for, with good tasty (gluten free, egg free, AND dairy free options).",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "One of my favorite hotels ever - AMAZING staff",
      "text": "I am in hotels about 3-4 nights a week all over the US and Canada for work and this is pretty much my favorite hotel. I always stay here when I'm in Toronto. It's an awesome location for good cheap food and walking to many things to do like shopping, parks, etc. But best of all is the staff. They really go above and beyond to make suggestions and help and just be friendly. The rooms are clean and it looks recently remodeled. The breakfast buffet is EXCELLENT. Unlike many Doubletree properties, there is no overpowering smell of perfume everywhere.",
      "rate": 5.0,
      "tripDate": " December 2019"
    },
    {
      "title": "Good stay",
      "text": "Check in was easy and fast, front desk staff very nice, rooms was very clean and the temperature was comfortable, stayed on the 15th floor, has any elevators and they are fast. Parking $35 and underground,very small garage and you have in/out privilegesWent for the breakfast, WAY over priced. I paid $27 for 3 sausages,2 eggs, one piece of honey dew melon and one piece of cantaloupe and 2 toast. Room service would have been cheaper. There is construction, but I wore earplugsThere is a Starbucks machine for coffee in the lobby $3, I would stay here againWelcome cookie was delicious",
      "rate": 4.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Another great stay at this hotel! A++",
      "text": "This was our third time staying at the Double Tree by Hilton downtown Toronto. Again, we were very impressed with every aspect of our stay. We arrived December 26th and stayed for three nights. We were in Toronto to attend the musical 'Come From Away' (highly recommend!!) and a Leafs game (also highly recommend!).:) Location: Ideal location in the downtown core, just a block from Yonge-Dundas Square and the Eaton Centre, a short walk to Chinatown, and also a short walk to Queen and King Streets. We love this area whenever we are in Toronto for a concert, hockey game, shopping, etc.Service: Excellent as always! Courteous and friendly check-in, we had a very early flight so arrived at the hotel at 10:30 AM and we were granted early check-in to our room with no wait time. Bonus! Each morning we received a text from the hotel asking if everything was to our liking, was there anything else we needed, etc. A very nice personal touch that we really appreciated!Room: Very comfortable king bed with fluffy but firm pillows, a very functional room, albeit a bit small. Having a fridge was a bonus.We requested extra towels and received them promptly each day. We were on the 19th floor and had a great view. Price: We booked this hotel via hotels.com and had a very reasonable rate.This hotel will continue to be our 'go to' whenever we visit Toronto (usually once or twice a year). Location, price and amenities are on point.",
      "rate": 5.0,
      "tripDate": " December 2019"
    },
    {
      "title": "Doubletree Disappointed",
      "text": "The shower door did not stay closed. I inform the staff and the issue was never resolved.  During my stay at Doubletree Toronto, I told the staff that my room needed toilet paper.  When I returned to my room after a day in the city, I discover that my door was left open.  I informed the staff my my room door was left open and the staff did not seem concerned.",
      "rate": 2.0,
      "tripDate": " December 2019"
    },
    {
      "title": "Read before booking- disappointing",
      "text": "Don’t waste your money on this 2 star hotel. We were very disappointed to find this king room which had pilling old sheets, a very old tub, and a toilet that would consistently run on and off throughout the day and night. We called reception to voice our complaint and they were not able to give us a new king room and only offered us a 20 dollar discount for our entire two nights for the inconvenience. This is a party hotel, we were awoken at 3 in the morning with signing and loud music and had a horrible night sleep. Would not recommend if you are looking for a relaxing weekend. I’m confused to how this hotel received a 4 star rating and is a Hilton. As a side note the underground parking is incredibly narrow and hard to navigate and the AC is the room is very loud and periodically stops working.The only good thing about this hotel is the location. Very central but we will not be booking again.",
      "rate": 2.0,
      "tripDate": " August 2021"
    },
    {
      "title": "Above and Beyond",
      "text": "Great location with updated rooms.  Convenient to many Toronto Amenities.  Bar tender and servers have great personalities and pick up your day when it is not going the best.  They are awesome!  The bellmen were very helpful in getting our vehicle in the garage which was a Silverado pick-up truck and they found a space to accommodate us after a very long day of travel.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Tired Hotel, Great Staff",
      "text": "The good stuff. The staff at the front desk were all great. Special shoutout to Al who did a wonderful job of assisting at check in. The location of this hotel is terrific, easy walk to most of the Toronto hotspots, if you can't walk, the subway is close by. The bed was quite comfortable, not too firm but with good support. The bad. The hotel is just dated, it's desperately in need of a full-property renovation. It's clear that some things have been done (the carpets in the room and wallpaper had clearly been redone) but there is so much more work to do. The hallways are drab , dated, and stained. The sconces in the room were all damaged and crooked. The desk chair (see photo) was quite damaged. There was also a thick layer of dust (see picture) that occurred every night, either from the HVAC or the bedding. While the housekeepers always did a great job of cleaning the room, including this dust, it came back the next morning without fail. The bathroom was very small with very little counter space. Breakfast buffet was just ok from a food quality perspective. The service at breakfast wasn't good. I started taking down my own water bottle because it was impossible to get someone to fill my glass with water. I wouldn't stay at this hotel again and I wouldn't recommend it to others. Hopefully the owner takes a page out of the Hilton down the street which just finished a complete property-wide renovation.",
      "rate": 3.0,
      "tripDate": " April 2024"
    },
    {
      "title": "Great Location",
      "text": "We stayed 1 night during a recent day surgery that brought us to the big city. Living 2+ hours away we knew going home afterwards wasn't an option. This hotel was the best price and the location was ideal for us. If you're looking for a place to stay close to tourist attractions in the downtown area I suggest here.Room was small but clean and comfortable. Beds were comfortable. Mini fridge and ac worked great! The ice maker didn't work on our floor. We didn't hear noise from the halls or others.We found the little store in the lobby convenient as we weren't up for exploring the city for things like Gatorade and Tylenol. We ordered in a late dinner and there is an area in the lobby just for deliveries to drop food off. Parking is expensive and should be included for every guest staying.",
      "rate": 4.0,
      "tripDate": " October 2020"
    },
    {
      "title": "\"Everything is Fancy Except the Smell!\"",
      "text": "We stayed at the Double Tree on Sept. 13th for two nights. The hotel was perfectly situated near the financial district, eaton centre, chinatown, etc. Everything we needed within a 5-10 minute walking distance.The hotel room was comfortable although not overly spacious (we stayed in a double room on the 6th floor). Good water pressure and fast hot water in the bathroom. Comfy beds too. The staff were excellent and pleasant.The underground parking was full from the time we got there to the time we left. The hotel charges $45/day for underground parking, which isn't as horrible as the parking lot up the street that is $89/day. However the Parking Garage literally across the street (89 Chestnut St) is only $26/day. (Part of the UoT building). Much cleaner, brightly lit, and cheaper. The only \"bad\" thing I will comment on is the smell in the lobby of the hotel. The title of my review comes from my 7 year old niece when she first walked into the lobby. It's true, the entire three days we stayed here, the lobby smelled like the bottom of a kitchen garbage can. The elevators, our hallway and our room did not smell. Just the lobby. So badly it's not a stretch to say we held our breath until we could get outside. I would probably stay here again, but I might check the status of the smell first.",
      "rate": 4.0,
      "tripDate": " September 2021"
    },
    {
      "title": "Rude Service Ruined an old Favourite",
      "text": "I've stayed at the DoubleTree Toronto Downtown on numerous occasions over the last 10 years.  I was keen to stay there again after the 2 year hiatus in my travel due to the pandemic.   I was greeted warmly on arrival.  Things took a turn for the worse when my hotel floor became very noisy each morning in the small hours.  Guests who had obviously traveled as a group spent two nights talking loudly in the halls, slamming doors, and generally behaving badly between 2 and 3 in the morning.  This went on for 3 nights.More offensive however was the interaction I had with a surly staff member at reception.  I had delivered a bag of laundry to the reception in the hope that it could be cleaned within the period stated on the form in the room.  The staff member rudely told me that the service was considerably less regular and presented this information as some form of challenge.  I politely asked whether there was an alternate service and was greeted with rolled eyes. I had been booked to stay again after a trip to Ottawa. I canceled this reservation.  I'm done with rude people. There are other hotels in Toronto after all.",
      "rate": 3.0,
      "tripDate": " May 2022"
    },
    {
      "title": "One night, easy walk to the touristy things we wanted to see 10/20 to 10/21/22",
      "text": "My wife used a bunch of Hilton honors points for one night in Toronto. We walked to everything we wanted to see- CNTower, Aquarium, Casa Loma, she bought a City Pass.We had a King room on the 22 floor, 2218. With a view of adjacent buildings and rooftops.I attached pictures of the front from the street, inside the entrance, views out the room window, view of the room and the bath.Parking in the connected parking garage was $45/ day.The front desk staff were very friendly and helpful and suggested the Asian restaurant , Lee Chen on King street that was very good.We also hd a very nice breakfast in the Hemisphere restaurant (a couple pictures are attached)",
      "rate": 4.0,
      "tripDate": " October 2022"
    },
    {
      "title": "6am- Water dripping from the ceiling",
      "text": "We upgraded a king suite : room very big , comfortable but they need to change the carpets  because they’re pretty bad …6 am in the morning we got a leak on the bathroom ceiling that woke me up after going out the night before for myBday .. the water kept dripping down … they offered for me to change rooms but I was exhausted.  At check out they only thing that they discounted for the inconvenience was the price of the upgrade and the parking .. which I thought was not good enough considering you’re going to a hotel so you can relax and not be disturbed by such nonsense.. they obviously don’t need their customers to come back because if that was me I would’ve  refunded for the Hole  room. I will not be going back to this hotel.",
      "rate": 2.0,
      "tripDate": " October 2022"
    },
    {
      "title": "Good but not great",
      "text": "Overall our stay was very good. Hotel is in a great location. Hotel has parking (contrary to what I saw in reviews) but it is $42 a day so we stayed at the public parking lot across the street for $21. (Only recommend if you don’t need your car during your stay and if you don’t have too many bags to bring in. Service was excellent and hotel was very clean. My only complaint is that there seemed to be no air conditioning in most of the hotel, which was unfortunate because both days were extremely hot (felt like 36 with the humidity at one point). We couldn’t stay in the lobby for long because it was so unbearable. The rooms were very hot when we got in and the AC was hard to control. It was either freezing or it would turn off and be hot again. Room was a lot smaller than expected but I guess I just didn’t look at the room size properly. For 2 people and just 1 night ir was fine though. Also, the fridge in the room was either broken or not connected. Would recommend this hotel if you just want somewhere clean to stay downtown but don’t want to spend a lot of money and don’t need anything luxurious.",
      "rate": 3.0,
      "tripDate": " August 2021"
    },
    {
      "title": "Avoid at all costs",
      "text": "1. Received a notification my room was ready from the Hilton Honors app.  So I Uber over to find out they just want to charge for early checkin.  Don’t waste your time they are eager to try to charge for everything and are not friendly and staff were coughing, not sure why they don’t follow Hiltons policies2. Room was not clean, stains on surfaces, mirrors, tub etc.  they said they would send someone, never saw any resolution3. Returned after meetings and ready for bed, well the sheets look funny.  Turns out the fitter sheet is turned inside out.  It was late and so tried to start changing myself and there by the mattress is a thick layer of dust.  So much dust that this room could not have been deep cleaned in years.  4. Loud humming and siren sounds all night, avoid avoid avoid if you have any trouble sleeping.So many problems, limited to no resolution by staff onsite, solutions like I can change the sheets myself.  What service.Oh and a final kicker.  They charged me at check in, $50 but later changed it to $78.50 for some reason.  I did not consent to that and didn’t sign anything.  I did not authorize further charges.Basically avoid, do not book.  The messages of response to people’s complaints on here are ridiculous as I am on property still and could not get any resolution so if you can’t fix things while on property you certainly can’t fix with a message following.Overall 0 stars, everything terrible and I am sure there will be more horribleness.  The government needs to do something about hotels taking advantage like this to charge us like this and not even providing the basics of a clean room or properly made bed with fresh linens and towels.  There are a lot of better hotels in this category in Toronto in this price bracket, that are similar in price but an overall better experience staff wise and from quality.  Hopefully Hilton removes there name from this property as it is the worst one in their books.  Showcasing lovely stains on the bedding and check out the dust.  The whole room was not properly cleaned but as you can see the bed was inside out.",
      "rate": 1.0,
      "tripDate": " March 2023"
    },
    {
      "title": "Terrible service experience",
      "text": "So when we arrived to the hotel , service was subpar to begin with the employees seemed not to care .   I get to my room to take a shower , after the  shower I am drying myself off my wife notices the towels we are using are filthy Like someone had been wiping there dirty shoes with it. Of course I call the front desk which takes me about 45 mins as no one picks up. Once I report this they bring us new towels and even the house keeper that came to take the towel told me to complain and receive some sort of compensation.  The manager on duty tell me they will look at it and get back to me (this is at 9:30 at night ) no one gets back to me …. I wake up at 11 and call the front desk , they inform me they are sorry and offer us free breakfast ( breakfast ends at 11:30…). And free parking ( I didn’t drive a car ). And that is all they could do for us despite my complaints they would not do anything else.  So safe to say there customer service needs a bit of work.  I would consider other hotels in the area, because for this pricing I would at least expect clean towels ..",
      "rate": 1.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Scent heavy, Worn-Out.",
      "text": "Visited because of close proximity to Sick Kids Hospital. Won’t be returning for a repeat visit.I will start by saying that the staff is lovely. Very friendly and helpful, and if our stay was based solely on the staff it would have been a 5 star rating.Unfortunately this hotel was just not good. Upon arrival we were hit with a very heavy scented lobby. It was overload and almost as though a not so great smell was being covered up underneath. When we checked into our room we noticed some smudges on the pillows and stains on the very worn and pilled sheets and were moved to another room. When we arrived at our new room, the sheets looked much cleaner however there was a random bobby pin on the bathroom counter which didn’t do much for our confidence in the cleaning. We ended up getting wipes and cleaning things on our own.The smell in the room wasn’t as bad as the lobby but still quite strong and we had to leave the window open to air it out. We were told by someone at the front desk that they spray febreeze in all the rooms after cleaning. In my opinion rooms should smell good after a cleaning and should not need some chemical spray to make it smell better. On top of that, things just felt dusty and worn. The corners and edges of the room look like they need a good deep clean to get the dust out.",
      "rate": 2.0,
      "tripDate": " February 2023"
    },
    {
      "title": "Not informed of no housekeeping! Frozen food in fridge.not happy!",
      "text": "We stayed last week for two nights.  Nice hotel in a good location.  Very clean.  But we expected the room to be made up  By 5 o'clock it was still a mess.  When we inquired we were told that a 2-night stay did not come with housekeeping unless we paid extra.  We were never informed of this, and were shocked that housekeeping was optional.  In all our travels this was a first.  And not even to be informed at checkin!Attention to detail is lacking: the fridge setting is so cold that our food was frozen, and no way to adjust it; the drawer handles are almost impossible to access as they are flat with just a small pinched opening.  Fingers are guaranteed to hurt.  We would not stay there again.",
      "rate": 3.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Great customer service from front desk Henry",
      "text": "This is just a short trip to Toronto with my best friend. I was so impressed by the check in service offered by Henry. He is so kind and professional, offering us the warmly baked cookies upon check in and sent us the welcome message after we got into the room. We were absolutely blown away by his exceptional customer service. We will be definitely be coming back because of Henry!!!",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Bed bugs!",
      "text": "Don’t stay here.  Service is terrible. I stayed for one night for work and got attacked by bed bugs.  I had bites all over my body that developed 2 days later.  When I reported this to the hotel, they said they would evacuate the room and do a inspection the next day.  4 days later, they finally did an inspection and when I complained about the tardiness and lack of correspondence, they said that there was someone in the room, so they could not do the inspection.  When I inquired about why they kept someone in the room despite bed bugs they said that it wasn’t in their protocol to evacuate a room for a bed bug report!!!  The inspection revealed at there were bed bug carcasses found, but no activity.  They therefore were not offering any compensation!  I’m sorry but carcasses should mean that bed bugs were present!!!!! Only after requesting that I speak to the general manager did I get the bed bug report (attached) and the first manager said there was no evidence of anything in my room.  So to summarize, many days of horrible correspondence, misinformation and no appreciation for the issue.  Save yourself the stress and grief and do not stay here.",
      "rate": 1.0,
      "tripDate": " December 2019"
    },
    {
      "title": "Good Location, tired/worn out room and furniture",
      "text": "Staff refused to clean the room when asked, regular cleaning is not being done and was told we had to request cleaning.  Requested cleaning and was told they were too busy for two days.The location was great.The room itself looked like it was poorly repaired after a party.I rented a suite and had some who snores sharing the room.  Suites do not have doors on the bedroom.  Would have rented two separate rooms instead if I had known.",
      "rate": 2.0,
      "tripDate": " September 2021"
    },
    {
      "title": "Excellent location, but that's about it",
      "text": "Fantastic location! Right behind Nathan Phillips Square. Easy 15-20 min walk to tons of great sites, restaurants and shopping. 5 min walk to Dundas Square. Heavy duty construction right next door, so a bit dusty and not very attractive. I expected there to be disruptive construction noise, but it was pretty quiet. Hotel, itself, is dated. Room was not very clean. Mold on the bathtub caulking and I found long hairs under the covers on the bed. Eww.Fantastic gym! Has bench, free weights, pull down machines, elliptical, treadmills, etc.Service was not good. Waited 20 mins upon check in and not even a greeting when we finally got service. Not friendly at all at check in or check out. Because of covid, there is no housekeeping service. Your room will not be cleaned during your stay. No one told us this upon check in so we ran out of towels the first day. Tried to call front desk, housekeeping, concierge 5 times over 2 hours. Not a single answer. Went down to front desk to request towels, and it took 2 tries bc it was so busy. Finally when I got service, the front desk clerk was apologetic and explained they are understaffed. Fair enough, but you still need to figure out a solution. You can't just not answer the phone, not provide towels or room cleaning, and have an unsmiling face waiting for you after your 20 minute wait for front desk service. Yikes.I don't know if I'd stay here again. The location is just so great at the price, but the service and the cleanliness needs serious work.",
      "rate": 3.0,
      "tripDate": " September 2021"
    },
    {
      "title": "Holy Cost-cutting Batman!",
      "text": "Hotel occupancy rates in the city are historically low, and Doubletree is generally a consistently reliable brand so I felt confident booking this room. Although the room was clean and the service at the front desk was great, it was clear there were a lot of cuts as this wasn't really anywhere near the pre-pandemic level of service I expected from Doubletree.First of all, the cookie is gone. Yes, it's minor, but that really was an amazing thing that kind of made Doubletrees unique. To add insult to injury, they still have the visuals of this delicious memory around the hotel to remind you what you aren't receiving when you check in. I even called down and was told that it wouldn't be returning anytime soon. Second, housekeeping has been reduced. I was here for a 5 day stay and my room was only cleaned once. Again, COVID-19 was to blame, but most hotels have restored their service levels and are back to daily service, so this was pretty irksome. I totally get the staffing shortage, etc., but to me this wasn't really acceptable. Other than that, rooms are good if not a bit small. It's your typical 4-star hotel but the room rates are historically low at this property and it's attracted some less than savory characters, so I'd keep the deadbolt on the door if I choose to stay there again.",
      "rate": 3.0,
      "tripDate": " October 2021"
    }
  ]
}