{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Dragon Gate Inn",
    "url": "/Hotel_Review-g155019-d23721720-Reviews-Dragon_Gate_Inn-Toronto_Ontario.html",
    "priceRange": "$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "1.5",
      "reviewCount": 13
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "791 Dundas St W",
      "addressLocality": "Toronto",
      "postalCode": "M6J 1V2",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2b/e9/5a/3d/caption.jpg?w=500&h=-1&s=1"
  },
  "description": null,
  "featues": [],
  "reviews": [
    {
      "title": "Unclean, inadequate, underwhelming but great location",
      "text": "We stayed here for 4 nights and the place was severely disappointing in many ways. Firstly, the room had not been cleaned properly at all when we arrived. Everything was dirty, dirty cutlery in the kitchen drawers, a bath tub littered with lots of empty soap packaging, extremely grimey and dusty kitchen appliances etc… the list goes on. Clearly no deep cleaning had been done at all. We complained about this in the morning and they said they would clean it whilst we went out for a few hours, we got back half the day later and nothing had been done until we complained again, they sent someone upstairs who mopped out the bath tub and that was it. We also reported and showed them that the toilet didn’t flush properly to which he said it seems to be broken and then never did anything about it for our entire stay. There were no windows or natural light in the room apart from one tiny square window in the ceiling that had a hole in it. The AC was way too cold, leaving us shivering at night, we complained and nothing could be done as it was a central AC system apparently that couldn’t be adjusted. They messed up our check out dates and we’re calling us a day before we were due to leave asking why we haven’t checked out yet so we had to walk back from our planned activities to show them the paperwork that we were not due to check out until the following day. The staff were friendly and uncombative but also didn’t seem to have a clue what was going on most of the time and were ultimately unhelpful and unreliable. The check out was very easy though and didn’t take anytime at all and  there was the one positive to this place and that was definitely the location. Dragon Gate Inn is situated in a really great area with lots of nice cafes and bars right down the street, cool trendy neighbourhoods all within a 10 minute walk or less including Ossington Ave, Chinatown and Kensington Market. Would not ever stay here again but would look for somewhere in the same location that can actually meet the basic requirements of what is expected from a guest house/hostel or hotel.",
      "rate": 2.0,
      "tripDate": " September 2023"
    },
    {
      "title": "Unethical business",
      "text": "We didn’t actually stay at this hotel.  We booked a room in November, 2023 for $300, as we were fortunate enough to have tickets to the Taylor Swift concert in November, 2024.  The Toronto dates for the tour were announced months before we booked our accommodation, so we assumed (big mistake) that the price reflected the market rate for the concert.  Three days ago (over 7 months after we made our reservation) we received a notice that our booking had been cancelled.  I called the hotel to rectify what appeared to be an error.  The woman I spoke with advised that there was a “glitch” with Booking.com and all their reservations for the year had been cancelled.  She assured me that my reservation was intact, that they were working out the issue with Booking.com and that I would receive an email within 24 hours, reconfirming my reservation.  Needless to say, no such email arrived.  When I tried to call the hotel today, there was no way of getting through to an actual person.  There was an “uninitialized” mailbox; there was a line for reservation inquiries that was an unending loop etc.  I managed to speak to an actual person at reservations.com and he advised that the only room available (a single) was at a much higher rate than we had been guaranteed for a double room.  I would never recommend anyone stay at such an unethical business.",
      "rate": 1.0,
      "tripDate": " June 2024"
    },
    {
      "title": "Worst hotel stay ever. Attacked by homeless, Extremely dangerous location & disgusting room, poor security. Lazy owner",
      "text": "Do NOT waste $200 a night and stay here. Here’s what it was like: Entrance is very hard to find with no signage just a piece of paper taped to the door, check-in was unprofessional. Did not feel like a guest. Dangerous street (Dundas). Someone violently broke in during the night I had to call 911. Very dramatic scene and was left restless for the rest of the night as the deadbolt on our door was completely destroyed and was on the floor. Our Room had blood stains on the pillow case, dirt on floor, disgusting windows, cob webs. The beds themselves were uncomfortable. The TV signal was like something you’d get in the middle of the desert, nonexistent. We received no explanation for the lock on the metal gate which led to the door to our room, was not told to secure the gate thus we had an intruder in middle of the night. Not our fault at all. Received no sympathy or any comment from management. This business lacks the bare minimum in customer service and following protocol with each guest. It’s like I walked into somebody’s house with all their stuff laying around and was showed to my room with no conversation or explanation on anything. We had one night stay luckily for the Post Malone concert. Never stay at this “Inn” it is a dump and you’re in one of the most dangerous areas of Toronto. I didn’t know any of this before booking and simply needed a bed for one night. Had I known how disgusting the rooms were, and that I would have to fend off a mentally ill drug addict intruder, I would’ve gladly paid $600 for one night at a proper hotel. For $200 a night to sleep HERE? That’s what we paid. No way. Never again. The worst hotel experience I’ve ever had in my life. I am disgusted with my overall stay. If I could give 0 stars I would! When you think of a bad hotel, this one crosses off every check box. Don’t waste your time.",
      "rate": 1.0,
      "tripDate": " July 2023"
    },
    {
      "title": "DO NOT STAY HERE",
      "text": "SCAM! Do not stay here! Address provided in booking had a letter taped to the door, saying to go to a different address down the street. I was given room 212. There were two doors connecting to my room that were locked from the other side, I could not prevent somebody from opening these doors from the other side. The sofa bed was a broken and stained futon. The bed was made, but not clean. I did not even stay 20 minutes. When I said I was leaving, they tried to offer me a different room which looked more like the images they post on the website but I declined as why would I trust them after having being put in this scammer room. I filled a complaint with Booking.com but when they contacted the property, they said I was lying and so my complaint was denied. I am out $200 but it was worth it to not have to stay there.If you have a complaint and decide to leave, take lots of pictures before you do so. I had nothing to support my statements because I just wanted to get out of there and didn’t think of taking pictures.",
      "rate": 1.0,
      "tripDate": " July 2023"
    },
    {
      "title": "DO NOT STAY HERE--CANCEL ON YOU WITHOUT WARNING",
      "text": "I have had this reservation booked for months and they just randomly canceled for no reason.  They obviously are selling it higher for the Taylor Swift concert.  We are no scrambling and my daughter is upset.  DO NOT BOOK HERE!   Oh, and so nice of them to cancel \"free of charge'   Horrible..",
      "rate": 1.0,
      "tripDate": " June 2024"
    },
    {
      "title": "Dirty, noisy, unfriendly staff. Save your money.",
      "text": "Staff were not helpful or friendly. Parking is not available. Room was disgusting. Hair on tile floors, mould on shower curtains, cobwebs in corners and the carpets looked like they had never been vacuumed. My bed was beside window located next to exit and the noise from guests coming and going and slamming doors kept me up all night.",
      "rate": 1.0,
      "tripDate": " November 2022"
    },
    {
      "title": "Terrible",
      "text": "Unlivable place even for a few days.Cramped, old, poorly maintained and absurdly filthy rooms.The hygienic conditions of the bathroom were very precarious, there was hair and hair everywhere.Grease was dripping on the kitchenette.Dirty and dusty curtains.Even the area in which it is located is not the best, a bit dangerous.I strongly advise against it!!!",
      "rate": 1.0,
      "tripDate": " August 2023"
    },
    {
      "title": "It's very dirty",
      "text": "Very dirty ! I will leave photos, we were two couples and each had a room, both rooms were disgusting. Mold in the bathrooms, hair everywhere, dirty dishes, dirt dripping on the walls. No window in our room and it was so hot, we couldn't adjust the temperature, very uncomfortable mattress, and it looked like they took their furniture from the trash. In short, I didn't want to be in that room.",
      "rate": 1.0,
      "tripDate": " April 2024"
    },
    {
      "title": "Disgusting",
      "text": "Horrible service, messy reception desk, disgusting bathroom, mold on the ceiling, stain on the sofa, faded paint, filthy windows. Everything about this room disgusted us! The mattress was not comfortable, but the bedding seemed ok. Except we were so disgusted by everything else that we organized ourselves to spend as little time there as possible!It is embarrassing to welcome customers in such an environment! The entire hotel does not appear to be finished. It would take a lot of soap and paint to make this room acceptable.Booking made with AiR Miles. Never again! 🤮",
      "rate": 1.0,
      "tripDate": " August 2023"
    },
    {
      "title": "La peor experiencia",
      "text": "La peor experiencia que he tenido. Jamás están en recepción y cuando están, son muy groseros, la limpieza fatal, habían insectos, las camas rechinan horrible y se robaron el depósito de 100 dlls que dejamos. ¡¡No lo hagan!!",
      "rate": 1.0,
      "tripDate": " June 2023"
    },
    {
      "title": "Great Hotel - Terrible parking",
      "text": "Some friends and I travelled in to Toronto and stayed at the Dragon Gate inn as we were going to a concert in the area.We were impressed by the room, as we were expecting worse with the current reviews and seeing some of the pictures.The room was simple, the wifi was poor, and the beds were very firm... but it was a clean place to lay our heads after stumbling home from a night out. The staff were very pleasant and helpful.The hotel's parking was under construction so we parked on the street and were towed over night. The signage was poor in the area, and as out of towners, it forced us to take some big leaps to expect our car to be towed. We hope that no one else makes the same mistake as us in the future.",
      "rate": 4.0,
      "tripDate": " June 2023"
    },
    {
      "title": "Great neighbourhood option",
      "text": "I loved my stay here. It is a low-cost place in a local neighbourhood, and that’s what I was looking for. My room was clean and efficient. It is a bit weird in that there is no public signage and you have to read signs on the doors to find your way to check-in. Once there, the people who run the place are lovely. There is no elevator so I had help carrying my bag up the stairs to the second floor. Best to bring your own toiletries, but they have small packets of shampoo etc it you want them. I loved the fact that there were some food items left in the fridge - and I left some behind. Much more like a short stay in an apartment than a hotel. Great local restaurants and easy transit. I was attending a downtown conference and loved my place a $17 Uber away from the convention centre.",
      "rate": 4.0,
      "tripDate": " May 2023"
    },
    {
      "title": "Sucht euch eine andere Unterkunft!!",
      "text": "Schäbiges, dreckiges, heruntergekommenes Zimmer mit verschimmeltem Bad. Das sogenannte “Hotel “ das über EXPEDIA gebucht wurde ist als solches von  außen nicht zu erkennen. Der sogenannte nie anwesende Rezeptionist  ist unfreundlich  und agressiv, Das Zimmer ist extrem !!  laut, die Straßenbahn fährt alle 5 Minuten vorbeiDirekt gegenüber liegt ein Nachtclub wo im wahrsten Sinne des Wortes der Punk abgeht.Die Klimaanlage ist nicht separat einstellbar. Die Hotelbilder sind geschönt.Es gibt keine Kaffeemaschine",
      "rate": 1.0,
      "tripDate": " September 2022"
    }
  ]
}