{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Dundas Apartments & Suites",
    "url": "/Hotel_Review-g155019-d7621184-Reviews-Dundas_Apartments_Suites-Toronto_Ontario.html",
    "priceRange": "$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "2.0",
      "reviewCount": 30
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "787 Dundas St W",
      "addressLocality": "Toronto",
      "postalCode": "M6J 1V2",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0c/a0/f8/d8/20160820-093414-largejpg.jpg?w=500&h=400&s=1"
  },
  "description": null,
  "featues": [
    "Free High Speed Internet (WiFi)",
    "Wifi",
    "Non-smoking hotel",
    "Allergy-free room",
    "Kitchenette",
    "Refrigerator",
    "Family rooms"
  ],
  "reviews": [
    {
      "title": "Stay away from",
      "text": "Made reservation with agoda (whoever they are), took my money, then cancelled my reservation and said I'd have my money back in 10 business days.  Stay away from Agoda and Dundas Apartments & Suites.  No explanation, just that it was cancelled, but hotel is till available now for same date that I chose.",
      "rate": 1.0,
      "tripDate": " February 2023"
    },
    {
      "title": "Do Not Book This Hotel!!",
      "text": "This was the absolute worst hotel I have ever stayed at. We booked through Hotwire, and we only stayed for one of the two nights we booked. -Scary unsafe area-Out of the way area-No parking-No toilet paper or paper products-no phone-canned food in cupboards-hair on sheets-Dirty floors",
      "rate": 1.0,
      "tripDate": " June 2015"
    },
    {
      "title": "has potential..",
      "text": "no parking, dirty room, newly remodeled but not done! reception area was not nice, clerk on duty, was not too knowledgable. Did not give us any information about parking. we incurred a parking ticket that the owner told us to ignore... Dirty floors and limited ammenities.. I did feel that the area was safe. I have stayed in toronto downtown mostly, so this location was different, but i feel safe.",
      "rate": 1.0,
      "tripDate": " August 2015"
    },
    {
      "title": "Disappointed",
      "text": "We were extremely disappointed in the studio unit.  We had brought coffee etc but after seeing the coating of dust inside the cupboards and the lint and sawdust on the dishes we could not eat there.  The top plate had not been washed properly and had food stuck to it.  We had to buy paper towels so we could at least clean a bit, no tea towels, dish soap or anything.  There are no lamps and there is only one light bulb in the overhead light.  The bathroom is the only place you can see to read.   Wifi is spotty,  we only got on for a few minutes.  Kept saying we had the wrong password.  There are no extra blankets and it was quite cool.The only good point was that the bathroom and towels were clean or we would have left last night.My husband is undergoing tests at Western for two days.  We needed a warm, comfortable place to relax in the evenings and to sleep.  Now we are having to drive back and forth from Barrie.  How can booking.com recommend this place?  It says there are renovations going on,,,,not true these are not ‘renovations’ it is a construction site.  That said we would still have stayed, but a dirty kitchen and unwashed dishes are disgusting.   All of this and we are told there is no refund, not even for the night we won’t be there.  I will not trust booking.com again.  Very very disappointed",
      "rate": 1.0,
      "tripDate": " March 2019"
    },
    {
      "title": "Utterly disappointed.",
      "text": "Reception impossible to get into contact with before arrival,as welle found out when we had to negotiate a late check-in. No sign in the street, hard to find. No windows in the room. Most basic standards. Noisy party going on in next room and the management did nothing. Dearly overpriced for the product they offer.Best avoided.",
      "rate": 1.0,
      "tripDate": " October 2018"
    },
    {
      "title": "Do yourself a favor and DON'T! ",
      "text": "Booked a stay here recently for myself and my two sons (9 and 18 y.o.)  The place itself is hard to find since they apparently changed their name to Urban Living. Once we found the right building the receptionist was unfamiliar with good customer service and acted like we were a big inconvenience. We were taken to our room (once she figured out where it was located - she was new) and to my surprise there were 2 queen beds lying on the floor, the kitchenette did have a mini fridge and microwave but the cabinetry was unfinished. There were exposed wired in the bathroom. It seemed like they had just slapped something together to rent out. At $180 USD I expected something WAY better. I went back to the front desk and told them that the room was unsuitable. The woman tools me they had only one other room left and proceeded to show us. This one seemed like a step up from the other but still not worth the price I was paying. I had the worst sleep of my night. Even though the beds were comfy the walls were paper thin and our two windows faced the hallway that was under construction. There were some young college students staying nearby and all I heard all night were there screaming, yelling, giggling, laughing, talking, cursing and loud footsteps. There was no phone in the room to reach the front desk so I couldn't call the front desk to ask them to help.  I have included photos to backup all my statements. I looked up how much a night at the Intercontinental downtown would have cost me and it would have been about a $60 USD difference. Knowing what I know now, I would have gladly doesn't the extra money to have peace of mind. Do yourself a favor, spend a little more and enjoy your nights in Toronto. P. S.  Upon checkout they didn't ask how my stay was (like any other lodging facility would) I guess they're tired of hearing all the complaints.",
      "rate": 2.0,
      "tripDate": " August 2016"
    },
    {
      "title": "Awesome place",
      "text": "Great place to stay,right inside downtown. The rooms are nicely kept with wide plenty of space. It is very easy to step outside and be emersed in the city lifestyle. The area which this place is located is pretty nice. Many local shops and close to the central shopping area. Walking around takes about 20 mins but taking the public transport is easy as well.",
      "rate": 5.0,
      "tripDate": " July 2016"
    },
    {
      "title": "Surprise find in a hip part of Toronto!",
      "text": "Needed to find a place to stay overnight, and quick.  Toronto was a challenge.  Very few places in town were affordable.  Finally found a suite on the west side of Chinatown near the hospital.  The location is very safe and easy to find.  The room was spacious and had a kitchenette, a small refrigerator and a microwave. Three different wi-fi access, which was fast and easy.  There are a few minuses.  The building is not handicapped accessible. There is no elevator or lift.  Parking is not available.  But for what it's worth, I would definitely stay again due to the affordability, location and nice bed.",
      "rate": 4.0,
      "tripDate": " April 2016"
    },
    {
      "title": "Great value and superb location",
      "text": "While the first impression is that of a building site i disagree with the first review. The area appears very safe (I know what a rough area is, and this is not it). In my opinion the area is a vibrant, cool and a little boho. I felt completely safe. The area is not out of the way either, it is only 1.5 miles from the CN Tower and is right in the middle of a busy restaurant area.There is parking (albeit the number of spaces are limited to circa 4). The street parking near by is a little complex and we learnt the hard way that you can't park within 3 meters of a fire hydrant - $100 fine!We have toilet paper, maybe the original reviewer was unlucky, the same goes for finding food in the cupboards, the hairs in the bed and the dirty floors.The only negatives we found were that the walls are a bit thin, the lack of signage for the reception (it's on the main road by some black railings - correct at time of posting) and the main door to our apartment should have had some sort of double locking feature. In summary the apartments are nice, clean albeit they are still being built (not that we heard any construction going on). The area is fine (loads of couples of all types holding hands and having fun) and it's a 30 minute leisurely stroll to the CN tower and 15 minute walk to Queen St and King St. The cabs are also relatively cheap.",
      "rate": 4.0,
      "tripDate": " July 2015"
    },
    {
      "title": "Sub-standard accommodations",
      "text": "Check in was difficult. There is no “front desk” or lobby. I had to call to arrange check in. But, I am from the U.S. and do not have an international calling plan. I had to borrow a phone to call. I set a time to meet. But no one showed up. So, I was left standing on the street waiting. Finally, I borrowed another phone from a stranger to call again. Once I got checked in, I could not stay in the room. I was willing to overlook the lack of a window and I knew it would be a very small space. I was even willing to forgive the plywood counter in the kitchenette. The blinds on the skylight looked like they were going to fall on the bed. When I tried the shower, the door fell off. The shower head was held by some set of tape. There were dirty, greasy pots and pans in the cabinets even though there was no stove to cook on—only a microwave. There were cigarette burns on the “retro” night table and there was trash in the drawers. Then, when I pulled back the bed linens, they were dirty with someone’s hair in them. I could not sleep in that bed. I had to go find another place to stay. I know I agreed to pay in advance, but the pictures I saw on the website do not represent the room I was assigned. I lost my money for this room. But, I could not stay there.",
      "rate": 1.0,
      "tripDate": " June 2019"
    },
    {
      "title": "You get what you pay for. I think. ",
      "text": "I'd booked alternative accommodation for my holiday to Toronto well in advance, but after running into some unexpected changes, I had to get something else arranged last-minute. This is what I got. It was about the cheapest I could get on the website I used, and from the photos it looked acceptable. When we arrived at Dundas apartments, we were far too early, so asked if it was possible to leave out bags (both off us just off a plane from Scotland) there, whilst we went to feed ourselves, and they prepared our room etc. That was fine, so off we went. We got back later, and were shown to out room. It wasn't exactly the Hilton, but for the price I paid, I'm probably lucky it even had running water. The room was clean (not immaculate), as was the bathroom. The fridge, cooker, and microwave were actually quite handy to have, and the TV worked. I had used my card to secure the booking and pay the $100 deposit, but told them I'd like to pay the outstanding balance in cash. This wasn't a problem, and a few days before leaving I paid the balance, and was told the deposit would be refunded to my card upon departure. That was a few months ago now... Still no sign of it. I won't hold my breath.As for the location, it's not in a bad area (street view made it look worse than it actually was), and it's only about 20 minutes walk from the harbour and the CN Tower etc.All in all it wasn't great - and I'm still a bit annoyed about my deposit being kept - and I wouldn't stay there again, but as the cheapest option available it did the job. I won't recommend it, but if your budget is very tight, you could do worse.",
      "rate": 3.0,
      "tripDate": " August 2017"
    },
    {
      "title": "If you need a place for a (very) short stay, and have no other option available...",
      "text": "I found this place through booking.com (the address shown there is 791 Dundas St W). If you have the option to stay in a different place, do it! We stayed here because I had to book a 2-night stay in the last minute and unfortunately there were events going on in the city and many places were already booked, leaving us without a reasonably priced option. In the end, based on the quality of this apartment, I would rather have stayed in a regular hotel.The place is not clean. The beds are ok. But the towels are old. Clean-ish, but suspicious. Everything else was disgusting. We got this place because we needed a kitchen. However, we had no courage to use anything that was there. Although we have to go one floor up (by stairs!), the place had the vibe of an old bunker basement (not enough windows). We could hear our neighbor radio day and night long, as the apartments were improvised and divided. There is no parking nearby. It is a busy street, so you must be lucky to find a parking spot.The staff was okay (they seem to be owners of a pub/restaurant downstairs).If you really don't find another option, it might be okay to stay here. I personally won't come back. It is not worth the price.Ah! The good things about the place: the location is good. Public transport ~100m from the door, 20min walk to the CN tower. 10min walk to a big supermarket (Loblaws). Wifi is good and free.",
      "rate": 2.0,
      "tripDate": " October 2017"
    },
    {
      "title": "Avoid this hotel. It cancelled my booking leaving me out of pocket",
      "text": "As stated in the subject line I was unable to stay at this hotel because it cancelled my booking and didn't refund me through the website that I booked the hotel on. I have tried to no avail to get a refund through this website. I am now contacting a consumer affairs organization in Toronto to try and get some response from the hotel. The hotel claimed that they had to close due to fire safety issues. Another verified review has also highlighted that there was a safety permit revoked by the Ontario fire brigade earlier this year. Please avoid this hotel?",
      "rate": 1.0,
      "tripDate": " September 2017"
    },
    {
      "title": "Apartments ",
      "text": "It's a good place with a good location (cost&benefits) there are NO sing of the name outside but the number of the bulding is there. The rooms are ok. It doesn't have a parking lot si do NOT park in the front of the bulding During the week at rush Hours 7-9 am othewise you car will take away and you will receive a ticket.",
      "rate": 3.0,
      "tripDate": " August 2017"
    },
    {
      "title": "Truly terrible",
      "text": "We found this place through Expedia, and so we trusted it would be of reasonable quality. It wasn't. 10 ways it was bad:1. We arrived jet-lagged and with an exhausted 3yo. No street signage, had to call just to find reception, which was 2 doors down from the actual apartment. 2. We asked and paid for a 2 BEDROOM apartment. It wasn't. One bedroom, with a cot-bed in kitchen. 3. Although it was up a flight of stairs, it had a basement bunker vibe. Tiny and claustrophobic. 4. Worryingly, there was a sign on the door saying the place had failed an inspection by the Fire Marshall. We were too exhausted notice at first, but the place was dangerous.5. Constant knocks on the door from baffled would-be guests trying to find the reception. When we were trying to sleep. 6. Were told there was going to be an inspection of our room (by fire authorities, we presumed) at 9am, so we'd have to pack up our stuff. We were not impressed, said we were not going to pack up normal signs of living.7. Came back to find all our personal items had been placed in a clear GARBAGE BAG by management. Everything else (books, shoes) hidden in drawers. Astounded. 8. No curtains - not great for a jetlagged family. 9. No bedside lamps. 10. I can't think of a tenth. But do yourself a favour and don't stay here.",
      "rate": 1.0,
      "tripDate": " June 2017"
    },
    {
      "title": "Very Surprising",
      "text": "In Toronto for a trade show for 2 weeks. Tried this out. Very surprised, it was great. Not fancy. Had a large two bedroom for a reasonable price. The owner was great, and the building quiet.Looks a little questionable from the outside but surprising on the inside. I would highly recommend",
      "rate": 4.0,
      "tripDate": " November 2018"
    },
    {
      "title": "dirty appartements",
      "text": "Very disappointing. the appartement was dirty, dust all over, footprints on the tails, crap in the fridge, hairs in the batheroom and in the bed. To get to your appartment you get in a dirty case up and then walk across an appartement and then down again. the staff is not responding : I asked for cleaning, nothing happened ! and it is not cheap. It is situated far away of the city center.",
      "rate": 1.0,
      "tripDate": " July 2018"
    },
    {
      "title": "TERRIBLE !! Book at your own risk",
      "text": "A prison cell is in my opinion better than the room i had.No windows.FilthySkome odor everywhere.No ventilation.Very clostrophobic atmosphere.The Managers don't even care about your opinion or needs. It's like they did you a favour when letting you sleep there LOL Don't book ! you'll regret.",
      "rate": 1.0,
      "tripDate": " January 2018"
    },
    {
      "title": "Canadian Horror Story",
      "text": "The listing should be removed. This resembles a flop house. Abandoned skid row drug dens have finer amenities. This place is a travesty and it is a shame it even merits inclusion on any hotel booking website. There is no signage whatsoever and the address listed is inaccurate. Once we begged a nearby shop owner to help us get to the right entrance, we walked through the unmarked door to find the \"front desk.” Check-in was confusing. In all our years of traveling to many countries, we have never seen such a disgraceful space. It is inconceivable that the owner(s) of this hotel think it is acceptable to even offer this room. It was a crime scene. A petri dish of utter filth. But let's start with the hallway -- a bag of garbage and smelly dirty mop leaning against an adjacent door - there the entire time. Or the light sconce falling off the wall outside our door. Upon entry, we discovered a hideous love seat with butt stains on the fabric, and a filthy electric stovetop range with a broken plywood \"counter\" and walls that had only one coat of sloppily and haphazardly applied paint. There were greasy fingerprints all over the coffee table, dirty handprints on the walls, and perhaps the most distressing of all the squalor were the vomit/urine stains on the wall adjacent to the toilet. The inside of the toilet was equally terrifying. Green algae surrounded the shower drain. Lamps with no bulbs. The \"bedroom\" is really a hastily and cheaply renovated porch. There is a skylight directly above the bed with no shade. The floor of the bedroom had dirty footprints on it. The sheets had brown stains. Check-in took almost an hour we had no time to find another hotel and get to our meeting. Absolute worst hotel experience of our lives.",
      "rate": 1.0,
      "tripDate": " May 2017"
    },
    {
      "title": "Couldn't find the place",
      "text": "The only reason I am giving this a 2 rating is because I booked it through Expedia and they did everything they could to make this work then refunded my money when it didn't. Check in was to be at 3pm and we arrived early to ensure we were there on time as we had a function to attend.  By 5pm we still had not found the place and had to make other arrangements so we could get to where we needed to go.  We went to the first address we were provided and there was a notice from the fire marshal saying the place wasn't to code.  Then we found another address for a couple of doors up however that door was locked.  I walked up and down and around trying to find a sign or an entrance or something to indicate there was some sort of lodging establishment to no avail.  I'm not even sure to this day if the place even exists.",
      "rate": 2.0,
      "tripDate": " March 2017"
    },
    {
      "title": "You get what you pay for",
      "text": "The Dundas Apt. and Suites was definitely affordable downtown accomodations and I am not unhappy with my stay however it could have been better. There was a TV in the room but the cable that came out from the wall was to short to attach it, so no TV. The Wifi worked but it occasionally cut out. It had A/C but the unit was quite loud and woke me up, however it was hot and humid that weekend and I'm glad that I had A/C. The room was clean and the owner and staff were friendly. Location was good. Like the title says \"You get what you pay for\".",
      "rate": 3.0,
      "tripDate": " July 2016"
    },
    {
      "title": "Eclectic hotel in funky part of town, but works.",
      "text": "At the last minute I had to go to Toronto staying over a weekend. This is a weird city and downtown can sell out and prices can go through the ceiling. I had a few \"needs\": close to U of T, PLUS I NEEDED 3 BEDS IN TWO SEPERATE ROOMS BUT NOT AT $800 / NITE. Booking.com got me this place. It physical fit the bill. In fact room we got could have housed a sports team of 10. It was renovated in simple style, was clean, and fine to crash. This is downtown Toronto so it is Bums & Billionaires in the same block but for sure not Ghetto. Nothing to worry about. Close to very good Chinatown and so best in Asia food.Staff a bit hard to explain things to both on the phone and in person, like English is not the first language and things take a bit to explain. All in all for the money and location all good. If you need fancy not for you. Anything special be sure to explain clearly and 5 times.",
      "rate": 3.0,
      "tripDate": " February 2016"
    },
    {
      "title": "It is an okay alternative to a hotel",
      "text": "Many of the things said previously are true.  The area is very safe and I had no problems walking around before or after dark.  The place, though, is not exactly as advertised.  I was supposed to have a room with courtyard views.  Ended up with a room with no views (unless the skylight counts).  I am in one of the \"newer\" rooms which is clearly not done (no molding on the entrance door - hallway light comes in) and no cabinets in the \"kitchenette\". Also no rugs or floor coverings and nothing on the walls.  I think the place has potential - just don't think that ownership quite knows what they want to do or be yet.  So, yes, good value although expect to get what you pay for.",
      "rate": 3.0,
      "tripDate": " October 2015"
    },
    {
      "title": "So bad - OMG!",
      "text": "WTF... I thought my Uber driver got the address wrong. I arrived at 3pm but the roon wasn't ready. The street address given was actually a few doors down - a note was stuck on the window \"ring this number\"... so dodgy. The room was, excuse me... the worst I have ever been - it stings - the hygiene was terrible - the bathtub had cigarette burn marks. The heater didn't work. I had to get the other blanket from the other bed to double up. It was just terrible, terrible, _ucking horrible! Worst night ever. Do youself a favour - avoid this place.",
      "rate": 1.0,
      "tripDate": " October 2019"
    },
    {
      "title": "Found a mouse in my room",
      "text": "I booked last minute, the place looked alright at first, bathroom, small but functional kitchen, comfortable bed. Not two hours into my stay, I saw a mouse running through the room. I left immediately. Customer service to request a full refund was a nightmare, but I was able.to do so the next day. Would NOT go there again.",
      "rate": 1.0,
      "tripDate": " February 2018"
    }
  ]
}