{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Econo Lodge Inn & Suites Downtown",
    "url": "/Hotel_Review-g155019-d596575-Reviews-Econo_Lodge_Inn_Suites_Downtown-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.0",
      "reviewCount": 254
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "335 Jarvis St",
      "addressLocality": "Toronto",
      "postalCode": "M5B 2C2",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/23/e0/fe/24/hotel-exterior.jpg?w=500&h=-1&s=1"
  },
  "description": null,
  "featues": [
    "Free High Speed Internet (WiFi)",
    "Wifi",
    "Free breakfast",
    "Breakfast available",
    "Baggage storage",
    "Newspaper",
    "Non-smoking hotel",
    "24-hour front desk",
    "Air conditioning",
    "Flatscreen TV",
    "Non-smoking rooms"
  ],
  "reviews": [
    {
      "title": "Great hotel in a descent location",
      "text": "This hotel is easy walk to all the fun areas of downtown Toronto.  Not far from public transit and restaurants.  Unfortunately it does not have a elevator so dragging luggage to the 3rd floor was a challenge.  And the main door card reader was not functioning, but they were getting that looked into",
      "rate": 4.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Excellent budget hotel in great location",
      "text": "Stayed here five nights in April 2006. The hotel has only recently opened after refurbishment so everything is clean and new. Great location in Downtown Toronto close to all the main attractions and shopping. We even got free parking in the side street with the use of a permit from the Hotel. There is no bar, restaurant or other amenities in this hotel but at $80 CA (£40) including taxes this was one of the cheapest and best hotels I stayed in whilst touring Ontario. Some rooms have a fridge or computer; all rooms have TV, hairdryer, iron. Only slight drawback some visitors might find off-putting is beggars on the street corners asking for money but just say no and walk on. All in all excellent value for money.",
      "rate": 4.0,
      "tripDate": " April 2006"
    },
    {
      "title": "A decent and comfortable place",
      "text": "There are certain prejudices about this hotel that need to be dismissed:- The staff are efficient and friendly (especially the desk manager). However if you are inclined to ask them a dumb question (like where can I park my car) you are likely to get a curt reply.- The area around the hotel is EXTREMELY safe (as is most of Toronto). It is a great location (ex Allen Gardens, College street cars). But if you are the type who is afraid of friendly Ryerson University students (the campus is right next to the hotel on Gerard), then stay away.- The hotel has all the amenities one could hope for (AC, ironing board and iron, coffe maker, bedside reading lamps, cable, alarm clock). The rooms are clean. However, if you are the type who gets queasy over a plastered wall, a scratched table or a rusty rad then you should not travel at all. Just stay at home.- The hotel offers a complimentary breakfast (I had toasted raisin bagels with coffee and  bran cereal with milk) with a free newspaper.- I can imagine that the hotel could be noisy during the summer when it is full, but you would have the option of running the 9000 btu AC unit in your room to drown out the noise. I went off season (December) and the hotel was extremely quiet and warm.- Don't forget to tip the maid.",
      "rate": 4.0,
      "tripDate": " December 2013"
    },
    {
      "title": "Outstanding downtown budget accommodation",
      "text": "I believe I wrote a review of this place a few years back saying I was pleasantly surprised by the quality considering the low price.  Well, the same can be said again.  You can frequently get a room here for under $100 a night - cheaper than most Air BnBs downtown - and it's a perfectly nice room.  Unlike most two star hotels, where you're likely going to be dealing with stains in the bathroom, maybe some mildewy tiles or chipping tubs, dowdy looking furniture, carpets, and linens, the owners of this Econolodge seem to keep on top of necessary renos and keep the place looking inviting. This time we had a small room with a queen size bed, desk, fridge, drawers, tv, coffee maker and ironing board.  It had what appeared to be inexpensive flooring designed to look like hardwood, but it was in good shape.  There were no stains or chips on anything.  My partner, who worked in hotels for years, noticed one piece of stray cobweb in a corner that hadn't been cleaned, but I likely wouldn't have noticed.  Our bathroom had a clean, faux marble counter and clean subway tile in the bath/shower area. The price of the room includes free wifi and a modest, free breakfast (cereal, toast, bagels, fruit and beverages).  And the hotel is two blocks off downtown Yonge Street and three blocks to the College Subway station. Oh!  Also, the staff were great about accommodating our need for separate receipts for each night of our stay, one for me and one for my partner, because of our expensing needs.  You really can't get better value for your money in the heart of the city.",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Yaar at Jarvis and Gerard",
      "text": "The hotel is perfect. The price of the room is perfect. The staff are perfect. The breakfast is great. I toast the raisin bagels and slather butter on them with a fresh banana. There is plenty of hot water for making tea. The place is clean and the rooms well heated or cooled (a large modern unit in the room below the window). The only way you could hear noise outside is if you stuck your head out the window. And the area is not all that noisy for a major downtown intersection. It would be disingenuous to complain about noise in the center of a large city like Toronto. The people who live and frequent the area (including the lovely Allen Gardens plant conservatory across the street) are wonderful. Some are down on there luck, some crazy, some eccentric some just tourists like me. Toronto is a pathetic city but the Econo Lodge is an exception that makes the city much more bearable.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "GREAT NEW HOTEL",
      "text": "Nice staff. Easy to find overnight parking a block or two away. Tim Hortons and 24 hr food close by. Was a lot of fun seeing Toronto and Allan Gardens nearby. Also the old maple leaf gardens is close, as well.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Bedbugs",
      "text": "Do not recommend. Infested with bedbugs and the staff did absolutely nothing about it. Had horrible bites all over. No doubt that there were bedbugs. Manager was extremely rude when we brought it up to him and called us liars. Do not recommend this hotel at all. The management is corrupt and rude.",
      "rate": 1.0,
      "tripDate": " July 2015"
    },
    {
      "title": "Stay here only if you REALLY have to..",
      "text": "We came to this hotel after spending a night at Comfort Inn right next to it. Rates were better and the room is way more spacious so the hotel did not seem that bad in comparison to our terrible experience the night before. We stayed here for 2 nights. Wi-Fi connection was very bad especially at night. Breakfast is a joke. They only had bread, cheese and cereal. They ran out of juice and did not bother to refill even the next day! They lock up the coffee machine so you have no access to it throughout the day.I wouldn't even recommend it for just a place to sleep since the pillows and mattress were not comfortable at all. The bed sheets were stained too so cleanliness is not all that great either.I would not recommend and would not stay there again..",
      "rate": 2.0,
      "tripDate": " April 2016"
    },
    {
      "title": "Great Stay at an Excellent Rate!",
      "text": "Excellent budget hotel in downtown Toronto. Just minutes from Eaton Centre by walking and at great savings in room price. Hotel was clean and nice, but no elevator for the upper floors.We had a very nice queen size room and was well taken care of by the staff. Even saved a gift that I mistakenly placed near the trash and the staff kept it and asked us about it. Very friendly and honest. Would definately stay there again when next in Toronto.",
      "rate": 4.0,
      "tripDate": " December 2006"
    },
    {
      "title": "I Will not stay here again ... an honest review",
      "text": "Spent one night here on May 27th ( I have stayed here 3-4 times before over tye last 10 years ).    Each stay the hotel has gotten worst in being run down, tired and dirty.  My recent stay has made me decide to look to other hotels when in the Toronto downtown core.  Staff are great ... But i require a clean and confortable room.     I took a pic if the office chair in my room.",
      "rate": 1.0,
      "tripDate": " May 2017"
    },
    {
      "title": "A dump",
      "text": "I have stayed at Choice Hotels in the past and had an idea of what to expect, but this place is a dump. I had a queen bed room on the third (top) floor. It was extremely tiny, old, the room smelled of smoke, the walls and carpets are stained, the bed has stains and cigarette burns on it, and the furniture is falling apart. My friend and I had to buy a can of Febreeze to get over the smell (we used the entire can). There were no other rooms available, as there's a big convention in town and the city is sold out. The hotel does seem to be doing some retrofitting, there were boxes of LCD TV's in the lobby to replace the current old CRT TV's in the rooms.  It feels like a very old building, and has no elevator. Don't expect any more than a small dirty room with a bed. If you're used to cleaner and more modern stays, like Sheraton, Four Points, Garden Inn, Holiday Inn, Radisson, Best Western, Super 8, etc, try to find that instead.",
      "rate": 1.0,
      "tripDate": " March 2013"
    },
    {
      "title": "Smokers paradise~!",
      "text": "My room was small but had everything I needed incl a small fridge. Now the bad...Advertised as a non-smoking room and floor however, I've smelled less smoke in a casino!  It was disgusting!  I think everyone on the floor was smoking something and it was all seeping into my room to the point where my eyes were stinging.  Called the front desk and their solution was to spray some sort of aerosol disinfectant.  My solution would have involved fines and getting medieval on some of the smokers on my floor.",
      "rate": 2.0,
      "tripDate": " July 2012"
    },
    {
      "title": "great location!!",
      "text": "great location,we were flying in late from Chicago and as we had stayed here before we made another reservation for our late night arrival. The breakfast is very good for an Econolodge and may me better then some of the Quality/Comforts we have stayed in.",
      "rate": 5.0,
      "tripDate": " December 2019"
    },
    {
      "title": "Good basic accommodation",
      "text": "It's hard to find a decent hotel for around a $100/night in downtown Toronto. In that context, the Econolodge is outstanding. Our room was recently renovated. Bed was super-comfy. Nice washroom and good water pressure. Free Wi-Fi was fast and reliable. Staff members were friendly and accommodating. Continental breakfast was simple but fine. Short walk to Yonge Street and subway. Our room fronted on Jarvis St, but no street noise. Note: no elevator in this 3-story building.km",
      "rate": 5.0,
      "tripDate": " November 2019"
    },
    {
      "title": "Great little hotel. Hidden Gem",
      "text": "Newly renovated rooms. Very clean. All staff were pleasant. Great cheap stop over to see Raptors game. 20 min walk. Nice continental breakfast everything was fresh.Parking available at Ryerson on Gerrard st.Would reccomend you stay here",
      "rate": 4.0,
      "tripDate": " October 2019"
    },
    {
      "title": "Great Location",
      "text": "Great location and easy access by walking or local transportation to downtown, staff was really helpful even they help us with our luggage. Also, rooms are really nice and comfy. I will just add more options for breakfast.",
      "rate": 4.0,
      "tripDate": " October 2019"
    },
    {
      "title": "Nice stay, good location & reasonable price",
      "text": "Leo at the front desk was very nice, overall very nice experience, great location near the village, not too far to the subway station (I walked to Eaton Center, not that bad), huge Loblaw with LCBO on the second floor. Breakfast included (toast, bagel, cereal, coffee, juice, banana) & free cancellation",
      "rate": 5.0,
      "tripDate": " October 2019"
    },
    {
      "title": "Good quality value ratio",
      "text": "It is always difficult to give an assessement about a hotel because the expectations differ depending on the price paid and the location. The price paid has also to be compared to the hotels in the same area. Toronto is fairly expensive and i would have given one less star if we were in a cheaper city.Positive aspects:The hotel is fairly well located. The \"College\" station is at about 5 min walk. The area behind the hotel is however not very nice.The rooms are fairly large and cleanFor Toronto, it is fairly cheapThe people at the desk are OkAbility to have your morning coffee in a take away cup Good wifiNegative aspectsThe rooms are not soundproof enough. It can be fairly noisy actually.The breakfast is quite basic (toast, butter, jam or cereals). No viennoiserie as you would have in Europe.The breakfast is not very ecological: plastic cup, plastic cutleries, plastic plates, tiny packs of butter... i don't see the rational behind as proper cutleries and plates would not cost that much to wash. Also, the jam, butter in tiny plastic packages is just the worst thing to do ....",
      "rate": 4.0,
      "tripDate": " September 2019"
    },
    {
      "title": "Perfect for my needs",
      "text": "A short walk from the streetcar stop at Carlton and Jarvis. The Allan Gardens Conservatory is five minutes away (you walk by it on the way from Carlton), and downtown not much farther. The room was modern, clean, and well-prepared.  I slept well and awoke refreshed after a tiring day. Closet space was limited. There is no elevator. Good wifi.",
      "rate": 4.0,
      "tripDate": " August 2019"
    },
    {
      "title": "need for sleeping",
      "text": "If you need a clean room, comfy bed, friendly service and with an affordable price downtown Toronto then you'll like it. If you want to experience a fancy hotel in an upscale neighbourhood, (which I sometimes do), then you won't like it. Great location to sleep when visiting your University kids!",
      "rate": 4.0,
      "tripDate": " August 2019"
    },
    {
      "title": "Not infant friendly",
      "text": "AVOID this hotel if you are travelling with infant. There is NO elevator. We were told that the hotels of old part of Toronto have similar situation. Although hotels across the street are equipped with such facilities (though not very user-friendly!) We didn't check that before and that was a big mistake. We were travelling with our 6 month old baby and we checked at around 11 pm. Initially we were offered a room in second floor, but we realized that we have to move up through the stairs with the stroller! Fortunately there was a room available in the ground floor, so we didn't have to do that. That room had stairs within it, I wish I took some pictures of it! In the morning the breakfast was horrible! Almost no bread, no eggs. Although I must admit that the staffs were quite helpful.",
      "rate": 2.0,
      "tripDate": " September 2017"
    },
    {
      "title": "Close to Allan Gardens",
      "text": "3 star hotel but all rooms have a fridge, coffee maker, toiletries, flat screen tv, free wifi,iron/ironing board. Complimentary breakfast (muffins, bagels, cereal, juice, tea/coffee.Free local newspaper and lots of tourist info. $9 taxi ride from Union Station.Great price $75/night   $134 weekends.10 min walk to Eaton Centre & Dundas Subway station. Harvey's across the street.1 block south of Allan Gardens. Very close to Ryerson University.",
      "rate": 4.0,
      "tripDate": " February 2016"
    },
    {
      "title": "It IS what is IS.",
      "text": "If you're looking for a no-nonsense, clean, respectable hotel than Econo Lodge is for you.  There's no valet to park your car, there's no bar as you enter the lobby and there's no bellhop to walk you up to your rooms with your bags. All you get is great service from the staff from the moment you check in.My room was exactly what I needed.  It had a clean bed with fresh linens, a tv for watching, lamps for lights, a mini fridge for pop, a coffee maker and a bathroom.  It was a perfect temperature too.If you're a no-frills kinda traveller and you want excellent quality at a great price, then set your sights on Econo Lodge.  Best value in the downtown core.",
      "rate": 5.0,
      "tripDate": " April 2015"
    },
    {
      "title": "A bed and a bath",
      "text": "Spent 2 nights at this hotel, the staff was friendly. The room was a bit dusty, the bed comfortable, the view out our window was an old turned over wheel barrow, stones and a high wall. The complimentary breakfast was very simple almost not worth the effort to go, but I suppose for the price ok. Easy walking to most places in the city. The hotel can do with a lot of tlc. At least we had a bed and a bath.",
      "rate": 3.0,
      "tripDate": " July 2014"
    },
    {
      "title": "HORRIBLE! discriminatory staff, tv cable not working, possible bedbugs, noisy AC, bad neighborhood",
      "text": "The list of bad things about this hotel goes on and on, the only good thing was that the bed was comfortable. The neighborhood is full of crackheads and prostitutes, I checked in after a long drive at 5am after booking this on hotwire.  The booking said \"pet friendly\" and no checkout time was specified.  First thing that happened after I got my room key was the front desk guy (Expedito) phones me to say that \"check out is at 11am\" - which was not specified in my hotwire documentation, nor was he able to prove that to me.  Most hotel check out times in Toronto is noon, but what I found most irritating was the fact that immediately after I entered the room he is on the phone telling me about the check out time as if \"we can't wait to get you out of here\". That has never happened to me before, he didn't even give me a chance to put down my bags and review the hotel policies in the binder on the desk.  Speaking of the binder on the desk, it did not include a WIFI password, and I could clearly see that checkout time had once been noon, and was now whited out to say 11am.  I felt like the guy at the front desk was being discriminatory towards me, so even though I wanted the wifi password, I was too upset to call back and ask him for it. Not to mention, the booking had been paid for on Hotwire and the payment went through, but he was trying to tell me that I gave them an incorrect Mastercard when I don't have a Mastercard, I only have a Visa - something seemed not quite right about that. The next thing that happened was that the TV cable connection was not working properly. There would be lines going down the screen no matter how hard we tried to tighten it.  The  \"A/C\" unit in the room is one of those external ones with a hose that is suuper noisy, made it hard to sleep.  When my boyfriend came into the hotel with our dog, the front desk guy ran into the hallway and yelled at us \"how are you going to pay for the extra pet fee\"  not taking into account that it's after 5am in the morning and he might wake other guests.  I told him I wanted to sleep and that I'd take it up with front desk at checkout.I awaken at 11am sharp by the next front desk woman (Hason sp?)  telling me I need to leave or they're going to charge me for another night.  SINCE WHEN has this ever happened that a hotel can't give you a few minute's grace for checking out? They were clearly discriminating against me for whatever reason. She then reminded me about this \"pet fee\" that I was never aware of in the booking and proceeded to charge me 20$ plus tax.  She was extremely rude.The cherry on top is that when I got home I found a bedbug in my suitcase.I would not recommend this hotel to my worst enemy.",
      "rate": 1.0,
      "tripDate": " June 2014"
    },
    {
      "title": "Bargain for the location",
      "text": "Within walking distance of the CN Tower, waterfront and greyhound station we found this to be outstanding value. Clean room, very comfortable bed, good bathroom and shower facilities and extensive choice of cereals, fruit, croissants and bagels, juices plus toast with jams and marmalade and tea or coffee for breakfast. Highly recommended for just over $100 per night.",
      "rate": 4.0,
      "tripDate": " June 2014"
    },
    {
      "title": "Hotel is a little run down... wouldn't book again",
      "text": "Hotel check in staff were very friendly and lobby area and bathroom were clean.  Stayed in a \"suite\".  Consisted of two double beds, a very small table and chairs and a set of stairs which led to a very cramped and dark area with a tv and pull-out couch.  Furnishings and room elements were very tired and dated and one bedspread had a hole in it.  There is no convenient area to park to unload your luggage and breakfast consists of continental items only.  Would not stay again but there is a Comfort Suites almost next door from the same hotel chain that is a much better stay and includes a full breakfast.",
      "rate": 2.0,
      "tripDate": " April 2014"
    },
    {
      "title": "Reasonable place with some concerns ",
      "text": "This Econo lodge hotel is not much different from the others I've already stayed in. The room is fine with good space and clean stuff. What concerned me about this hotel in Toronto was the difficulty to unload the bags from the car (there's no place to stop in front of the hotel nor park). You have to do things in a real hurry if you don't want people to be angrily honking their horns behind you. We had to leave our car parked on the street because the nearest paid parking lot cost about 25 dollars plus taxes the overnight. Something else to be pointed out is safety. The windows from the second floor, for example, give view to a short roof which can be easily climbed from the street. I'd be no surprised to see someone staring at my room through the window, that's why I left the curtains closed during the entire time of my stay. The place is an option to stay shortly, but if you are up to spending a bit more for comfort (no elevator = carrying heavy bags along the corridor carpets) and security, try somewhere else!",
      "rate": 3.0,
      "tripDate": " February 2014"
    },
    {
      "title": "Run for your Life",
      "text": "We arrived and saw no place to pull off the street to register so I made the block.  Within 100 yards of the back of the hotel there is a free medical clinic and the streets were lined with over 100 homeless, mentally ill or drug depedants folks and one 6 foot tall cross dresser soliciting business. As we completed the block, there never was a place to pull over so I stopped in the traffic lane as close to the front door as possible.  My wife was going in to see where to unload but she had her path blocked at the entrance door by a woman who was obviously high demanding money.  The clerk came out and ran her off.  My wife was told that we had to pull into another business down the street and carry our bags up the sidewalk.  We had had a long day and it was getting dark so we decided to stay and barricade ourself in the room.  I parked the rental car in an unguarded public parking lot about three blocks away, paid my $20.00 and drug my suitcases back down the street.     When you enter the front door, you immediately go down 6 steps to get to the front desk.  The coffee machine and the ice machine both had out of order tags on them.  We were shown to our room which on on the first floor street side.  The other option was third floor with no elevator.     Once in our room, we realized that because the first floor is down in a hole, that the bottom of our window was even with the side walk.  Six feet away was a busy street that had traffic all night long.  There was a small fridge but the freezer compartment was completely frosted closed.  The phone cord was partially pulled out of the wall and the phone was dead.  The air conditioner was a portable unit that sat in the floor and had a 6 inch flexible exhaust like a dryer vent about 8 feet long that connected to a piece of plywood with a hole cut in it that replaced the window glass.  If you sat immediately in front of the vents you got cool air.  The rest of the room was heated by the exhaust tube.     It was dark now but we were hungry so I went alone to a small burger joint across the street to get something to bring back to the room.  I believe it was called Harry's.  It was comletely dark by now and the free clinic had apparently closed because the streets were filled with those folks who had been in street behind the hotel.  As I made my way back across two streets, I felt like I was in the movie, Night of the Living Dead.  I made it to the room.  The burgers were remarkable so at least there was one high point.     You can't make this stuff up.  If you value your safety, stay somewhere else.",
      "rate": 1.0,
      "tripDate": " August 2013"
    },
    {
      "title": "I'll stay somewhere else next time.",
      "text": "We paid about $100 per night while prices next door were $45 per night. The location is within 30 minutes of the major attractions. No parking at the hotel. We had to pay $20 per day to park a block away and carry our luggage. The hotel appears nice and clean when you walk in the front door. However, our \"non-smoking\" room had cigarette burns throughout the bedding and on the floor. The bedding also contained hair. The ceiling had several leaks. The bathroom only had 1 hand towel and 1 wash cloth. We had to go to the front desk each day to ask for towels, which were stained. Be prepared to walk up stairs, no elevators. We were on the 3rd floor. The continental breakfast contains: bagels, bread, cereal, milk and juice. We opted to have Tim Hortons. We did come across several homeless people around the hotel. We will read reviews before making reservations next time. Very disappointing.",
      "rate": 2.0,
      "tripDate": " March 2013"
    },
    {
      "title": "Great Hotel and Close to Eaton Centre.",
      "text": "This hotel was absolutely fantastic  and the staff were all so helpful and friendly. There is a 24 hour Rabba Store close by and its within walking distance to The Eaton Centre in Dundas sq. Rooms seemed to be newly furnished and very clean and modern. Housekeeping staff are meticulous and changed the beds daily. This hotel is also in walking distance to Church Street where all the great bars are. Would definitely stay here again.",
      "rate": 5.0,
      "tripDate": " June 2015"
    },
    {
      "title": "A failure of a hotel",
      "text": "The area is filled with aggressive drugged-addicted panhandlers, not a block from the hotel a woman asked me for money multiple times and when I refused she offered her 'services' (I have never come across that in my entire life). The heat in the room didn't work, the florescent light in the bathroom never fully turn on and just flickered, there is no floor space so opening your suitcase and walking are mutually exclusive, and they have a large air conditioner taking up floor space with an industrial hose going to the window, there was no do-not-disturb door hanger and I was disturb by the cleaner, and all day and night you can hear people and traffic on the street outside at full volume even with the window closed. I phoned and arranged a late check-out (promised to me by my rewards program), but either they didn't take note of it or they chose not to honor it and they harassed me the next day. Even the WiFi was slow and intermittent. And Jacob at the front desk is extremely disrespectful and has no business working in customer service. Why would a hotel hire someone that 'puts on airs'?",
      "rate": 1.0,
      "tripDate": " April 2015"
    },
    {
      "title": "Simple but clean",
      "text": "It's a simple place, but we had all we needed in the room. The room was very clean. Some repairs are needed, but the cleanliness of the place and the kindness of the front desk people made up for it. :)There is also continental breakfast and free wifi. We felt cozy and welcomed.",
      "rate": 3.0,
      "tripDate": " March 2015"
    },
    {
      "title": "Good stay, and I'll come again",
      "text": "I stayed two nights at Econo Lodge. It was one of the lowest priced hotels in the city, but I was pleasantly surprised -- and I will stay here again.  The only downside was slightly weak shower pressure, but other than this, it was great.  Breakfast was good, and wifi internet worked great.This is a good location on the edge of the university.  It's a safe area and reasonably close to things: 3 min walk to Carlton/College streetcar; 10 min walk to College subway station; 5 min walk to the best Loblaws store in Toronto (groceries & ready food).Parking is a bit difficult, as with everywhere in the downtown.  There's a lot near Yonge & Gerrard that's $12 for a full 24 hours of parking, but no in-and-outs.  A closer lot just one block north is $23 for 24 hours, but you can do in-and-outs as long as it's not packed.",
      "rate": 4.0,
      "tripDate": " January 2014"
    },
    {
      "title": "Homeless people and prostitutes",
      "text": "The hotel is the most basic which is to be expected...the bed was comfy and the rooms were clean-ish. However it backs on to a homeless shelter which made me very uneasy and I was harassed for change every time I entered. Furthermore there was a prostitute standing outside the front doors when we arrived after dinner. Hotel was alright but I felt very unsafe. Will never stay there again...",
      "rate": 1.0,
      "tripDate": " March 2013"
    },
    {
      "title": "Interesting....",
      "text": "Hello, I'm currently lying in the bed of this hotel waiting for my friends to wake and I thought I would take the time to review! So here goes... Sign in was quick and easy overal pretty painless we were given two keys and quickly came to our room.. After reading lots of reviews I was worried room would be in distraught in major need to a face lift but I was plesently surprised to open door to a clean, cozy space with high end upgrades... The room included two beds a pull out sofa and a fridge ( which I requested prior to our arrival).The location and price of hotel can not be beat we paid just 115 for the night which is crazy for four ppl in the core of the city...! My only complaints are the heating and cooling I could not for the life of me figure out how to get the heat off and ac on... So we slept in 30degree weather which was slightly uncomfortable also... The windows open which is nice but there are no screens and in this neighbourhood who really feels like leaving a window open...? Also the ppl staying above us were either morbidly obese or enjoyed pacing back and forth all day and night... Walls are apparently paper thin which kind of sucks!Overall it exceeded my expectation! Will def come back again!",
      "rate": 3.0,
      "tripDate": " February 2013"
    },
    {
      "title": "Good hotel for budget minded travellers",
      "text": "This is a good budget hotel in downtown Toronto.  I paid $88.00 CAD. (taxes incl.)  This included free internet, air conditioning, TV, hairdryer, and continental breakfast.  The room wasn't in the best of shape and there was dust on the furniture.  There were several cigarette burns on the carpet, markings on the wallpaper, and damage on the washroom ceiling, but the queen bed was comfortable.",
      "rate": 2.0,
      "tripDate": " May 2007"
    },
    {
      "title": "Good value for downtown hotel",
      "text": "Window that opens. Shower. Comfortable bed. Fridge. Coffee maker. Great service. Close to downtown. What more could you ask for? Not a luxurious place but I wasn't planning on spending much time in my room anyway. Perfect location and amenities for the price I paid. I'd stay there again. I'll stay there again.",
      "rate": 5.0,
      "tripDate": " August 2019"
    },
    {
      "title": "Sleep overnight ",
      "text": "I was pleasantly surprised with the property . Stylish , clean and professional front desk clerk . Breakfast not really appealing but if you want to save your money you have it free. The wall bathroom were not properly clean but I would leave with it. I do recommend the in this place .",
      "rate": 4.0,
      "tripDate": " March 2018"
    },
    {
      "title": "Bedbugs, mice, filth...stay away!",
      "text": "Most ghetto hotel in downtown...very close to the largest mens shelter so there are lots of transient folks around, asking for change, lots of sex workers close by at night. I can deal with that...but I swear I brought bedbugs from this hotel to my next hotel. The sheets were smelly, and my room was dirty. I could also hear mice through the walls running around. I was later awakened at 4am by a lady screaming on my floor for some reason. I felt very unsafe. I cancelled my reservation for the second night. I short, I tried to save $ but its ghetto. you get what you pay for, my bad.",
      "rate": 2.0,
      "tripDate": " December 2017"
    }
  ]
}