{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Edward Hotel North York",
    "url": "/Hotel_Review-g155019-d188299-Reviews-Edward_Hotel_North_York-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "2.5",
      "reviewCount": 50
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "185 Yorkland Blvd",
      "addressLocality": "Toronto",
      "postalCode": "M2J 4R2",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-s/02/76/94/8a/meeting-room.jpg?w=500&h=-1&s=1"
  },
  "description": "Edward Hotel is located conveniently off Hwy 401 and 404 in North York. Complimentary parking and WiFi are available throughout. There are 290 beautifully renovated rooms situated across 10 floors. The hotel features an on-site restaurant and lounge, a self serve business center, on site ATM machines and 24 hour reception. Each room is equipped with a flat-screen TV, an alarm clock, a coffee maker and a large work desk with ergonomic chair. The hotels offers a sophisticated and comfortable stay for both business and pleasure seekers. Attractions Nearby: Don mills Subway- 1.1 km Fairview Mall- 1.3 km Seneca College- 3.6 km Ontario Science Center ; Aga Khan Museum- 8.6 km Toronto Pearson Airport- 28 km Downtown Toronto- 20.8 km",
  "featues": [
    "Secured parking",
    "Free High Speed Internet (WiFi)",
    "Fitness Center with Gym / Workout Room",
    "Pool",
    "Bar / lounge",
    "Nightclub / DJ",
    "Business Center with Internet Access",
    "Banquet room",
    "Wifi",
    "Indoor pool",
    "Restaurant",
    "Breakfast buffet",
    "Kids' meals",
    "Snack bar",
    "Special diet menus",
    "Wine / champagne",
    "Vending machine",
    "Meeting rooms",
    "Baggage storage",
    "Non-smoking hotel",
    "Picnic area",
    "Shared lounge / TV area",
    "ATM on site",
    "24-hour front desk",
    "Express check-in / check-out",
    "Dry cleaning",
    "Laundry service",
    "Self-serve laundry",
    "Air conditioning",
    "Housekeeping",
    "Safe",
    "Bottled water",
    "Microwave",
    "Refrigerator",
    "Non-smoking rooms",
    "Suites"
  ],
  "reviews": [
    {
      "title": "Read!!!!!",
      "text": "Dont expect a great clean room... the spa is worth going... owner was amazing!!! The restaurant was good just very simple. The room had bug traps and pubic hair in the with the gate 2014. I asked to have a clean room.. there was dust on the walls  too.. just thick and was falling onto the bed... it looks like a really old hotel that someone is trying to re camp..  I appreciate all the hard work  that has been done but the pool liner is falling off so you can feel it when you swim on your feet. The hot tub is closed ... they have a wicked fire pit out back but they dont use it. The spa was honestly so well priced and the owner there gave my son a free manicure..she was so so sweet!Close to the mall but not going to go back until Reno's are done. ...",
      "rate": 3.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Oaky Hotel",
      "text": "We hadn't read the reviews before we booked, so we were obviously quite worried. We didn't notice any of the issues mentioned by others, thank God. The hotel foyer is nice, the breakfast was okay, the rooms were okay, although some of the hallways need a new paint job. The value wasn't great based on the reviews and the condition of the rooms, hallways, etc. However, the bones of the hotel seem good and hopefully they can do some upgrading to acquire better reviews. Also, if you don't have a CAR, there's nowhere to go - everything is far, far, far away.",
      "rate": 3.0,
      "tripDate": " December 2019"
    },
    {
      "title": "Okay Hotel - doubles as long term refugee residence, for the last 8 months at least.",
      "text": "The hotel itself is okay, it's a little dungeony (black exterior,  black stairwells, dark halls, dark carpet) and lots of damage.It's the kind of place you want to take pictures of any room damage as soon as you arrive because there's lots of gouges on the walls, and you probably don't want to get stuck with paying a fee for the damages that you didn't cause.The food at the hotel restaurant is mediocre at best.The Wi-Fi is very poor and constantly cuts out.My room was okay, clean, but a lot of scuff marks and gouges on the wall.The best features in the room are the waterfall shower head and air conditioning.When I arrived my room didn't have bath towels so I called the front desk and they told me I had to come down and get them myself. I told them that's their job to ensure my room is equipped. The cleaners were out in the hallway so I asked them if they had some... they didn't but radioed to the front desk and then the front desk finally brought them up.",
      "rate": 2.0,
      "tripDate": " August 2019"
    },
    {
      "title": "Lovely clean hotel",
      "text": "Had to be at hospital in North York early so decided to stay at hotel to avoid the stressful morning commute.  The Edward is a very clean hotel.  Looks newly renovated. They would have gotten an excellent rating if the beds were a little more comfortable.  Good parking and a decent rate.  We ended up staying there 2 more times in the next two weeks!",
      "rate": 4.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Scam, Stay away",
      "text": "After noticing that they were not  re depositing my security deposit of 200$, I called the hotel and found out that they were falsely accusing me of smoking in the room and keeping the security deposit. I am a non smoker, and yes during one of the nights I was there, somebody was smoking somewhere, and the smell was coming into my room threw the poor ventilation. After making many calls, and verbally fighting with managers and front desk, I finally got a promise of reimbursement.  Still have to see the money. Stay away, if not be warned. Such an easy way to scam clients !!!!",
      "rate": 1.0,
      "tripDate": " April 2018"
    },
    {
      "title": "Cockroaches and Fraudulent Pictures",
      "text": "This hotel knows very well what it’s doing on Expedia they do not call list hotel and we’re village they call it the Edward hotel North York they have put money into the lobby making it look modern fresh and clean but behind the elevator is like a glass door you enter what used to be apartment living spaces completely non-renovated every level has ripped wallpaper stained carpet dark brown stains all along the walls and chipped paint in addition to cigarette stain ceilings. If you check out the pictures for Edward Hotel North York the hotel looks like a beautiful boutique style modern stay we entered our room past other rooms where people were clearly cooking ethnic food in their rooms and staying long-term to find a room completely in habited by German cockroaches!!!!! Shame on this company for putting the pictures out on their website that are not a true representation of the business they are offering!",
      "rate": 1.0,
      "tripDate": " August 2019"
    },
    {
      "title": "Work trip",
      "text": "If you are going on a family vacation be cautious. This hotel felt off. I was not comfortable taking stairs. I did once, and ran into kids running the stairwell with soccer balls, toys etc. They were everywhere by themselves.  I saw gobs of something on walls and floors and it stunk. I became curious about this. It felt odd. I selected this hotel due to the price n location . Breakfast is not included, but there is a Tim’s up the street. You can walk to Fairview mall as well. This was not a leisure trip, so I did not use the pool and other amenities. However I did check it out. It appears like people are living there. They took over the pool. Kids running around with toys.  Chaos. Not a pool you want to hang out at. I felt uncomfortable. I was only staying one night so I didn’t check reviews.   It was Very noisy in the evening. I Could hear someone drilling into a wall or something around 9:30pm. I had a room that could adjoin to another room so I put chairs against it. I just didn’t feel comfortable there.  The rooms were decent for the price . We had a good sized fridge n microwave and the bathroom was new n redone. One night in and out was enough. I won’t go back. I will pay more n go with Marriott. Today I was  reviewing a comment about potential asylum seekers staying there, it made sense to me. This hotel is housing people. Also, when our elevator was brought down to the basement. I saw the the same kids running around down there.",
      "rate": 1.0,
      "tripDate": " August 2019"
    },
    {
      "title": "*WARNING* Refugee Residence Hotel - Do not book!!!",
      "text": "We decided to book this Hotel as it was the closest Hotel to our Birthday destination. Since we live in Burlington we didn't want to do the drive due to the weather/drinking/time. We checked in and immediately left to meet with up my Parents for dinner in Markham. Before getting ready for the Birthday party at 7:00 pm we decided to go for a swim and explore the Hotel. This was a huge mistake - the pool liner was falling into the pool, their was garbage all over the hotel and individual floors. There was dirty laundry laying in the hallways. It was quite disgusting. On the way back to the room to prepare for the party there was a gentlemen who worked there waiting for the elevator. I asked him why their were kids running all over the place, playing \"elevator tag\" and the running noises above us - his reply absolutely shocked me. This hotel is a refugee residence. I checked on the website thoroughly as well as Expedia's who I booked with - and neither of these disclosed this information. We felt disappointed that this information was not disclosed. We proceeded to our room to get ready and upon entering the room - we found the bathroom to have bugs crawling on the counter. This prompted me to walk around the hotel to take pictures of everything. I called Expedia and they were shocked - they told us to check out of the hotel and they were going to refund us in full. But this left us with nowhere to stay except to drive home since the other Hotels in the area were all booked. This hotel caused our weekend getaway to be a complete disaster. The Hotel offered no help and seem to not care at all.",
      "rate": 1.0,
      "tripDate": " January 2019"
    },
    {
      "title": "Too much bad reviews but not for me!",
      "text": "Honestly, I was ready to be disappointed when I read reviews about the hotel. But, when I reach the hotel, I was greeted so well by a chinese lady at the reception which gave me 3 complimentary breakfast for the 8 nights I was there. The room was really clean, and the toilet looked good too. There was even a microwave in the room and a nice coffee machine. The bed was clean, the room had all the necessity I needed. There was a false alarm at 1am when I was there which pissed me off as I was sleeping, but that was a one off thing. I can see there were people who lived in the upper stories of the hotel. They weren't particularly noisy or anything. They were helpful. but more of it, i was happy that we are housing refugees/asylum seekers in that hotel, it means a lot to me. The check out was smooth, everything I needed was given well. Just breakfast doesn't have much variety, which if you think it matters to you, then dont purchase it. (:",
      "rate": 5.0,
      "tripDate": " April 2019"
    },
    {
      "title": "Very quiet room ",
      "text": "Everything you want in a hotel:Super friendly staffSuper comfy bedAmazing shower with 5 sprays and two nozzles!Very quiet rooms. Breakfast is included. Eggs are awful and yogurt & granola are okay. Coffee is okay too although I held out for SB. Photos are from hotel restaurant. Hamburger is pretty good if you’re starving:)",
      "rate": 5.0,
      "tripDate": " December 2018"
    },
    {
      "title": "Pleasently surprised",
      "text": "Due to last minute arrangements, we booked a one night stay at this hotel as it looked good and the price was reasonable. After reading some of the reviews posted by others, it made us have second thoughts but thought its for one night.... I am glad we chose to stay. From the warm friendly greeting upon  check in to the spotless lobby and comfortable clean room,we were impressed. The rain shower head with massage jets felt good after a long day sightseeing.  only minor complaint was the mattress was quite firm. The next morning  we chose to have breakfeast at the hotel. Having never stayed here before, we werent sure where we paid etc. Sadly i didnt get her name but the lady looking after the breakfeat was very nice and asked if we had coupons for it, we said no and she asked to wait while she checked with the front desk. I followed her and the man behind the desk advised that online bookings dont include breakfeast. I explained we had never stayed here before and he asked how many in our party, i said two, he gave me two complimentary coupons for the breakfeast which was a very nice and much appreciated gesture. Breakfeast was delicious!! Thanks to all rge staff for a very enjoyable stay!!",
      "rate": 4.0,
      "tripDate": " May 2019"
    },
    {
      "title": "No cable and weak wifi",
      "text": "The cable was out for the entire night I was there. I was in town for a conference and after a long day, I just wanted to relax and watch some brainless tv.....not possible when the tv isn't working. The wifi is very weak and although I was able to access it, it was so slow that it was difficult to even open my emails.I like to take the stairs rather than the elevator and the stairwell smelled of urine.On a positive note, the staff was very friendly, the room was clean, and the shower was fantastic! Also, although there weren't many choices in the restaurant, the food they did have tasted great.",
      "rate": 2.0,
      "tripDate": " May 2019"
    },
    {
      "title": "Pleasant Business Stay",
      "text": "I stayed for one evening.Yes, it is true that it is a refugee hotel, but there are no problems here that I found except with the outside guests, whom I found many be very judgmental and racist.Right from the moment I walked in, several began warning me to watch out and not to leave my bag or it would be stolen.We are in THEIR home. Have some respect and check yourself. And they are here to live and take care of their families, do you really think they're concerned with risking their homes to try and steal your suitcase from you old man!? Shaking my head.Yes, they're are some children running around playing, but only during appropriate hours like a regular apartment building or hotel and nothing out of line. Just children having fun.No excessive noise, smells, bugs, or otherwise. Just regular wear and tear from a busy, well-utilized hotelThank you for your service. 🤗❤️",
      "rate": 4.0,
      "tripDate": " May 2019"
    },
    {
      "title": "Good but not great",
      "text": "I found this hotel to be clean and efficiently run.Good value for the money. I have no complaints ,everything went smoothly. It isn't cozy. It is a good basic place. The staff were friendly and available.",
      "rate": 3.0,
      "tripDate": " September 2018"
    },
    {
      "title": "Friendly staff, great restaurant and a beautiful suite",
      "text": "This was our second hotel in T.O after our first hotel was less than adequate and in a shady part of town. Not how a person wants to start their first time experience toToronto.  Any who, THIS hotel is beautiful and exceeded all our expectations (there was three of us travelling together). We ended up in one of the suites and it’s wonderful! Friendly staff and a great restaurant . Definitely recommend this gem.",
      "rate": 4.0,
      "tripDate": " August 2018"
    },
    {
      "title": "Very reasonable at this price",
      "text": "It was our second year staying in this hotel. This time it was a bit longer then first time. We were on the 10th floor which made us happy ! The room was ready in time and it was super clean. The washroom seems like to be fully renovated.This time we had tried the swimming pool and sauna. The swimming pool needs some touch up but it didn’t bother us to use it at all !! The sauna was closed but I tested it and it worked fine !!! What is the real problem ? Nobody knew it !The staffs are super nice !!! All of them !!!The only cons that bothered me is that the corridors on each floor and elevators weren’t vacuumed. Maybe because of the high volume of people ?!I’ll come for any other time when l’ll be in Toronto !!!",
      "rate": 4.0,
      "tripDate": " August 2018"
    },
    {
      "title": "Smoke & Mirrors  -  0 STARS ",
      "text": "This hotel has all the hype of a big city hotel until you check out the rooms ... they will put you in awe ...We woke up to realize the Refugees staying long term in the hotel were deep frying food in their suite . They decided to fry plantains in the room directly under us. We also found Old food behind the couch , A pair of socks , and the carpet has not been professionally cleaned in years. ... later on kids running in our room  playing hide and seek. The best part ..The rooms walls were falling apart. We still paid upwards of 130.00 a night to stay here ...even after showing higher management these photos. Regardless if they offered a new room 2 days later ... checking in was a waste of time .... and I felt disrespected from the time we checked in until we were gone.",
      "rate": 1.0,
      "tripDate": " July 2018"
    },
    {
      "title": "Excellent hotel.",
      "text": "I had may daughter stay here while she was visiting me from Dallas.  She was very happy with her experience.  Great central location.  Well appointed room and bathroom and comfortable bed and cushions. Superb service from the front desk staff.  Highly recommended.",
      "rate": 5.0,
      "tripDate": " June 2018"
    },
    {
      "title": "Acceptable for the price",
      "text": "The Edward hotel is showing its age. The large lobby area is clean, but the doors scrape and somehow everything looks a little worn and dingy. The rooms themselves have been upgraded nicely, with a black and white color scheme in the bathroom and a very modern and attractive large shower (no bath tub) and a large surface mounted sink, but the clothes hook had been pulled off the door leaving large holes in the door and a square of the old finish beneath, diminishing what would have otherwise been a good renovation.    The room was nice and quite large but the beds were too hard to be comfortable. A little ore money spent there during the renovation would have been well used.   I had no strong issue with the Edward hotel, it was clean, the staff were helpful and the rooms were certainly acceptable, but it somehow did not feel as comfortable a place to stay as many other hotels. Simply put, it did not impress and was simply average, thus the 3 star rating.",
      "rate": 3.0,
      "tripDate": " May 2018"
    },
    {
      "title": "Ok; average hotel",
      "text": "No issues with check-in process...rooms were ok...some drywall issues in my room, and also found chocolates under the bed..bathroom/showers are very well done...large lounge....breakfast is not included in all prices, so clarify when making your reservation....mall, restaurants, and highway are in close proximity...WiFi is terrible...",
      "rate": 3.0,
      "tripDate": " April 2018"
    },
    {
      "title": "Questionable",
      "text": "Our one night stay at the Edward North York was far from being average.  We stayed on the the third floor which smelled like old smoke throughout and I know this because I had to search the floor at 1 am and 5 other floors in the hotel for an ice machine that worked!  As a result, the room carried the odor making hard to have a good nights sleep. On top of it, my husband slept on one the beds which had a broken spring. Also, the internet was not functional. The ONLY good thing that came out of our stay was the hotel front desk staff, in particular Susana Cho! When we decided to go to the Markham hotel for our second night, she went over and WAY beyond to make it possible.  She was exceptionally professional and courteous to us and were grateful for her help to make it right! Thank you!",
      "rate": 3.0,
      "tripDate": " August 2018"
    },
    {
      "title": "Needs some work.",
      "text": "This hotel was less than I expected. There is no  help to take luggage to your room. But I have to say that the young man at the reception desk stepped in nicely when he saw I was travelling with a handicapped companion. The room was recently renovated and clean though the corridors were messy. I understood that there are refugees from all over the world staying here. During my five day stay, I spoke to several - all nice people. This is just an idea for the hotel  ... insist on a clean up ... put more garbage and recycle bins in the front, as the entrance of the hotel was very dirty.All around the very helpful staff and service",
      "rate": 3.0,
      "tripDate": " June 2018"
    },
    {
      "title": "STAY AWAY COCKROACHES",
      "text": "So I checked into this hotel , very nice front desk staff very accommodating, and for most part nice hotel, how ever this hotel has cockroaches and they are fully away of the issue and still letting people check in, make sure to read these review before and I’m also going to be notifying the board of health about this.",
      "rate": 1.0,
      "tripDate": " November 2019"
    },
    {
      "title": "AMAZING",
      "text": "I stayed here for my friend's wedding. The front desk are very friendly and helpful. The indoor swimming pool is heated well. The hotel lobby is clean and beautiful. I will definitely come back next year if I am coming back to Toronto!",
      "rate": 5.0,
      "tripDate": " October 2019"
    },
    {
      "title": "COCKROACHES IN KING SUITE",
      "text": "Booked and stayed in King Suite (room 418) Woke up Thursday, Oct 25th, at 5:45AM and was greeted to a fully grown cockroach scurrying across the toilet seat in the bathroom. Woke up partner who was still sleeping to tell her, went back to bathroom, to the sight of a different, not yet fully grown cockroach appearing from underneath the toilet seat.Went downstairs to notify Muhammed at reception and showed him pictures, and was met with a response not of any concern, but by telling me that he could offer me a $30 voucher for breakfast, or that he could come spray the bathroom... Asked him if I could use another room to shower in, and was told that it wasn't possible.Went back upstairs and got all my things, and went back down to check-out, asked to speak to the manager on duty, and Muhammed said that he was the manager on duty, despite the sign behind him saying that it was Kayo Mehta. He told me that Mr. Mehta wasn't actually in yet.I don't care about the cost of the room, what's absolutely baffling is the fact that there seemed to be no concern of the matter, and now that i'm reading other recent reviews, it seems like it's not a unique issue. I will be reporting this to Toronto Public Health.",
      "rate": 1.0,
      "tripDate": " October 2019"
    },
    {
      "title": "Awesome Hotel!",
      "text": "I was going to Toronto attend my first ever TIFF, and staying at the hotel made my first experience so much better. The staff was super friendly and accommodating. My flight arrived at 6am and I wasn't sure if I could check-in so early, so I gave them a call and they said that they had a room available for me to check in. So when I arrived there at 7am, they asked me if I wanted a room with a view of the city, and I was like \"Sure!\". Also on top of that, they gave me a FREE breakfast buffet voucher!The breakfast buffet was amazing, as it had a great variety of food to eat, and so timely and super nice of them to give me a voucher as I was super hungry from traveling overnight. As for the room, the bed was so comfy and the bathroom was clean too. The Wi-Fi was great too. My only 2 negative drawbacks of the room was that a few of the plugs didn't work, as I needed to charge my phone, iPad and laptop. The other was that the TV didn't work at all, but that was ok, as I was barely in the room at all, other than to sleep and shower. Overall, it was a great hotel for a most memorable week at my first TIFF. I would definitely stay here again and would recommend anyone else to stay there too! :-)P.S. please fix the TV in my room!",
      "rate": 4.0,
      "tripDate": " September 2019"
    },
    {
      "title": "Stayed for 2 nights",
      "text": "We enjoyed our stay in the hotel. The complimentary breakfast was good and the staff was great. Ee didmt use the pool or gym but it was nice that the option was there. We would stay there again for sure.",
      "rate": 4.0,
      "tripDate": " August 2019"
    },
    {
      "title": "Nice hotel ",
      "text": "Excellent experience.  Some unruly family in pool area, started throwing rocks into pool and and anyone In The pool.    We brought it to managements attention and it was dealt with in a timely manner by a very nice manager.",
      "rate": 4.0,
      "tripDate": " July 2019"
    },
    {
      "title": "Great Service ! Front desk made an exceptional service",
      "text": "Thank you to Jay and all girls at front desk, the location is good , downtown is not really close (about 35-40 min) however the service and rooms are very good. There is not a store to buy many things inside of the property but there are some food basis around. It’s about 30 min from airport in Toronto .Shower clean and great amenities . You will find a frigo and microwave .",
      "rate": 5.0,
      "tripDate": " May 2019"
    },
    {
      "title": "Good value, good location",
      "text": "Their location worked for me, right at 404/DVP and 401. The hotel has very modern rooms. They were a good size, clean with good linen and a comfortable bed. The Samsung TV's channels were screwed up and they couldn't fix them so it just made it a little awkward to use. The halls were pretty scuffed from the renovation. Most of the staff were polite. I stayed 2 separate nights within the same week. The buffet breakfast was good but over priced at $14...its worth about $8. I had a couple special requests and they were happy to accommodate me. Different prices on different nights so my prices were good for a Sunday and Tuesday....they do seem a little high on other nights. Yes I recommend this hotel.",
      "rate": 4.0,
      "tripDate": " May 2019"
    },
    {
      "title": "Terrible experience ",
      "text": "I booked this hotel on 8/20 for 8/21/18. Money had been taken from my bank; however, they told me they didn’t have room for me when I checked in at the hotel which was 11:30pm. How could I find another hotel at this time since that was my first time came to Toronto!!!! The reason for the cancellation was they were overbooked!!! How can that be possible?! The experience with this hotel is worse than terrible",
      "rate": 1.0,
      "tripDate": " August 2018"
    },
    {
      "title": "Cockroach and other bugs during my stay - keep clear of this place!!!",
      "text": "Stay away!!!  Was given a room on the 4th floor and could not get the television to work.  As I was playing with the remote to try and figure out why, a cockroach walked across the bureau and disappeared under the television.  I demanded a new room and was moved up to the 9th floor.  The hallway looked to me like a war zone - patch job repairs everywhere and stains on the carpet.  In the second room I discovered there was no fridge, another bug, this time a smaller, hard shelled  bug on the night side table, and several smaller bugs on the bathroom floor.  Totally grossed out!!!! I slept on top of the bed 'cause I was afraid to get under the covers; left first thing next morning without even stopping for a shower.  In my opinion this hotel as it stands is not fit for human habitation.",
      "rate": 1.0,
      "tripDate": " October 2019"
    },
    {
      "title": "Jessica",
      "text": "⚠️ STAY FAR AWAY!! ⚠️ COCKROACHES!! Stay away from this hotel!!!!! They have put work in to make the front desk area modern.  This is a Refugee residence with floors 3 and 10 for corporate.  The second you get in to the elevator you are overwhelmed with a strong stench and the air quality is terrible.  Colleagues with asthma, allergies and sensitivities had to check in to a different hotel which was unfortunately 30min away from business events.  Staying was not an option as this severely effected their health.  The sheets and pillow cases were stained and dirty.  Dirty carpets and walls with water stains and dirt everywhere. This was a most stressful and highly unpleasant experience.  The only positive element was that the staff were very kind, sweet people.",
      "rate": 1.0,
      "tripDate": " September 2019"
    },
    {
      "title": "Rat in my hotel room",
      "text": "I am staying at this hotel for 3 nights. On the 2nd day I left to go to my car and came back and there was a dead/rodent in room. It has blood on it. It was disgusting. I googled rat illnesses and have no idea how it died and how I got lucky enough for it to die in my room. It looks like a pet rat not that I am a rat expert. The hotel upgraded my room which was nice but I will not be staying here again.",
      "rate": 1.0,
      "tripDate": " August 2019"
    },
    {
      "title": "1 star would be generous ",
      "text": "I grew up without much so have pretty low standards when it comes to lodging that I deem acceptable. However even by my very low standards this place missed the mark.Some floors remind me of the upside down in Stranger Things  as the conditions are so poor they seem surreal when you step off the elevator. And a strange horrible smell permeates the entire hotel . I can only surmise that people must be cooking in their rooms and it is really hard to take. I always try and find the good in things but this is a complete miss for me!",
      "rate": 1.0,
      "tripDate": " August 2019"
    },
    {
      "title": "Great Toronto/North York Hotel",
      "text": "Very good hotel stay option in North York is the Edward Hotel.  Modern quiet rooms surprise you after your more routine lobby and hallways.  Great bathroom with contemporary shower, sink and amenities. The very quiet room had good beds, lots of power plugs and free internet.",
      "rate": 4.0,
      "tripDate": " February 2019"
    },
    {
      "title": "Not satisfied at all",
      "text": "I booked this room for my wife and I for 3 days but checked out after the first night. The first thing was not to our satisfaction was that, almost every floor had children running up and down the hallways, and it seemed like a daycare. Ever floor seemed as if they had been under minor renovations, painting /wallpaper replacment etc. The staff was very lost in there information and never gave us a definitive answer for anything. No two staff members had the same answer for us. The king size bed was very uncomfortable to say the lest and we where both up all night and woke up with back pain. The swimming pool was not up to health standards as we went for a night swim and found a Band-Aid in the water. Our deposit has yet to be refunded two weeks after we have checked out, and Sarah the manager was not very helpful at all in resolving any of our concerns. I do not recommend this Hotel for anyone, and unfortunately we will never be staying at any Edward Hotels in the future.",
      "rate": 1.0,
      "tripDate": " January 2019"
    },
    {
      "title": "BED BUG ALERT",
      "text": "Weekend of November 17/18! Bed Bugs... we went right away to lobby counter and we were told that the exterminators hadn't finished their job and were coming back the following Monday. So management knew there were beg bugs and still checked people in. Very irresponsible!!! and till today we are waiting for a call back....",
      "rate": 1.0,
      "tripDate": " November 2018"
    },
    {
      "title": "This is such a nice place",
      "text": "This hotel is so clean, amenities are in excellent condition. I stayed in this hotel with my sisters and brothers in-law while joining a packytour arranged by e-world travel and tours of USA. We need to transfer in another hotel every night and for the 8-day tour package, we stayed in 7 different hotels. Out of the seven, Edward hotel in Toronto stood out as the best hotel so far. I love this hotel and I recommend this to others who are looking for hotels in Toronto.",
      "rate": 5.0,
      "tripDate": " October 2018"
    },
    {
      "title": "Not what you expect",
      "text": "Kids running up and down hallway, Playing in the elevator.  Smells like deep fryers are frying all day. Hallways are not vacuumed.  Room was clean but stunk. Elevators are broke had to carry everything up 2 floors. Not again",
      "rate": 2.0,
      "tripDate": " October 2018"
    }
  ]
}