{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Elevate Rooms At Spadina & Bloor",
    "url": "/Hotel_Review-g155019-d15194222-Reviews-Elevate_Rooms_At_Spadina_Bloor-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.0",
      "reviewCount": 5
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "33 Dalton Rd",
      "addressLocality": "Toronto",
      "postalCode": "M5R 2Y8",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/18/7d/a4/18/photo0jpg.jpg?w=500&h=400&s=1"
  },
  "description": null,
  "featues": [],
  "reviews": [
    {
      "title": "Un po’ scarno..",
      "text": "Questo affittacamere in una bella zona residenziale di Toronto, tranquilla e vicino ai mezzi di trasporto (tram e metro). La stanza lasciava ben sperare dalle foto, ma non c’era un asciugacapelli e nemmeno cuscini aggiuntivi.. La pulizia non viene effettuata giorno per giorno, pensiamo per policy della struttura. Nonostante tutto è funzionale per chi non volesse spendere troppo e non andare in un postaccio.",
      "rate": 2.0,
      "tripDate": " July 2019"
    },
    {
      "title": "Nette Pension ohne Service",
      "text": "Für einen dreitägigen Aufenthalten in Toronto hatten wir die Elevate Rooms at Spadina & Bloor gebucht. Die Lage ist sehr gut in einer kleinen Seitenstraße, aber dennoch zentral in der Nähe der Bloor Street/Ecke Spadina Road. U-Bahn und Straßenbahn sind wenige Gehminuten entfernt. Das Check-in lief problemlos. Über Mail wurde uns der Zugangscode zum Haus mitgeteilt und der Zimmerschlüssel lag im Zimmer. Während des Aufenthalts gab es keinen Service oder Ansprechpartner, was aber nicht gestört hat. Das Zimmer war sehr geräumig und mit einer zentralen Hauskühlung ausgestattet, die nicht zu hören war. Die Matratzen waren sehr gut. Das Duschbad ist sehr klein und zweckmäßig. Alles war sehr sauber. Einzige kleine Minuspunkte: es gab pro Person nur ein Duschtuch, kein zweites Handtuch. Außerdem war das Haus hellhörig.",
      "rate": 4.0,
      "tripDate": " July 2019"
    },
    {
      "title": "Un barrio bonito, la propiedad también, pero el servicio debe mejorar",
      "text": "Excelente ubicación, dado que la estación de metro está a pocos minutos. La vecindad es preciosa, con negocios de todo tipo. En cuanto al servicio recibido: difícil  de clasificar pues no tuve contacto con nadie. En mi cuarto faltaba calefacción (no había)  habían dejado sólo una toalla, ausencia de secador de cabello, elementos que solicité por mail pero nadie me respondió ni los alcanzó. Luego los encontré junto con otra pasajera abriendo las puertitas de las alacenas de la cocina principal. esta cocina es muy bonita pero sin equipar: faltaban servilletas, utensilios varios. Poencialmente es un buen lugar, pero debe mejorar muchísimo la calidad de su servicio.",
      "rate": 3.0,
      "tripDate": " May 2019"
    },
    {
      "title": "Da dimenticare",
      "text": "Stanza claustrofobica nello scantinato senza finestra. Sporca la doccia e le lenzuola. Il materasso di gomma piuma da spezzaschiena. Parcheggio a pagamento e a 500 metri. Niente tv. Frigo in comune. Insomma una prigione.",
      "rate": 1.0,
      "tripDate": " August 2019"
    },
    {
      "title": "Great place, great location ",
      "text": "We really enjoyed our stay here, we had 3 nights to explore Toronto. There is car parking around the back of the house for 2 cars so book in advance, $15 CAD per night, well worth it.On first floor there is a \"public\" fully kitted kitchen , you will just needed to being any tea coffee, milk ingredients etc. you need.Great location on a street car and Metro line. Also, the local area is full of places to eat and drink, there is also a Metro supermarket a 5 min walk away if you want to cater for your self.There was 10 rooms so people were coming and going, the hard floors were a little loud so you could hear ones coming and going. Would recommend avoiding the basement rooms 001 and 002 as they were a little cold.WiFi was good.Would recommend.",
      "rate": 5.0,
      "tripDate": " May 2019"
    }
  ]
}