{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Elliott House B&B",
    "url": "/Hotel_Review-g155019-d7388981-Reviews-Elliott_House_B_B-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.5",
      "reviewCount": 115
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "157 Dowling Ave",
      "addressLocality": "Toronto",
      "postalCode": "M6K 3A9",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0f/0a/e2/92/breakfast-room.jpg?w=500&h=-1&s=1"
  },
  "description": "Elliott House is over a century old, Victorian, family run bed and breakfast. Your stay includes self serve breakfast of coffee/tea/juice; breads and spreads, cereals, fresh fruit and yogurt). You can come down and help yourself to breakfast from 7am until 11am daily. Located on the Queen St. West streetcar line (or King Streetcar line), takes you right to downtown and runs 24 hours. Or you can walk along Queen Street - lots of restaurants (at all price points from Pizza Pizza right up to organic/free range/locally sourced food, etc). Our neighbourhood is very close to Liberty Village, and along Queen St West. We are in Parkdale, also known as Little Tibet. It's an artsy, eclectic neighbourhood, lots of antique and vintage shops, and around the corner from Roncesvalles Village. We are also about 5 minutes from Lake Ontario, lovely for a stroll; and not too far from High Park - one of Toronto's biggest parks. We have been hosting guests for over 10 years. Let us help you make your stay memorable! Check in time is 3pm; checkout at 11am Please remove your shoes on entering the house. We are a smoke free environment",
  "featues": [
    "Free High Speed Internet (WiFi)",
    "Wifi",
    "Free breakfast",
    "Non-smoking hotel",
    "Clothes rack",
    "Iron",
    "Complimentary toiletries",
    "Hair dryer",
    "Non-smoking rooms"
  ],
  "reviews": [
    {
      "title": "Perfect place to stay in Toronto",
      "text": "We stayed in Elliott House twice, November 2014 and April 2015, and totally enjoyed it, both times! The house is nice and warm, and kids-friendly, and Pauline and Jeff are wonderful hosts.  They seem to have thought of every detail -- for example, when we arrived, there were snacks and drinks waiting for us in the rooms. The rooms were nice and clean and beds very comfortable. We were impressed by how easy it was to get around from this location. A 1-min walk to the streetcar line, the streetcars run every two minutes, and it takes only 20 min to get downtown and even less to a subway line.  I would recommend this place in a heartbeat.",
      "rate": 5.0,
      "tripDate": " April 2015"
    },
    {
      "title": "A Great Location Near Downtown",
      "text": "We have stayed at Elliott three separate times; twice with kids in November, 2014 and April, 2015 and once on our own this past November.  It is in a very good location close to the street cars downtown and Roncevalles for evening outings.  Pauline and Jeff are very friendly and accommodating to both adults and kids.  Breakfasts are good.  Elliott House is very good value and in a very good location.",
      "rate": 4.0,
      "tripDate": " November 2015"
    },
    {
      "title": "With selfish reservation",
      "text": "It is so selfish of me but I hove no shame in saying here and now that I am always inclined to go back here again and again.and it is With that in mind I say I am reluctant to tell  my fellow travellers how much I love staying at Elliot House. What if the place becomes as popular as it deserves to be, OOOPS ……I suppose an honest review though is a great benefit to those  who wander and on that note I will submit a candid and somewhat slanted review.Elliot house for me is a home away from home  where  I feel comfortable and at ease no matter when I am there.No prentense necessary and complete acceptance of their guests is a real draw.I feel completely welcome and yet free to be doing my own thing at all times.To be fair there is nothing fancy or luxurious about Pauline and Jeffs' place.It is a large and spacious home that is quite eccletic and very comfortable. The beds are all comfortable and the rooms large and clean.I am never nervous about what I am doing or about breaking anything as I may be in a very fancy Band B.I feel as at ease here as I do in my own place.I have a sense that the other guests feel every bit as at home as I do. I believe i am qualified to say this as I have stayed many times over the last few years with the Cross family.(They are not cross HAHA) Breakfast is ample and intersting and always includes all the staples. Hot coffee or tea toast and fruit. Eggs are often the main thing as well as yogurt cereal etcetera.I think what i enjoy the most is a casual and friendly family atmosphere in the home. It is real and palpable that the home is an accepting and caring place to land.There is plenty of assistance provided to those who need advice as to places to eat, local attractions and tips as to how to get the most from Toronto with the least trouble and expense. These Torontonians are well educated on this beautiful city and all that iit has to offer.They are always eager to share their wealth of knowledge.I strongly recommend (gulp) that you try this Elliot House!You'll not be sorry.",
      "rate": 5.0,
      "tripDate": " June 2015"
    },
    {
      "title": "An excellent B&B in a traditional Canadian house.",
      "text": "I stayed at the Elliott House B&B on my recent trip to Canada. Pauline & Jeff were superb hosts who made me feel very welcome and will advise you on anything you need to know about Toronto and Canada. If you are looking to stay in a traditional Canadian house then this is for you! The room I stayed in was excellent with everything I needed, including a TV, and the bed was very comfy in fact some mornings it was hard to get out of! The added basket of welcome snacks was a very nice touch! The breakfast was also superb and set me up for the day. The B&B is in a lovely location just off Queen Street West so lots of eating places, bars nearby, and you are not too far from Lake Ontario and High Park so if you fancy a walk head there. If you need to get into the city then you can jump on a streetcar and you will be in downtown in about 20 mins or it is a 45 mins walk. I highly recommend staying here; you will have an enjoyable stay. The price for a room is very reasonable for Toronto. Look out for the Racoons!",
      "rate": 5.0,
      "tripDate": " February 2017"
    },
    {
      "title": "Nice place, nice couple. Time to modernize. ",
      "text": "Terrific location in older typical Toronto home. Very nice couple. Very clean place. Rooms r modest but could use some updating. Noise does travel through the house so don't expect super quietness especially at breakfast time. The breakfast is standard issue. Cereals, bagels & u do it yourself. So here's my ratings. Location 4 starClean 4 starFriendliness 4 starBreakfast 3 starComfort 3 starNoise level 3.5 star. Parking (really need to milk us for another 10$ a day regardless that it's for charity)Would stay again? Yes.",
      "rate": 3.0,
      "tripDate": " November 2016"
    },
    {
      "title": "Relaxing nights in busy Toronto",
      "text": "My husband and I spent a rather strenuous three days in Toronto and were pleased with how beautifully our accommodation at Elliott House allowed us to relax and enjoy the time we stayed there. The charming gardens and front porch welcomed us back from our adventures, and the hosts made it really easy to get to our room even when coming in late from the airport or a Blue Jays game. We used a rental car the first night (I was worried about the late-night airport pickup) but after that it was extremely easy to use public transit lines. If you bring a car, be aware that there is a small fee for parking either on the street or in the small parking area behind the house. It was worth it for us to leave our car in this neighborhood, especially since Toronto is one of those cities where parking is costly.Our 2nd-floor room was in the front of the house and I loved the decor, the comfortable bed, and the super air-conditioning! It was extremely quiet every night - for some reason this street is not very busy even though it is close to some busy streets. I was able to pull the curtains and get the room good and dark for the one day we were able to sleep in a bit. There are night-lights in the hallway which is a good safety feature when moving around in the night. We shared a bath this time (with another guest down the hall) and this was not a problem because everyone was really quiet, polite, and neat. The upstairs guest areas (bathroom, bedroom, and hallways) were all fresh and clean, which is a big achievement in an older home with lots of hardwood floors and intricate woodwork. All of the towels and bed linens were nice and clean too. My husband and I decided to keep the same towels in our room for the 3 nights - a California habit due to our long-term drought, we re-use so we don't waste as much water washing towels. But I think we could have had fresh towels every day if we wanted them - no danger of drought in Ontario I guess. We had our own shampoo with us, but a full range of liquid soaps, shampoos, conditioners, etc. were provided in the bathroom. The downstairs guest areas are mainly the dining room and a pantry-type kitchen area. The coffee maker works well (although one morning I was rather groggy and Jeff had to help me) and there are lots of choices such as fruit, breads, muffins, and yogurt. Jeff made hard-boiled eggs on Saturday morning and that was perfect! Limited kitchen use is allowed - if we had wanted to heat up take-out food or something like that, we could have. (I was there for a conference, so I was trying not to eat too much.) I loved the dining room decor - there was a Provencal-style tablecloth and cute animal plates high on the railing. (It is really obvious they don't have earthquakes there in Toronto!) The floors are hardwood but there are plenty of nice rugs, which also keep the noise level down. The family includes three cats but I never saw a speck of cat hair anywhere but on the cats themselves - this is a big achievement keeping an older house like that clean and sparkling! There was also ample air conditioning in the rest of the house (besides our well-cooled room) so I appreciated that in the recent heat-and-humidity wave. I was able to arrive at my conference each morning refreshed and ready for the day ahead.Our hosts were very available to consult about how to get around the city and see all its attractions, but were never obtrusive, so we had lots of privacy. As an alternative to our conference hotel, the Elliott House was super - the room was bigger, quieter, and just as comfy, more breakfast service was included with the room, and the \"concierge\" service was just as professional. Sharing a bathroom for a few nights was worth it - I saved lots of money - and I felt like I got to experience the character of a Toronto neighborhood much better than if I stayed at a big hotel!",
      "rate": 5.0,
      "tripDate": " August 2016"
    },
    {
      "title": "Charming character home! Would repeat!.",
      "text": "I had a rough weekend. It was supposed to be just two but we had an extra surprise and unruly guest with us. The host was so understanding and made my weekend very enjoyable! I was totally embarrassed but she was just full of so much warmth dealt with the situation with grace. Fantastic host. I wish I left a tip! She deserves it.",
      "rate": 5.0,
      "tripDate": " July 2016"
    },
    {
      "title": "Wonderful place and friendly atmosphere ",
      "text": "I stayed 5 nights with my sister in July. Pauline and Jeff are fantastic, it's like a \"host family\". They took care of us and help us to have a very good time in Toronto. Breakfast is avaible from 7 and there's everything you want (eggs, milk, juice, jam, bread...). You have to prepare your breakfast on your own but it's very easy. It's nice talk with other guests and exchange opinions and suggestions about the city. It has been a pleasure to stay there. Thank you!!!",
      "rate": 5.0,
      "tripDate": " July 2016"
    },
    {
      "title": "HIghly recommend stay at Elliot House",
      "text": "I had a great time at Elliot House last year, and this summer I stayed back. Jeff and Pauline are excellents hosts, always so helpful. The house is good located, very close to Queen Street streetcar, and 10 minutes walk to Lake Ontario. Very confortable rooms and excellent breakfasts. I highly recommend Elliot House",
      "rate": 5.0,
      "tripDate": " July 2016"
    },
    {
      "title": "Highly Recommended",
      "text": "Located conveniently between the King and Queen streetcar lines, Elliot House B&B is a great choice for your visit to Toronto.  The house is quiet, even when full of guests.  Breakfast is self-serve and simple, and this is a good thing because it's very relaxed.  It gives you enough fuel to start your day before finding a great unique place to eat brunch or early supper somewhere on Queen Street.Parking was a bit tight with our van, but totally doable, especially if you plan on using public transportation (and you should!).  Once you get your car situated you can leave it there your entire stay.  Also all funds raised from parking spots go to the local basset hound rescue... which is a total win-win in my book. :DIf we head back to Toronto anytime soon, we will definitely look into staying here again!",
      "rate": 5.0,
      "tripDate": " May 2016"
    },
    {
      "title": "Charming and traditional B&B",
      "text": "Such a lovely house, with history and charm. Jeff and Pauline are great hosts,  laid back abd yet eager to please. The location is a little \"downtown\", with a shabby quality but its got excellent access to good transport and a pleasant walk into the city and waterfront.",
      "rate": 4.0,
      "tripDate": " July 2017"
    },
    {
      "title": "Lovely experience",
      "text": "My stay at the Elliott House Bed & Breakfast was great. I felt like I have been with friends and family. It is 2 min walking distance from bus station, where bus/tram easily takes to downtown. Both Jeff and Pauline are generous people, very kind and supportive. Tips that they gave me helped to explore Toronto and  saved a lot of time.",
      "rate": 5.0,
      "tripDate": " July 2017"
    },
    {
      "title": "Fall in Love with Elliott House!",
      "text": "From the moment I arrived, I loved Elliott House, its owners Jeff and Pauline, and their two cats.  The home is comfortable and inviting, the breakfasts very good and different everyday, and the location is close to great public transit. I will definitely seek out Elliott House the next time I visit Toronto. I left feeling that Jeff and Pauline are like family!",
      "rate": 5.0,
      "tripDate": " June 2017"
    },
    {
      "title": "Felt at Home",
      "text": "Parked the vehicle at the rear of the property and made to feel at home instantly. Had the full tour and run down of this quirky property. We had top floor front bedroom which was very roomy and comfortable. Breakfast was very casual affair with a good variety and plenty of it. Location was great for the tram into town. Only down side was there area beyond the street was a little run down. Would highly recommend.",
      "rate": 4.0,
      "tripDate": " June 2017"
    },
    {
      "title": "Great hosts at terrific Toronto location",
      "text": "Recently spent two nights at the Elliott House and my wife and I were extremely please with the hospitality, food and accommodations.  Our hosts Jeff and Pauline treated us like family which made us feel very comfortable.  The breakfast was a very social time for all guests and added nicely to home-style food we all enjoyed.  If you are lucky enough to book reservations you will find like us the Elliott House is a good choice for a Toronto visit.",
      "rate": 5.0,
      "tripDate": " July 2017"
    },
    {
      "title": "Great stay",
      "text": "Very large, bright, and comfortable room. Normally don't get a shared bath but it was no problem. Breakfast was good with cooked eggs and an assortment of bakery and fruit items. Location was right on for us as we had immediate access to the bike path by the lake. Parking in the back was a good choice as I like to keep my vehicle pristine and cars on the curb had scuffs and cracks from the tight parking. Would definitely stay here again on a return trip.",
      "rate": 5.0,
      "tripDate": " June 2017"
    },
    {
      "title": "Feels like Mom's Home",
      "text": "Had a great 2 nights here. Comfy room, tasty breakfast laid out for hours each morning. (Host Pauline collects honies!). In the neighborhood of many Tibetan stores. Not too far from the waterfront. Up and coming neighborhood.",
      "rate": 4.0,
      "tripDate": " May 2017"
    },
    {
      "title": "Homely B&B",
      "text": "Initially we stayed 4 nights, then went to Niagara for 2 nights and returned to Elliott House for the reminder of our stay.  When returning from Niagara we felt we were returning home not to a b&b. We throughly enjoyed our stay, we were made to feel very welcome by Pauline and Jeff.  The room was very comfortable with one of the most comfortable bed I have ever slept in.  Downtown Toronto is easy to get to as public transport is very efficient, we got a taxi from the airport which cost $45 but got the UP train on our return which is nearly half the price for the two of us.  I highly recommend this B&B",
      "rate": 5.0,
      "tripDate": " June 2017"
    },
    {
      "title": "A perfect cozy and welcoming place",
      "text": "This place exceeded our expectations. It felt like home instantly, most of it was due to the owners who were really great and trusting people but also to the place wich felt familiar. Thanks for a great stay! Hope to see you soon jeff and pauline!",
      "rate": 5.0,
      "tripDate": " June 2017"
    },
    {
      "title": "At home in Parkdale",
      "text": "The Elliott house offers a great location with easy access on and off the Gardner expressway or by tram to downtown. The hosts are friendly and helpful, the parking onsite (at a small fee) is worth its weight in gold, the rooms are comfy and nights are quiet in the neighborhood.",
      "rate": 4.0,
      "tripDate": " June 2017"
    },
    {
      "title": "Like at home!!!",
      "text": "The host was very friendly  and helped us in everythingThe breakfast was great: the special French toast was deliciousThe house was amazing, and the room and the bathroom were very clean.We definitely choose it again!!!!",
      "rate": 5.0,
      "tripDate": " August 2018"
    },
    {
      "title": "Wonderful stay in a wonderful house",
      "text": "Really nice B&B Thank you very much It’s a nice neighborhood as well and short distance for all the sights in this beauty Town of Toronto A nice breakfast as well WOW - hello to PAULINE AND JEFF , highly recommend",
      "rate": 5.0,
      "tripDate": " July 2018"
    },
    {
      "title": "Quiet and Comfortable",
      "text": "I stayed at Elliott House B&B while I was in Toronto for a conference.  The room was beautiful, quiet, and comfortable.  The hosts were also friendly and accommodating.  There are two friendly cats in the house which was a nice surprise.",
      "rate": 5.0,
      "tripDate": " June 2018"
    },
    {
      "title": "Great Toronto B&B",
      "text": "Our hosts were friendly, the room was clean and comfortable, breakfast was tasty and the cats were adorable. The location is a few blocks from Queen St with plenty of restaurants and shops to check out. It's also walking distance to Lake Ontario.",
      "rate": 5.0,
      "tripDate": " May 2018"
    },
    {
      "title": "A wonderful week inToronto",
      "text": "Our stay in Toronto was wonderful.. At the Elliott House we felt like at home.. Pauline and Jeff were very polite and helpful whenever we needed informations about monuments or Niagara Falls trip... the breakfast was plentiful and delicious...they cooked waffles, sausages and oatmeal...Their cats (Minnie and Mama) were very friendly with us...we would come back again in the future",
      "rate": 5.0,
      "tripDate": " April 2018"
    },
    {
      "title": "Fantastic B&B, Friendly host and cats, really lovely owner, Jeff",
      "text": "We stayed at Elliot House for the last two days of our stay in Ontario. The owner, Jeff, was fantastic, he could tell us anything we didn't know about the area.  The cats are friendly.  The place is well stocked with shampoo, soap etc.  The rooms are large, clean and comfortable.  Breakfasts were so lovely and too filling! Would definitely stay again.",
      "rate": 5.0,
      "tripDate": " October 2017"
    },
    {
      "title": "Lovely old home",
      "text": "When we arrived, we were told how to access the parking at the back.  We were able to check in earlier in the day, which was great.  Our room was very comfortable, and the ensuite was great.  Pauline made us tea and gave us some fresh banana bread upon arrival.  We stayed for four nights.  Jeff told us how to access the trolley bus to get down town so we did not have to fight traffic and pay to park.  We did not see much of Pauline since she was at work, but Jeff was friendly and interested in our plans.  Loved the cats and their toy mice!  Would have liked more protein at breakfast.  The oatmeal \"casserole\" was served cold on our last morning; we should have asked to heat it in the microwave.  Other guests did not join us at breakfast, so we ate alone each day.",
      "rate": 4.0,
      "tripDate": " August 2017"
    },
    {
      "title": "Nice Bed & Breakfast",
      "text": "The owners are very nice and helpful if you need directions or something like that. The house is nice, it is a bit dusty in the corners but it's fine. The breakfast is ok, you can help yourself to anything they have. The parking is convenient, and the 10$ you pay per day go to an animal shelter. Nice location, about 20 minutes from the downtown by bus",
      "rate": 4.0,
      "tripDate": " August 2017"
    },
    {
      "title": "Thoroughly Enjoyable!",
      "text": "The owners were very friendly and welcoming and actually fun to talk with...they have great personalities and were very generous with their time and hospitality.  It's a great location, easy to catch the streetcars (directly into town) or walk to local restaurants.  Breakfast was plentiful and varied (hot or cold) provided at a big family style table where you could chat with other guests if you wished.  I had a beautiful big Victorian bedroom with a shared bath (which was scrupulously clean) - I was hesitant about the sharing part but there was never any conflict about timing.  They owners were diligent in planning guest numbers so that this would not be a problem.  Because it's in a real neighbourhood, it had a comfortable and homey vibe, especially in a huge and sometimes overwhelming city the size of Toronto.  I have recommended this B&B to friends and would stay there again whenever I'm in Toronto.",
      "rate": 5.0,
      "tripDate": " June 2017"
    },
    {
      "title": "We loved it! ",
      "text": "We stayed with Jeff and Pauline for 5 Nights altogether and we loved it. I felt at home right away thanks to Pauline's two cats (and her sharing my love for everything feline). Our room was spacious and clean and so was the bathroom. We loved the fact, that we were treated like friends or family and the breakfast was also very relaxed as all guests sat around the large Dining Table. Pauline made us tasty French Toast, Oatmeal Bakes or fried bacon etc in addition to Cereals and Toasts. There was always fresh fruit and plenty of coffee and orange juice. Elliott House is homely and cosy and within walking distance of public transport and supermarkets. Many nice restaurants in the area as well. We will definitely be back!",
      "rate": 5.0,
      "tripDate": " July 2017"
    },
    {
      "title": "Elliot House.",
      "text": "Clean and comfortable. Close to Lake Ontario. Situated besides major routes to the city. Spacious, charming and relaxing. Very pleasant hosts.An ideal starting point from which to explore and discover all Toronto has!!",
      "rate": 5.0,
      "tripDate": " April 2016"
    },
    {
      "title": "A friendly BnB",
      "text": "We recommend Elliot House.Location at West end of Queen-King neighbourhood means easy street car access to downtown Toronto.Owners were welcoming and helpful.An enjoyable stay so we will likely book again on a future trip.ThanksPH, Pembroke Ontario",
      "rate": 4.0,
      "tripDate": " January 2016"
    },
    {
      "title": "Old World Charm with convenient location.",
      "text": "Pauline and Jeff were very welcoming hosts; locals who know the area; tourist information available. Our big old room had everything we needed along with complimentary water and juice on arrival. Breakfast included good things like yoghurt, juice, fresh coffee.  I loved hearing from Pauline on the history of Elliott House which is over 100 years old.  Only a short walk to access the street cars for a quick trip downtown. I would highly recommend this B & B.",
      "rate": 4.0,
      "tripDate": " October 2015"
    },
    {
      "title": "Great location!",
      "text": "Our stay at Elliott House was great!  Property is in great location, right on public transportation routes that go directly to downtown.  Proprietors were great and very accommodating.  Definitely recommend!",
      "rate": 4.0,
      "tripDate": " September 2015"
    },
    {
      "title": "Elliott House",
      "text": "Pauline and Jeff are very nice people and treat everyone with respect and kindness.The room I stayed in was clean and up to date. I was able to park my car there for the duration of my stay. The location provided me easy access to down town via street car.I look forward to returning next year.",
      "rate": 4.0,
      "tripDate": " August 2015"
    },
    {
      "title": "Holiday in Toronto",
      "text": "We stayed with Pauline and Jeff in Elliott House B&B for 2 weeks in June 2015. My Wife and I and my youngest daughter were visiting from Ireland. To see our eldest daughter who lives in Toronto. We found Elliott House to be very well located with quick access to both Queen Street and King Street. We found Pauline and Jeff to be very friendly and helpful with trip advice and the house to be comfortable and clean with all good facilities. We would have no problem returning again or recommending this B&B to our friends and family.",
      "rate": 5.0,
      "tripDate": " June 2015"
    },
    {
      "title": "The real Toronto",
      "text": "Jeff and Pauline are very friendly and welcoming.  It's an old house but charming, clean and comfortable.  Do try Pauline's sourdough waffles!  There is lots to do in the neighbourhood (Parkdale).  Queen St is a mix of restaurants, boutique shopping, vintage clothing stores and does still have some grittiness to it.  Easy access to downtown on either the King or Queen streetcars.  The UP station at Bloor is close by too.",
      "rate": 4.0,
      "tripDate": " February 2019"
    },
    {
      "title": "Comfort stay close to Queen street",
      "text": "Stayed for 2 nights over a weekend. Bed and breakfast was well located, walkable distance to a lot of good vegan stuff: Copenhagen Cafe, Doomies (Vegandale Brewery) for example, and lots more restaurants on Queen street. It's also easy and fast to reach downtown on a streetcar from either Queen or King street.Room was big, with everything you need. Bed itself was comfortable (a little too soft for my taste). Breakfast have something warm provided plus lots of stuff you can help yourself with. You can also ask ahead to have a parking spot behind the B&B not to worry about it.",
      "rate": 5.0,
      "tripDate": " November 2018"
    },
    {
      "title": "wonderful experience",
      "text": "I stayed at the Elliott House for three nights this past week, October 20, 21 and 22.Excellent and welcoming in every imaginable way. Very comfortable bed and bedding. House is clean and the hosts treated me like a valued friend. I have a slight mobility challenge and Pauline and Jeff were very accommodating and sensitive to that issue. Beautiful neighborhood with easy access to public transportation, although I relied on Uber, and lots of great little restaurants nearby. Hosts did my laundry! Breakfast was ample and varied. I would stay there again, no question.",
      "rate": 5.0,
      "tripDate": " October 2018"
    },
    {
      "title": "GOOD PEOPLE GOOD BEDROOM",
      "text": "Me and Marge stayed there mid sept for approx. two weeks  we had the queen bedroom with ensuite bedroom , a lovely old house and the bed room was a delight  when you book a room there its  that your room and you can come and go as you want  any time   breakfast is good hot and cold food help your self I used to make my own cup of tea  and Jeff gave us the run of the kitchen  so I could put a beer in his fridge if required  and sup it when we came to our Canada home  Pauling is a delight and don't miss the Saturday home made waffles with bacon and maple syrup uuummm  I can taste them now don't be put of by the neighbor hood you are perfectly safe  there are homeless people all over Toronto  ask Jeff about the trams kings street leads you every where  he was a tram driver for 30 years so he knows his stuff finally I cant wait to go back it was a blast  thank you Jeff and Pauline",
      "rate": 5.0,
      "tripDate": " September 2018"
    }
  ]
}