{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Embassy Suites by Hilton Toronto Airport",
    "url": "/Hotel_Review-g155019-d186883-Reviews-Embassy_Suites_by_Hilton_Toronto_Airport-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.5",
      "reviewCount": 663
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "262 Carlingview Drive",
      "addressLocality": "Toronto",
      "postalCode": "M9W 5G1",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2a/a4/5c/8e/exterior.jpg?w=500&h=-1&s=1"
  },
  "description": "Embassy Suites by Hilton Toronto Airport Welcome to Embassy Suites by Hilton Toronto Airport, a haven of comfort and convenience located less than three kilometers from Pearson International Airport and the Toronto Congress Center. Ideal for both business and leisure travelers, our hotel offers easy access to top destinations such as the International Center and Woodbine Racetrack, both just a 10-minute drive away. For those looking to explore further, the vibrant heart of Downtown Toronto is only 20 minutes from our doorstep. Indulge in a culinary experience at our on-site restaurant, Westside Social Eatery, where you can enjoy delicious, freshly prepared meals in a stylish and relaxed atmosphere. Each morning, start your day right with our complimentary, made-to-order hot buffet breakfast, offering a variety of options to suit all tastes. In the evening, unwind and mingle at our complimentary cocktail reception, the perfect way to relax after a busy day of travel or meetings.",
  "featues": [
    "Paid private parking on-site",
    "Free High Speed Internet (WiFi)",
    "Fitness Center with Gym / Workout Room",
    "Bar / lounge",
    "Children's television networks",
    "Free airport transportation",
    "Business Center with Internet Access",
    "Conference facilities",
    "Parking garage",
    "Wifi",
    "Restaurant",
    "Breakfast available",
    "Kid-friendly buffet",
    "Kids' meals",
    "Snack bar",
    "Vending machine",
    "Free shuttle or taxi services",
    "Airport transportation",
    "Shuttle bus service",
    "Banquet room",
    "Meeting rooms",
    "Baggage storage",
    "Currency exchange",
    "Newspaper",
    "ATM on site",
    "24-hour front desk",
    "Express check-in / check-out",
    "Dry cleaning",
    "Laundry service",
    "Air conditioning",
    "Desk",
    "Housekeeping",
    "Room service",
    "Coffee / tea maker",
    "Microwave",
    "Flatscreen TV",
    "Bath / shower",
    "Safe",
    "Telephone",
    "Iron",
    "Wake-up service / alarm clock",
    "Refrigerator",
    "Complimentary toiletries",
    "Hair dryer",
    "Non-smoking rooms",
    "Suites",
    "Family rooms"
  ],
  "reviews": [
    {
      "title": "Excellent option for large families",
      "text": "This hotel was fantastic. It is newly renovated an exceptionally clean. The rooms are large and spacious and have laminate flooring. There are coffee and tea machines in each room and a large mini bar and sink area. The breakfast that is included in the rate was also very good – a hot buffet breakfast (eggs, pancakes, sausages, has browns) with a selection of fruit, oatmeal, pastries, drinks etc. The staff was super friendly and amenable. The shuttle runs every half an hour from terminal at Pearson. Highly recommend!",
      "rate": 5.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Traveling During Global Pandemic: Excellent Staff, Flawless Cleanness , and Safe Hotel",
      "text": "I work as a Flight Attendant and traveling and working during the Pandemic be depressing due to people's lack of social skills behind a mask. I have had the pleasure of being greeted by one of the hotel's staff while eating breakfast by the name of  Sukhi.  Doing our short conversation and she took care of me and I had the pleasure of making a connection with her, \"The Human Connection.\"  I felt like I was talking to my best friend or someone that I grew up with, She was 100% genuine about me enjoying not just my stay at the hotel, but my day.   It was her ability to go above service and to make me feel like I was a rockstar in the hotel, safe, worry-free, optimistic about the future during this Pandemic, is uncanny.   She is truly the icing on the cake for a wonderful hotel.  The hotel's beautiful room was flawlessly clean. The door had a sticker with \"CleanStay with Lysol Protection\" before you enter.  They let you know that all Coat hangers, Iron, phones, buttons and knobs, and spaces that the kids can find and adults avoid are cleaned. Plus, the even took the time to wrap the television remote control so that you can feel at peace. Wow.  If running a hotel is like running a relay team then Sukhi would be the Unisan Blot on that team..  She was one of a really great team of employees at that location.  I highly recommend this location to everyone.  Plus, there is some locations nearby to get some food less than 100 yds away",
      "rate": 5.0,
      "tripDate": " August 2020"
    },
    {
      "title": "Amazing staff",
      "text": "We stayed here for a Sleep/park/fly. We went to Cuba for vacation, spent the night before our morning flight and left our car at the hotel. We returned on a Sunday evening to a car with a flat tire and a dead battery.  There was nothing open to fix the car until Monday morning. The staff tried to assist with a boost (no luck). They were able to get us a room at a discounted rate and made sure we had everything we needed. Lin was compassionate and caring. She could see that I was upset and went above and beyond to try and make things better.Co-located to the airport was also a bonus.  Our shuttle ride was quick and we didn't wait long. The happy hour on arrival and the made to order breakfast were a nice surprise.I would highly recommend this hotel and we will definately stay here again.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "An Airport Hotel That  Should be at Every Airport",
      "text": "This is about the most elegant and stylish Embassy Suites of the dozens I have stayed. Among all the hotels along Dixon Rd at the airport, this one is a standout. One of those design shows on HGTV HAD to have designed the public spaces and rooms.  It’s practically brand new. Shockingly, it’s the old Quality Inn, first opened 30 years ago. It closed 3 years ago. It must have been gut renovated down to the steel structure. The room is as spotless as possible. A great feature is that the floor is a grey wood and carnauba marble - far better and cleaner than carpeting. Bonus points for the large bathroom with a heavy frameless glass shower door instead of a shower curtain and quite the vanity mirror. Ultra clean. Lastly, the hotel is across the street from The Keg restaurant.",
      "rate": 5.0,
      "tripDate": " November 2021"
    },
    {
      "title": "Excellent Hotel",
      "text": "Stayed here as a stopover prior to our flight out and again on the way back. The Staff are excellent, from the Airport Shuttle driver to the Desk Staff to the Restaurant/Bar Staff. We traveled during the Covid-19 and they made accommodations for the morning breakfast due to the forced closure of the restaurant. The rooms are large, new and well equipped, including complimentary snacks and drinks. The only concern I had was the lack of sound proofing of the windows - we had an end Runway Room facing Dixon, and it was noisy. Our return, we took a room mid-hotel and it was quiet. I would stay here again!",
      "rate": 5.0,
      "tripDate": " March 2020"
    },
    {
      "title": "Excellent Customer Service",
      "text": "We stayed twice at this hotel in the last 2  months using their park and fly option, which included leaving our car on site in the covered parking garage.The first stay I had a minor complaint that I put in my review of the hotel.  I also said I could have addressed it with the hotel at the time, but I did not. I immediately received an e mail from the manager who informed me he would make it right the next time we stayed.  3 weeks later we returned to the hotel for another park and fly stay.  It was absolutely perfect.  THANK YOUI highly recommend this hotel not only for customer service but for the comfortable clean rooms, evening drinks and snacks as well as a very yummy breakfast included.",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "False advertising- $CAD 80 / $US 64 for “free” breakfast!",
      "text": "We’ve been Embassy Suites customers for many years. We like the suites and the full free buffet breakfast. This free buffet was advertised on the web for this site, as always. There were signs about it in the elevators and a card in the hotel room. But when we went to the designated floor we found only another confused couple. We sought out a staff person who informed us that there was no free buffet after all and instead we’d get a $20 voucher ( one per room valid only with purchase of two adult entrees) Ok, no problem…until we saw the bizarrely jacked up prices. We purchased two very average priced entrees (2 pancakes with two eggs) and WITH the vouchers had a mediocre plate ( no refills like a buffet) for CAD80 with standard tip. Promised a free buffet breakfast and got this, tThe next day we ate a grocery store yogurt in the room, The room was great. We understood lack of staff and some services because of COVID and could even overlook the $70 parking in this prime location but the breakfast bait and switch is completely unacceptable.",
      "rate": 3.0,
      "tripDate": " October 2021"
    },
    {
      "title": "Disappointing shuttle service",
      "text": "We used the park sleep and fly service in the hopes of having a stress free experience however, the service did not meet our expectation. We stayed at the hotel the night before our trip. There was no available covered parking and had to park at the topmost level, uncovered. Upon arrival, we were at the waiting area 10 minutes prior to the scheduled shuttle and we waited outside despite the freezing cold to make sure we do not miss the shuttle. Non arrived so we contacted the hotel and they assumed we missed it and was told to wait for the next shuttle (every half hour). Half hour passed by (and so other hotel shuttles), but no embassy suites shuttle came so we called again but was again told the same thing. We were questioned if we were at the right place and if we were really there at the right time. An hour later, we finally asked for a manager who informed us that their shuttle has broken down and never left the hotel so we were picked up by a holiday inn shuttle! They obviously did not contact the shuttle when we were told they did, and we ended up waiting for nothing in the freezing cold with our toddler. It was a disappointing experience and will never choose the same hotel again for the service. The manager however was very apologetic, offered free breakfast and tried to make up for the damage done.",
      "rate": 1.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Staffs make all the difference",
      "text": "We returned to this hotel because the good experience from our previous stay.Hotel has been hit by the pandemic and the occupancy just started to pick up.The hotel charge parking for $15  in and out privilege with your room key.Lobby was nice and clean, check in was smooth. The evening cocktail service was temporarily canceled.Hotel provide all suites on every floor, which made it easy to choose the room, recommend the room at the end corner one on each side, it provides better view and also quieter.However, the safe was not working in the room so we had to switch to another one, the hotel staffs acted quickly to solve the problem.The front desk agent Nhi was polite and professional. The one bedroom suite was clean and spacious with the door separating the living area and bedroom.The hotel also has breakfast and if you are checking out before the breakfast starts, they provide a on- the-go breakfast for your convenience.Overall it was a bit hectic in the beginning with the room switched, but the hotel staffs made up to it with an impressive service. We will definitely consider staying there again.",
      "rate": 5.0,
      "tripDate": " October 2021"
    },
    {
      "title": "President",
      "text": "I have stayed in many hotels over the decades. The Embassy Suites by Hilton Toronto Airport is by far the cleanest hotel I have ever stayed at. The staff is also very friendly and courteous. I am sure many hotels have had extra cleaning due to recent COVID 19 protocols however it is very evident that this hotel always keeps the rooms and common areas immaculate",
      "rate": 5.0,
      "tripDate": " August 2020"
    },
    {
      "title": "Great hotel great price",
      "text": "You won't be disappointed. It's the Hilton. Rooms are clean and beds are comfortable.The weight room was clean and had good equipment.  Dining in the restaurant was good value  and food was tasty.  They had coffee, muffins and fruit for early risers which was a bonus. . The shuttle to the airport was right on time and friendly driver.",
      "rate": 4.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Very nice airport hotel",
      "text": "The shuttle worked very well. I called from airport and I think he was there in 15 mins or so. Very nice friendly driver. Room was very nice, view over part of the airport. Very little noise. We had a late flight so for $50 we could stay 6 extra hours. Breakfast nice, no omelets but think might be because of Covid. The evening reception is a coupon for one drink each and some veggies and dip. Gym looked nice but didn’t use",
      "rate": 5.0,
      "tripDate": " March 2022"
    },
    {
      "title": "A good option near the airport",
      "text": "The rooms are bright, spacious and well maintained. I like having laminate floors and tiled floors much better than carpeting. They have a small fridge and microwave and lots of USB charging ports. The staff are friendly and helpful. Parking is expensive but then again it is Toronto. They have a shuttle service to and from the Airport that leaves the hotel on the half hour. No lunch service but breakfast and dinner are good. There is an Asian server in the restaurant (Jesse, I think) sit in her section if you can as she is efficient even when it is a zoo.",
      "rate": 5.0,
      "tripDate": " October 2023"
    },
    {
      "title": "They will transfer you to a nearby bad hotel",
      "text": "The embassy suite staff and management have no regard for customers, They canceled my  booking and reservation last minute in the evening. Not very  helpful staff. Over all very bad  management who overbook this property and send customer to near by lower end   hotels  the local owner own at the last minute in the evening. Its scam to fill their lower end hotels!Stay out of this property if you want a booking that is reliable.  Book other hotels",
      "rate": 1.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Beautiful hotel",
      "text": "Beautiful hotel, great breakfast in the morning. We had trouble finding parking in the designated area but they allowed us to park in the rest of the parking lot anyways. You can hear the airplanes overhead but nothing earplugs won’t fix. Love that they shuttle us to the airport. We would definitely stay here again.",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Excellent stay",
      "text": "Decided to stay at this hotel based on the good reviews and I didn't want to spend a lot staying in Toronto's Downtown. I cannot say enough good things about this place. Upon arriving we were greeted by the staff, and the check-in process was a breeze. All personnel throughout the hotel was polite and attentive. The service was excellent. Now the room... WOW! It's one of the biggest, cleanest, and more comfortable rooms I've stayed. Everything was stopless and perfect. It had such an amazing distribution of space and the number of amenities was unreal. The complimentary breakfast buffet was very good. There's a restaurant on-site and an evening reception featuring beer, wine, premium spirits, and light snacks. Highly recommended!",
      "rate": 5.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Booking price & actual price is different .",
      "text": "not perfect place interms  of  value of money . food was so poor . I was made a reservation for three night for my family but when I came for check in they told me this booking is not active & they offered me almost more then double price .",
      "rate": 1.0,
      "tripDate": " April 2021"
    },
    {
      "title": "Would Return",
      "text": "This property is conveniently situated close to Toronto Airport and can be quickly reached by complimentary shuttle which runs every half hour.  We had a pleasant high floor room and did not hear any airport noise.  Breakfast included in rate was satisfactory although the dining room does get rather hectic at peak times.  They also offer a free drink in the daily happy hour and a lovely member of staff gave us a additional voucher for a second helping!Quiet, comfortable hotel.",
      "rate": 5.0,
      "tripDate": " July 2023"
    },
    {
      "title": "Bad night shuttle!",
      "text": "Poor night shuttle service!  We arrived after midnight with our family of five, called about the shuttle and were told the next available was at 12:45, and where to meet it.  When the shuttle arrived, they started to load our luggage and our kids went to get in the shuttle.  A group of flight attendants in the shuttle told our boys not to get on because they wanted their whole group to get on and were saving seats. We had to unload our luggage and were left without a ride in the rain with three tired kids.  The shuttle only runs every 30 minutes no matter if people are waiting so we opted to take a cab, which cost $45.  When we arrived at the hotel the shuttle driver was at the front desk and explained the flight attendants are “very good customers”, but as a diamond member we couldn’t even get on.  There are many hotels with shuttles in the area and we won’t stay here in the future.",
      "rate": 1.0,
      "tripDate": " March 2023"
    },
    {
      "title": "does what it says on the tin",
      "text": "A clean and comfortable hotel. Rooms more than adequate. The only problem is the complementary shuttle. It only runs very 30 minutes and each time was inadequate for the numbers of travellers who wished to use it. An extra 30 minutes wait in -10c is not much fun.",
      "rate": 4.0,
      "tripDate": " February 2020"
    },
    {
      "title": "The Staff and Vouchers Make This Place a Delight",
      "text": "My most recent stay at the Embassy Suites was in November 2023, but I’ve stayed there several times for work over the past year. I have used countless hotels for work over the past 20 years and this is one of my absolute favourite places. The staff are, to a person, friendly and helpful. This makes a huge difference when being away from home because it’s a warm atmosphere, and you feel like a person, not a commodity. I also really appreciate that breakfast, which has a very generous selection of dishes, is included in the cost of the room, as are a drink voucher and snacks at the end of the day. There are vegan options at breakfast and dinner, so dining for anyone who follows a plant-based diet in is easy.The rooms aren’t fancy. This is a comfortable, very clean, mid-range hotel. But it’s well kept, well appointed, and there is a small kitchen in each suite that is a real bonus when I want to bring some of my own food. We will be staying at the hotel in early 2024 for a mix of business and pleasure. The fact that we’re choosing to stay on our own time, when there are many other options in the area that are close to the airport is a testament, to how much we value this gem of a place.",
      "rate": 5.0,
      "tripDate": " November 2023"
    },
    {
      "title": "Wonderful pre trip stay with some lovely surprises",
      "text": "Stayed here before our trip.  Room was large and well appointed.  Nice treat between 5 and 6 pm free wine or beer and help yourself to snacks.  Good selection.Menu looked pretty good with reasonable prices for dinner although we didn’t stay Since we were too early for free breakfast, the staff offered us coffee, juice and water to go.",
      "rate": 5.0,
      "tripDate": " May 2022"
    },
    {
      "title": "Good experience",
      "text": "Ambience, service, response and food was great. The choice of channels on the TV was good as my kids enjoyed their channels while I enjoyed mine in my room. The reading table was comfortable and the wifi was great all through.",
      "rate": 5.0,
      "tripDate": " April 2021"
    },
    {
      "title": "GAA Ripoff in Toronto",
      "text": "The food is horrid and they make you pay for three nights when test results for COVID come back in a day.  They even make you pay extra for soda when they are collecting 3-4 times the normal room rates.  People need to remember how the COVID hotels are ripping people off.",
      "rate": 1.0,
      "tripDate": " May 2021"
    },
    {
      "title": "Fantastic Pre-flight/vacation Accommodations",
      "text": "This is a beautiful hotel, modern, clean, very comfortable beds. Choosing our room electronically was great. We chose 811 and had a wonderful view of planes landing, and a spectacular sunset. We especially appreciated being able to lock and unlock our room, enter and exit the parking lot with our cell phone. Being able to park our car for the week was very handy. There are lots of restaurants nearby, some within walking distance. Happy hour from 5-6 pm was a nice touch with one free drink ticket and a few snacks. The gym was small but clean, good equipment. We will def use this hotel next time.",
      "rate": 5.0,
      "tripDate": " December 2022"
    },
    {
      "title": "Happy Holiday",
      "text": "We always enjoy our stay at this hotel.  Very nice people, good quality for the price and our vehicle is always safe. Quick easy access to the airport.  The shuttle service is very well handled and usually on time.We recommend this hotel to all our friends and family.",
      "rate": 4.0,
      "tripDate": " January 2020"
    },
    {
      "title": "An excellent hotel!",
      "text": "I chose Embassy Suites for my 3-night quarantine stay, and was so glad I did! The whole process of checking in, staying safe and sanitized, having my needs catered to, and the overall experience was brilliant! They have really worked hard to ensure guests are safe and comfortable. The suites are clean, comfortable, beautiful! The meals are healthy and thoughtfully prepared. I was very nervous about the stay because I had to wait for my Covid test result, but I had nothing to worry about at Embassy Suites! Even after my test result (negative!) came within 28 hours, I chose to stay an extra day at the hotel because it was so relaxing and comfortable. On the whole, a very nice experience!",
      "rate": 5.0,
      "tripDate": " May 2021"
    },
    {
      "title": "Great Hotel - Stay away from top floor",
      "text": "Great Hotel - Stay away from top floor - very noisy due to a/c on roof !Hotel food service was poor due to covid. The Manager had to arrange for a special breakfast to be sent up as the regular buffet was closed. Problem was resolved only after complaining that the \"brown bag\" breakfast provided was not up to Embassy Hotel standards.",
      "rate": 4.0,
      "tripDate": " July 2021"
    },
    {
      "title": "Great Stay!",
      "text": "Family excursion to the Toronto area, we stayed here for two nights.  Hotel is nice, clean, and in a good location that was easy to get to the places on our itinerary.  Breakfast was buffet style and there were plenty of options.  Evening reception snacks were good too.  Parking fee is reasonable and once you've checked in you use your key to get in/out of the parking lot.  When it's time for checkout you keep one key to get out of the lot and there is a drop box there to leave it.",
      "rate": 5.0,
      "tripDate": " April 2023"
    },
    {
      "title": "Fantastic Stay!!!",
      "text": "What a fantastic well located hotel!!!We travelled to Toronto at the start and end of our trip out East. Our plane landed quite late on our flight in and we weren't too worried about getting to our hotel seeing as we know that we had access to a free shuttle.We made our way outside and the arrivals doors where it was indicated that hotel shuttles picked up their patrons. It took a little while before we located the correct spot where our particular hotel parked their car, but we sure were happy to see the driver when he showed up! : )We were promptly taken to our hotel where we checked-in to a very clean and elegant property. The staff was very kind and accomodating even though it was the middle of the night. Our room was a king suite and it was spacious, clean and well designed. Our three kids had more than enough room to make the space their own. We had also received free breakfast vouchers and were quite pleased with the choices we had at the buffet restaurant-style breakfast area. The next morning we took a free shuttle to get back to the airport in order to pick-up our rental car. Everything was simple and smooth!Thank you for a fantastic stay!",
      "rate": 5.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Clean, comfortable and spacious with a great breakfast.",
      "text": "This is a nice clean hotel. For our family of 4, we stayed 3 nights, it was very comfortable and spacious. It came with a full free breakfast and the food was actually good. The first day we had an omelette station, the next two days for some reason it was not open, but you still had scrambled and boiled eggs, bacon, and a variety of other foods and meats. The room looks clean and modern with a big tv, and sink, microwave and fridge and I don’t really have any complaints about it except the people next door to us were loud and noisy with their 6 or 7 kids ( they had 2 rooms) running down the hall at 6am. I can’t really blame the hotel for that. I did mention it, but the gentleman didn’t really do anything about it. By that point we were ready to check out anyways. Some families are ignorant about their surroundings and there is really nothing you can do about it except carry ear plugs I guess. The room itself was great and we hope to come back one day again.",
      "rate": 5.0,
      "tripDate": " May 2022"
    },
    {
      "title": "Exceptionally clean and convenient.",
      "text": "Very clean comfy king size room, although a bit expensive.   The bar was very convenient although there was no pay-per view channels being offered.    Checked in around 9pm and staff was nice and accepted my request to extend check out till 1pm.   Thank you!",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Parking and Airport Shuttle",
      "text": "We stayed here on our way to the airport. Shuttle runs 24 hours every 1/2 hour and we were about 10 minutes from the terminal. Pick up at terminal on return was quick and easy. Excellent, friendly service. Rooms were spacious with desk and kitchenette (microwave, coffee maker, sink, mini fridge). There was a managers reception and free drink on arrival.",
      "rate": 4.0,
      "tripDate": " December 2019"
    },
    {
      "title": "A great surprise!",
      "text": "Stayed 2 days this week, check in was smooth.. they were very diligent on covid-measures. I felt very satisfied with the way they secure their rooms, it’s assuring they’ve taken every step they can to prevent covid spread. The room was beautiful, clean and newly renovated. Thank you for a lovely stay.",
      "rate": 5.0,
      "tripDate": " August 2020"
    },
    {
      "title": "Suite for the price of a room",
      "text": "I had a one night layover at this hotel. I chose this particular hotel based on price, location, airport shuttle and access to a printer. I was not disappointed. Checkin was efficient, my suite was roomy, clean and well appointed. The bed was super comfy, and I loved the fact I could open the windows for fresh air. The windows also come with terrific blackout blinds.The staff were all friendly and extremely helpful. Complimentary Starbucks coffee in the morning (plus a COVID style boxed breakfast) was a pleasant inclusion. The free wifi worked great. I really have nothing negative to say about this property. I will definitely check out this hotel on my next stay at Pearson.",
      "rate": 5.0,
      "tripDate": " May 2021"
    },
    {
      "title": "Best Airport hotel in Toronto",
      "text": "Amazing Embassy Suites! An pleasant surprise beyond expectation!Fresh, spacious rooms, functional space. Modern colours and design. The bathroom offers a generous space to move around, with direct access from the bedroom as well as the living area. Plus, they have a little vanity space to make our lives easier! Loved it!!Kitchenette well equipped, great bath amenities.In the evening, they had a small reception buffet that was replenished several times, while we were watching the game in the restaurant, helping ourselves to the delicious food.Breakfast buffet included an omelette station in addition to other buffet items like egg & friends,.Service was excellent, check in was a breeze.Highly recommendable.",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Everything Great",
      "text": "No issues whatsoever with this hotel. The suite was very spacious and well appointed, clean and brand new looking. The included breakfast was tasty as well. Coming into Pearson after midnight this was an excellent choice with the quick free shuttle, which we took the next day to continue on to downtown on the train.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Amazing!",
      "text": "Rooms at this hotel are so clean and beautiful we had a great sleep before our flight! We paid extra to be closer to the airport instead of choosing one of the hotels a bit further away. This place is definitely worth paying the extra money. The rooms were immaculate and the staff were all so friendly. We missed the breakfast in the morning because we left too early but we did eat there for dinner. The pizza was actually decently priced and delicious. The evening reception definitely needs a little spruce up as when we got there it was pretty much just some soggy carrots and celery and leftover popcorn with a lot of kernels. But we enjoyed the drinks and the gentleman who served us was very friendly. The pillows aren't the greatest as they are pretty thin but if you double them up it's not so bad. The best perk is the park and fly was directly across the street so it made it easy to park our car the night before and not have to worry about all that early in the morning before our flight. I would definitely recommend this hotel!",
      "rate": 5.0,
      "tripDate": " December 2023"
    },
    {
      "title": "Embassy suites",
      "text": "Great place, beautiful room, very very clean. Would definitely recommend it to everyone. Reception at night is really nice with complementary drink and appetizer. The  breakfast was the best, with a chef cooking your personal omelette.",
      "rate": 5.0,
      "tripDate": " March 2020"
    },
    {
      "title": "Modern spacious rooms, service and cleanliness is very poor",
      "text": "This hotel used to be a Quality Suites... They renovated it really well and the rooms turned out really nice, the lobby is very nice and modern. As a frequent Hilton guest and an elite Hilton Honors member, they just don't live up to Hilton standards at all... they continue to run a Quality Suites. They encourage you to skip check in and use mobile and in doing so they don't communicate with guests at all regarding their services, or lack thereof. During our stay, they didn't clearly communicate breakfast times, provide any housekeeping or amenities (you had to go get everything yourself - they wouldn't even bring you something if you asked for it) and the staff had an attitude as if they were doing you a favor by being there. So for 3 nights, I had piles of overflowing trash until they told me to put it in the hallway (then it stayed there for hours and hours) and when I opened up the sofa bed, their commitment to cleanliness showed with blood stains on the sheets. So overall, their \"commitment to cleanliness\" was not much of a commitment. Of course, when I checked out, there was no one to complain to because the front desk agent didn't even bother to ask if I enjoyed my stay. So much for elite status... This is not representative of Hilton, just this particular owner/operator.",
      "rate": 2.0,
      "tripDate": " November 2020"
    }
  ]
}