{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Est Hotel",
    "url": "/Hotel_Review-g155019-d15643446-Reviews-Est_Hotel-Toronto_Ontario.html",
    "priceRange": "$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "2.5",
      "reviewCount": 84
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "1790 Albion Rd Etobicoke",
      "addressLocality": "Toronto",
      "postalCode": "M9V 4J8",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/16/74/9b/f8/est-hotel.jpg?w=500&h=-1&s=1"
  },
  "description": "Welcome to Est Hotel By Dass group of hotels! An individually crafted boutique hotel experience that offers the best hospitality with excellent service and value – for the Executive at work and play. The Est hotel is located right on Highway 27 and Albion Road . A four Star very modern brand new boutique hotel with easy access and close proximity to all major highways 401, 407 and Highway 27. We are also 10 minutes from the Pearson International Airport.",
  "featues": [
    "Free parking",
    "Free High Speed Internet (WiFi)",
    "Fitness Center with Gym / Workout Room",
    "Pool",
    "Free breakfast",
    "Business Center with Internet Access",
    "Baggage storage",
    "Non-smoking hotel",
    "Parking",
    "Wifi",
    "24-hour front desk",
    "Dry cleaning",
    "Laundry service",
    "Air conditioning",
    "Microwave",
    "Refrigerator",
    "Non-smoking rooms",
    "Suites"
  ],
  "reviews": [
    {
      "title": "Dirty dirty dirty!!!",
      "text": "The first room they tried to give us hadn't even had housekeeping done. The next room they offered us at least had the bed made but the floors were filthy. Hair, dirt, small bits of toilet paper were all over the bathroom floor. The shower had hair all over it and some weird brown stuff on the floor. When we went to check out the next morning we were then informed that the $250 security deposit would be returned to my credit card in 3-5 business days! Never have I had a hotel not immediately return the deposit. The staff was nice but honestly it was a dirty little hotel. The lobby appeared to be the only part regularly cleaned because the housekeeping on the rooms is terrible.",
      "rate": 2.0,
      "tripDate": " February 2020"
    },
    {
      "title": "bad move by hotel",
      "text": "This is only my second review in about 15 years having stayed at literally dozens of places. But I feel compelled to tell about my experience and I told front desk the will see the review, that I would never stay there again and would tell all my friends not to. Hotel itself is fine, smallish rooms but nicely decorated. I booked through expedia and the booking.com for second night and I joined the so called \"loyalty plan\" which apparently gives late checkout at 1PM.On first morning at 11am someone knocked on door and said checkout is 11 and it would be an additional 50 dollars to stay till 1 pm. So I told her I had joined \"loyalty program\" at  premier level and so was entitled to check out at 1.  I repeated same story to front desk when they phoned. So they got me out of bed and kicked me out with just a few minutes notice to get out or pay 50 bucks. I was pissed but left.I had to stay in town another day and against my best judgement went back to same hotel. I checked again that I was a member and entitled for late check out without needing to even ask! To be on the safe side I cleared the late departure with front desk! To my surprise at 11 this morning staff came to door and asked if I were checking out today. Yes I said but not till 1pm. Ten minutes later the front desk calls and repeated yesterdays fiasco. I went through the story again and even told them I had cleared with front desk staff. Nope 50 bucks again if i stayed till 1.  Woken up for the second day in a row and summarily given the boot with just minutes to get out. I stopped at front desk on way out and expressed  my dissatisfaction pretty sternly. I was pissed!! Told them I was writing a review and would tell it all and advise everyone I knew not to stay there.  And that is exactly what I am  doing now. I advise in the most strongly worded way I can - avoid the EST hotel on Albion in Toronto.",
      "rate": 2.0,
      "tripDate": " October 2020"
    },
    {
      "title": "Modern but dirty",
      "text": "The interior of the hotel is modern-looking and staff are friendly. There is hair in the corners of the bathroom floor, on the bed, in the shower, under my socks ... Not sure the rooms are vacuumed. There is a live spider living in its web in the corner of the bathroom floor. One of the pillows is stained. My booking also indicated that I was here on business and requested a quiet room, but I was given a room on the main floor, right near the elevator where you can hear the 'ding' each time. No attention to detail, won't stay here again. Also, there is a sign indicating that masks are required by bylaw for COVID-19 but front desk staff are not wearing one. Hand sanitizer was almost empty.",
      "rate": 2.0,
      "tripDate": " July 2020"
    },
    {
      "title": "Please choose another hotel",
      "text": "This is a terrible hotel, the bedroom had a bad scent, the shower room needed to be cleaned, some of the towels were dirt, the pillows were dirty and stained.The complementary breakfast was served in a brown paper bag and the cheese burger was cold. this is not a tradition hotel, they house refugees and they therefore do not care about customers or customer service.",
      "rate": 1.0,
      "tripDate": " May 2024"
    },
    {
      "title": "WOW.",
      "text": "hey everyone even THINKING about booking at the EST hotel located at 1790 albion road, trust me, you should. when you first walk in you are greeted with a staff member following all covid protocols behind the desk ready to check you in. their lobby is beautiful. the attention to details is phenomenal! everything from the room sizes and lighting to the pretty blue/purple lights all around the hotel truly are a sight to look at.  but on top of all of that, let me tell you the best part of this hotel. the manager. parveen singhal is not only friendly and accommodating when any issues arises, but he is also so dedicated to his position. he’s only been the manager for TWO WEEKS and he is perfect at his job. he sleeps at the hotel to be able to support the hotel customers and train new employees. when we had any questions, we would head straight to parveen singhal. not only was he quick at responding but he was also honest and genuine. definitely would recommend this hotel to anyone and everyone looking to plan a visit to toronto! thank you so much EST hotel, i’m coming here every time i come to toronto. this is my new favourite hotel thanks to all the staff and parveen singhal!!",
      "rate": 5.0,
      "tripDate": " July 2021"
    },
    {
      "title": "Looks nice but I would keep looking.",
      "text": "Lobby was clean and had a nice clean smell to it. Hallways and elevator smelled clean. Tot to our room and it looked just like the pictures posted except for the garbage in the middle of the floor in our room. Took pictures and went down to the front desk to ask if they clean rooms after each guest. We checked the bed and it looked clean so decided to stay. Bed and pillows were comfortable. The fridge and the heater did not make to much noise when operating. Nice big flat screen tv. It looks like they are trying to upgrade and make this into a nice renovated hotel but they are still a little short. There was mold/mildew in the shower along the caulking. There was no HOT water. Show got luke warm only. The fit and finish on some of the reno's makes it look like they were done by an amature. The pool was closed and drained (apparently due to covid and our safety) and the gym was closed as well for the same reason. Tim Hortons, KFC right across the street.Bottom line, would we stay here again, No, mostly due to the hot water issue.",
      "rate": 2.0,
      "tripDate": " November 2022"
    },
    {
      "title": "Dirty rooms and rude staff.",
      "text": "Friday afternoon we checked the hotel. We were given room 105, all was good until the next day when we found bugs in our room and our daughters hair. We had to buy a solution to wash her hair to remove them ($70), which also caused us to miss a show ($60) that we had tickets for. (Two additional charges I should not have incurred on our trip) Your staff moved us to another room which was good and had no issues here. Sunday morning when I go downstairs to get my breakfast, I reach to take a bag and one of the staff tells me that I already took my two bags, which I did not. In front of about eight other guests, she continues to belittle me and tell me that my daughter came down and took them. I explain to her that my daughters are 8 and 10 and are still sleeping and I would not allow them to come down by themselves even if they were awake, she continues to yell at me in front of the other guests. She tells me she will show me the cameras, and when I insist to show me, she would not. Later when leaving for the day I show her my two daughters and ask her if they were down for breakfast this morning, she tells me \"I'm not arguing over this $hit\".  I've reached out to the hotel for a response and have heard nothing, this will give you a sense of how they feel about their \"guests\".If I could I would give a 0 rating.",
      "rate": 1.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Very unsatisfied",
      "text": "I checked in to hotel on May 30th 2020 to room 301. After check in, in some time housekeeping walked into the room without even knocking. I was with my boyfriend and it was very embarrassing and upsetting. I informed reception about it and asked manager to call me and haven’t heard anything yet. This is complete invasion of my privacy. I will never stay here again.",
      "rate": 1.0,
      "tripDate": " May 2020"
    },
    {
      "title": "Avoid at all costs",
      "text": "The first room was disgustingly dirty. There was a bug as soon as i opened the door and brown sticky gooey stuff all ground into the floor. Asked for housekeeping, none at 10pm when we checked in. They asked if we could wait until morning. I refused as it was literally filthy. Moved to a second room that was slightly cleaner. After walking around  in the room for an hour, our feet were black with dirt from the carpet. We had to walk around in our sandals. Pool still shut down due to covid they say.  If they are that concerned about covid they should at least clean their rooms. Continental breakfast is a bagged lunch that leaves a lot to be desired. The front desk agent accused my brother in law of taking more bagged lunches then we were entitled to when  in actuality we took 1 less than we were entitled to every day. Then she accused us of not being entitled to any at all and asked to see our reservation. Upon showing her she said it was wrong. Very unprofessional. Confronting guests and accusing them in front of other guests is completely unacceptable behavior. Asked to speak to a manager and she said there were none. Still haven't heard from one. Avoid at all costs.",
      "rate": 1.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Difficult phone access and no shuttle.",
      "text": "They don’t offer a shuttle. I had to call three times to get through to the front desk. They advertise that they are close to the airport but a cab still costs over $40 one way. The attendant offered no help when I finally did get through, refusing to offer even a partial refund.",
      "rate": 1.0,
      "tripDate": " March 2022"
    },
    {
      "title": "Affordable hotel close to Pearson Airport",
      "text": "The hotel just opened a few weeks ago when I stayed, and was just what I expected from an airport hotel, clean and cozy, and comfortable. While some of the TV channels had some static for some reason, it didn't bother me too much. The location is pretty close to Pearson airport, although quite far away from downtown Toronto, especially in bad traffic. Rates were reasonable and even included breakfast, which was nice.",
      "rate": 4.0,
      "tripDate": " December 2018"
    },
    {
      "title": "Almost had it all",
      "text": "So its super pretty, modern touches and very clean.  I love the design and the decorating, there are many special touches for the price range. The bathroom was amazing! BUT why would someone build a hotel and put all this money into these special touches and put up paper thin walls? I could hear EVERY SINGLE THING my neighbour was doing, including his hands free calling, coughing, etc. I had to ask front desk to come up and get him to turn down his cranked up punjabi music sirens and all. No one wants to have to complain about their neighbours. Not fun to try and sleep with that. I mean, I am not even sure if his music was overly loud or the walls are so thin? Either way I would never go back because of this, I need sleep!",
      "rate": 2.0,
      "tripDate": " February 2019"
    },
    {
      "title": "Very clean and new , no frills hotel",
      "text": "Very clean and new , no frills hotel, still a work in progress, with some potential. First, the photo of the exterior is from another location somewhere, which should be corrected as not to be confused when pulling up. I arrived in the middle of a snow storm and several hours late. Called the hotel and they arranged for a shuttle to pick myself and two others up right away.Check in was quick and simple. Very friendly and efficient front desk personnel. Was disappointed that there was no chance to buy a beer after midnight that night, no bar or restaurant in the hotel, no mini bars in the rooms and only simple junk food snacks for sale in the lobby. Had a very large and clean room. Bathroom was clean and had a rain shower which is always nice. Buy the extra bonus was the jetted tub in the actual bedroom, which is funny, but meant I could relax in the tub and watch a movie streaming to the large smart TV...Breakfast was included, but was really bad in my opinion, paper and plastic utensils, instant cold scrambled eggs, Luke warm, not crispy bacon, not much else offered, some room temp boiled eggs, bread, some bagels, coffee and tea...breakfast room itself was not very welcoming, very sterile, like a hospital cafeteria.All in all, a pleasant enough stay...will maybe try again if passing through to see how the finished product comes out...",
      "rate": 4.0,
      "tripDate": " January 2019"
    },
    {
      "title": "Stay away - Tons of problems here",
      "text": "I can only discourage people to go there. Lets start from the beginning:1.) On Check-in Staff didn't even know what kind of documents they ask there guests to sign. A quick question about a paragraph was answered with \"Oh I don't know what that suppose to mean\".2.) The room we got assigned seemed to be made except that the sheets where crumpled and one of the towels in the bathroom had pubic hair. In addition to that as soon as you turned on the shower the toilet started leaking (yeah I know extremely weird!)3.) Given all that issues we contacted front desk immediately (personally by walking down there). I got told someone is gonna take a look within 5min. After 35min I called as no one showed up. Got told again that someone is coming shortly. After waiting another hour I went out and walked by the front desk where the fix-it man was just sitting and chatting with front desk personal. I got another promise that they will look at it as soon as I return (which they finally did). Unfortunately he was not able to do anything and we got offered to move to a new room which we agreed on.4.) After talking to front desk we got initially told that they can't move us till tomorrow when the manager is coming in (why don't you tell us that first or ask first before offering us a new room?). After 30 minutes we got a call from front desk that they can now move us to a new room (there seem to be huge disconnects in how they work).5.) The other room had a working shower. Properly made bed sheets. But it came again with a problem. The door latch to the bathroom did not work so you where not able to lock the bathroom door (which in our case was not the end of the world but still).6.) And the biggest issue we had in both rooms is the noise. There seem to be no sound isolation at all between the rooms as we where able to hear pretty much everything that went on in the neighboring rooms (in both rooms we had!!!)The only thing positive I can say about this place was the breakfast which had a pretty good selection for being included in the room rate. I hope this feedback will help some people to make there decision and hopefully it will make the owners consider improvements and proper training to there staff.",
      "rate": 1.0,
      "tripDate": " January 2019"
    },
    {
      "title": "Under Construction",
      "text": "My hubby wanted to try something new so he book us a room at EST Hotel. When I searched for it on TripAdvisor it only had architect rendering but Google has more pics of a room from a guest’s stay. As beautiful as the hotel is it is also clear that they are still in construction mode and that they should have waited a couple more months before opening and taking in guests. At first glance the beautiful and modern inside. Outside/curb appeal isn’t the greatest. Once you settle in you can see the “rush” on the finishes, things not screwed in securely or screwed in crooked, or the fridge wasn’t plugged in to the wall. The pot lights wholes are oversized and sloppy. Breakfast is complimentary: eggs- hard boiled & scrambled, sausage patties, cereal, pancake station, juice machine (which wasn’t working), hot water for tea/ hot chocolate, yogurt, mini juice boxes, milk- a2% / chocolate and fruit (pineapple). The toaster was temporarily out of service because the circuit blew but was fix within 10 mins of us being there. The staff is pleasant and polite but it was hard to tell who staff and not just a friendly guest. It would have been nice to see the ladies at the front desk dressed more professional. Other staff uniformed as well even if it was a certain coloured t-shirt. A couple of the men I saw were in suits, the ladies were in causal/ street clothes and I felt it diminished the message of a modern/contemporary hotel. Our first night there wasn’t the best due to noice from the floor above us. The front desk was called three times and on the third call I asked that someone to actually go to the third floor and tell who ever it was to stop. That was about 3am. Overall it was a nice and we will return at some point. I stand by my statement that they should have waited a few more months to make sure the hotel was finished and procedures were in place.",
      "rate": 3.0,
      "tripDate": " December 2018"
    },
    {
      "title": "Don’t book here. Stay away!",
      "text": "This hotel is in a very sketchy area and you would not want to travel outside after dark. Parking area was small, difficult to find, and littered with garbage. Outside of building is crumbling away from walls and stained with bird excrement. Access is through a neighbouring strip mall lot.For the price, you can do much better a few kilometres away in Vaughan. This hotel is an embarrassment that should not be listed on Trip Advisor or anywhere else. Others have reported even worse experiences here.",
      "rate": 1.0,
      "tripDate": " February 2023"
    },
    {
      "title": "If your going for work and sleep do not go on a friday or Saturday night to EST Hotel Vaughn",
      "text": "Good morning,Must say the room I stayed in was a good size, comfy bed, clean linens to to naked eye, pillows super for a good night sleep. Try not to stay in room near door to stairwell or by elevator; quit noisy from door opening and closing, music playing in other rooms on a weekend. Room was fairly clean; shower and bathroom walls could of used a little extra TLC and scrubbing. Shower head awesome, good water pressure, hot water. Once in room with door closed smells clean. Hallways are another story, if you like to smell the green it is your place. Interesting interactions can be heard overnight, suggest ear plugs and running fan. Perhaps was just a one off. Front desk employees were friendly and accommodating for early morning coffee.If your staying for business I suggest to go elsewhere unless your up for a party and potentially an altercation-suggest to stay in your room and do not engage.Tricky cut off to hotel, have to pull off into another parking lot, if you hit hwy 27 you have a long jot back to get to hotel.Thank you.",
      "rate": 3.0,
      "tripDate": " January 2021"
    },
    {
      "title": "Great Stay!",
      "text": "The staff is very friendly and accommodating! The lobby, hallways, elevator and room were all extremely clean. This hotel is highly recommended - I will be staying here again for business trips to Toronto.",
      "rate": 5.0,
      "tripDate": " September 2020"
    },
    {
      "title": "if I could rate 0, I would!",
      "text": "so first, my girlfriend and I have traveled from Buffalo to this hotel for valentines day vacation. when we first got there, they gave us a hard time with the deposit, said it had to be $500. NO WHERE did it say you had to pay $500 deposit. plus that was a lot of our spending money on our vacation. after a 2 hour car ride, I was upset, my girlfriend tried explaning everything and finally they decided $250 was the down deposit which, is ridiculous because our atay for 3 nights, didn’t even come up to $250. and then when we got into our room, the lights weren’t working at all. so had to call down and get that situated. the next day we got breakfast and brought it up to our room, and tried to watch tv. first, they have a chrome cast  to where you can automatically set your phone up to it through a website, I did that. and then the screen  would turn black. confused, I called back down again. after an hour and a half of waiting they sent a maid, and then finally a guy. I tried telling him what happened and he wasn’t listening to me. everything he was doing I already tried. so we got another call saying we would be getting our rooms switched. so we pack our stuff and wait for a phone call AFTER ANOTHER HOUR, FRUSTRATED at this point, I call down and ask what is going on, they continued to tell me that NONE of the chrome casts  are working from every room and that they have to call the electric guy to come fix everyone’s and that we would no longer be getting our rooms switched. WE WERE FURIOUS. we decided to not let that ruin our vacation and we decided to leave and continue our vacation. The next morning, we decided we wanted to go to the pool. Remind you, the pool is open from 6 am- 11pm, which means it is closed throughout the night. We go down to the pool and for one, it’s a weird green color, and a big machine inside the pool moving around. Cords everywhere. My girl refused to swim around it, so she went to the front desk and asked when it would be taken out, they said an hour. As she was asking the front desk another worker came inside the pool area looking at it. I asked when it was going to be taken out, and he look at me and then ignored me. I walked up to him and asked again, he said 30 minutes. I’m just a little confused as to why they would do this when the pool is open, instead of closed, when they have 24 hour front desk service. Ridiculous. Our last day, we go down for breakfast, and again bring it up to our room as we are leaving the lobby, a worker comes up to us and says, we cannot eat the breakfast in our hotel room. I said “we did this the other day and no one said anything.” she said “probably because no one was paying attention.” unbelievable. I pay all this money for a vacation to get told we can’t eat BREAKFAST IN OUR ROOM THAT WE PAID FOR. we walked STRAIGHT to our room with our breakfast. ON TOP OF ALL OF THIS, the parking is so small! you half to walk half a mile if you’re not back at the hotel by 9 pm because all of the front spaces are gone. my opinion, don’t build a hotel where you cannot put enough parking in. they honestly ruined our vacation, just made us so angry. I WOULD NEVER RECOMMEND ANYONE TO GO HERE. It looks nice but looks are deceiving! it was TERRIBLE.",
      "rate": 1.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Not bad",
      "text": "We had a nice stay. The hotel is new and off the normal beat and track not far from North of the city or the airport if you’re looking for more low key. Best thing about the location is the amount of places to get food within walking distance. Still some improvements to be made but overall a pleasant experience, the staff is quite friendly.",
      "rate": 3.0,
      "tripDate": " October 2019"
    },
    {
      "title": "New hotel with lots of problems",
      "text": "Stayed for New Year's Eve 2018. Rate was reasonable so we chose it for that. Check in at the Hotel is 3pm, arrived at 4pm but room was not ready. Apparently they were full the night before (Not sure why that mattered). Went out to dinner and came back and the room was ready. Wanted to take a shower before going out, however our room didn't have hot water. Also, the sink plug was stuck closed so sink was quite gross after brushing our teeth. Bedding was nice, but room was relatively small for what I would expect for the area. The exterior of the hotel did not look completely finished and parking lot is very tight. Interior looks like it's fancy, but it looks like the cut a lot of corners while still trying to appear upscale. If everything was working correctly and check-in time was done correctly, this would be a really nice place at the rate. If what I experienced is the norm, it's a last resort stay.",
      "rate": 2.0,
      "tripDate": " December 2018"
    },
    {
      "title": "Don't use the towels!!!!",
      "text": "This was a solo trip. I've never endured a problem. I've always rated EST highly. When I checked out I was told I had to pay $50 for 2 dirty towels a housekeeper said couldn't be cleaned out of my security deposit. It was a bit of soda I wiped up after I spilled it. ( As any human that spills something would simply do) I was told I should have called the front desk. Sooooo... I was to call the front desk when I spilled something when natural instinct is to wipe it up with a towel???  Now, I'm a Housekeeping Manager at a 5 star resort. I take solo trips and rate hotels it gives me ideas to better direct my Housekeeping department. I am absolutely appalled by getting charged $25 per towel. I didn't steal anything, I definitely did not destruct property. I simply cleaned up a mess I made. I even stripped the room and organized the trash to help out the housekeeper and left a pretty generous tip. My 10+ years in housekeeping I have NEVER charged people or called a dirty towel destruction of property. Any housekeeper with correct knowledge on laundry knows that a little bit of peroxide and water removes soda, blood and dark stains and when they are stained to no saving point you can't respectfully charge a guest $25 per towel Towels are a write off. Sadly, I'll never be back!",
      "rate": 2.0,
      "tripDate": " August 2020"
    },
    {
      "title": "Helpful staff..that's about it...",
      "text": "The Est Hotel looked like a good option for a one night stay, close to Toronto airport for an early morning flight but the hotel definitely didn't live up to it's online imagery. While the staff at the desk were friendly and helpful the bright lights of the foyer were soon a distant memory once in the room.I travel frequently and this was actually one place where my confidence in the room cleaning was such that I actually avoided bare feet on the carpet.To top things off, the curtain didn't fully close and I was exposed to the glaring outside lighting and the room door wouldn't close properly.Definitely not worth the price paid and not a recommendation I'd be making.",
      "rate": 2.0,
      "tripDate": " October 2019"
    },
    {
      "title": "REASONABLE",
      "text": "The EST is a good hotel for the occasional stay. The hotel is modern with a minimalist feel and efficient use of space. A hot breakfast was included with DIY pancakes, eggs, bacon, fruit, cereals, etc. Due to a quirk, access is through the parking lot of the strip plaza to the east on Albion, but it is convenient.",
      "rate": 3.0,
      "tripDate": " October 2019"
    },
    {
      "title": "Dodgy",
      "text": "Decided to try save a few bucks. My mistake. Not horrendous inside but the outside is atrocious. Very dodgy area and didn't feel safe. Will not return. Way better value and security  for money not too far away in Vaughan or next to the airport.",
      "rate": 1.0,
      "tripDate": " October 2019"
    },
    {
      "title": "Funky",
      "text": "The outside of the hotel doesn’t reflect the inside funkiness. This place has loads of character. The breakfast included eggs, bacon, waffles, yogurt, muffins etc. Don’t miss the chandelier in the hallway.",
      "rate": 4.0,
      "tripDate": " September 2019"
    },
    {
      "title": "Average nothing too special",
      "text": "The property is still under some construction and not all sections of the hotel are open. The pool was very small kinda resemble a hot tub and the fitness room was also small. The front desk staff was great and very accommodating. Breakfast was ok nothing too crazy or special. This hotel is good for a one night quick stay. Bed is comfy and room were brightly light washroom had cool mirrors great for selfies.",
      "rate": 3.0,
      "tripDate": " January 2019"
    },
    {
      "title": "overnight Stay was a little disappointing!",
      "text": "This new hotel is difficult to get into parking lot off kipling not highway 27.Pool very small, breakfast buffet was average but staff was untrained but did do when asked.parking lot was small but I did get a spot for handicap out front.Rooms were odd shaped and very smallThe rooms were well furnished with very modern amenities.price was competitive.PH",
      "rate": 3.0,
      "tripDate": " September 2019"
    },
    {
      "title": "Luxury Motel",
      "text": "This hotel was worth a try. I stayed here with my baby, mother, brother and sister. We stayed in the suite(room 335) with two queen beds which is actually a disable friendly room. It was a good size room and one of their biggest rooms, I was informed by front desk upon check-in. Here are my dislikes: • Location- it is nice to be 10mins from the YYZ airport but I hated that the hotel is at the rear of a very busy plaza and that plaza has two high traffic sports bars. I had to park in the main plaza for one night due to the hotel paving the Parking spaces directly in front of the hotel. I was nervous leaving my rental SUV but the front desk guy assured me that the hotel owns the plaza and they would be liable.• Hotel had no security. From time to time the front desk staff would frequent the parking lot to make checks but I suggest a security due to the location, not that it’s unsafe but just as a precaution due to the types of crowds sports bars attract frequently. • Staff were absolutely not welcoming at all. Stayed for 7 nights and there was not one time that a staff GREETED FIRST. I had to greet them when I walked in the door. It was disappointing because I’m a customer service manager at a 5 star resort and I expect HOSPITALITY wherever I spend my money! 😇 • Insufficient staff. We needed towels for the room and a few times had to come down for it. • Limited Parking space at the front of the hotel. I hate that you have to park way at the back in the back of a warehouse facility for parking when the front area is full. If you’re a woman and solo traveling please try to come to your hotel before dark. The light is not as good in the back there and not many people can see you if anything we’re to happen. Just a precaution. Here are my likes:• Love the decor in the lobby area. I’m a stickler for details when it comes to hotel decor. The design on the inside is so modern and chic and I liken the hotel as a luxury motel lol! • Good continental breakfast. Waffles, Muffins, Cereal, Eggs, Bagel, Fruits, Orange  and Apple Juice, Coffee or water. • The sitting area for breakfast was clean but we ate in our rooms most mornings. • Love the snack bar. It offers microwaveable food items like pizza pocket(7 CAD), Mac n cheese with beans which was great for my little 1 year old and snacks like chips, chocolates, muffins, oat bars and an assortment of drinks. • They have disable parking. Not that we needed it but maybe good info for someone else. • Beds we’re comfortable. Read several reviews that was contrary to that but my experience was comfortable. • Great lighting in our room when the sun was up. • Microwave and Fridge we’re great convenience during our stay. • loved the sink and kitchen cabinets. • Bathroom was really nice. The tiling doesn’t have a great finish meaning you can see that it’s a new hotel. But the design is gorgeous and our bathroom was spacious. I love that the mirror had a clock. Shower pressure was good and hot water didn’t always stay on during our stay but not a big deal for me. It was warm enough. • Reasonably priced.• has an ATM machine• Lots of eateries nearby like Caribbean Lyme(Western Asian Cuisine), TacoBell, KFC, Tim Horton, and an Italian Restaurant. They are all 1-7minutes walking distance.",
      "rate": 4.0,
      "tripDate": " June 2019"
    },
    {
      "title": "Don't judge a book by its cover",
      "text": "This hotel looks straight up run down from the outside.  Thankful for reviewers on TripAdvisor I went ahead and booked.  The outside and inside don't match to say the least. Staff was nice and helpful. Hotel appears modern and clean.  Workout area is small but just enough to store a treadmill, elliptical and set of weights.  Swimming pool was sufficient but didn't feel the cleanest.  Our room did not feel cramped as some reviews have stated. Liked the 'do not disturb' button that turns your light red by your room number. The room itself felt clean the bathroom was ok in terms of feeling clean. There was a good amount caulking around the tub and door. One complaint/feedback for hotel owners/mgmt I have is the constant light seeping into the room. Could use black out curtains. I think the ballpark level lighting is for security but I woke up at 3am thinking it was already a cloudy morning! Breakfast was good. Contents what you'd expect from a continental breakfast.  Again staff was very helpful and nice here as well.I would have given this property a 4 star but added an extra star for life lesson learned. :)",
      "rate": 5.0,
      "tripDate": " June 2019"
    },
    {
      "title": "Not the best stay but it could have been worse",
      "text": "You get what you pay for, I was only there one night. Check-in was easy. I had a room not far from the elevator.  Very noisy throughout the night and another family kept trying to get into my room, I had to yell through the door. Not clear besides the front door sign requiring mask what else they require during the pandemic. For instance, people crowded onto a small elevator, they didn’t appear to be too concerned about physical distancing. The staff and mgmt are trying and the rates are reasonable for what you get but it felt too much like I was back in the university dorm rooms, I was there for business closeby.  While they tried to make the room look clean, I didn’t get the sense that it really was. Despite the friendly staff, I would not stay here again.",
      "rate": 2.0,
      "tripDate": " August 2021"
    },
    {
      "title": "Traumatized",
      "text": "The hotel is clean and looks very different from what you see out. However, four hours after checkin, two men walked on on my family in the room, and what's worse...they had a room key to my room! My kids and I were so afraid for our lives. I approached the front desk about the matter, the person who made the mistake told me I must accept the fact that it was a mistake. I wrote the hotel about the matter. I hope I get some type of response.Then, all night there seemed to be a party on my floor. Doors slammed until about 4am. I know because I had to stay alert in case we had more unexpected visitors.",
      "rate": 2.0,
      "tripDate": " November 2021"
    },
    {
      "title": "Awful hotel",
      "text": "It’s really awful , unprofessional staff, unfriendly and location is bad. I really disappointed booking the Est Hotel . We paid for buffet breakfast but we received poor quality. Pool was closed. When I booked the hotel I saw the picture it seems that it is brand new and clean but unfortunately it was not. I never recommend this hotel to anyone.",
      "rate": 1.0,
      "tripDate": " August 2021"
    },
    {
      "title": "Pool is closed",
      "text": "Took the kids out of town here.  Booked last minute on hotwire so was not aware that many if not all pools in the GTA are closed due to covid restrictions.  We were all very disappointed but this was not the hotels fault, although I feel like posting it on website and updating booking sites would have worked.  As for the service, pleasant and direct.  Had 2 rooms, 1 definitely had smokers in it before us and something was sprayed but it was very obvious.  Marijuana was smelt often in hallways and walls are paper thin like many comments.  Looks like an old hotel that was attempted to be modernized but it needs work.  No breakfast included in my rate.  Free parking and good wifi.  NOT a 3 star hotel I thought I was getting.",
      "rate": 2.0,
      "tripDate": " July 2021"
    },
    {
      "title": "I would rate it 0 if I could",
      "text": "If I could rate it a zero, I would! Horrible customer service. The attendant was constantly leaving the front desk , causing a line and not being there when needed by customers. He spoke rudely to us and gave us the impression that we were wasting his time. Pillows, blankets and furniture were damaged and stained. Air conditioner didn’t work. Felt grungy and unclean.",
      "rate": 1.0,
      "tripDate": " August 2022"
    },
    {
      "title": "The Worst",
      "text": "The worst customer service experience of my life! And I travel a lot so that's saying something! I forgot something in the room and a month later can't get anyone to give me a straight answer. There was a note on the account saying something was found and returned which is a complete lie. The would answer and leave me on hold and then never bother to come back. They had vomit in the elevator for hours despite the front desk knowing about it. Also the room had no windows and no elevator to the 4th floor you have to take the stairs.",
      "rate": 1.0,
      "tripDate": " March 2021"
    },
    {
      "title": "Terrible hotel",
      "text": "Don’t waste your money it is disgusting from start to finish. The parking lot is a mess, the staff are rude and the place is just plain falling apart. There was duct tape on the window, the blinds were broken and a bright light shone in all night . Add to that amenities are closed and there is no free breakfast - not even coffee. This place should be closed down",
      "rate": 1.0,
      "tripDate": " March 2022"
    },
    {
      "title": "DO NOT STAY AT THIS HOTEL",
      "text": "First off - the hotel is not in a nice area. Stay somewhere nicer. There is no where to walk to and this is a purposed building behind a strip mall. When we checked in the room didn't look like the picture, it was much smaller. We asked the front desk to get a room with more floor space, traveling with 2 young kids we needed it to setup their bassinets. The second room we got was not cleaned - we found dirty underwear. They put us in a 3rd room. The 3rd room didn't have hot water. Then the faucet broke and sent water all over the room and getting myself and my kids soaked. When we returned to the room it smelled like glue and they argued that we needed to stay there. Finally they moved us to a 4th room that had floor to celing windows facing the highway. We requesterd a different room. Room 5 was good the first night, but out of water again the second night. The hotel promised a refund when I checked out... but knowing I was out of the country they just said that so I would leave. I did not get a refund and the manager refuses to take my calls. DO NOT STAY AT THIS HOTEL",
      "rate": 1.0,
      "tripDate": " July 2019"
    },
    {
      "title": "AVOID THIS SKETCHY HOTEL",
      "text": "Worst experience with a hotel in the Toronto area. Walls are so thin you can hear everything your neighbours do, even going to the bathroom. Area and staff are sketchy.There was no hot water, it was freezing cold. We couldn't use the shower. Hotel manager said they couldn't fix the water until after we would check-out and they offered to refund our last night. Refund never happened. We contacted them about it and now they are saying we don't have proof of this so they will not do anything for this situation. What a bunch of crooks.",
      "rate": 1.0,
      "tripDate": " September 2019"
    },
    {
      "title": "Decent stay",
      "text": "Stay at this hotel last night. Initially when entering the room, it appeared to be clean. After pulling the duvet back, I noticed that the duvet, the bed sheets AND all 5 pillows had hair on them. Not 1-3 strands. But about 25 strands all over. I went to the front desk to ask for a new room, he advised me that the hotel is all sold out. I said no problem, may I have new bedding. He came to look at the hairs then left. He returns with ONE, yes one pillow and asked if that’s was okay. I responded that I would like everything to be changed as it appaears that it wasn’t. He went grabbed the first sheet, duvet and 2 pillows he found. Enters the room with what he believed was clean. One pulled had red lipstick on one side. The duvet has a huge hole(shocked he didn’t notice this when he had picked it up. At this point I was frustrated. The staff member was apologetic but this was unacceptable. He then brings a second new duvet and 1 pillow and said okay goodnight. I changed the bed because housekeeping wasn’t there.Also the walls in the shower had stains on them. Aside from the old bedding and shower stains the room was decent. Washrooms really has a modern look. The hotel staff in the morning were friendly.",
      "rate": 2.0,
      "tripDate": " August 2019"
    }
  ]
}