{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Fairmont Royal York",
    "url": "/Hotel_Review-g155019-d155495-Reviews-Fairmont_Royal_York-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.0",
      "reviewCount": 1763
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "100 Front Street West",
      "addressLocality": "Toronto",
      "postalCode": "M5J 1E3",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/11/e1/cf/0d/aerial-view.jpg?w=500&h=-1&s=1"
  },
  "description": "See why so many travelers make Fairmont Royal York their hotel of choice when visiting Toronto. Providing an ideal mix of value, comfort and convenience, it offers a luxury setting with an array of amenities designed for travelers like you. For those interested in checking out popular landmarks while visiting Toronto, Royal York Hotel is located a short distance from Scotiabank Arena (0.2 mi) and Rogers Centre (0.5 mi). Rooms at Fairmont Royal York offer HDTV, business amenities and an automated minibar providing exceptional comfort and convenience. ALL - Accor Live Limitless loyalty guests can go online with free internet access. Room service and a concierge are some of the conveniences offered at this hotel. A pool and breakfast will also help to make your stay even more special. If you are driving, valet parking is available. When you’re feeling hungry, be sure to check out Pai Northern Thai Kitchen, Khao San Road, and Kiin, which are some Thai restaurants that are popular with locals and out-of-towners alike. During your visit, be sure to check out popular attractions like CN Tower (0.4 mi), St. Lawrence Market (0.5 mi), and Graffiti Alley (0.9 mi), which are all within walking distance of the hotel. At Fairmont Royal York, your comfort and satisfaction come first, and they look forward to welcoming you to Toronto.",
  "featues": [
    "Valet parking",
    "Wifi",
    "Pool",
    "Fitness Center with Gym / Workout Room",
    "Bar / lounge",
    "Evening entertainment",
    "Pets Allowed ( Dog / Pet Friendly )",
    "Airport transportation",
    "Paid private parking on-site",
    "Paid wifi",
    "Hot tub",
    "Indoor pool",
    "Heated pool",
    "Fitness / spa locker rooms",
    "Sauna",
    "Coffee shop",
    "Restaurant",
    "Breakfast available",
    "Breakfast in the room",
    "Complimentary Instant Coffee",
    "Complimentary tea",
    "Kids' meals",
    "Taxi service",
    "Conference facilities",
    "Banquet room",
    "Meeting rooms",
    "Photo copier / fax In business center",
    "Spa",
    "Massage",
    "Salon",
    "24-hour security",
    "Baggage storage",
    "Concierge",
    "Currency exchange",
    "Non-smoking hotel",
    "ATM on site",
    "Butler service",
    "Doorperson",
    "24-hour check-in",
    "24-hour front desk",
    "Express check-in / check-out",
    "Private check-in / check-out",
    "Dry cleaning",
    "Laundry service",
    "Ironing service",
    "Shoeshine",
    "Allergy-free room",
    "Bathrobes",
    "Air conditioning",
    "Desk",
    "Housekeeping",
    "Coffee / tea maker",
    "Flatscreen TV",
    "Complimentary toiletries",
    "Interconnected rooms available",
    "Room service",
    "Safe",
    "Telephone",
    "VIP room facilities",
    "Clothes rack",
    "Iron",
    "Wake-up service / alarm clock",
    "Minibar",
    "Refrigerator",
    "Electric kettle",
    "On-demand movies",
    "Hair dryer",
    "Bridal suite",
    "Non-smoking rooms",
    "Suites",
    "Family rooms"
  ],
  "reviews": [
    {
      "title": "I love this hotel!!",
      "text": "I decided on the spur of the moment to stay the Royal York last week, after a long day of flying. I took the UP Express from Pearson, crossed the street, walked into the Royal York and booked myself a room for the night. I am so glad I did! I have known the Royal York for many years, have had many a business meeting in the lobby bar and library bar, but had never actually stayed there. The hotel itself is beautiful and so nicely appointed. My room was very comfortable, and very quiet, for which I was so grateful!! I have stayed in so many hotels where noise is a problem, and it's always disappointing to not be able to sleep well when paying for a hotel. I don't think I woke once the entire night, which was lovely. The bathroom in my room was also very nice, and I really appreciated the quality Le Labo products the hotel provided. As mentioned, I was really tired after a long day of travel, so even though I was tempted to go downstairs to eat in the gorgeous Reign dining room, I opted for room service instead. The food was very good, and came to the room quickly. It was a nice surprise to get a call from In-Room- Dining shortly afterwards asking how my meal was. I did go down to Reign in the morning for breakfast, and again, it was very good and I just love the design and decor of the room. Every person that I dealt with who worked at the hotel was very friendly and polite. I go to Toronto often on business, and The Royal York will now be my go-to hotel, without a doubt.",
      "rate": 5.0,
      "tripDate": " January 2023"
    },
    {
      "title": "Exceptional ",
      "text": "Stayed here Feburary 29th Leap year day.That's something special in itself, as was our stay at the Fairmount Royal York. Special acknowledgement to Bernie whom did our check in which was both efficient and friendly. Our room was on the 8th floor with a view of the CN Tower. Room was immaculate. Bed was dreamy. Room service for breakfast the next morning was fit for a king and by far the best room service breakfast we have ever had. We tip our hats to the facility and staff who went out of their way to ensure  our stay was impeccable. We shall return.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Amazing Anniversary Stay",
      "text": "My husband and I booked the FRY for our 20th anniversary, to spend the weekend in the city. It’s always been my dream to stay at the FRY and now it has finally come true! I booked our stay through Priceline, which was a standard room, so called the hotel directly to see if there was a possibility of an upgrade. I had the pleasure of speaking with Joy from the front desk, whom helped complete my reservation. Joy offered me a free upgrade to a Luxury room or an upgraded Signature suite for a small fee. I took advantage of the Signature suite as it was our special weekend.  When we checked in, we where pleasantly surprised that we where upgraded again to their Gold Floor, in an amazing one bedroom suite at no extra charge! This room was incredible!! The details and decor in this room was absolutely beautiful, I have never stayed in a room that was this posh! There is absolutely nothing negative I can say about this room, even the lights in this room where perfect, sensors to turn on and off the lights when you walked into the room or bathroom! Just perfect in all aspects! I would have giving this review a 5 star, if it wasn’t for the slight mishaps that I wish we could have avoided, to make our weekend just that much better. We decided to check into the hotel one day earlier to take advantage of the whole weekend. I called the hotel to see if they can check us in or get us another reservation, I spoke to someone whom answered the phone at the hotel, I explained my situation, he said he would have to talk to front desk and let me know. He called me back and told me there was no way front desk could accommodate us and I would have to talk to reservations. I spoke to the reservation department and they had quoted me an astronomical rate if I wanted to check in the night before, so I called Priceline again and got another reservation, which lead me to two separate reservations. When we checked in, I asked if we could we could just get the same room for two night (even if I paid the upgraded fee), rather then changing room, the lady who checked us in said, unfortunately none of the room that we are booked in for the second night are available, but I couldn’t understand why she couldn’t find us a room for two straight nights (I would have paid the extra fee if need be), when she had just checked a guest in before us who didn’t have a reservation, offered him a Gold Floor room for way, way less then what I was offered over the phone through reservations. Maybe we should have just walked in on our first night and possibly could have gotten better service booking and rate! A reputable and great service hotel, it really sucked that I had to jump through those hoops to come in a night earlier. So, unfortunately I can not give this hotel 5stars in this retrospective, I felt like more could have been done or accommodated regarding adding a night. Other then that, the service was phenomenal, every time you walk-in or out, someone from the concierge or security would greet you. Anything you needed someone would provide you. Everyone is cheerfully and always willing to help! Overall it was a great weekend and a nice experience (despite the bump on the road)!",
      "rate": 4.0,
      "tripDate": " July 2021"
    },
    {
      "title": "Beautiful hotel, room a little small",
      "text": "The hotel is absolutely beautiful and in a perfect location downtown. Check in was easy and staff was super friendly. Note - if they tell you they are adding a $30 resort fee, just kindly ask them to remove it as it is not mandatory. The room was nice and the view from the room was spectacular! it was a view for the CN tower. The room had enough towels, pillows, toiletries, kettle, coffee machine, etc. I would have liked a mini fridge. The only thing i found was the room was a little bit on the smaller side, especially the bathroom. There was little to no counter space. The next day, you can do an online check out so you don't have to wait in line, you can drop of your card in the drop box near the elevator. Overall it was a nice, comfortable stay.",
      "rate": 4.0,
      "tripDate": " March 2020"
    },
    {
      "title": "Lacking in COVID protocols",
      "text": "Beautiful historic hotel in a good location a short walk from Rogers Place. Staged at many Fairnonts and was disappointed in a few things which maybe COVID contributed to. The check-in line was very long - it took me 25 minutes in line to get checked in.   The breakfast at Reign was an awful experience. There was just a few tables with customers with the restaurant being mostly empty, yet the hostess seats us at the smallest lounge table. Four adults squeezed into this was absurd. Considering we ended up with a $200 bill for bacon/eggs breakfast, it’d be nice if they didn’t have to remove all the saucers from the coffee cups just so the cup could fit on the table. We had to eat very carefully so we didn’t knock items off the table. With Covid precautions, this hotel is lacking. Our bathroom wasn’t cleaned well prior as there was hair on the floor and on the toilet. Makes me wonder how well the rest of the room was cleaned for COVID other than placing the tv remote in a plastic bag. Also, I’m not sure what the regulations are in Ontario right now but the valet (there is no self parking) doesn’t wipe down the steering wheel, gear shift or keys that he’s touched before handing the car to you. He’s also in the vehicle without a mask which risks his health as well as ours. I opened the windows and left the doors open for few minutes prior to driving each time but when I drop off the vehicle, they hop right in to park it even though we’ve had 4 people in the car with no masks for a long period.  Overall I’m disappointed with this stay.",
      "rate": 2.0,
      "tripDate": " August 2021"
    },
    {
      "title": "Perfect Location, Some Minor Glitches",
      "text": "Perfect location to the Scotiabank! Upon arrival, all staff seemed very friendly and professional. The focus was on service which I like to see as I too work in the hotel industry. Once we checked into our first room (East Wing), it was rather dissapointing after the initial impression of the hotel. The bathroom seemed original to the building, the outlet in the bathroom would not even hold a plug, and lastly, the connecting door to the room beside us offered zero sound proofing (I could hear the other guest literally blow their nose). We spoke to the FD and asked if we could perhaps pay an additional fee to not have a connecting room. The gentleman was less than enthusiastic and friendly in comparison to any employee we had encountered thus far, nevertheless, he offered us a complimentary upgrade to a \"luxury\" room up in the main elevators, which we were very happy with. The luxury room was basically the same as the previous but with a redone bathroom, and nicer finishes, however, it had no connecting door which was exactly what we hoped for.One last dissapointmnet, which I understand is often out of the hotel's control, but should definately be relayed to guests upon booking.. the pool was closed for its annual \"two week maintenance\" we were told when we went to take a look at it. Thankfully the storm had us arriving late with not enough time to swim, but I can imagine how upsetting that may be for others. Overall, we enjoyed ourselves and would definately return!",
      "rate": 4.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Festive Retreat",
      "text": "I don't usually write reviews, but I am taking the time to do so as we need to support our local hotels and restaurants that have safety protocols in place for guests who agree to follow the guidelines. This hotel is very special, so full of history, and active in the community. Our concierge, Louise of the Gold Floor  anticipated our every need prior to arrival  and throughout our stay. All possible protocols were taken to ensure every aspect of our stay was safely distanced and hygienic. We had not stayed at the hotel since it was renovated a few years ago. The entire experience was a dreamy splurge, the view exceptional and the room was ultra well-appointed.   Just how the items we ordered from the In Room Dining could have arrived as perfect as the did (as if we were dining in one of the restaurants) is beyond me.   We gifted ourselves the turkey and duck confit on the Christmas menu and on the next night we couldn't resist ordering from the  menu again.  Our family bubble retreat was in keeping with the current covid restrictions and was intended to replace the excitement of our annual gathering. So thankful we could do this.  It was so wonderful that we may have started a new tradition. Plus, if Toronto restaurants stay closed to dining for much longer we may respectfully be back before we know it-- for the dining in a guest room.",
      "rate": 5.0,
      "tripDate": " December 2020"
    },
    {
      "title": "The last game in town for truly bespoke service!",
      "text": "From begin to end my newly wedded wife and I were treated like royalty. Fred the doorman who was celebrating his 70 birthday and almost 40 years of service with the Royal York made us feel as if we were old friends. The management met or exceeded our every special request and was nonstop with upgrades, lavishing us with so many unexpected perks that it was almost embarrassing (almost). Zak our server at Reign was a fountain of information and struck the perfect balance between attentive and giving us the privacy we desired. We are locals and have always heard that the Royal York still treated all of its guests in this way while other high end hotels have long forgotten how but now that we have experienced this for ourselves we won’t consider another place when staying in the core.",
      "rate": 5.0,
      "tripDate": " September 2020"
    },
    {
      "title": "Beware the \"Urban Fee\" Bait & Switch",
      "text": "Let me begin by saying, I've staying at the Royal York in Toronto several times over the years and it is certainly an iconic hotel in great location in downtown Toronto. I stay at a lot of Fairmont hotels as I love their locations and service, although the services seems to be on the decline since they were purchased by Accor. BEWARE: On my most recent stay, which was to watch a watch the Oilers/Maple Leafs game, I noticed that they have added a mandatory \"Urban Fee\", which is explained to be a grouping of \"sought after amenities\", such as \"high speed internet\" and 15% off Ripley's Believe it or Not.  It was very disappointing to see, what is considered to be a higher end hotel, automatically add on an additional $30 fee at check-in without disclosing in advance. It's deceptive. Simply be honest and transparent and add it to the fee up front at the time of booking. Aside from that the room are nice and the new lounge bar is quite lovely.",
      "rate": 3.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Not a luxury 5 stars hotel at all!",
      "text": "Well this is definitely not the best hotel in my travel life.+Location View Old historical building Breakfast -Very dusty roomCheap toilet paper, soup and other toiletries No a free welcoming bottles of water (only for additional fee)No sleepers Not friendly staffI’m very disappointed! When we arrived and went to front desk only for Accor ALL members ( I have a gold level), the lady from the front desk asked us to wait and started check in other client who was not a member of loyalty program. This was very strange because we came first then other client. The room was very dusty. It seems like the room was not cleaned from the day when hotel was open in 1929. Unfortunately, I have allergy on dust, and during the stay I have a problem with my breathing. It’s lucky for me that I always take with me some medicine which helps me breathe normally again.The all toiletries are cheap. This is not appropriate for 5 stars luxury hotel. It seems like all toiletries was bought in a Fix Price Market (all for 1 $).There is no free welcoming bottles of water, like in the other not luxury hotels and not the 5 stars hotels. All water was only for money (for additional fee). Also, no sleepers at all.The breakfast was included in stay price, and we said about it in the restaurant, but after breakfast we received a receipt on $126 for breakfast and the 2nd day on $82. The waiter said that only one item from menu is included in our breakfast, other for additional fee.The elevators in this hotel live their own lives. You don’t know which one is opening their doors and when.And the last - it was an alarm in the middle of the night. Thanks for unusual way to wake me up at 2 am. I couldn’t fall asleep after that until morning.Okay, it’s not so bad in the hotel. The first thing it’s location! It’s prefect. The view from window is beautiful. The old building and atmosphere here and design is nice. The breakfast was delicious.But still this is not worth it all those money which hotel takes. It’s not worth it for 700$ for 2 nights. Sorry guys!If you represent yourself like a 5 star historical luxury hotel please be on this level or reduce the price for stay for your current level of service which at this moment much lower then you write on your website.",
      "rate": 3.0,
      "tripDate": " October 2021"
    },
    {
      "title": "Price for location cannot be beat.",
      "text": "We visited Toronto in August for a five-day city getaway and booked at the Fairmont Royal York after looking at a number of downtown hotels (over $400/night). We have stayed at a number of Fairmont locations, so the size of the washroom, the long expansive hallways and the historical building is true to the brand. What is also true are strange things like needing to request a fridge to keep drinks cold (I think the days of weighted mini bars in rooms need to be over), small almost miniature bathtubs and walls seeming paper thin (we listened to a screaming baby for well over an hour Sunday morning around 5 am). The location of this hotel is amazing if you will be spending time at Scotiabank Arena, Rogers Centre, CN Tower, and Ripley’s Aquarium. It is within walking distance and there are a variety of restaurants and car rental companies within the block. The hotel lobby restaurants were lively, and we ate at Reign twice during our stay. The fries and sliders were amazing, drinks were delicious, and atmosphere was cool but also felt casual. We took the UP train from Pearson to Union station, and I highly recommend this for anyone staying in downtown Toronto after flying in.  This service is very convenient and reasonable for price – to and from downtown was $48 for two adults (children under 12 are free).  Our stay was fairly standard - the room was clean; the hotel common areas were clean, and we enjoyed the pool and hot tub facilities. If you are looking for unparalleled luxury in downtown Toronto and are not looking to stay walking distance to the lakefront, there are other hotel options that would probably be more luxurious. This fit the bill for our stay!",
      "rate": 4.0,
      "tripDate": " August 2023"
    },
    {
      "title": "Avoid this hotel at all costs for special occasions",
      "text": "My wife and I stayed at the Royal York on our wedding night and they knew it was that. We even called the day before to verify our late check in. The front desk receptionist addressed me by title and name and reassured me that they knew it was our wedding night and that we would be arriving late. When we arrived our king room was downgraded from a king room to a Queen and a food voucher was only offered after complaining. We waited in the lobby (my wife in her wedding dress) for 15-20 minutes at 2:00am only to be given a king room with no additional compensation. Any respectable hotel would upgrade a newly wedded couple and have a bottle of champagne waiting in the room. This is appalling and negatively affected the most important day of our lives. We recommended avoiding this hotel at all costs, especially for special occasions, including those you only experience once in your life.",
      "rate": 1.0,
      "tripDate": " September 2021"
    },
    {
      "title": "Fairmont stay unsatisfactory",
      "text": "I had recently stayed at this hotel for my birthday and had some unsatisfactory encounters.Upon arriving at your hotel at 4:00 pm we waiting 2 hours to check in to gain access to our room. There was a technology issue with the cards so we were unable to gain a key card for our room and were told we would get it within the hour.We had reservations for dinner at 7:00 pm that we now became late for due to the delay. We also were not able to gain a key card until after our night due to the inconvenience.During all the confusion with check in we did not gain a WIFI password and had to use data or pay for the guest 20$ wifi during our stay.Upon checkout we waited another 1 hour due to the line aswell as waited approximately 30 minutes to track down and elevator since it seemed like only 2 elevators were working at the time. With COVID its hard to find an elevator with just family members or people comfortable riding together. This made it difficult to get from our floor to the lobby.I would never of complained if this was a motel 6 or a regular hotel. But since this is a prestigious hotel i found my stay not as relaxing or enjoyable as i would of hoped.Beautiful hotel overal. Just not the best encounter",
      "rate": 2.0,
      "tripDate": " August 2021"
    },
    {
      "title": "Will Return!",
      "text": "Hotel staff are present and courteous; they will always acknowledge and greet you (even a housekeeping attendant greeted us from way down the hallway) and they will definitely make you feel noticed. Apart from the great service from staff, the building itself is lovely. Decor taste is wonderful and the property itself is well-kept and in good condition. It was also very clean, and all amenities and tools are in working condition (some hotels I visit sometimes have a lamp not working, or an outlet not working, etc). The hotel itself offers a lot of great services, so if you are new to the city they will definitely have resources available to guide ur stay. It is a well-oiled machine. The room is also exactly as the pictures show, you will not be let down. I only booked a Junior Suite (it has a separate living room area and a separate bedroom area, plus two bathrooms!) but I will definitely book a larger suite in the future because the hotel is just lovely! The only disappointment of our stay was that we could not explore the hotel fully! Because of the COVID-19 pandemic regulations we didn’t have the opportunity to dine at their restaurants or go to their spa and such (obviously). We would of loved to explore everything the hotel had to offer! We will definitely visit again once the pandemic is no longer a concern, to get a full experience! If you’re looking for a QUALITY stay, I’d definitely recommend Fairmont.",
      "rate": 5.0,
      "tripDate": " October 2020"
    },
    {
      "title": "Great hotel and location",
      "text": "This hotel is amazing! The location is fantastic right across from union station and close to a Tim Hortons and other great restaurants. We ate at Jack Asters and Moxies that are close by, both great restaurants and service. The hotel itself is very beautiful and sophisticated, it made me feel like I had gone back in time but the rooms are tastefully done and clean. I would definitely stay here again. My only suggestion would be save your money on a car rental because the valet parking is $50.00 and you are so close to everything. Unless you are going a far distance it’s pretty easy the jump on the train or call an Uber. This is a great location and hotel for anyone wanting to stick around the downtown area, I highly recommend the Fairmont!",
      "rate": 5.0,
      "tripDate": " August 2021"
    },
    {
      "title": "Beautiful updates, great staff",
      "text": "We had a great stay. The updates in the rooms and common areas are beautiful. The tub in my room was very small, unfortunately. The pool area could use an update, or at least a proper grout cleaning in the hot tub. Staff was super friendly and helpful. Room service was delivered very quickly even during peak breakfast time.",
      "rate": 4.0,
      "tripDate": " October 2021"
    },
    {
      "title": "Amazing Overnight Stay",
      "text": "Fairmont Royal York will hold a special place in our hearts because this is where my fiancé proposed. Once the reservation was made my fiancé called them to let them know about the proposal. They helped to make the day incredibly memorable. The room itself was gorgeous with modern amenities, a large sitting room, a wet bar and a well appointed bathroom with a huge walk in shower. They had sparkling water (we don't drink), chocolate covered strawberries and a personal note from the manager delivered to our room and when we left to enjoy the pool and hot tub we returned to the room beautifully decorated with rose pedals all over the room. It was truly something that we'll remember forever and have decided that we will come back each year to celebrate. Anyone considering Fairmont Royal York for a special occasion or just a weekend getaway won't be disappointed!!",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Great Location",
      "text": "When I checked in the front desk was very friendly. I have stayed here before but they asked us if we wanted to upgrade our room and advised us of the text messaging service they have to communicate with them (which is very convenient). Rooms were very nice, bed was very comfortable, but bathroom and shower were very small. We like this hotel as it is closed to everything. If you are looking to go to CN tower, Scotiabank Arena or Rogers Centre this is a great hotel to go too. I wanted to warn everyone that room service takes a while. I was there on a Thursday afternoon and ordered chicken fingers and French fries at 3:00pm. I was told it was going to take an hour to get to my room. Well it took over an hour to get the food to the room and when it did arrive the French Fries were not even warm. I can only imagine how long it would take if it was a weekend or evening.  Also make sure you check your bill when you leave. I was charged for items that I was told were covered. The hotel was great to reverse them right away, but I am glad I checked right away.Overall I enjoyed may stay and would stay there again.",
      "rate": 3.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Truly fabulous stay - great service, great location, lovely rooms",
      "text": "This is one of the loveliest hotel stays I've had in years.  The hotel's staff are absolute gems - from Paul in the valet area, the doorman who had treats for my friend's dog, to Paul in the Clock Bar who remembered us (and our orders!).   The staff were all exceptionally welcoming.  The hotel is in a great location to see the city - close to the CN Tower, sports, museums, great restaurants, etc.  The rooms are very well appointed - they have a kettle, coffee maker, top quality bedding (down pillows) and a powerful shower.  I look forward to my next stay here!",
      "rate": 5.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Weekend away ",
      "text": "I felt like Macaulay Culkin in Home Alone with the huge amazing Christmas tree in the lobby & beautifully decorated hotel for the Christmas season. We stayed in one of the renovated rooms, it was nice & it was bigger then expected for Toronto. Our room was however right in front of the ice machine, that was off putting because It was rather loud, but not constant thank goodness. Hotel was beautiful. Had the charcuterie from the bar that night before we went out for dinner, no mustards or compotes, no fruit, nuts or pickles. Nothing special really, kinda disappointing. We were charged $100 for room incidentals (normal), but the money was not returned even though we didn’t use it. I had to call a week later to find out why it was not put back on our card still. Apparently because I payed with a debit visa. So I have a credit of $100. Kind of annoying. I wish upon check in they would have said something about that. We will be back (mostly now because we have a credit) next time we come to the city for another celebration.",
      "rate": 3.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Loved it…4.5",
      "text": "Stayed for a weekend in July with my husband. We have stayed at many hotels in Toronto but this was my first time at the Royal York. We arrived early but had no issue checking in and getting our room. We were assigned a king room on the 7th floor. It was very nice. I had been told the rooms were very small and somewhat dated but honestly I didn’t find that to be the case at all. No, not the biggest room ever but plenty of space for two people and modern without losing it’s charm. They have tried to keep the amenities as they would have been in past years (robes, shoe shine stuff, an actual mini bar….) which was cool. Big TV with lots of channels, very comfortable bed, AC worked well and the room was nice and quiet. We opted out of having our room cleaned (just prefer not having extra people in or out right now) but the housekeeping staff stopped us in the hall to give us more towels and toiletries. The hotel itself is honestly just so charming, historical and gorgeous. Felt like I was always looking at something! We had a drink on their clockwork terrace and breakfast in the Reign restaurant….both expensive but very good. We used the pool which was great…honestly I hope post covid hotels keep the reservation system! It’s nice knowing when you’ll have a spot. Only issue with our stay….the valet parking. I wouldn’t recommend it right now. When we dropped the car off the gentleman told us to give them about 15 minutes to pick up because they were busy and didn’t have all staff back yet. That is TOTALLY understandable. But, it actually took about an hour to get our car. Thankfully we weren’t in a hurry  and the front desk did let us keep our room while we waited, which was awesome and very helpful!  BUT….the valet is very expensive at $49 a night and people use it because it’s convenient. Until things are more back to normal they should maybe drop the price and tell customers their car is going to take a LONG time. I can’t wait to stay at The Royal York again. Moving it into my top 5 Toronto faves!",
      "rate": 4.0,
      "tripDate": " July 2021"
    },
    {
      "title": "A real mixed bag",
      "text": "I stayed at the Fairmont Royal York for 2 weeks and found it to be a nice, hotel in a great location, however it is let down by the attention to detail that you would expect from a luxury hotel. The room that I stayed in on the 11th floor was very noisy particularly at weekends when the corridors were active until 2 or 3 in the morning before the housekeeping staff begun their rounds at 08:30. My name was spelt incorrectly throughout the system which given that the booking was made by British Airways and their booking had to be correct to match our passports came as a real surprise and meant that we couldn't register for the wifi until we worked out that the spelling was incorrect. For a luxury hotel to provide wooden spatulas in their rooms instead of teaspoons was a real put-off for me, I had paid a lot of money for a special trip and had upgraded the room so this was also surprising. Finally, British Airways had managed to miss one of our bags off our actual flight and it came later, we advised reception of this and a note was put on our account saying they would call us once and deliver it when it arrived, I visited the desk on 2 further occasions as the BA system advised that the bag had been delivered but no notes had been updated with this and again I was advised it would be delivered to us. On the third occasion the receptionist took me round to the Bell boys stand and my case was sitting there presumably waiting for me to collect it.",
      "rate": 3.0,
      "tripDate": " May 2022"
    },
    {
      "title": "Well located and classy",
      "text": "This hotel is very elegant and well located directly across from the main train station. Getting our luggage to our room required patience (took 45 minutes) and a trip downstairs to assist locating the luggage. I think the bell staff need to be trained on customer service. What made the Royal York 5 stars was Patricia in housekeeping. My son had a cold and she arranged hot water, honey and tea to help him. She really cared and went the extra mile when i tried to tip her she refused the trip which is something i had never experienced in North America. The pool and hot tub was nice and popular with my children. Direct access to the path is very handy when the weather is not too good.",
      "rate": 5.0,
      "tripDate": " December 2019"
    },
    {
      "title": "Dirty Room at the Fairmont Royal York",
      "text": "When we got into our room, we had a hair brush ball of hair in our toilet, smudges all over the coat closet mirrors and a half eaten pack of Pringles that had been put back into the snack drawer. The snacks clearly weren't checked over because the half eaten pack of Pringles was put back perfectly with the lid on. If you are a cleaning staff of a highly reputable hotel then cleaning and check over should be done thoroughly.",
      "rate": 2.0,
      "tripDate": " February 2020"
    },
    {
      "title": "home away from home",
      "text": "My appreciation to the staff and the comfortable accommodation, the positive experience of the stay started as soon I entered into the hotel with friendliness of the doorman, then I was greeted with helpful and pleasant staff at the check in counter. the room is well maintained with tasteful decor, this adds coziness and warmth to the room. The linens and bed are in perfect shape, my sleep was uninterrupted and waking up feeling refreshed. Thanks for checking in on the second day of my stay. I would recommand to anyone who wants to spend a wonderful time for those special occasions.",
      "rate": 5.0,
      "tripDate": " May 2021"
    },
    {
      "title": "Attainable luxury",
      "text": "In years of old hotels had to bring wonder and glamour to guests to stand out among the architecture and high service standards expected. In many ways Fairmont Royal York has maintained this luxe atmosphere without being stuffy.It's restaurant, Reign serves the most delectable dishes with impeccable service. However, it appeared that my server was perturbed that I, a young female was having lunch alone, however he soon gathered himself and redeemed the service.Perhaps my favorite feature is its location. Literally across the street from Toronto's Union Station it is perfect for travelers going anywhere! If traveling by plane, a 30 minute ride on the Up train (Direct train from Pearson Airport) for just under $13. one way gets you across the street from Fairmont Royal. Rail, subway, TTC, buses and some coaches are also across the street. Also, parking, valet services, walk-ability to everything in about 15 minutes. Best spot hands down for tourists who want to get around and see everything but still wish to have luxe amenities that won't break the bank. Also a sensible choice for business travelers and the more discerning connoisseur of history.",
      "rate": 4.0,
      "tripDate": " December 2019"
    },
    {
      "title": "Luxury Getaway",
      "text": "This hotel exceeded my expectations in many ways:Location: This hotel is centrally located and accessible to many sights...across the street from Union Station and in close proximity to St. Lawerence Market, the CN tower, Nathan Phillips Square and many more. That being said, make sure to ask for a nice view of the CN tower or Union Square. You won't be disappointed! Staff: We were warmly welcomed by Imran who checked us in promptly. He was attentive and came all the way around the desk to address my daughters and tell them about the life size gingerbread house in the lobby. He went above and beyond by sending holiday cookies to the room for the girls to decorate! This instantly set a fun tone for the girls and gave mommy a little time to unwind :-) So thank you Imran for your attention to detail and for your warm welcome! Upon leaving, Irvika checked us out and also went out of her way to make sure we were taken care of and addressed a minor issue we had in the room (loose glass on the coffee table). Check out was a breeze. Thank you Irvika! Room: What a view! We had a view of Union Station and the ice skating rink set up in the front. My girls loved watching it and looking at the lights of the skyline in the background. The room itself was very clean. There were even small robes for the girls. Quite honestly, I would give it 5 stars for the beds alone. It was heavenly. Best sleep I've had in a while. Pool: The pool was just ok. Nothing to write home about. There was a main pool, a small (wading?) pool and a hot tub. My girls had fun so no complaints. Overall, we had a great getaway for the holiday all thanks to the wonderful and attentive staff as well as the amenities. We will definitely be back :-)",
      "rate": 5.0,
      "tripDate": " December 2019"
    },
    {
      "title": "A hotel within a hotel",
      "text": "I had a one-night staycation with a friend at the end of July 2022. I grew up in the GTA and I cannot remember how many times I have passed by the hotel going to Union Station, but I have never been inside the hotel until this week. To say I was impressed was an understatement. Stepping into the hotel, I felt like I was whisked away from the hustle and bustle of the city centre and into a relaxing lounge. While we waited for our room to be ready, we had cocktails at the Clockwork lounge in the lobby. The Meet Me at the Clock cocktail was delicious and it paired well with the oysters. We were upgraded to a Signature Room which had more than enough space, and were welcomed with some chocolate-dipped strawberries in the room. I also appreciated how quiet the room was even though we were right next to Front and University/York. We also enjoyed dinner and breakfast at Reign. The restaurant was a quite pricey but we had dining credits from our package to cover some of our costs. I felt genuinely welcomed by the staff and I was impressed by their attention to detail. Breakfast was also offered at Reign and you could choose between a breakfast buffet or the à la carte menu (we had the buffet). Although the breakfast spread wasn’t huge (your typical continental breakfast spread, smoked salmon, and a variety of baked goods and fruits to choose from), I thought it was enough for breakfast. I had heard the hotel harvests honey from its own beehives, but I must have missed it. I also had an opportunity to tour the second floor and the fascinating history of the hotel. Overall, we had a great experience at the Fairmont Royal York. It truly had a hotel in a hotel feel to it. We may have been steps away from Union, but you would not know it.",
      "rate": 5.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Fantastic stay, great customer service and great location",
      "text": "We stayed for 1 night on the 12th floor, ordered room service at night and ate breakfast in the morning onstie.  All of the food was exceptional and the stay exceeded our expectations. THe room was spotless and it was definitely deep cleaned between guests.  The converter was obviously cleaned and placed in a bag which was quite comforting, given that this is typically a very unsanitary item. THe food was excellent and everything about the stay exceeded expecation",
      "rate": 5.0,
      "tripDate": " September 2021"
    },
    {
      "title": "A Canadian Classic",
      "text": "This was my first experience staying at a Fairmont hotel and I am a new fan! First impressions say everything. I was warmly greeted by the doorman who took care of my luggage and directed me into the hotel.  WOW!  The hotel is decorated in an art deco style and I felt like I was in a 1920s movie. These days hotels can be generic, sterile, and unimaginative. The Royal York is unique, warm and elegant. Check-in was efficient, and struck the right balance of professionalism and friendliness.The room was spacious, beautiful and immaculately clean. Again, this was not your average hotel room. The decor was unique in an art deco style. I felt like I was in a NYC Park Avenue apartment. I appreciated the tea pot and beautiful tea cups.The bed was comfortable and linens were luxurious. The bathroom was amazing with a separate w.c. and large shower. The tub was the largest I’ve ever enjoyed in a hotel. It’s hard for a hotel to surprise you with amenities, but the Royal York did that with their “SkinJay” aromatherapy system for the shower. They provide you with different pod essences that attach to the shower and you can enjoy a unique experience depending on your mood (relax, revive, etc). I ordered room service twice and it was delicious and arrived quickly. The staff taking the order always said, \"It's X o'clock now, your meal will arrive by X o'clock\". Every contact with staff was flawless and they always expressed their appreciation for my patronage during these difficult times. I will definitely return to The Royal York. Congratulation to staff and management for a unique, wonderful and memorable experience.",
      "rate": 5.0,
      "tripDate": " November 2020"
    }
  ]
}