{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Gladstone House",
    "url": "/Hotel_Review-g155019-d582667-Reviews-Gladstone_House-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.5",
      "reviewCount": 1073
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "1214 Queen St W",
      "addressLocality": "Toronto",
      "postalCode": "M6J 1J6",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/29/02/9b/37/front-view-night-v-new.jpg?w=500&h=400&s=1"
  },
  "description": "Situated in West Queen West, one of Toronto’s most creative neighbourhoods, the reimagined Gladstone House maintains its emphasis on culture, art, and diversity, while ensuring the building’s rich history and iconic original architecture remain preserved. Featured in Michelins‘ Toronto Hotel Guide, the celebrated boutique hotel, steeped in history, features restored exposed brick walls, curated local art and innovative lighting applications that transition throughout the day, bringing the building to life.",
  "featues": [
    "Paid private parking nearby",
    "Free High Speed Internet (WiFi)",
    "Bar / lounge",
    "Evening entertainment",
    "Conference facilities",
    "Banquet room",
    "Baggage storage",
    "Non-smoking hotel",
    "Parking",
    "Wifi",
    "Restaurant",
    "Breakfast available",
    "Happy hour",
    "Special diet menus",
    "Wine / champagne",
    "Meeting rooms",
    "Shared lounge / TV area",
    "ATM on site",
    "24-hour front desk",
    "Allergy-free room",
    "Air conditioning",
    "Housekeeping",
    "Telephone",
    "VIP room facilities",
    "Cable / satellite TV",
    "Flatscreen TV",
    "Bath / shower",
    "Private bathrooms",
    "Wake-up service / alarm clock",
    "Complimentary toiletries",
    "Hair dryer",
    "Bridal suite",
    "Non-smoking rooms",
    "Suites"
  ],
  "reviews": [
    {
      "title": "Beautiful Winter Wedding!",
      "text": "We had our wedding at the Gladstone Hotel on Saturday February 8th, 2020. It was honestly better than we could have expected! The food was excellent – we had many compliments on it from guests. Initially we had gone with their Winter menu, which was offered to us at the time, and we had chosen the bone-in rib steak and hoisin butter salmon. But to be honest, we were not happy with those selections and asked for alternatives from their non-winter menu. You should know that there was an extra charge to do so, but in our opinion, it was well worth it. We chose the slow-braised short rib and the black cod, both of which were delicious. The staff were extremely friendly and helpful throughout the entire day (checking in on us while getting ready in the bridal dressing suite) and night (checking in with us throughout cocktail hour and dinner) to make sure that everything went smoothly. We paid the extra $100 to have a Gladstone staff member help set up for the ceremony and the reception and everything was beautiful! We loved how everything looked, it was well worth it! We also chose to add uplighting which added a great effect. Having the ceremony, cocktail hour and reception all at the same venue was also very convenient for guests. The signature welcome cocktails that were offered to guests when they arrived (we chose “the Salon”, which had Lot 40 whisky, maple syrup, grapefruit and egg white) were a huge hit. Following the ceremony, the cocktail hour was in a gallery that was already decorated with (rotating) art displays, so we didn’t even need to add anything to decorate that room, it looked great on its own! We also had a few family members and friends staying in the hotel and they all commented on how great the staff were in helping them settle in and feel comfortable. They were quick to assist my parents in using the elevator as my father has mobility issues. We also stayed two nights in the hotel – the night of our wedding and the night after. We really enjoyed our stay in the Tower Suite and were so happy to just relax the day after the wedding. We were interested in going to the drag brunch the next morning at the hotel, but it books up fast so make sure to make your reservations in advance. Finally, we would also really like to thank Sarah McGree, she was a huge help in organizing the event for us. She was in regular contact with us throughout the entire process and was very helpful. She answered all of our questions very promptly and offered us planning advice. We were so glad that we had the opportunity to work with her in planning our special day.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Amazing Experience!!!",
      "text": "I love to stay at the Gladstone every time I am in Toronto. The service is always great and the concierge makes you feel welcome and not stuffy. There is such a cool vibe all through the hotel. All the rooms are uniquely designed by different artists, so I try to book a different one, each visit.  They are all so fun. The last one inspired some washroom design ideas I can’t wait to try. The location is walking distance to all the Queen West Hotspots. The art installations throughout the hotel are always changing and give you something new to see each time.Their Sunday brunch is like none you have ever been to. LOVE IT!!!",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Beautiful fusion of New and Old",
      "text": "Was on a fairly tight budget and had to think long and hard about booking a room here, as \"budget\" this property is not.  SO glad I stayed, however! The Gladstone, being Toronto's oldest continually occupied hotel ,was a lovely fusion of historic charm and sleek, modern decor.  At one time the rooms were individually decorated (and most guidebooks still rave about it) but this has changed so the rooms are all fairly uniform as far as furnishings.   The hotel is still a haven for art lovers, however, and has various works by local artists displayed in both the public spaces as well as the rooms.  The staff at the hotel are wonderful -- friendly and accommodating.   The small bistro offers creative menu options, and a plethora of bars and restaurants are in easy walking distance.   Great hotel, great location, great people, what else could you need?  Do yourself a favor and check this gem out!   It's not often you find a property so lovingly restored,  and a staff so dedicated to seeing their guests satisfied!Quick tips that I'm too wordy to fit in actual tip section:  Hotel has the original and amazing bird cage elevator.  This must be operated by staff, and those gracious folks are always prompt and cheerful to get you to your floor.  However, you may wish to book a room on the second floor and just walk up.   Historic hotel often means smaller rooms as in the day, a bedroom was a room that fit a bed and that was about it.  The studio rooms are charming, with plenty of storage  but folks who like a lot of space may want to think about upgrading their room category.  (I stayed in a studio, and thought it was perfectly fine, however.)  Each floor has a different public area .  Library and comfy chairs on 4th floor, pool table on 3rd floor, and cozy chairs and tables on second floor that's perfect for those needing some space to work.  Lastly, although I indicated \"family\" it was just my college age daughter and I.  I don't believe the property has any double bedded rooms.  This hotel is very much more for adults than kids!",
      "rate": 5.0,
      "tripDate": " May 2022"
    },
    {
      "title": "Quaint old hotel but Overpriced",
      "text": "This a quaint old hotel with unique features including the old elevator but lacking in communication and customer service. We reserved two rooms to include the breakfast option and early check-in. One of the rooms was also to include the parking. When I made the reservation there was no confirmation sent and no instructions on where to park. I called the hotel and all they said is to drive under the Metro grocery store, but nothing else. Not wanting our vehicle towed away we paid for parking in the parking lot ($28), thinking that the charge would be deducted from our bill. Please note that when we arrived there was no place to stop and go into the hotel to get instructions. We dropped our daughter off at the door and proceeded to the parking garage.  She was trying to call and text us with instructions but we were already in the parking garage and calls and texts did not come through.  At reception they told us that we should have received instructions via a text message about how to park, but I never did get that. I absolutely know that they had my phone number because they were texting me constantly after check-in. When we asked to have the parking removed from the bill, the person on the desk did not know how to do it and suggested that we could get it removed at checkout. The next morning when we needed to get an early start the bistro was not open for breakfast, so we also did not receive that service. We do realize that not all restaurants open early, and it is not their fault we needed to get an early start, but still disappointed that we could not take advantage of something we were paying for. The clerk on the front desk took at least 20 minutes to check us out and at one point told me my credit card company had declined the transaction. When I called the credit card company, I was informed that no transaction had gone through and there was nothing denied at their end. When we asked about removing the parking from our bill, he had no idea on what to do. Our rooms faced Queen St and it was very noisy through the night. The air conditioner fan is very noisy so not a good night’s sleep. Have to say we feel that the room are overpriced, and we will not likely stay there again. We stayed here on the weekend of August 20th for a family wedding in the area. We ended up paying $1740 which includes $30 for parking for two rooms and did not get a refund on the parking nor did we have breakfast. I have reached out to the hotel to get some type of response and a reasonable attempt to refund the parking, but so far nothing from them. At the prices that they are charging, I think there should be a little bit more communication with instructions and what to expect while staying at their hotel. The staff in the bistro were very friendly and did make us a coffee before we left on Sunday morning.  With a few changes and this could be a much better hotel.",
      "rate": 3.0,
      "tripDate": " August 2022"
    },
    {
      "title": "overpriced, cramped, poor design",
      "text": "I paid by far the highest price per night ever in my life for a cramped room without useful things like a desk or a fridge. Maybe we were paying for the 'design' chandelier? Or the pink glow in the room when turning on the bathroom light (I'm sure my partner loved being woken up by that when i got up in the middle of the night to use the toilet). Extremely hard to regulate the temperature in the room.We were drawn to the place by the photos showing an old brick building...it has been very carefully restored, but with a 'modern' flavor that we found downright tacky. We liked the bed- super comfortable. And the pool table, except that every time we wanted to play, the balls were gone (and then we heard someone breaking at 9am). Free coffee, but not in your room -- head up to the fourth floor and wait in line for the one machine. The elevator is original, but half the time we called it, no one answered (it has to be operated by hotel staff).We wouldn't be complaining so much had we paid something more reasonable...the price per night was almost triple what I'd consider fair for what you get here.",
      "rate": 1.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Style over substance",
      "text": "Lots of beauty, but when you look beneath the surface, lots of problems. We discovered at least 6 stray hairs (not from us as they were very long) on the wall, floor and 3 in the face towel. Only one garbage can for the whole room (located in bathroom tucked by the toilet). Body lotion and conditioner were obviously watered down (these were beautiful products and those two were not). Shower looks beautiful but not designed properly. No hooks to place your towel nearby (closest is back of the door and requires guest to create a pile of water) and water freely soaks bathmat. Unpleasant to step out. Person checking us out did not ask us how the stay was...and was unaware of charges to room and how to process with our deposit (ultimately charges were correct). Upstairs Nespresso is high quality and available 24/7, but area is unkept and we had to ask for more cups (and they brought 5 and never cleaned up area).  Seating area on each level is comfortable and convenient. Bar in the hotel was enjoyable. Overall, nice hotel but not worth the cost and the issues.",
      "rate": 3.0,
      "tripDate": " July 2023"
    },
    {
      "title": "Like home, only prettier",
      "text": "The Gladstone is just like home, only so much prettier. Even the tiniest of rooms offers perfect comfort, with amazing attention to detail. I was really pleased to see toilettries offered in refillable glass bottles, rather than in single-use throwaways. It was so nice and convenient to have kettle provided, along with a coffee packet with an integral filter. The customer service is always amazing; I appreciate being able to communicate directly with the staff via text. There is no other place I'd rather stay.",
      "rate": 5.0,
      "tripDate": " April 2023"
    },
    {
      "title": "My favorite hotel in the world",
      "text": "I LOVE the Gladstone hotel. It is so inspiring to stay there - the staff is absolutely fantastic and the art displays are fantastic. Every room is individually decorated by a specific artist. I stay there a few times a year when I visit Toronto for leadership and strategic planning work with The Strategic Coach. A few nights at the Gladstone is exactly what I need to get my creative juices flowing.",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Good vibes, solid hotel stay",
      "text": "Overall really good experience! Comfy bed, very cool vibe across the whole hotel, and great coffee! Plus the location was fantastic for us… we walked to Budweiser Stage for our concert as well as a ton of bars and restaurants we have been itching to try!It would have been a 5 star for me if a few things had just been executed better with their revamp of the hotel. We were on the top floor at the back of the hotel which thankfully wasn’t noisy with city noise like some others have complained about but… there was light that came through the interior door around the seam like it wasn’t properly installed or insulated? Which also meant that any noise in the hallway and common area could be heard in our room very clearly. This resulted in a good night’s sleeping being very interrupted, and I mean we didn’t end up going to bed until 2am or so anyways which I couldn’t imagine how much we would have heard if we were early to bed!",
      "rate": 4.0,
      "tripDate": " June 2023"
    },
    {
      "title": "Nice Little Hotel",
      "text": "Enjoyed my stay at Gladstone Hotel. Front desk staff were really pleasant and helpful. Room was very clean and bed was comfortable. The breakfast that was part of my package was excellent. Handy location right on Queen street car/bus route. You had to walk a little bit for the parking and it cost $30 but the instructions were very good and that is typical hotel parking cost in Toronto.",
      "rate": 4.0,
      "tripDate": " April 2022"
    },
    {
      "title": "Grand old house, in contemporary funky clothes!",
      "text": "Nice to be in a hotel with character, not the generic bland type. Lovely decor with the exposed old bricks in the bedroom and the many modern touches, nice little pluses like the pool table, the library and the beautiful antique elevator, and friendly service. Gladstone House is well located, close to lively neighbourhoods, good dining, and fun shopping. We'll be back!",
      "rate": 5.0,
      "tripDate": " February 2023"
    },
    {
      "title": "Chique room and attentive staff  in a classy hotel in excellent location",
      "text": "Loved my modern, stylish room with a most comfortable bed and wonderful shower. The staff was friendly and went out of their way when I had some special requests. Delicious food in the small restaurant/bar where I loved to hang out. Amazing location allows you to walk to most places. Miguel, you saved me much time and hassle and I so appreciate that you went the extra step to help me out.",
      "rate": 5.0,
      "tripDate": " September 2023"
    },
    {
      "title": "Winter Wedding at the Gladstone",
      "text": "Our wedding was absolutely perfect! We can't thank Sarah enough for all your help in setting everything up. The hotel looked gorgeous and The Gladstone Team were all amazingly helpful and friendly.  It was an absolute pleasure working with Sarah and the wider team from start to finish.  Everything went so smoothly and it was better than we could've imagined. We are so incredibly happy - both still beaming from the day.",
      "rate": 5.0,
      "tripDate": " November 2019"
    },
    {
      "title": "Cool Vibes",
      "text": "From the moment you step foot into this hotel you capture the vibe.  It’s clean, cool a lot of history. The manual elevator definitely stood this hotel apart   Welcoming and attentive staff was a nice change. Check it out",
      "rate": 5.0,
      "tripDate": " January 2023"
    },
    {
      "title": "Wedding party at the Gladstone house hotel",
      "text": "A beautiful hotel in a great location Clean and spacious rooms great service and the most beautiful decor and art on the walls, a nice bar and a great breakfast.The staff are very helpful and courteous and friendly.I will definitely stay there again on my next trip to Toronto!!!",
      "rate": 5.0,
      "tripDate": " February 2023"
    },
    {
      "title": "Great weekend at the Gladstone",
      "text": "My wife and I spent two fantastic nights at the Gladstone this past weekend.  Nothing but positive comments from us.  Check-in and check-out we're effortless, room was funky and comfortable.  Super cool common rooms on each floor.  Highly recommended.",
      "rate": 5.0,
      "tripDate": " March 2022"
    },
    {
      "title": "Great Hotel For a Quick Toronto Trip",
      "text": "We enjoyed our stay here, nice intimate/boutique hotel. The beds were super comfortable and lots of restaurants nearby. Only thing missing in the room is a fridge but overall was comfortable for a short stay in Toronto. The staff/service is wonderful!",
      "rate": 5.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Totally satisfied ",
      "text": "We stayed at the Gladstone to celebrate my daughter’s wedding October 14 2023.  We were completely satisfied with our stay as was the rest of our family.   The staff, facilities, rooms, overall service ….everything was excellent.   Thank you for helping to make this an extra special event",
      "rate": 5.0,
      "tripDate": " October 2023"
    },
    {
      "title": "We will return",
      "text": "Great little hotel in the art district.  Fun lobby and great social areas on each floor.  The room was well appointed, the elevator is a unique experience and quite beautiful.  They did an incredible job making this property unique, fun and well appointed.",
      "rate": 5.0,
      "tripDate": " February 2024"
    },
    {
      "title": "Best Hotel",
      "text": "This is an awesome spot.  An old hotel completely redone.  Food and service were both great at the restaurant!  Highly recommend the hotel.  Lots of great spots to eat in the area.  Rainfall shower is one of my favs.",
      "rate": 5.0,
      "tripDate": " May 2022"
    },
    {
      "title": "One night's stay at Gladstone House",
      "text": "We had a cozy suite, and there was some construction going on, on the street below.   The rate was good, the dining room was welcoming, and the staff went out of their way to be helpful. Un unexpected issue with the room, led to a credit for parking, and this gesture was certainly appreciated.The newly renovated décor was nice, and the open common spaces were available to share with visitors.  Overall an excellent experience",
      "rate": 5.0,
      "tripDate": " March 2022"
    },
    {
      "title": "Holiday Party!!",
      "text": "Great venue for a holiday party!!  Staff super helpful with all the arrangements for the event.  Great selection of food and party packages to select from which was very helpful.  On the night - everything well really well and everyone loved the venue and location.  Food was fantastic.  Highly recommend.",
      "rate": 5.0,
      "tripDate": " December 2019"
    },
    {
      "title": "Character hotel with relaxed laid back feel.  Great place to stay to explore Toronto.  Will certainly return again",
      "text": "A great boutique hotel in Toronto. The hotel had great character.  We spent a few nights here exploring Toronto. In walking distance of city centre. The street it is located on has loads of quirky shops and cafes close by.  The hotel room we had was lovely high ceilings. The dinner in the hotel bar was tasty and modern.  Defo recommend as a location to stay in Toronto.",
      "rate": 5.0,
      "tripDate": " May 2023"
    },
    {
      "title": "Never book with them. Worst experience",
      "text": "It was the worst experience I have ever experienced, I don’t recommend it all. The music downstairs was loud and I couldn’t sleep all night. The front desk didn’t help at all. They all also didn’t take into account the employee discount. I payed the full price to sleep on the floor because they also didn’t have enough rooms that I asked for. The prices were expensive. I spent $600 a room. No parking! No courtesy! Worst place!!",
      "rate": 1.0,
      "tripDate": " October 2022"
    },
    {
      "title": "Funky hotel",
      "text": "Was in Toronto for a short stay for business, and this hotel provided some spice to the trip. Very helpful and friendly staff, and such an interesting place! Room was comfortable. Everything I needed was available, including a yoga meditation session. Will definitely stay here again.",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Eclectic and unforgettable",
      "text": "Gladstone House Hotel will not disappoint. Its eclectic vibes are so inviting and fun. It is like no other hotel we’ve ever stayed at. The attention to detail from booking welcome text messages all the way to the decor of the place is exquisite. The staff are very friendly and welcoming and the food is delicious. Naz and Beyza excelled in customer service, knowledge and overall enthusiasm. They were beyond attentive and caring. This was truly a memorable place. Thank you for your attentiveness! 💕",
      "rate": 5.0,
      "tripDate": " May 2023"
    },
    {
      "title": "Sunday Brunch at the Melody bar, Gladstone Hotel",
      "text": "What a wonderful way to spend a Sunday. My friend and I booked a table at the Sunday Drag Brunch yesterday the 23rd February, 2020. Miss Moco was the host and she had a special guest Betty.Firstly the food was wonderful and the ambiance was great but the stars of the day were Miss Moco and Betty. We had so much fun that I didn't want it to end. So much so that I booked again for another Sunday. I highly recommend this event. I would go every Sunday if I could.Miss Moco is a star, drop dead gorgeous, funny and brings everyone together in the audience. Please don't stop this event, this is the best event in the city. :-)",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "The Gladstone knows how to throw a party!",
      "text": "My wife and I recently had our wedding at the Gladstone hotel and could not be happier with the results. From the food, to the decor, to their wonderful staff. Erin and her team took great care of us and through us a wedding that was unique and memorable. All of our friends and family were comfortable and taken care of. My wife and I couldn't be more thrilled with the result. Thank you! :)",
      "rate": 5.0,
      "tripDate": " December 2019"
    },
    {
      "title": "A historical gem now with a modern flair",
      "text": "A remarkable revival of a historical gem. The remake of the hotel was amazing without losing the elegance of the 19 th century. The room was clean and spacious.  We would recommend some small tables for coffee or food placement.  Otherwise an enjoyable experience with an excellent and accommodating staff. A special thanks to Monica who was extremely helpful.",
      "rate": 5.0,
      "tripDate": " September 2021"
    },
    {
      "title": "Trendy hotel in a great neighborhood",
      "text": "Absolutely love this hotel. Very trendy with a lot of unique character and details. Very easily walkable to great shopping and restaurants. Only downsides are that, because it's an older building, the walls/windows are a bit thin so there's some noise but overall, it's a great spot.",
      "rate": 5.0,
      "tripDate": " January 2023"
    },
    {
      "title": "Versatile wedding venue!",
      "text": "Our daughter and son-in-law got married here last weekend. What a lovely and versatile venue! We had use of the bar and the banquet facilities. Bar staff were phenomenal at keeping up with demand for the couple’s signature drinks, both alcoholic and non alcoholic and made them look festive! Being mom of the bride, I had some extra jobs. Whenever I needed help I simply called on housekeeping and they were there in a flash to help out! Beds were comfortable and rooms were cool. Restaurant served good food. Overall an excellent experience!",
      "rate": 5.0,
      "tripDate": " September 2023"
    },
    {
      "title": "Monica Rules!",
      "text": "Me and my partner stayed at the Gladstone for a weekend staycation and unfortunately the fire alarms went off several times in the night. When we were checking out Monica offered us a complimentary stay which we used the following weekend. She went above and beyond to make sure we had a nice time.",
      "rate": 5.0,
      "tripDate": " February 2022"
    },
    {
      "title": "A Beautiful and Vibrant Oasis on the West Side of Toronto",
      "text": "I love the Gladstone. I had the pleasure of staying several years ago (it’s the longest continuously operating hotel in Toronto!) and loved it. I returned to a refreshed hotel, under new management and I’m thrilled to find it even better. The renovations are perfect - it has energy, dynamism, heritage, and artistic charm. You will get a unique opportunity to ride a historic hand operated elevator! The rooms are unique, with distinctive art and design touches. Very clean, simple, and good small touches (eg automatic blinds). The physical design is complemented by a varied program in the Melody Bar downstairs, which has an old world charm paired with contemporary art and performance. I LOVE the Gladstone’s commitment to supporting local and upcoming artists. There is even an active art studio and residency program in the building! The fitness room and other amenities, like a library and meeting rooms, are great. But above all the staff is terrific. Very friendly, quick to respond, and helpful but not overwhelming. Kieran, the GM, gives the hotel a personal touch – he is a wonderful host and tour guide.I ended up extending my stay by a night, and I look forward to returning again in the future.",
      "rate": 5.0,
      "tripDate": " March 2022"
    },
    {
      "title": "Loved this fantastic boutique hotel!",
      "text": "We thoroughly enjoyed our stay at Gladstone House. The entire staff was very friendly and welcoming. There was a wonderful laid back, cool, hip vibe about the place, without a whiff of attitude. The decor was fun and modern but also gave a nod to the hotel's historic heritage. Our room was spacious, the bed was comfy and the shower pressure was fantastic. The hotel is located in a great neighborhood with plenty of bars, bakeries and restaurants. There is a streetcar stop just outside the front door, so you can get downtown in no time flat. There is even a grocery store located directly behind the hotel if you're looking for some snacks for your room. On our next visit to Toronto we will definitely be booking a room here again!",
      "rate": 5.0,
      "tripDate": " June 2023"
    },
    {
      "title": "Best hotel in Toronto",
      "text": "This hotel is not only trendy and cool, it has the best costumer service. What some rooms lack in size they make up in style and space utilization. I stayed in their best roof top suite recently and it was one of the best experiences I’ve ever had. They’re costumer service always makes you feel like you are the most important guest in their hotel. Monica one of their manager/team leaders is one of the best people. Incredibly good at her job. I can’t say enough great things about this hotel. Also they have plenty of events happening day and night at their various restaurants and bars.",
      "rate": 5.0,
      "tripDate": " October 2022"
    },
    {
      "title": "Corporate Event was perfection!",
      "text": "If you need a place to host a corporate meeting with a party afterwards, look no further- the Gladstone is THE place to host.  I cannot express to you how perfect and flawless the event went due to the detail oriented staff at the Gladstone.  We had our out of town guests stay at the hotel, had the meeting in the Ballroom, followed by a party in the same room. I promise you, you will not be disappointed.  Rooms were talked about highly. Meeting space was talked about highly.  Food was talked about highly. The team is easy to work with, accommodating and worked on the fly with last minute changes. I can't rave enough about The Gladstone.  Wonderful and professional people who work there and a million thank you's for making our event a massive success!",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Beautiful room, great customer service",
      "text": "The hotel is very conveniently located so you can walk everywhere.  The décor is beautiful and the room was super clean with a really comfortable bed.  We unfortunately ended up staying on a night that a wedding was happening, which despite ear plugs (provided by the hotel to us) and the fan on, it was too loud to sleep.  However, on check out I explained that our stay wasn't great because of that (we were exhausted, traveled early and desperately wanted to fall asleep).  They were so accommodating and sympathetic with our situation they made it worth our while to stay again.  If I hadn't been there on a wedding apparently it is usually quiet and I would have given it 5 stars.",
      "rate": 4.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Perfect stay",
      "text": "I had an absolutely wonderful stay at Gladstone House for an overnight stay in Toronto for work. Everything was perfect, from the welcoming staff at the front desk (with welcome cookies), to the stylish decor and very cool sense of history to the place, to the stylish and well-appointed room, to the rain shower head shower with the loveliest essential oil scented bath products. I wish I could have stayed longer to have time to hang out in the cool little library or play pool in the game room. I did make time to enjoy a dinner and beer in the bistro. Highly recommend. I'm looking forward to returning in the Spring when I'm next in Toronto.",
      "rate": 5.0,
      "tripDate": " December 2023"
    },
    {
      "title": "Gorgeous hotel, lovely staff",
      "text": "I stayed one night in a corner king room. I was literally emotional at how beautiful the hotel, and my room was. The Gladstone is a Toronto landmark, and I love seeing how it's evolving. The hotel has undergone extensive renovation, and the result is epic. Coloured glass everywhere, super cool furniture, art, plants...I want to live there! The aesthetics of this hotel are amazing. My room was awesome too. Hardwood floors, exposed brick walls, a comfortable King bed, nearly floor-to-ceiling windows, very chic and modern bathroom...it was like a 5 star vacation. The staff were very friendly and helpful. I felt as though I could ask them for any assistance necessary.",
      "rate": 5.0,
      "tripDate": " January 2022"
    },
    {
      "title": "Stylish Boutique Hotel with Excellent Service",
      "text": "This is the coolest boutique hotel in Toronto.  Newly renovated and modernized with luxurious rooms and friendly and effective staff.  Each floor has its own character with a common area lounge.  New exercise facilities downstairs, great bistro for food and drinks off the lobby, Melody Bar for events and a night out on the main floor.  Easy walking distance to the dynamic Ossington Street and Parkdale scenes as well as Queen West shopping.  I stay here all the time, can't recommend it enough.",
      "rate": 5.0,
      "tripDate": " October 2022"
    }
  ]
}