{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Glen Grove Conservatory Tower",
    "url": "/Hotel_Review-g155019-d320731-Reviews-Glen_Grove_Conservatory_Tower-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.5",
      "reviewCount": 114
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "736 Bay St",
      "addressLocality": "Toronto",
      "postalCode": "M5G 2M4",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/16/8b/fb/af/glen-grove-conservatory.jpg?w=500&h=400&s=1"
  },
  "description": "The Glengrove at Conservatory Tower offers fully furnished, fully equipped 1 and 2 bedroom suites with full kitchens. Located in the heart of the city (Bay & College), the suites are located within walking distance to the subway, shopping areas, restaurants and activities.",
  "featues": [
    "Paid private parking on-site",
    "Free High Speed Internet (WiFi)",
    "Fitness Center with Gym / Workout Room",
    "Pool",
    "Non-smoking hotel",
    "24-hour front desk",
    "Express check-in / check-out",
    "Self-serve laundry",
    "Wifi",
    "Sauna",
    "Indoor pool",
    "Air conditioning",
    "Kitchenette",
    "Microwave",
    "Refrigerator",
    "Non-smoking rooms",
    "Suites"
  ],
  "reviews": [
    {
      "title": "Great Location but no luggage storage",
      "text": "Great location in Toronto. The apartment was clean but could do with updating. Easy to get to it from airport - take UP Express to Union then yellow line to College. Exit the 777Bay st exit and building is opposite. The bus station is 10 minutes walk away (if you are heading to Niagara Falls) and so many of the city's attractions are easy walking distance. Checkout is at 11am but NOTE there is NOWHERE to store your luggage. My flight was at 8pm so basically i wandered the streets with my bags which was not ideal.",
      "rate": 4.0,
      "tripDate": " September 2017"
    },
    {
      "title": "Really enjoyed",
      "text": "We stayed in Toronto for two weeks in July 2006. Our apartment was on Bay street in a Condo Residence. It was a one bed appartment .  We were really pleased with the apartment in general, but the sofa bed was a little uncomfortable. It was clean, and there was warm water and a fully functioning kitchen. It is ideally located  downtown and just two blocks north of the Eaton centre and 2 mins walk to subway. The management of the building were extremely helpful and friendly.The most important thing for us was cleanliness and central location, and I would rate these two as excellent.I did not like the fact that you had to hand in your bed sheets to be cleaned and then they are returned later. However there was a washer and drier in the room which turned out to be brilliant and were able to go home with very little laundry to do. We were also able to wash sheets and towels as we liked.There was building going on across the street at the time but I did not find this of any disturbance. The swimming pool was small but was clean.The management of the building were extremely helpful and pleasant. However as we were staying in a condo, the management were from the building, not the hotel, so I cannot comment on the glen grove management as we had no need to deal with them.",
      "rate": 4.0,
      "tripDate": " July 2006"
    },
    {
      "title": "Great location, good for long-term",
      "text": "We stayed here for 2 weeks after we had just moved to Toronto. The bedroom was very spacious, and the living/dining was a fine size, although the kitchen was tiny with very little bench space. Comfortable big bed, pay TV, iron, lots of linens, all the kitchen tools you could need were all supplied. Our only real gripe was that the place wasn't properly cleaned - a maid came in once a week but she didn't actually vacuum (only sweep), and as a result the floor was constantly covered in dust (I think maybe the heating vent was blowing dirt in?) 247 security, which was great. It's also very quiet - we never heard a peep from anyone! The gym was very basic (two treadmills, a few weights), but fine.The location is FANTASTIC - around the corner from College subway station, across the road from pharmacy, Starbucks, mini-mart, food places, etc. Short walk to the Eaton Centre. Definitely good for long-term rentals, but I'd probably want to stay somewhere a bit nicer if you're in Toronto for a holiday (the building is fine, just a little dated).",
      "rate": 4.0,
      "tripDate": " February 2011"
    },
    {
      "title": "Don't Even Think About It!",
      "text": "We stayed at the Conservatory Tower location of Glen Grove Suites in Toronto June 30 - July 6. The 2 bedroom condo was roomy and that is all that is good about it. Upon arrival we had to wait ten minutes for a guard to show up to give us our keys. There were 4 of us but only 2 keys and one passcard (required for access into the building). We asked the guard for more keys he said we'd have to call the help #. When we called they said they only supplied 2 keys but they would try to get more. We checked in on Thursday - on Monday 1 more key and 1 more passkey was delivered. There is construction right next door to the condo. A sign at check-in warned residents to stop throwing things at construction workers. We were concerned about the calibur of our fellow tenants. We understood there frustration when we were woke up at 7:30 am every day but Sunday by jackhammers right outside the window. On our second night at this location a fire alarm sounded at 3 am and we all had to leave our rooms and walk down stairs (11 flights) to discover there was no fire. On the night before we left there was a power outage - again requiring the walk down 11 flights. There is parking provided but the space we were given was 6 floors down and we had to exit the car before parking there because it was so tight. The remotes given to open the doors only worked if you were right next to the pad - it was very frustrating using the garage.The condo provides no paper towels, dish cleaning facilities, laundry soap or anything like this. When I called about my blowdryer not working the help desk said they couldn't get us another one until after the weekend, nor could they authorize reimbursement for me if I chose to buy one. We never did get one.This neighboorhood is also very shabby. I also visited the Jefferson, another property of Glen Grove - this was in a better location but my friends who were staying there couldn't get wash cloths for two days. Don't even think about staying here - even though the pictures look nice it is a very shabby property.",
      "rate": 1.0,
      "tripDate": " July 2005"
    },
    {
      "title": "I wouldn't stay any other way",
      "text": "After searching on line I was intrigued by the idea of staying in an Apartment Hotel.  I decided on Glengrove based on their detailed web page.  I was nervous that it wouldn't live up to my expectations.  I was pleasantly surprised to find that not only did it meet my expecations it exceeded them.   The minimum 3 nights stay was understandable, after all your in Toronto!  We had a great time in the city.  We met great people, ate at a French Restaurant, had cocktails on roof tops, and even discovered the peaceful surroundings of the Bluffs & Islands.  What a blast, thanks Toronto!",
      "rate": 5.0,
      "tripDate": null
    },
    {
      "title": "A Disaster Without Doubt",
      "text": "Booking was made in December 2014 for a stay 6 to 9 May, 2015. On 5 May an email was sent to confirm late arrival and a return email on 6 May gave instructions that concierge was open 24 hours. Arrived with party of 3 others at 10.45pm. There was no Concierge so we had to wait for someone else to enter the building to get access. Eventually a Security Officer searched everywhere and could find no details. We had to leave and try and find another hotel. City hotels were booked out. $70 and 2 hours later we got a room near the airport.  Cancelled rest of stay.At no stage were we contacted to advise there was a problem.",
      "rate": 1.0,
      "tripDate": " May 2015"
    },
    {
      "title": "Better than hotel rooms for group of four or more",
      "text": "SIx adults, three couples, stayed in #505 (one queen, two twins) at The Conservatory for 3 nights.  The location is wonderful.  The #505 apartment was a fine size with two bedrooms and two bathrooms.  We knew one couple would be sleeping on the pull out sofa when we booked the place.  However, this was the worst pull out mattress ever.  We put it on the floor but it was so thin all you could feel were the coils.  I ended up on the mattress on the floor and my husband slept on  the couch which was very narrow and sloped back.  We made it work but I would not recommend #505 for six adults.  It would be wonderful for a group of 4 adults or adults and children.  Other apartments Glen Grove rents might have better pull out beds.Over all, this is a great alternative to hotel rooms.  We could have breakfast every morning, cook meals if we wanted and  plenty of room for all of us to \"hang out.\"  It is about 1 1/2 blocks to subway.  We walked most places, within 2 miles.There is a little restaurant named Somethin' 2 Talk About  south on Bay at 78 Gerrard Street West with delicious reasonably priced food.  More of a take away than a sit down but there is seating.  Open from 8-5 weekdays only.We paid $199 per night plus $10 underground parking for total stay.",
      "rate": 4.0,
      "tripDate": " July 2010"
    },
    {
      "title": "I would NOT recommend.",
      "text": "Stayed here at end of July.  6 nights.  What was advertised as a 'deluxe condo'.  $1900+ for a very run down dirty apartment.  Many broken fixtures and fittings.  Kicked in bathroom door.  Pool closed our entire stay.  Impossible to get help / staff.  I'm home 4 weeks now many emails been set and photos but still not 1 reply.  Photos speak for themselves.",
      "rate": 1.0,
      "tripDate": " August 2017"
    },
    {
      "title": "Total disaster!",
      "text": "When we arrived we could not find the front door. Then we finally found the entrance to the garage but we did not have a key to get in so we tried to buzz the security guard but no one answered. When I finally found the front door I asked for the garage opener as we were told that we can pick it up before official check in. The security guard had me sign a log that I was picking it up but I tried to explain to him that some of my friends are coming hours later and that we are going to be out so can we leave a set with them so when they arrive my friends can get in. They said no, once i sign they can't take it back. Your whole party better arrive at once to avoid confusion. The didn't even tell us where to park and the parking spot was indicated on the wrong line! We parked in someone's space and I didn't know until that person left me a note. We went to ask the security guard and he did not understand. He kept asking why we are there and wanted us to pay more for parking. He completely did not understand or process English! We called the emergency number on our invoice and it took forever for someone to answer after they did the person that answered told us that there is no one there to help us and that they would call us back which they didn't! we finally found out where to park but that took forever. There is no clear check in process, no clear instructions for parking and communication from the company that rents out this place and from the security guard was horrible. The apartment was ok but the sheets and towels were old and you can see stains on them. One of my friends got a mysterious bug bite on his leg even though we did not see signs of bugs. You are better off spending a few extra dollars on a hotel with better and cleaner service. Only good thing about this place is that it is close to everything.",
      "rate": 1.0,
      "tripDate": " May 2016"
    },
    {
      "title": "Well situated but old and dirty",
      "text": "The condo is well situated down town, concierge 24h a day, and has a parking. That's all for the good points! Furniture from 80's, we found the condo very dirty: floor and furniture tights, traces of food in the kitchen, stained and threadbare towels, suspicious traces in the bathroom...",
      "rate": 2.0,
      "tripDate": " July 2014"
    },
    {
      "title": "Great location",
      "text": "We spent 5 nights here and were very happy with the apartment although it could probably do with a bit of attention - some of the flooring had been damaged.  However, this did not detract from the fact that the apartment was very comfortable and well equipped and also it was in a good location.",
      "rate": 4.0,
      "tripDate": " July 2009"
    },
    {
      "title": "Great Family Option",
      "text": "We just returned from a 4 night stay with our 3 kids. Great location right downtown, 5 min. walk to subway. Apartment was a nice size for our family of 5. It was great to have 2 baths and a kitchen. The apartment was clean, some of the furniture is a little tired looking but functional. The beds were comfy. Personal toiletries are provided but not dish soap.  Also would have been nice to have coffee filters and or coffee provided.  Pool was clean. Exercise room functional. Parking garage was a bit tricky but once the car was parked we just left it. Overall I would say it was a great value and would definitely recommend as a place for families that need a little more space and would like to economize by dining in for a few meals.",
      "rate": 4.0,
      "tripDate": " August 2009"
    },
    {
      "title": "Great value in downtown Toronto",
      "text": "Stayed In Conservatory Tower for 4 nights and we were delighted at the value for money in such a central location.  Unfortunately we had two days of rain during our visit, but we used the subway around the corner to visit the Ontario Science Centre, Casa Loma and did some shopping in the Eaton Centre to escape the bad weather.  Like the previous reviewer, we noticed that the safety netting on the balcony of our condo was ripped but it didn't bother us as our kids are teenagers.  We were glad of the two bedroooms and made good use of the kitchen and washer and drier.  We didn't get to use the pool as it was being refurbished.  Would certainly recommend for families looking for clean central accommodation who don't want to break the bank.  Go see Jersey Boys musical as we really enjoyed the show.",
      "rate": 4.0,
      "tripDate": " June 2009"
    },
    {
      "title": "Adequate",
      "text": "I stayed at the Conservatory Tower in June 2005 for a week.It was an adequate accommodation and I was able to do my shopping in the downtown core.My wife and I are going to come back to stay there.R Cox Barbados",
      "rate": 3.0,
      "tripDate": " June 2005"
    },
    {
      "title": "Great Place to Stay",
      "text": "2 bedroom 2 bathroom apartment on 14th floor and 2 bedroom apartment on 5th floor. The apartments have everything you need: Washer, Dryer, Fridge, Stove, Mic, Coffeemaker, and a Dishwasher. Couch in living room also pulls out into a bed if needed. Master bathroom had ensuite bathroom as well. Paid parking is also available. Excellent Location  - right downtown and has a bus stop outside. Also 1 block up the street and 1 block down the street are the following: grocery store (Sobeys), pharmacy (Shoppers Drug Mart & Rexall) and 24 hour Tim Hortens. 3 blocks down is the Eaton Centre, Best Buy, AMC Movie Theatre and Canadian Tire",
      "rate": 4.0,
      "tripDate": " August 2018"
    },
    {
      "title": "Value for money! ",
      "text": "Many people have criticised this apartment/building. However, for the money we paid we disagree. Yes you could pay a hell of a lot more and stay somewhere a little smarter & not so rough around the edges. But it’s clean, it’s got everything you need, nice enough view and great location. We found the people downstairs on the door/security friendly and helpful. Our only criticisms would be that the electricity system is poor! Plug sockets are dodgy and need tidying up. It’s a shame this doesn’t just get sorted as it would make a big difference. All in all, for the money we were quite happy! If you’re someone who likes the finer things in life maybe pay a bit more and go elsewhere but if you want to come to Toronto, want some where to stay that’s clean and convenient then this honestly will do the trick. Basic but satisfactory! Plus you can see the CN tower! Enjoy your holiday!",
      "rate": 4.0,
      "tripDate": " May 2018"
    },
    {
      "title": "Good things and so so things ",
      "text": "This was my second time staying in this building. The apartment is dated and there were some minor issues with it. (One element didn’t work on the stove, it was unbalanced and some blind louvers missing), but it is a secure building and the bed is comfortable. The pool is nice but the hot tub was not in service again. The building is central to a lot of things to do in Toronto and a sobey’s is also located across the street. Building is quiet and security in the lobby. The tv works and the apartment has many of the things you need to stay. (Pots, dishes and glasses). The apartment building/condo is clean and it’s a good place to stay.",
      "rate": 3.0,
      "tripDate": " April 2018"
    },
    {
      "title": "Lots of room to move",
      "text": "We had a two bedroom apartment and there was plenty of room for 3 adults and 3 children.  Good beds, good kitchen facilities and lots of hot water.  Working the showers is a little tricky, but found that all over Canada. Centrally located, so you can walk to everything.",
      "rate": 4.0,
      "tripDate": " December 2017"
    },
    {
      "title": "First trip toronto with friends",
      "text": "Great location .walking distance to the shopping center ..on a bus route.pool was great.fully furnush 2 bedroons 2 bathrooms.. We bought groceries and cooked which saved from dining out all the time.reasonable pricing.washer and dryer.only thing some dishes were broken and left in the cupboard",
      "rate": 4.0,
      "tripDate": " April 2017"
    },
    {
      "title": "THEY LACK THE BASIC INFRASTRUCTURE OF ANY HOSPITALITY SERVICE",
      "text": "We were completely fooled by the fancy name and by the pictures. Who would guess that a tower with swimming pool, gym and other facilities didn´t offer a dirty corner for the guests to keep their bags until the check-in time (4pm)? Not only this was not a hotel, it also lacked the basic infrastructure of any hospitality service. We arrived around 10am and found a rude doorman who barely spoke English and didn´t know anything about our reservation. We were very lucky there was a small hotel in the neighbourhood (the fabulous Six Fifty) that charged to keep our luggage and gave us all the assistance we needed, otherwise our stay in Toronto would have been a complete nightmare. We saw that our credit card had been charged (although we had written the property in advance, explaining that we preferred to pay cash) and suspected it could be a scam. We thought about calling the police. Differently from other hotels, this property never contacted us about our stay, the time we would get in etc. No communication at all, they only took our money and gave us nothing in turn. As international travellers we didn´t carry phones, hence the difficulty of calling their phone number (I wonder if they would answer, it was a Sunday). After finding a real hotel (and paying for it), we went to the places we wanted to go and came back a few times to see if there was any update on our stay. Around 4pm the doorman was finally instructed (we don´t know how/by whom) to let us in. It was pathetic to see him (who barely knew how to read) pretending to check our passports. He was obviously not prepared for that “job”, so the place is not safe either. We felt totally abandonned and insecure. The apartment was dirty and needed maintenance, we needed assistance in several aspects (as with the wifi, about which there are other complaints here), but no one ever showed up or gave us a call or even sent us an email.",
      "rate": 1.0,
      "tripDate": " October 2017"
    },
    {
      "title": "Location, and... well, location...",
      "text": "Glen Grove Conservatory Tower is where you want to stay IF:  1.  Location matters.  Nothing beats the location.  In fact, the location is about the only thing this place has going for it.2.  You don't mind being moved from one suite to another because the cleanliness of your first suite is absolutely abhorrent;  dried skin scabs along the headboard, dried urine on the toilet seat, harden brown stains (don't even want to guess) on the vertical blinds, missing vertical blind sections, holes in lamp shades, dirty/stained towels & linen, hairs visible on bathroom counter tops/sinks, refrigerator shelves with sticky, leftover residue... need I go on?  (Unfortunately, I could.)3.  When you ARE moved to your next suite, you don't mind ants in your kitchen.  But hey!  Management will cover the cost of the ant traps!  While they \"say\" units are refurbished/being refurbished, be warned - these units are *very* worn down.  We had gaps in the laminate flooring, actual holes in the bathroom walls by \"new\" electrical outlets, mould that had *clearly* been painted over (how's that for refurbishment?) in BOTH our bathrooms - to simply name a few.When we were choosing our accommodation for our stay in Toronto, we did not see one picture that depicted what we were faced with upon arrival.  At least be honest with your potential clients.  SHOW them what they will get so there are no surprises.  What I've listed above may not bother every client.  To whomever said \"don't you visit Toronto for the city experience, not the apartment?\" is partially correct.  Charging roughly $150 per night, and given that we were traveling with children, I expect an accommodation that has cleaning standards.  While I don't expect the most trendy, contemporary furniture, I certainly don't expect lamp shades with holes and missing blinds.  And I certainly don't expect ants in the kitchen of the second suite they move us to because the first suite should quite honestly be condemned.  To be fair I should state one other positive;  the kids loved the pool.  When it was open.  Other than that, what else is there to say except... you've been warned.",
      "rate": 1.0,
      "tripDate": " December 2016"
    },
    {
      "title": "Family rooms",
      "text": "We stayed here for 3 nights in a lovely spacious 2 bedroom apartment in the heart of Toronto.Lovely kitchen allowed us to make our own breakfast and even dinner if you want, but we went out all the time as it is so close to everything.if you dont want to walk jump in a short taxi ride to anywhere but traffic in the city gets really busy during rush hour and baseball games",
      "rate": 5.0,
      "tripDate": " August 2016"
    },
    {
      "title": "Good location but VERY tired",
      "text": "Firstly, this is a mainly residential housing block with a some apartments which are rented out privately to visitors. The building has 4 huge lifts for each floor with a 24 hour concierge. The location is great on Bay Street with loads of supermarkets, drugstores and restaurants nearby, with great views. We had a apartment on the 18th floor and the general state of the apartment was not up to standard. It seemed like little money had been spent on it. It was comfortable with sofa, dining table, cable TV, WiFi, laundry facilities (the complimentary Tide and Bounce were a nice touch) and balcony.The bathroom needs a complete overhaul. The sealant round the bathtub has turned orange, the basin is loose, the walls need repainting, there are knobs missing from doors and the bedroom has office style blinds which do not close properly and light floods in from the gaps. With a little money spent upgrading, it could be a great place. Not the fault of the owners, but there was also an overwhelming aroma of cannabis being smoked from the apartment below.",
      "rate": 3.0,
      "tripDate": " July 2016"
    },
    {
      "title": "Please, run away.",
      "text": "Staff were very rude,they spoiled our day trip for two consecutive days. First, there was a power shut down in the suite. So we could not get ready on time for the day trip organized by a third party. Re-scheduled it on the next day. Again, could not go to the trip because the staff was not agreeing to keep our huge bags until our return from the day trip (We had already checked out). They say, cant keep the luggage near the security. Could not find a place to keep the bag. Greyhound lockers nearby were very small. Cancelled our whole trip as we can't drag our huge checkin bags all along. No body should stay here anymore. Appliances are old, window binds were falling down, can't turn ON multiple switches at the same time, else be ready for a power trip. Totally waste of money, time and energy.",
      "rate": 1.0,
      "tripDate": " September 2016"
    },
    {
      "title": "Old but great location ",
      "text": "Location is great. Yonge/dundas sq is just around the corner. The apartment is dated though, half the furniture is falling apart. Sockets are broken, some loose wires.We are family of 4, so two bedroom was great, but couldn't close some doors as the door handle would fall off. So bit risky with 2 kids.Choose the place because it has a pool, unfortunately on the 1st day pool was \"out of order\" and hence we had to look for a local swimming pool. Bit annoying as the pool is a good break in between the city trips.Overall it is ok. Not brilliant.Was gonna stay here again in a few weeks but cancelled and booked elsewhere",
      "rate": 3.0,
      "tripDate": " July 2016"
    },
    {
      "title": "Great location, needs more cleaning",
      "text": "We stayed in a 2-bedroom apartment over New Years. The location is fantastic -- right at Bay and Gerrard, so easy walks to the Eaton Centre, Maple Leaf Gardens (and its amazing Loblaws), Queen Street, the subway, and the bus terminal. Check-in was slightly confusing as there is no staff for the apartment on-site, but our keys were ready early when we asked the security guard in the lobby. We found the apartment very spacious, and with 2 bathrooms! Great for 4 people staying there. It was pretty well equipped, with laundry machines in the apartment, detergent provided, dishwasher, microwave, and wifi. Was nice to have a balcony too!The downside was that the apartment was a bit dirty and run-down. Nearly all the glasses and dishes had food remnants on them, so we had to wash everything before using it. The towels all had hairs on them from previous guests (ew) and so we had to run a load of super-hot laundry to feel OK about using them to shower with. Overall, the place doesn't seem to be cared for that well, but I suppose at the price, you're not going to get a flashy place. However, I think clean towels and dishes is a must. It was a decent size for being downtown and having a few friends over for cheese and drinks on New Years anyway, but I would have loved a slightly later checkout than 11am! I'd probably stay there again if I needed space and location and a decent price above flashiness, which was the case for this trip.",
      "rate": 4.0,
      "tripDate": " December 2015"
    },
    {
      "title": "great location",
      "text": "Only good thing about this property is the location. we booked another hotel but got an email a few days before we left to say that we can no longer stay there but we can stay at the conservatory towers. We got our key from the concierge desk. Walked into the apartment. The floors were covered in hair, dust and bits of food crumbs. The bathroom were the same. Pulled the sheet back from the bed and it had hair over it.The blinds in the bedroom were broken, so let in a lot of light. The location is great. in a good spot, close to everything.",
      "rate": 2.0,
      "tripDate": " May 2015"
    },
    {
      "title": "Great location",
      "text": "Rented a 2 bedroom suite for 5 nights to accommodate 4 adults & 2 children. Was great having the full kitchen as one of the children was only 13 months old. He had plenty of room to crawl/walk around and explore. Plenty of room for all of us. The security staff weren't too pleasant. The remote for garage wasn't working properly and after calling Glen Grove, was told to leave the remote with security. Went to do so & they didn't want to take it. Parking was only $10/day - cant beat that in downtown Toronto!! Well definitely stay there again.",
      "rate": 4.0,
      "tripDate": " September 2012"
    },
    {
      "title": "Cheap, but worth paying more to be elsewhere",
      "text": "We were moved to the Consevatory towers by default as the accommodation we had booked with the Glengrove group became unavailable about one month before departure; which is a story in its own right.The conservatory towers are conveniently located on bay St, about equidistant from 3 subway stops, closeish to restaurants and shops [5-10 minutes’ walk]. Convenient but just.The first apartment we were given smelt of cigarette smoke, was dirty and the furniture scruffy and ancient. We were moved to a different apartment; it was better there was no smell and it was a little cleaner.The rooms are dark, small, and the two apartments both had really old fittings. The concierges varied form pleasant to [more often] abrupt and dismissive. We did like the pool; the gym is basic at best.We wouldn’t stay there again; even for the location. Look elsewhere.",
      "rate": 2.0,
      "tripDate": " June 2012"
    },
    {
      "title": "NEVER AGAIN",
      "text": "When arrived ,had to pick-up the keys from a less then helpful security guard. Opened the door to the apartment to be greeted to non working A/C and a smell like wet dog.  Could only stay one night.Disgusted with dirty floors and kitchen (which had a bad smell from something) and the bed linen.Pavements on Young St was cleaner then this place. This place is a joke.Don't know how it got any good reviews",
      "rate": 1.0,
      "tripDate": " May 2012"
    },
    {
      "title": "Suite Experience",
      "text": "Located on Bay Street across from College Park, Conservatory Tower offers, in my opinion, the best location in Toronto.  It is just a quick walk away from Yorkville and Bloor Street, the Entertainment District and Eaton Centre.  A supermarket, pharmacy and the subway are across the street.  The suites offer a fully-equipped kitchen with diswasher, self-controlled heating and air-conditioining and an ensuite clothes washer and dryer which is a real plus.  Weekly maid service is offered in modern-designed, hardwood floor suites with great city views.  A private phone line with free local calls and voicemail are included as well as cable TV.  One feels as though they are living in the city not just visiting --  a home away from home.  Conservatory Tower is good value for the money from any point of view with an efficient staff to advise you.  As a repeat customer, it would be difficult to find a better location in Toronto.A satisfied repeat customer.",
      "rate": 5.0,
      "tripDate": " September 2012"
    },
    {
      "title": "Some problems but great location.",
      "text": "Spent hours online looking for 4-5 bedroom house to rent for 3 1/2 weeks to accommodate  a dozen people in Toronto for family wedding.  Not much available, and cost was prohibitive. Eventually decided on three separate apartments in The Conservatory Tower. We chose it primarily for the location, then on price (good), and if that is important then this place is great value. Our apartment two bedrooms and two bathrooms and was clean when we arrived (other family chose one bedroom apartments).  It is serviced weekly, but toiletries and more importantly toilet paper were not replaced - they were the following week when we left a note!! However, for a place which accommodates four guests, it only had three lounge chairs, three small plates...  The second bedroom was tiny, and the wardrobe door was broken, fallen off the track.  It was propped up, but after 3 weeks was not repaired, neither was the broken mirror.  The vertical blinds were missing slats, and these were replaced after complaint.  In fact we were offered another apartment, but that was worse, the bed was broken and propped up on the cabinet.Good points: location (apart from the construction site across the road) washer/dryer, location, reasonable size except for bedroom 2, location.  Comfortable for 3, ok for 4.  So what's with the location?  Walking distance to sops, bars, restaurants, and more importantly to the subway and trams. Very easy to get to from the airport.Bad points: maintenance is poor, light bulbs were not replaced, fittings were brokena nd not repaired when reported, noisy, air-con was set to heat, and we were not able to reduce the temperature to something bearable - we were opening the windows to let air in when it was snowing outside.Overall, if you can cope with minor problems - i.e. you don't expect it all to be right, then this is a wonderfully located apartment, and good value for money.  If you expect 5 star, look somewhere else. Yes, even knowing what to expect, we'd stay there again.",
      "rate": 3.0,
      "tripDate": " April 2012"
    },
    {
      "title": "Dirty and Old",
      "text": "Booked in to stay for 4 days.Two bedrooms with beds. Both beds had unwashed linens. Visible hairs & stains throughout both beds. I was disgusted & could not sleep in the apartment. Went & checked in across the street at the Mariott Courtyard (much nicer).It is an apartment block, so no reception. I was given contact details by the security guard in the lobby, however when I rang the number all I got was an answering machine.Apartment not as pictured. All furniture & beds (which also creaked) where 20+ years old.",
      "rate": 1.0,
      "tripDate": " April 2012"
    },
    {
      "title": "Excellent experience",
      "text": "Glen Groves new location \"The Conservatory tower\" is a good place to stay. Well located in the city of Toronto. All interesting sightseeing points are in easy reach. The room was spacious and tidy and the room service was very good. The check-in/check-out process is verry customer friendly. The places can really be recommened.",
      "rate": 5.0,
      "tripDate": " May 2011"
    },
    {
      "title": "Very run down and no respsone to our complaint",
      "text": "We had a great trip to Toronto and made the best of a bad situation with our stay at Glen Grove. When we checked in we tried to see the good side of it with the location and that is good for shopping and visiting downtown attractions.The room however was in desperate need of repair and renovation. Doors not closing properly and fittings falling off. The balcony looked like it was never finished properly and the protective netting was ripped. We e-mailed management twice politely about some of our concerns and comment about safety for our young children and the general state of the apartment and received no response. In my opinion this speaks more about the establishment then the state of the apartment. As I have worked as management in the hospitality industry and firmly believe that a complaint can be a gift for a business that want to provide the best service they can for all the guest.",
      "rate": 1.0,
      "tripDate": " August 2008"
    },
    {
      "title": "Dated",
      "text": "My parents and I stayed in a 2 bedroom 2 bath unit, while visiting my brother and his family. It was clean but dated. The beds were either hard as a rock or lumpy. The kitchen faucet was coming apart from the sink. Knobs weren't screwed into the dressers. The shower curtains were moldy and missing a toilet paper roller. Holes in window screens were taped with plastic and duct taped. There were no hangers for clothing. It looked like it hadn't been updated since the 1980s. Next time we visit, we are looking for a different place to stay.",
      "rate": 3.0,
      "tripDate": " October 2019"
    },
    {
      "title": "Great location but a bit pricy",
      "text": "The location is great, you’re just around the corner from downtown (Dundas and Yonge) and to the shops and restaurants. You have two metro stations close by and the union station is about 1.7km away. You have a full apartment for yourself including a kitchen and washing Maschine/dryer in case you need one after a long travel. You get the keys from the concierge and you’re good to go. The apartment is spacious and comfy.  I would recommend this place if you want to be close to everything. ...just a minor thing, the apartment floor was a bit dusty and the furniture outdated for the price. But it was the “tiff” week, maybe that’s why it was so pricy.",
      "rate": 4.0,
      "tripDate": " September 2019"
    },
    {
      "title": "Good central downtown base",
      "text": "This was a one bedroom serviced apartment in a large tower block of approximately 25 storeys. My wife and I stayed there for 6 days during a longer visit to Toronto. The apartment itself was not particularly remarkable and consisted of a bedroom, separate bathroom, and a reasonable sized lounge/kitchen. It was well equipped with full sized cooker, microwave, dishwasher, washing machine, iron + board etc. It was clean with spare towels, but no maid service during our stay. The furniture and fittings were a little dated and not of a particular high quality. Security of the property was very good with a full time concierge and locked entrances. As residential apartment block many of the residents were long term and there were no other communal facilities. However, there were at least two high quality supermarkets with deli facilities.The apartment block is within easy walking distance of the Eaton Centre and City Hall as well as the Metro Line 1 and bus stops for street cars. Public transport links in all directions were excellent.In summary the accommodation lived up to its description and served to purpose as a well placed downtown base from which was in easy reach of the waterfront and other attractions. We were very pleased with our choice.",
      "rate": 4.0,
      "tripDate": " September 2018"
    },
    {
      "title": "Family City break",
      "text": "1 bed apartment on 14th floor. Secure apartment block with very helpful security!! Clean apartment and had everything we needed. Had pull out sofa bed for kids to sleep on. Small kitchen with cooker, microwave and coffee maker. Washer & dryer was godsend as air canada lost all our luggage so we could at least wash the clothes we travelled in. Secure Underground parking space Great area around 20minute walk to finance district.Great value for money would definitely returnMany thanks",
      "rate": 4.0,
      "tripDate": " August 2018"
    },
    {
      "title": "Good location, reasonable value, could be better",
      "text": "The location is ideal for seeing Toronto main sites, and near bus stops and subway stops.  Also very close to bus station for traveling further - we caught the bus to Niagara Falls, which was really easy! We chose glen grove as we wanted the self catering facilities, as we didn’t want to be eating out all the time.  The apartment had everything- but some items were missing from the kitchen, like a frying pan and bottle opener.  The gift bag of essentials- such as washing powder, coffee sachets etc was nice to have, and there were toiletries in the bathroom too. The windows were really dirty.The balcony was very small, uninviting and nothing to sit on.The pool was out of use for our stay, yet this was not shown on the booking site.The bed was ok, but short of pillows- only 2 on the bed, and only one spare. Not enough for 2 adults!There is only a security guard at the front desk - they are very helpful, but it’s not the same as having a permanent receptionist.However, it did offer value for money overall, and like I said we found the kitchen facilities a great benefit.",
      "rate": 3.0,
      "tripDate": " May 2018"
    }
  ]
}