{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Glen Rouge Campground",
    "url": "/Hotel_Review-g155019-d3216438-Reviews-Glen_Rouge_Campground-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.5",
      "reviewCount": 59
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "7450 Kingston Rd",
      "addressLocality": "Toronto",
      "postalCode": "M1B 0B7",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0b/ef/14/f2/20160624-152634-largejpg.jpg?w=500&h=400&s=1"
  },
  "description": "Glen Rouge is the only campground located within the City of Toronto. It offers campers a unqiue experience: both the natural beauty of a park, and proximity to urban amenities and attractions.",
  "featues": [
    "Pets Allowed ( Dog / Pet Friendly )"
  ],
  "reviews": [
    {
      "title": "Huge lots and beautiful environment",
      "text": "Stayed here with friends last year, could not believe the size of the lots. Really gorgeous with lots of wildlife to be seen sauntering in the park.  No sewer connections but they have a dump station at the park gate you can use for free.  Clean washrooms but a lot of stalls \"out of order\" or otherwise not functional and they never got fixed, were still broken when we came back in October.  Also, not handicap accessible. You have to climb stairs or a step path to get to them. Office staff were super nice. Wifi sucked. They have discounted rates that were not advertised nor explained properly.  I hear the park is closed for some kind of renovations in 2020, too bad, it was a nice urban place, very convenient to almost everything.",
      "rate": 4.0,
      "tripDate": " September 2019"
    },
    {
      "title": "Close and Closer",
      "text": "As a native Torontonian, I was happy to find Glen Rouge Campground. Its' proximity to the city was excellent. The Rouge River runs through it. The Rouge Valley Trails are at the entrance and were lovely. The Zoo is close, a great hike through the woods and you are there! The Campgroud is close to the highway. Bring earplugs. The sites are very close together and you WILL get to know your fellow campers. Whether you like it or not. The facilities could use some money from the city. Getting to sleep in a tent and build a nice fire over the weekend though, was exactly what I needed. No need to return though...",
      "rate": 3.0,
      "tripDate": " July 2013"
    },
    {
      "title": "Could be so beautiful...",
      "text": "The place is beautiful, all green and clean. My own point is, we had a hippie guy just beside our camping, i thing they take pity of him and keep him there. His dog bark bark bark after all type of wheel, he look so miserable its was digusting. The shower... omg look like a perfect murder shower, nothing to lock the shower, only two thin sheet, all door open, and soooooo dirty.. ewww i didnt take a shower there!!",
      "rate": 3.0,
      "tripDate": " August 2012"
    },
    {
      "title": "dirty campground",
      "text": "Last week, we went camping there... You never want to go to the washroom (showers and toilets)... It is so dirty... You have hair, water, paper and  mud all over the place... We were suppose to stay 2 nights but we couldn't... A family from Montreal  :(",
      "rate": 2.0,
      "tripDate": " August 2012"
    },
    {
      "title": "Beautiful oasis ",
      "text": "We were taken with the beauty of this campground. It is located just outside of Toronto and it was the perfect place to park our trailer and take the car into the city to see the sights and take in a ballgame. We noticed lots of locals use it with their families to escape the city on the weekends. This campground offered large lots, full grown trees for shade, clean washrooms and fire pits. Our grandchildren loved it!",
      "rate": 5.0,
      "tripDate": " June 2018"
    },
    {
      "title": "Camping in the big city!",
      "text": "My husband and I and a group of 18 friends went camping for a week at this campground.  We were pleasantly surprised seeing that it is right in the city.  It was well maintained and very clean.  Even when full it was very quiet.  We went down for site seeing and this spot was so handy to the TTC and Go stations.  We enjoyed ourselves immensely and would do it again in a heartbeat.",
      "rate": 5.0,
      "tripDate": " June 2018"
    },
    {
      "title": "Won't stay here again ",
      "text": "My family and I stayed here 3 nights while we toured Toronto as we were intrigued by the location. After our experience , I'd recommend paying a bit more to stay somewhere nicer or farther away in return for more comfort. The grounds and paths are not lit at night.The bathrooms are located at the top of a big hill with treacherous steps (which is quite tricky at night with kids ) .The playground is in need of upgrades and repair. The bathrooms are not kept clean . And my biggest complaint is the showers. They are old and require the user to hold the small button continuously if you want more than 6 seconds of water (think automatic shut off sink tap but in a shower )  .The edges of the showers aren't sealed so your feet go right into deep dirty water as soon as you exit the shower and there isn't a curtain between where you wash and where you store your items so they get all wet from the spray. The customer service was mediocre as the lady who checked us in was very impatient with a French family ahead of us who were asking for explanation of their weird tent rules (even on huge sites , you can't have a camper plus small tent) . I have stayed at many campgrounds across the country and this is , by far , the worst experience our family has had in a long time. The only positive I can think of is that there was security at the gate at night. This made us feel a bit more secure when heading into the city for the evening. Bottom line : stay somewhere else.",
      "rate": 2.0,
      "tripDate": " August 2017"
    },
    {
      "title": "Not a usual camping experience",
      "text": "We had reservations to camp at Glen Rouge last weekend. There were a number of unusual things about this campground that led to us not staying and forfeiting our entire weekend stay. Firstly despite being recently bought by Parks Canada, they have maintained their own set of rules in addition to the PC rules, which includes one that nothing can be hung on the trees. As rain was forecast, this was not ideal as we would normally secure a tarp over our picnic table. We decided to stay anyway and set off to find our site, which we couldn’t find, so we went back to get directions. They showed us our site on the map, which was a “backpacking” site. We normally book backpacking, back-country or walk-in sites wherever we stay as they are normally more private. When we went back to the office they informed us that we weren’t allowed to park our vehicle in the park. We knew we couldn’t park it at the site, however they informed us that we couldn’t keep it in the park at all and that we could “try” the city lot across the street, but it wasn’t guaranteed. At this point we asked for a refund of the firewood we bought, and they called for a manager. When the manager came we explained the situation and he clarified that it was legal to park in the city lot. We still felt it was unreasonable to not be able to keep our car in the park since the site fees on the website, including the backpacking sites, say they include parking for one vehicle. We were still wanting to camp however so we decided to give it a go. Finally we made our way to the site, and when we got there realized it was not anything even resembling a campsite, rather a patch of grass on the shoulder of the road, only five feet from its neighbouring site and in a clearing with the toilets and campground. It shouldn’t be sold as a campsite at all, let alone a “backpacking” site that implies privacy. Finally, we left and forfeited all our fees plus the firewood. The manager was quite lovely to deal with but could only work with what he had. Needless to say we won’t be returning, hopefully when Parks Canada finishes the changeover they will remedy the shortcomings.  We didn’t see the regular sites so it’s possible they are quite fine, and you can park your car at them.",
      "rate": 2.0,
      "tripDate": " July 2019"
    },
    {
      "title": "Not very flexible for reservations",
      "text": "I made a reservation for 3 days. I cancelled by mistake, and since I was only a day away from the beginning of my stay, the fees were almost half the cost of all of my stay. So I called on the same day to ask if they could keep my reservation, but there was nothing they could do. Instead of keeping a 3-day reservation, they refused my request and stole my money.",
      "rate": 1.0,
      "tripDate": " July 2017"
    },
    {
      "title": "Nice Campground",
      "text": "We camped at Glen Rouge Campground in summer 2016. This is a nice campground located in the city, it's pretty close to go other places. We had a nice site located pretty close to the bathhouse. The bathhouse was quite nice.",
      "rate": 5.0,
      "tripDate": " July 2016"
    },
    {
      "title": "Beautiful and close to the city!",
      "text": "Strongly recommend visiting the hiking trails in the area - was one of the best I've seen in Toronto! Campsite was clean and showers were hot. Very close to the GO station which brings you to the city in 40 mins. Bring food for the campfire, a tent and you're all set!",
      "rate": 4.0,
      "tripDate": " July 2017"
    },
    {
      "title": "Great for first time campers!!!!",
      "text": "This was our first time to try camping, I actually chose this place as a preparation for out of the city camping. We did camp here during the Canada day long week end. I was lucky to find a spot on the website just a week before the the longweek end. It was a perfect place for us first time campers its near where we lived but the camp ground itself will make you feel your not in the city limits. Camp ground is well maintained, its safe for childrens to walk around and play.",
      "rate": 4.0,
      "tripDate": " July 2017"
    },
    {
      "title": "Lovely campground",
      "text": "Camping inside city limits of Toronto! Sites are generous with good space between.Bathrooms/showers are very very clean. Gated 24/7 and sites are cleaned by staff as soon as they are vacated. This is a quiet family oriented campground. Mr. Softee comes around between 7 and 9pm. We camped in a motorhome and had electric (30amp) and water. Dump station is located on a roundabout at the entrance to the campground.The Toronto Zoo is in the park and made for a fun day.The park itself is beautiful, clean and peaceful. Lots of hiking if that interests you.We LOVED it and even extended our stay!There are gas stations and drug stores nearby, but the grocery store was about 15' away. We were surprised at this as it appears to be a very densely populated area...We drove to Toronto (30') where we found parking either on the street or in lots. The highway is easily accessible from the campground.  We took the subway into town only once but found it was not convenient nor time saving. We did not use the commuter rail, but you have to drive to that station as well.",
      "rate": 5.0,
      "tripDate": " April 2017"
    },
    {
      "title": "Nice and close to zoo",
      "text": "We camped here as we planned a zoo trip. It is a really pretty park, lots of trees and shade. There is not much for kids to do, swings but no playground or beach. The site we booked (and all the rest) indicates 15/30 power, but when we went to plug in I think it's actually 50 and we didn't have a 30 conversion kit, so could only use the 15 (which if you have a trailer actually matters!). Also according to our neighbours the water pressure is too high so people were having their water systems damaged, so we filled out tank and used it that way instead. The bathrooms are ok, showers could use an update as they always look a little dirty but i think it's likely the age of the tiles. The water was warm and good pressure for showering. The park has a 10km/hr speed limit and most people completely ignore it, which is irresponsible of them as guests and dangerous with all the kids and people in the park. Perhaps the park could install some speed bumps? Also some of the guests didn't realize that it is poor etiquette to cross through other people's campsites (using ours as a shortcut) which I have never experienced at other campgrounds across Canada. The staff are super friendly, the grounds are well maintained, the quiet hours were respected and overall it was a good stay, close to Toronto and cheaper and more fun compared to a hotel.",
      "rate": 4.0,
      "tripDate": " June 2017"
    },
    {
      "title": "CAMP IN SUMMER, HIKE YEAR ROUND",
      "text": "A wonderful little gem in the valley which separates Toronto and Pickering.Campers are in and out all summer. My favourite thing is to hike during all seasons with my dog. I take a lot of pictures while there. You will find trails that will take you through the valley.Camping or for a few hours hike this is a great place to go.",
      "rate": 5.0,
      "tripDate": " October 2016"
    },
    {
      "title": "Nice camping",
      "text": "The campground is mostly grassy and the campers were very quiet. The only two negatives were the traffic noise (of which the campground has no control) and the showers were lukewarm.  Other than that the check in person was more than helpful when we thought our credit card number had been stolen.  He went above and beyond to help. If you are immune to noise, this is a great place.  We liked the hiking trails.  They were very beautiful.",
      "rate": 4.0,
      "tripDate": " September 2016"
    },
    {
      "title": "A must try..",
      "text": "My spouse & I love staying at this campground.  We book here for every single long weekend. We got our families to come & also loved it. Its close enough to home(just in case an emergency comes up). While there, it doesn't feel like you're in the city at all. Very clean and the staff is very friendly.  I recommend it to everyone. #happycamping.",
      "rate": 5.0,
      "tripDate": " September 2016"
    },
    {
      "title": "Camping in Toronto? Who knew! ",
      "text": "Today is the first day of a week long stay at this urban campground. Since selling my house and moving into my tiny house on wheels I've been exploring campgrounds near Toronto so as to be close to my family. Next summer I'll stay predominantly in one spot to take advantage of long term rates.  This could be the spot!Things I like: it's so darned convenient. Located on Kingston road it's close to the zoo, mass transit, and shopping. The sites, though not level, are large with many trees. People are friendly, as is the case in campgrounds. There's power and water at almost every site, and the Rouge river winds along one boundary. There's a beautiful breeze and a ton of green grass everywhere. There are campers from all over including young backpackers.What I don't like: no septic (I don't know  about the seasonal sites but the trailers look well settled), the traffic noise I think will blend into the background eventually, the playground consists of a couple swings,  and the bathrooms look a little sketchy. Will be interesting to see how I feel about it at the end of the week.",
      "rate": 4.0,
      "tripDate": " August 2016"
    },
    {
      "title": "great location!",
      "text": "We chose this campground for the location.  Just inside Toronto city limits, not very far from the zoo and a short drive to downtown Toronto.  When we booked we thought it had 3 services but only had electric and water, so that was a problem for us.  Their dump station is not located well, especially for a motorhome towing a vehicle. The campground is well kept, the site was level and very nice.  No amenities for families, it is really about location, which we enjoyed. However, we would not likely camp there again.",
      "rate": 3.0,
      "tripDate": " July 2016"
    },
    {
      "title": "Its camping...",
      "text": "No access to the river which is a bummer. They are very proud of their firewood at $12 a bundle. Other than that it's a nice clean campground with hot showers that are relatively clean. Shower stalls are big which is a plus. No sanitary hook ups but there is a dump station. Tons and i mean tons of poison ivy so stay out of the high grass. Shouldn't be trouble though as the sites are large around the outside. The inside sites are small but mostly filled with tent campers.",
      "rate": 4.0,
      "tripDate": " July 2016"
    },
    {
      "title": "Best Campground!",
      "text": "We're  on a Roadtrip and we're always using campgrounds to sleep. We're on our way with a tent and a car and that's it. So we've seen a few campgrounds, in the USA and this one in Canada. And Hands down, this is by far the best so far.It's so Close to downtown Toronto. It's safe and everything is superclean.We recommend it to everyone to go there. It's awesome",
      "rate": 5.0,
      "tripDate": " May 2015"
    },
    {
      "title": "Made for nice access to Downtown Toronto",
      "text": "Clean well kept campground. Close to Rouge Hill train station...30 minutes to Union Station in Downtown Toronto...$15.80 Canadian. Bathrooms could use a serious overhaul. They need to allow Easy Ups and dining tents...all of our stuff got wet twice due to no canopy.",
      "rate": 4.0,
      "tripDate": " September 2019"
    },
    {
      "title": "Great location to downtown but lots of highway noise",
      "text": "My husband and I stayed at Glen Rouge for two nights at the end of September. We chose the campground due to its proximity to downtown Toronto.  On the plus side, it was just a short drive to the train station.  We took the train downtown which was super convenient (driving and finding a parking space didn't sound like much fun!).  Also, there were hiking trails we and our dog enjoyed.  One the negative side, there was really no privacy at our campsite, no trees or shrubs between sites.  We stayed in a  pull thru site, and had enough room for our motor home and our car.  As others have stated, the campground can get muddy in the rain!  Thankfully it didn't rain while we were there, but there was a huge muddy rut right in front of the door to our motor home.  We didn't use the restrooms so we can't attest to that.  For me the biggest negative is the campground is right next to a very busy expressway. So there is the constant drone of traffic 24 hours a day.  Also, excessive water pressure blew out our line, which has never happened in our 14 plus years of rv-ing.  Thankfully my husband is handy and was able to find a store that carried the parts that we needed so he could fix it.",
      "rate": 3.0,
      "tripDate": " September 2018"
    },
    {
      "title": "Unforgettable Summer",
      "text": "My family had a summer vacation and stayed here for several days. Well managed, safe and clean. Only wish they have several shower places for “family use”(  a mother was helping her two sons and senior father for shower in the ladies ‘ place) it’s so so fair to girls and ladies!",
      "rate": 5.0,
      "tripDate": " August 2017"
    },
    {
      "title": "Pretty good place to camp with a trailer in Toronto",
      "text": "We camped here in our 30' TT in Oct/17, and, although the place \"looks\" a little unkempt (it WAS the end of the season), we found it to be just fine. We don't use CG amenities so I can't speak to those. Trails were closed due to poisonous plant (thank you for letting us know!), but there were spaces where our dog could roam and there is a huge park nearby as well as the Zoo. Location is excellent, if a bit hard to find the turn at night. Personally, we like the lack of lights everywhere and the park has reasonable grounds. Spots are not tight at all, though can be somewhat close to each other.Getting in to Toronto from there is an easy, if tedious drive (traffic!), and there are a number of shopping stores nearby for food and goods.Pro tip: if you need propane tanks filled there is a U-Haul depot about 5 minutes away on Kingston Road that will happily service you during daytime hours. Camp staff seemed unaware of this and was sending people to Oshawa, 25 km away.CG was quiet and we were undisturbed, but there was no staff on grounds as far as we knew for overnight. If that's a concern, you may want to be somewhere else or check to see if they've added security.It's a bit pricy, but on the outskirts of Toronto that's to be expected.",
      "rate": 4.0,
      "tripDate": " October 2017"
    },
    {
      "title": "Great location!",
      "text": "Nice campground which is conveniently located right beside the 401 in a large conservation area. Price for camping are really cheap (less than $40 for water and electricity). There is not much to do per say on the campground but this is a great alternative to super expensive hotels.",
      "rate": 4.0,
      "tripDate": " June 2015"
    },
    {
      "title": "THEY TOOK DOWN CHRISTMAS....",
      "text": "Its been a tradition for 30 years to dress a few Christmas trees in the forest...this is done by people who have been taking care of the forest and have been hiking there for years...people who care and are responsible with what is put up on the trees...….. (unbreakable plastic ornaments well secured) and  the ornaments are taken down after New Years....the hikers and runners and everybody walking thru would smile as they came upon them and generated a Christmas spirit ....As well as taking down a bird feeder that has been there for years ….... parks Canada worries about this meanwhile they are cutting down perfectly good trees claiming they would fall...isn't that what naturally happens in forests... and there is garbage thown everywhere and NO SIGN forbidding garbage not to be thrown....( the same people that dorn the Christmas trees and a few other people that have used the trail for years , pick up the garbage on a dailly basis and put it in the right receptacles .... they allow biking on the trails that are anything but bike friendly ....as I watch older people trying to get their exercise in for the day be run off the trail by daredevil cyclist and kids leaving their bikes blocking trails so inhibits the use of the trail.....and all the broken alcohol bottles and beer cans strewn all thru the woods is not a concern but a few bobbles on a tree and a bird feeder are????? doesn't make any sense......Not to mention the domestic duck (Abigail) we were monitoring and taking care of and had a plan for her to go to a sanctuary…. was chased by them in order to catch her but instead tramatized her and the group she was in and we haven't been able to locate her since...we are still trying to locate her.....We are very disheartened by the complete disreguard for the people who have taken care of the forest for all these years!!!!!!",
      "rate": 1.0,
      "tripDate": " December 2019"
    },
    {
      "title": "Nice quiet camping spot",
      "text": "The grounds were very nice and very friendly staff. The washrooms and showers weren't very clean, but still comfortable to use the facilities. The process to book was annoying, as you first need to create an online account then make an online booking. When travelling on the road, it is easier to quickly phone and book.However is still very much recommended this campground.",
      "rate": 4.0,
      "tripDate": " August 2018"
    },
    {
      "title": "Best RV campground in the GTA",
      "text": "Having travelled from Waterloo, ON this place was pretty easy to find, located a short distance from the 401 at the bottom of a slight dip in the Kingston Road.  Signage from the street isn’t great but out GPS took us straight in.  Check-in was simple but I didn’t get any map of the CG and drove in using memory from when I’d made a reservation.  Despite the proximity to the highway, noise is buffered by the trees and barely noticeable.The interior road signs could do with improvement because shortly after entering the park the single lane in/out road splits in to three separate roads without any indication about what sites are on which road.  The interior roads are paved and do go around in a series of loops.  The single lane in and out of the park could be problematic, especially if two trailer, travelling in opposite direction meet.  Backing out of the conflict would not be the easiest for either vehicle.The site was very long and big enough for our 40’ 5er and truck.  It also appeared to be quite wide but that may be because we had nothing parked next to us in the adjacent two sites for the duration of our 6 night stay.  The site was grass and dirt (where someone had previously had a carpet for an extended time killing the grass).  We had a picnic table and fire pit.  Water pressure was good as was the 30 amp power we had.  There are no sewer sits here which is a let down and meant I had to go out and buy a waste water tote to empty the grey tanks on the rig.There is only one set of CG washrooms that are cleaned but due to the volume of people using them, soon began to look untidy.  What you don’t see from their map is these are located atop of a hill about 30’ above the CG level.  There is a steep path or set of stairs to access these but for those in a wheelchair or other medical condition it could be very challenging to reach.Wi-Fi was good and is included in the price.  There are lots of trees that provide good shade and a habitat for wildlife.  Raccoons are prevalent so ensure everything is secured overnight.",
      "rate": 4.0,
      "tripDate": " July 2018"
    },
    {
      "title": "Great Location and a well kept campground",
      "text": "We are frequent and avid campers, in everything from tents to 20 foot trailers, and have a lot of experience at a lot of different campgrounds. Being a family of 5 we find it hard to find reasonably priced hotel rooms that will accommodate us and for our recent whirlwind sightseeing trip to Toronto, we just needed somewhere to sleep.  It seemed like a hassle to pull our large travel trailer for hours along the 401.The new Parks Canada Otentiks were perfect for us and made for an excellent vacation!  Our children loved the set up and beds inside, and we loved being off the ground and out of the rain!  They had everything we needed for a fun weekend including lanterns, a table, beds for 6, chairs etc...  My only complaint about the Otentik is that the beds are extremely firm!  Being just a few minutes from the Go station allowed us to zip into downtown for a Jays game, CN tower and aquarium and then the next day the zoo is just minutes away!The campground itself has security walking around and the sites are large and tidy. It is the perfect homebase.My only complaint is the washrooms.   It is difficult to access the washrooms from the Otentiks.  A bit of a walk and then up a set of steep concrete stairs that are not lit at night made middle of the night bathroom runs awful. A suggestion would be to move the porta-potties they have outside of the bathrooms (presumably there for when they are cleaning?) to a closer location in the lower section.  Also, cleaning the bathrooms at 9:30 at night when people are getting ready for bed and need to brush teeth etc.. is not ideal and seemed to be the practice each night we were there.Otherwise terrific and our kids absolutely loved it!",
      "rate": 4.0,
      "tripDate": " August 2017"
    },
    {
      "title": "Perfect location",
      "text": "Great spot for being close to downtown. Never used any of the facilities as we were in our 5th wheel & have our own shower etc. Sites were big & spacious & the overall site was quiet. Basic play park with swings. Campground is on main road with McDonald's and Tim Hortons nearby.",
      "rate": 4.0,
      "tripDate": " September 2014"
    },
    {
      "title": "Excellent location - facilities average",
      "text": "Location:  4/5 (4 out of 5) for someone visiting Toronto.  The park is located beside the Rouge River within the City of Toronto.  Access to the highway is good as is access to the GO train about a 10 minute drive away.  The Rouge Valley is presently in the process of becoming Canada's first urban national park which gives an idea of what the surrounding area is like.  I would give it 5 stars except Highway 401 can be noisy at times (but never enough to keep us awake at night).Site Quality:  3/5.  The campground sits on the Rouge River floodplain which is flat.  The campground however is a \"lay of the land\" layout which means many of the sites are not level.  The campground is park like with sites not clearly delineated and located on a grass field.  That said, about a quarter of the sites are reasonably level and about half require levelling to some degree.  The remainder would require some serious levelling (these are estimates only).  The campground is well treed with most sites having at least partial shade.Facilities:  3/5.  Most sites are serviced with electricity and water; there is a dump station for sewer.  The washrooms were kept clean during our month long stay in May-June however the water pressure in the showers was pretty poor.  Weekends were busy when we were there but during the week the campground was less then half full.  There is no laundromat on site nor Wi-Fi (McDonalds is a short drive away).  Staff kept a clean campground and were reasonably friendlyOverall: 3.5/5.  The location and setting so close to Toronto and within the Rouge Valley makes this place attractive.  This is the second time we've stayed there and we plan on doing so again when we pass through Toronto.We are full timing and travelling in a travel trailer.",
      "rate": 4.0,
      "tripDate": " June 2014"
    },
    {
      "title": "Great location!",
      "text": "We have stayed at Glen Rouge twice - once this year and once last year. Love the location, close to the GO Train, shopping and other attractions. No WiFi, but Tim Hortons and McDonalds nearby. We found the place clean and well maintained. We have a large trailer so we never went near the washrooms or showers (have our own facilities), so I cannot comment on those. Lots of trees for shade. We will probably stay there many more times in the future.",
      "rate": 4.0,
      "tripDate": " July 2014"
    },
    {
      "title": "Great Base Camp for a Toronto Visit",
      "text": "Having done all types of Campgrounds from resort style to basic state parks its important to know what this is and isn't. You'll want to plan to have what you need for play, cooking and comfort, if you do then it's really a perfect place. This is not a Campground with every activity all day and lots of facilities. However it is a beautiful setting, ideal location and a great spot to use to explore the area. As a bonus you get access to Petticoat Park and for a small fee their outstanding pools and splash park.We stayed in a tent for a week and had all we needed. There are tons of markets, restaurants and stores just down the road so it's easy to get to everything you need while still having a setting that is peaceful.  You can take the 401 or learn some of the city roads that connect and avoid the highway like we did. Made for a lot less stress. We also did the hike from our site to the Zoo which was fun but make sure to give ample time. With 2 kids (6 and 9) it took us a solid two hours to get there, stayed until Zoo closed and then decided to cab it back.The washrooms are central but do have a hill and use the access road, so you may want to choose your site close. The washrooms do have dirt but are cleaned daily, its camping not a hotel, so set expectations accordingly. Also lock your food, there are raccoons all over and they know what to look for.I was really pleased with the security presence and gate. Felt safe even though in major city.  For us staying here allowed us to save hours over the week to get in to explore rather than the hour plus drive for other Campgrounds that claim to be \"near\" the city. The layout was great for our kids to just ride their bikes around and we ended up spending a lot of time getting back to just hanging out at the site, playing games and enjoying campfires. Not sure any other way to be at a Jays game and then fireside in less than 45 minutes later. Quiet times were observed no issue with any neighbors or noise, just a lot of families and friends enjoying each other. If you want to camp near Toronto, this is the spot.",
      "rate": 4.0,
      "tripDate": " August 2018"
    },
    {
      "title": "An excellent place to stay when visiting toronto",
      "text": "Stayed here while on a CityPass to Toronto with the family.  We tented in an electrical area near the far end of the park.I was quite surprised at how clean the park was.  Mostly it is people with campers there but there are tenters as well.  There are a few sites without electrical and smaller if you have a small family with tent but the sites are all a decent size and very nice.The washrooms were ok.  There was always soap available and the showers were private (sliding shower curtain) and nice with warm water.A small playground with swings but nice enough for kids to play away at while you are in the washroom.Fellow campers were very quite and we had no noise issues while we were there.  Everyone was friendly.  A variety of folks from out west and Quebec as well as from the US.Can't beat the location.We stayed for 3 nights and I would come back again if I were travelling in the area.",
      "rate": 4.0,
      "tripDate": " July 2017"
    },
    {
      "title": "Good Grounds, Bad Bath house",
      "text": "If you don't use the bath house, this review is not for you.First, the grounds for RVs are beautiful and the sites are large. Very nice. All the RV sites are on one large flat area. The only bath house is up 26 steps on a hill with about a dozen tent sites near.The bath house was almost continually being cleaned by staff and that effort should have made it clean under normal construction practices. BUT the 3 showers in the bath house each had a drain under the shower head, about a 3 feet square area, but the dressing area next to the shower head has no drain. So the over shoot water that hits the dressing area just accumulates there. It accumulates from all three showers and reaches a depth of half an inch before it can reach the only other drain which is about 30 feet away by the toilets.So this standing water is all over the bath house and cleans the mud off everyone's shoes and makes for a very dirty floor.Since the drains have been there since the original construction many years ago, this must be a very old issue and one can only think that management lacks the funds to resolve the issue or doesn't recognize this as a problem.It was a big issue when we were there for a week and it's the only reason for giving such a low rating to an otherwise pretty camping ground.The womens bath house had 2 of 6 toilets out of service and one so difficult to flush that it was always dirty. The handicap showers and toilets would be difficult to use. Access to the bath house up the steep ramp might be dangerous in a wheel chair.",
      "rate": 2.0,
      "tripDate": " July 2017"
    },
    {
      "title": "Improvements required.",
      "text": "We camped here for 4 nights. The pros:-The location is amazing due to the fact that everyting is nearby. 20 minutes to downtown.-The playground was cool, but some improvements would be awesome.-The external sink is great for dish washing, however the hot tap did not seem to work., If it had any.-Recycling is a plus. -Ice cream truck . He should play the music.- wifi was not on the list but was available, however almost everything is blocked, but facebook was not. I did not ket the kids know , as youtube dis not work at that time.The cons are:-If you are looking for privacy, you won't have it. Only a few location can enjoy it. That did not bother us thought.-Regarding silence, sometimes we hear police car or muscle cars showing off during the night.  We did not mind.- people (customers) that do not know to live in community. They do not flush toilets after a #2, do Not know how to aim when doing #1, leave their bandages laying around, clothes ... And other thing i will not describe. I know, the management has no control on that. 2 thumbs up for the staff.- the way how the bath stall is designed. The dirty water are interconnected through all 3 stalls, and drain is not working great, so we end up with the dirty water from the other stalls. Please bring yourselves some very high water resistant shoes.- drain is missing, it results as a big puddle just when you open the door.",
      "rate": 3.0,
      "tripDate": " July 2016"
    },
    {
      "title": "Rip off",
      "text": "First we saw it listed on line for $36.00 that was the hook.  First we find out there is $10.00 fee for a reservation that we didn't want but had to pay our bill totaled $52.00.  But we sucked it up because we need the laundry,  buy we find they don't have the laundry that's listed on their website.  Oh did I mention that we didn't get the 50 amp service we asked and payed for.  Walmart is a far better deal.  Out one to ten a one for honesty about what they offered at the price advertised, the camp site it's self was level with grass.  You can't bring your own fire but they will sell you some for $12.00. That's it you are better off calling around to other private parks.",
      "rate": 1.0,
      "tripDate": " July 2016"
    },
    {
      "title": "Easy to get to from HWY ",
      "text": "We took a long road trip and this was our second stop in Canada.   The staff was very nice, the campground and facilities were very clean and quiet.   We had plenty of grass to put out our tent next to our RV site..... Had to rent 2 sites..... Was a short hike from our site to the wAshrooms",
      "rate": 4.0,
      "tripDate": " August 2015"
    },
    {
      "title": "Great place",
      "text": "Stayed here with my family in June 2015, not very busy and quiet time of year. Great place to stay right outside the main core of Toronto. Unserviced site cost us 31 dollars after tax. We saved on not making a reservation, but wouldn't recommend it during the busy season. No privacy to any of the sites whatsoever ever, which didn't bother us for one night. No real fire pits, but a hole in the ground. So I wouldn't plan on cooking over the fire. With the lack of trees on some of the sites it could get hot pretty quick.Nice groomed trails to walk on. The 'park' is 4 swings so don't plan on occupying kids for long there.I would stay here again with my family which includes a 3 year old. Gives you a place to sleep if doing anything in the city.",
      "rate": 4.0,
      "tripDate": " June 2015"
    }
  ]
}