{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Global Stay Burano Condos in Downtown Toronto",
    "url": "/Hotel_Review-g155019-d27530558-Reviews-Global_Stay_Burano_Condos_in_Downtown_Toronto-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "1.0",
      "reviewCount": 5
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "832 Bay Street",
      "addressLocality": "Toronto",
      "postalCode": "M5S 1Z6",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2c/6a/5d/31/caption.jpg?w=500&h=400&s=1"
  },
  "description": null,
  "featues": [],
  "reviews": [
    {
      "title": "DON’T Book global stay",
      "text": "DON’T BOOK GLOBAL-STAY.COMIt’s being 10 days and they haven’t refunded my security amount yet .1. Very deeply disappointed and regret the fact that I was the guest who recently had the misfortune of staying at their property2. My experience was nothing short of a nightmare, filled with frustration, distress, and outright anger. From the very moment we arrived, it was clear that something was amiss.3. After leaving the property, we were shocked to receive baseless accusations of leaving the room in disarray and hit with additional fees, including withholding our security deposit. This is utterly unacceptable and only serves to compound the anguish we've already endured.I have mailed them twice and didn’t received any reply yet nor they have initiated my refund .Please don’t book global stay toronto, it will lead you to a very bad experience.",
      "rate": 1.0,
      "tripDate": " March 2024"
    },
    {
      "title": "better off sleeping on the street",
      "text": "they ask for a $500 deposit on top of everything.refused access because I have a fulls service dogrefused to give me money backrefused bookings.com to give me my money backlet them know they are breaking the law and they still didnt care.they will be sued",
      "rate": 1.0,
      "tripDate": " June 2024"
    },
    {
      "title": "Terrible terrible and horrible",
      "text": "Sofa bed was broken. Parking fob did not work. Door key did not work. Very difficult to contact them and get anything resolved. Not at all worth what we paid. Never again!————————————————————————————————————————————————————————————",
      "rate": 1.0,
      "tripDate": " June 2024"
    },
    {
      "title": "SCAM - FRAUDS",
      "text": "TOTAL SCAM FRAUDS FRAUDS FRAUDSDo not book this place.Incorrect door code when we arrived at 11pm.Strong smell of cigarettes in the suite.No balcony as described in the listing.No toilet paper.Pubic hair in the bathtubSubstance resembling bodily fluids on the blanket.Filthy microwaveGrubby caked in substance in stove top knobs.Unwashed floorBroken toilet flusher Dirty toothbrush holderBathroom door did not closeFilthy glasses, bowls and spoonsBroken dishwasher with no cutlery holder Magic erasers for cleaning dishesFilthy dust cloth.With each item I notified Globalstay and they either did not respond or told me to take pictures and they would send it to their cleaning crew. No attempt was ever made to make anything right.I asked 4 times for an email for management. On the last ask they said they would “forward my concerns.”So, you can imagine how we feel spending $1400 on this for 3 nights.And after all of this, they are withholding $50 of my damage deposit because I damaged the suite. They had to do a deep clean of deep stain I left on the carpet. Yeah! Right! Booking.com is trying to help me.Thank you for your help booking.com",
      "rate": 1.0,
      "tripDate": " June 2024"
    },
    {
      "title": "DO NOT BOOK WITH GLOBALSTAY - SCAM!!",
      "text": "CONDO RENTAL BY GLOBALSTAYI wanted to share a recent experience at 2 Anndale, North York. The management of GlobalStay is terrible. They didn't conduct any hygienic checks, and there were broken appliances and a broken showerhead. The cleanliness was non-existent. DO NOT WASTE YOUR MONEY. THEY DON'T REFUND. When I spoke to customer service, they hung up on me. I paid almost $1500 CAD for 5 nights. This is the worst hotel experience ever.",
      "rate": 1.0,
      "tripDate": " May 2024"
    }
  ]
}