{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Global Guest House",
    "url": "/Hotel_Review-g155019-d735049-Reviews-Global_Guest_House-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.0",
      "reviewCount": 51
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "9 Spadina Rd",
      "addressLocality": "Toronto",
      "postalCode": "M5R 2S9",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-s/01/5b/fe/43/friendly-adam-s-family.jpg?w=500&h=400&s=1"
  },
  "description": "We are a charming, clean, century-old bed and tea, located in the Annex, an eclectic neighborhood in the center of downtown, within easy walking distance of many of Toronto's famous tourist sites.Several of our city's best restaurants are right around the corner. We are next door to the Bloor Subway, Spadina Station, 3 stops from Yonge St. Our building has been a Guest House at this location for over fifty years, welcoming tourists and business people from all over the world.Global Guest House is listed in over 60 international budget travel guides, including \"Lonely Planet\". We offer value, location and a friendly environment. Enjoy free tea, coffee and hot chocolate 24 hours a day and a pleasant clean kitchenette with a refrigerator and microwave for guests to prepare light meals.The rooms are decorated with paintings by award-winning Rhona Stein Singer, wife of owner/manager Norman Singer.",
  "featues": [
    "Free parking",
    "Free High Speed Internet (WiFi)",
    "Wifi",
    "Pets Allowed ( Dog / Pet Friendly )",
    "Non-smoking hotel",
    "Air conditioning",
    "Kitchenette",
    "Non-smoking rooms",
    "Family rooms"
  ],
  "reviews": [
    {
      "title": "Loud traffic seriously took away from this place.",
      "text": "I had an interesting room not counting some very juvenile looking paintings adorning the walls...the sounds of traffic permeated the room from the start of the transit day (the place is right beside a subway station that also served as a bus terminus) to the wee hours of the morning. The buses proudly proclaim that they are 'hybrid' buses but to hear them is to hear the loud engine roar that you hear from buses that have been in service a long time-there was no indication of the use of the supposedly quieter hybrid power plants...that notwithstanding there was also a significant amount of noise from pedestrians at night instead of from a huge nearby bar which you couldn't really hear much noise from at all. The bar also doubled as a restaurant with a nice rooftop sun deck thing great for lunch and was pretty much the areas saving grace. There was only a small space available for guests who wanted to have a smoke outside (all non smoking inside) coupled with a very creaky stairway to the upper interior of the guest house which made for some awkward bordering on just plain irritating moments.The manager was a nice person but that doesn't change much in the context of the places overall \"ease.\" Toronto is interesting but in the handful of days I was there-there were more than one incidents within a two block radius involving Police which I found reminiscent of downtown Hamilton or downtown Detroit. In short-if you can afford to stay in a better place you should really do so.",
      "rate": 2.0,
      "tripDate": " May 2014"
    },
    {
      "title": "would be fine if not for bed bugs",
      "text": "I've been here a few times before. Great location, friendly staff and inexpensive. The building is charming - old and well maintained. The rooms have AC, wifi, and TV. Unfortunately I had the same experience as initias with bed bugs which put a damper on my stay - whatever approach was used previously to address did not work.",
      "rate": 2.0,
      "tripDate": " July 2013"
    },
    {
      "title": "too many bed bugs!",
      "text": "I'm full of bed bugs bites! It's a big problem, you have to do something about it. Please call a specielized cleaning service. Neverthless, the position is very good, near to the metro and the city center.",
      "rate": 2.0,
      "tripDate": " June 2013"
    },
    {
      "title": "Don't Stay Here!",
      "text": "Despite the ideal location in the Annex and steps from Bloor Street West; despite the very nice over worked staff.. DO NOT STAY HERE!I had booked online from the UK and was required really to stay for the week. I had been quoted a very cheap rate, (that would still have been expensive taking it all into consideration!), which they tried to increase. I didn't pay anymore than the quoted price. Apparently the third party website made errors in regards to the rates..sorry, not my problem!First room we stayed in was smelly and dirty; thick fluff and dust on the light shade, dirty room. The shared bathroom on that floor was revolting, really filthy. The bathrooms on the floor below were not much better. Thick dust on mouldy draped fabric serving as a makeshift curtain at one bathroom window; unhygenic fluffy toilet seat covers, just didn't bear thinking about. Moved to a room with a private bathroom. This was cleaner but still smelt very strange. No duvet, just a unwashed, aged, bobbly comforter and sheet. We used almost a whole bottle of anti-bacterial febreze! Say no more. We were over for job interviews, etc, so were on a tight budget. We should have left, but it almost became easier to get on with it, as our days were full without having to look for CLEAN affordable accommodation. I would say YUK to the Global Guesthouse. The owners need to start again: new decor, new carpets, new bathrooms, new furniture, new beds, new bedlinen, DUVETS and PAID cleaning staff!",
      "rate": 1.0,
      "tripDate": " March 2010"
    },
    {
      "title": "Arts",
      "text": "\"Positive: The location of the place is perfect. Clean. Excellent design, restaurants, bar. The hotel was very good for the money paid. It was a nice to have a small kitchen to make your own food. Exactly what you need from a hotel. We will go there again.",
      "rate": 4.0,
      "tripDate": " January 2015"
    },
    {
      "title": "Rodent Infested-Rundown, Old & Dirty! Stay Elsewhere!!!!",
      "text": "Global Guesthouse 9 Spadina Toronto, ON, CanadaThe Pros: Great Location @ corner of Spadina & Bloor right beside the subway/streetcar station- It's a 30 second walk to the station if even that! Close to the ROM, Bata shoe musuem, Chinatown, Kensington Market, and many eateries along bloor, Free wireless internet, Free local calling, Access to kitchen facilities (microwave, fridge only), Large variety of TV channels, Relatively cheap- about $95/night (3 people all taxes included) although I''m convinced most can do better....The CONS: MANY cons.... RODENT infested- we found evidence of droppings & chewed up holes on a bag of mini-wheats left in an open backpack on the floor, dirty EVERYWHERE- they don't dust inside the rooms & the hallway carpets are filthy, as are the drapes/fabric coverings in the bathroom, can be noisy if facing the main road or if somebody is occupying the upstairs rooms, funny smell in the whole place, noisy airconditioning- don't expect to sleep with this ancient thing on, small 12\"? TV, not enough plugs in the room (4), linens can be thin & linty, bring your own shampoo because they don't offer you any, Luggage storage fee ($7)OVERVIEW: This place would be adequate for BUDGET travelers who don't expect anything and just need a place to crash for a couple nights, but if you are a traveler with ANY expectations of something 'nice', you WILL be disappointed- spring another $50/nt and go somewhere better....  Of all the places I've EVER stayed at this has been the WORST! and this is NOT an exaggeration- Stay Away if possible!",
      "rate": 1.0,
      "tripDate": null
    },
    {
      "title": "THEY LOST OUR RESERVATION.",
      "text": "Do NOT book here, as they are liable to lose your reservation.  We booked a month in advance for our vacation...would have preferred doing it through a secure website, but the guy at the front desk said we would only be able to book parking if we did it over the phone.  We did that, got an email confirmation, and when we arrived after driving 9 hours from the States and crossing an international border, we found out they gave our room away!But even worse was their idea for fixing their enormous goof-up: they called another guest house in the area and found us a room there.  We went there and found out that the room was basically a large closet (no windows) with a bed, toilet and shower, located next to where they keep their trash and washers/dryers.  Why didn't they just call a decent hotel or B&B and pay the difference?  So not only are they extremely unorganized, they are cheap and do not value their guests.  Luckily we found a place and did not wind up on the street, but we very nearly did because of the folks at Global Guest House.",
      "rate": 1.0,
      "tripDate": " September 2016"
    },
    {
      "title": "noise from buses and trash trucks ..",
      "text": "My sister, age 78 was booked into this guest house first floor room 3, the noise from the buses at Spadina Station kept up until 12am and then trash trucks came with great noise ........little sleep  We hoped for a refund but ignored.  Every review is good, did people not hear this?",
      "rate": 1.0,
      "tripDate": " June 2014"
    },
    {
      "title": "Average place to stay",
      "text": "This place is very 'OK'. I didn't think it was great, my towel had some mysterious stains on and the welcome was not the best we've experienced. That said, I think we have been spoilt by staying in some incredible B & Bs during our trip travelling in Canada and the US. We didn't spend much on our accommodation in Toronto, and I think that if you have a smaller budget, this place is fine. Just don't expect too much. The location is great for getting around but very noisy and we didn't sleep well.",
      "rate": 3.0,
      "tripDate": " September 2014"
    },
    {
      "title": "Very Expensive, Rude Staff!!!!",
      "text": "Stay at Global Guesthouse at your Peril.  Although conveniently located in the Annex/downtown area, this is where the positives stop.  Myself and my girlfriend stayed here for 16 nights, we have recently moved to Toronto from Ireland and thought this would be the perfect place to base ourselves until we found an apartment.  Upon our arrival the office was closed, we rang the door bell 4 four times before a guest let us in.  I had to ring the owner's cell phone and tell him we had a booking, he was unapologetic and said someone would be there in a few minutes.  A lady arrived who helped us check in and informed us that the private room we had booked was situated on the top floor, we were not offered any help with our bags.  This lady seeing that we were struggling with our bags simply turned a blind eye.  Our Room was far from spacious and smelled of dry damp.  Most places that are undergoing refurbishment inform their guests prior to bookings but Global Guesthouse did not.  For the entire duration of our stay there were men on the roof banging away from 9am, the hallway looked like a construction site as they were doing up the bathrooms.  When we checked in the lady informed us that the refurbishments would take a few days, we didn't mind but they were far from finished when we checked out.  For a private room we paid $300 dollors each for that you would expect better facilities, in the Kitchen there was only a fridge and a microwave for as the website says 'cooking light meals'.  There was also a washer and tumble dryer in the kitchen which was off limits to guests.  For the price the Global Guest House charge you would think that they would at least serve continental breakfast in the morning right?  Wrong!  The only thing free are the tea bags!  The staff were extremely rude, unhelpful and idiotic in every way imaginable.  I'd expect this from a 2 star hotel but not from a guesthouse and not for the price we paid.  We wanted to stay here because of the convenience of the location and because we didn't want to book into a hostel, we said we would pay the extra money for a private room but in the end we were dying to get the hell out of that place.  I could not recommend a stay here, stay well away.  There are better, cheaper alternatives around if you are prepared to do a bit of research.",
      "rate": 2.0,
      "tripDate": " August 2012"
    },
    {
      "title": "great stay",
      "text": "I loved staying here - great veg food around the corner; great transport and everything so well cared for at the place. Everyone on staff friendly and helpful.  Enjoyable stay-  Winter - few guests- warm",
      "rate": 5.0,
      "tripDate": " November 2013"
    },
    {
      "title": "Beautiful Guest House",
      "text": "From the moment we arrived we loved this place. We stayed there with a large group for Canadian Music Week and the staff were very friendly and accommodating. It is in an EXCELLENT location literally right beside the subway station, so we could quickly get anywhere we wanted to. The rooms were clean and cozy, and the architecture of the house was beautiful.  Highly recommended.",
      "rate": 5.0,
      "tripDate": " March 2013"
    },
    {
      "title": "A delightful little place",
      "text": "This place was a pleasant surprise. The staff were lovely and helpful, the rooms were nice and tidy. It was a really pleasant no frills guest house.The free wifi was fast and reliable and the beds were comfy.The location was good although it was a little too close to Spadina station and any light sleepers might struggle with the sound of the buses until late but we had no problems.Not for everyone I imagine but it's good for the price and I would stay here again.",
      "rate": 4.0,
      "tripDate": " June 2012"
    },
    {
      "title": "Surprisingly delightful",
      "text": "Very early turn of the century building. A very home like feeling. Very pleasent staff. room was very cozy. subway and street car terminal is right next door. decent size room with private bathroom. There is parking but limited on site. There is city paid paid parking ( actually cheaper than expected) next to the building. Good so far.",
      "rate": 4.0,
      "tripDate": " July 2016"
    },
    {
      "title": "Cheap and Cheerful",
      "text": "Great location right next to Spadina Station. I stayed for a night here on two occasions. Both times when I rang the bell no-one was there. However, on ringing the number posted on the door the owner arrived within a couple of minutes. He was a very welcoming and friendly chap who took your booking details then showed you around the guesthouse and taking you to your room.The guesthouse is a large rambling affair with lots of rooms. I stayed in two different rooms, both en-suite. The furniture was old but all the linen etc was clean. There were interesting pieces of art in the rooms too. Like the bedrooms the bathroom facilities were old but clean and worked ok.There is a small kitchen and living room area for guests use too although I never used this.If all you want is a clean and cheap place to sleep the night then this place is ideal.",
      "rate": 3.0,
      "tripDate": " July 2015"
    },
    {
      "title": "GREAT place!",
      "text": "The rooms are styled very old, but I LOVED the character of the place! Very clean, great value & service, I felt right at home. Not a single complaint!And the location is phenomenal; right next to Spadina station.",
      "rate": 5.0,
      "tripDate": " November 2013"
    },
    {
      "title": "Cozy room, great location and fast wi-fi!",
      "text": "I was surprised to see a large number of negative reviews here - I'm pleased to report that my experience at Global Guest House was a positive one and I would happily stay there again.It's very conveniently located right next door to Spadina Station (access to two subway lines + the streetcar) with plenty of bars, cafes, shops and services in the vicinity, including a 24 hour grocery store a few hundred metres away. The room was cozy and warm, with a walk-in wardrobe, air-conditioning and TV with cable. Wi-fi was fast and worked like a charm for my whole stay - a big thumbs up as this is very important to me when booking a room!! A little street & subway noise made its way in but I didn't find it off-putting. Staff were scarce but friendly, and although the house felt a little aged, the artwork on the walls gave it a certain charm.I stayed on the top floor and there two bathrooms: one was shared between a few rooms, the other was private for use by one room only. The shared bathroom was clean and spacious - the only disappointment I had was that somebody locked the door before shutting it which put it out of action for nearly a whole day before it was unlocked (I had to use the bathroom on the lower floor during this time).For the price I paid though, I was very happy with my stay. It beats a noisy backpackers any day.",
      "rate": 4.0,
      "tripDate": " October 2013"
    },
    {
      "title": "A charming place",
      "text": "We stayed one night, escaping from the Global Village Backpacker on King street.Lounge is nice, clean and bright. The owner hung her paintings  everywhere and we loved that.Our room was large and clean.Bat point is the tiny kitchen where you cannot cook, just prepare salads and have a free hot drink. There is a large fridge though.",
      "rate": 5.0,
      "tripDate": " October 2013"
    },
    {
      "title": "Comfortable and a Great Value",
      "text": "After a bad experience at a hostel in Chinatown, my boyfriend and I arrived here and never looked back. Great value and a friendly staff. We were glad to see that there was a window AC unit since it was very hot that weekend. The free wifi, clean bathroom and accessible location made it a great stay. The bed was not the most comfortable, nor the room the most beautiful I have ever stayed in, but a wonderful place for a student on a budget.",
      "rate": 4.0,
      "tripDate": " July 2013"
    },
    {
      "title": "Really good location, great price!",
      "text": "The global guest house is located right next door to the Spadina station of the TTC - this makes it really easy to get practically anywhere in town because the Spadina station has bus connections, streetcar connections and both of the Toronto subway lines. The rooms are also very well priced. Don't expect a lot of frills if you're going, but it is a good place if you're just looking for somewhere to lay your head. Bonus: it has a little communal kitchenette so you can make things yourself instead of always having to eat out. Staff is really nice and helpful.",
      "rate": 4.0,
      "tripDate": " March 2013"
    },
    {
      "title": "Run down",
      "text": "Dirty (toilet base was filthy, mold on shower curtain)In state of disrepair (furniture falling apart, toilet leaking non stop)Somewhat rude staffNoisy (late night bar just East)You clean your own roomOn the good side:Location is convenientprice is not badFree internetLooks charming on the outside",
      "rate": 2.0,
      "tripDate": " August 2009"
    },
    {
      "title": "Wouldn't Stay Here Again",
      "text": "1. Staff were rude2. Rooms were small, pull out sofa bed (wheres the real bed?)3. Dead mouse under the bed (wondered why there was a strong smell of herbal cleaner)4. Untidy, DONT STAY AT THE GLOBLE GUEST HOUSE.5. Walk 5 minutes up the road and there is a lovely clean, friendly B&B for $22 a night.",
      "rate": 1.0,
      "tripDate": " October 2006"
    },
    {
      "title": "Worst place we have every stayed",
      "text": "We booked this guesthouse on hotels.com for our overnight stay in Toronto, the pictures and description looked good on the website so got a huge shock on our arrival. The building was very grotty and enterence and hallway grubby and dirty. Our room was musty and there was no running water in wash hand basin I had to brush my teeth in the bath which was also very dirty. The bedside light didn't  work. All in all a very bad experience not to be repeated it spoiled our visit to a beautiful city",
      "rate": 1.0,
      "tripDate": " August 2016"
    },
    {
      "title": "Never going back",
      "text": "We booked their last minute found it at a decent price online. Initially it wasn't so bad, decent location right beside spadina subway station.  They do not offer parking. But there is a lot right beside  $5 overnight max amount from 6pm-7am and $9 max during the day from 7am-6pm. They offer a small kitchenette microwave fridge water kettle instant coffee and tea. The morning we woke up and we did find a bed bug on our pillow. We were pretty sure it was dead but treated as Alive with the stuff we brought home. So be weary and check the bed prior to sleeping !",
      "rate": 1.0,
      "tripDate": " April 2016"
    },
    {
      "title": "Nice place",
      "text": "The room was great and location was very handy.  You are right beside the subway to connect to city and if you so desire you can get on the hop-on hop-off bus from right across the road.  Staff were friendly and helpful.  The only downside to this place is the noise from the bus terminus right beside the room.  If you think you can sleep through that then this place is ideal.  I'd stay there again.",
      "rate": 4.0,
      "tripDate": " August 2014"
    },
    {
      "title": "Could be more energetic with cleaning",
      "text": "Not recommended if you suffer from a dust allergy. Extreemly handy for the Spadina metro/streetcar/bus interchange. Best feature is the wonderfully comfortable squashy sofa in my room but I understand the rooms are to be renovated so I expect this will go then. Yhe kitchen is useful for stretching budgets.",
      "rate": 3.0,
      "tripDate": " May 2012"
    },
    {
      "title": "Very unclean, old and understaffed.",
      "text": "Very Faulty towers feel, the decor is tacky and old, the facilities under appointed and many non functional, but the utterly filthy kitchen and bathroom (hairs, built up soap scum, shower didn't work, unwashed utensils, unhygienic dual use of sink for chemical use and dishes - in a cupboard!! And dust filled room with litter under the bed and hairy blood stained top duvet with no under blanket and lumpy pillows.) Internet is slow, we were misquoted the price of the room then had to debate the new price, and everything smelled mouldy and damp. I had a better stay in a hostel right on Hastings street, Vancouver.. And until today, that was my worst stay ever. The location is GREAT but you couldn't PAY ME to stay there again.",
      "rate": 1.0,
      "tripDate": " March 2012"
    },
    {
      "title": "Value for money",
      "text": "This place is warm (maybe a bit too warm in our room for me...) and cheerful.  We stayed 1 night and found it to be just what we were looking for. Something eclectic, not your usual cookie cutter hotel.  May not be for everyone but as long as the place is clean we're happy enough.The room we had had 2 doubles - the placement of the beds made it a bit awkward for getting directly to the bathroom - you had to squeeze through an opening where the 2 corners of the beds met. Bed was comfortable.  We had a good sleep - didn't notice any noises during the night.The guest house is decorated with art - everywhere! - I didn't go past our 1st floor but our daughter said it was upstairs as well (she went exploring).Check in was easy and staff was very polite and efficient. Overall, it's a great place to stay if you want something different and easy on the budget.  Great location, near tons of restaurants.",
      "rate": 4.0,
      "tripDate": " February 2016"
    },
    {
      "title": "Good place",
      "text": "Stayed there for just two nights and was what I need and expected. The bed and sheets was clean as the room and bathroom. Nice localization, near the subway and some minutes walking from the downtown. Good service.",
      "rate": 4.0,
      "tripDate": " October 2014"
    },
    {
      "title": "Good Place",
      "text": "We have stayed there many times. It is generally a good experience and the rooms are nice and reasonably priced. Location is convenient to the subway. It is a good idea to set your arrival time in advance to insure someone is there to help you check in. Two free parking spaces are available on a first-come basis. Each room is unique and the atmsphere relaxed.",
      "rate": 3.0,
      "tripDate": " September 2014"
    }
  ]
}