{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Globalstay  Modern Apartments In North York",
    "url": "/Hotel_Review-g155019-d26614317-Reviews-Globalstay_Modern_Apartments_In_North_York-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "1.0",
      "reviewCount": 3
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "2 Anndale Drive",
      "addressLocality": "Toronto",
      "postalCode": "M2N 0G5",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png"
  },
  "description": null,
  "featues": [],
  "reviews": [
    {
      "title": "Do NOT BOOK WITH GLOBALSTAY",
      "text": "Do not book with global stay. It is a scam. On any booking site the deposit is stated in the small print. Even so if you stay in hotels you are used to having to pay an up front damage deposit. But what they do is use PayPal, not the booking site that you initially book with. They also offer no refunds once you have booked the room so you are then forced into their process. Only then do you realize that your deposit and cleaning fee are taken not on the booking site but through PayPal. So you are then forced to pay them directly in cash. Their rules then say you will get your deposit back within 7 days. Actually it’s within 7 business days and they give you your deposit back on the last of the 7 days.  Meaning they have your deposit, they determine whether you have damaged anything, they then pay you your money back when they want. It’s fine if it’s their rules, but what isn’t fine is that they do not clearly state upfront what their rules are so once you have booked you find yourself mired trying to get your funds back or even know when you might get them back. They are totally unhelpful and do not offer any information other than on the 7th day you will be refunded. I would never have booked with them if I had any idea that I had to go off of the booking website where at least you can be assured that you have recourse if this sort of issue arises. This business is a scam as everyone has said, please do your homework. No matter how nice the rooms are (and it isn’t that great) or how conveniently they are located this is not a business you want to be engaged with. They are just terrible. They will add stress to your trip have no customer service experience or standards. They are the worst hospitality company I have ever dealt with. There are so many better ones out there. Please do not use them.",
      "rate": 1.0,
      "tripDate": " April 2024"
    },
    {
      "title": "Disciminaters",
      "text": "I suffer from a disability and made a booking at this facility. I sent along a note in requests that I had a guide dog since I noticed they had a no pet policy , I was being polite to let them know I would be bringing a service dog. I received very curt messages that no pets were allowed but I explained thru a series of emails that it was a service dog , licences and certified, they still refused. When I showed them bookings.com policies they till refused, when I showed them the law, they still refused. Obviously they discriminate against people with disabilities. Blind people, people in wheel chairs etc need not apply for a room here as they will be refused. I am going to take legal action against them due to this refusal but any company that would discriminate in this day and age needs to be avoided.",
      "rate": 1.0,
      "tripDate": " June 2024"
    },
    {
      "title": "Beware of  sending personal ids or passport photos",
      "text": "This apartment makes very unusual requests that  they do not state beforehand, like 1) Providing CA$500 security deposit beyond stay payment with paypal which unlike credit cards, do to have insurance against fraud. They could keep the money for no reason.  2) Selfie of yourself with passport. Since this form of identifcation is often used by banks, it could potentially be used to supplant your identity. Moreover sending this sensitive information by email is not secure and I do not trust they are equipped to handle this information securely online. I have cybersecurity training and this is information hackers typically target because they can claim is you that forgot password or whatever.  3) They also changed the property without any compensation. They did not offer refund either.",
      "rate": 1.0,
      "tripDate": " October 2023"
    }
  ]
}