{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Global Village Backpackers",
    "url": "/Hotel_Review-g155019-d184512-Reviews-Global_Village_Backpackers-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "2.5",
      "reviewCount": 166
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "460 King St W (near Bay Street)",
      "addressLocality": "Toronto",
      "postalCode": "M5V 1L7",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/01/af/76/d1/global-village-backpackers.jpg?w=500&h=-1&s=1"
  },
  "description": "Global Village Backpackers is Toronto's original backpackers hostel. Since 1997 the \"Village\" has hosted thousands of travellers from around the world. Our facility offers 24 hour operations, large common area, backpackers pub and restaurant, kitchen, laundry and clean and comfortable rooms. We look forward to welcoming you.",
  "featues": [],
  "reviews": [
    {
      "title": "OK for what I was expecting",
      "text": "All in all, this place wasnt too bad. For a backpacker style cheap accomodation, it had all the usual. A scary kitchen from lack of cleaning, but large and functional. Had washers/dryers. Communal bathroom wasnt too bad. Had a huge bar/pool/games room area. I didnt spend much time in there because I was out but the times I saw it is was quite lively.I stayed in different rooms, and I have to say this was a bit of a letdown. It seems in one I could hear all the plumbing being used throughout the building, and it was near the main access stairwell, so was noisy all night. The other room up on the 2nd floor was a lot quieter, but stifflingly hot. It was just next to the improvised radiator heater outside.But, these are individual room things, and may not reflect the place as a whole. Location wasnt too bad, so if you're just after a place to hang while going out, I think it would do.",
      "rate": 3.0,
      "tripDate": null
    },
    {
      "title": "You get what you pay for",
      "text": "Stayed at this hostel a couple of times when the far nicer Canadiana Backpackers down the road was full. It's fine as a crash pad, although the bathrooms were pretty grotty both times. You can't fault the location though; the second visit, we had a private room overlooking Spadina, with a view of the Tower from the window. One note: beware the 'no alcohol in rooms' policy. I had collected a friend from the airport who had a duty-free bag with a sealed bottle of booze in it. Whilst we were out, the cleaning staff entered our room, went through the bag and removed the bottle. Fair enough - we were unaware of the rule, but happy to abide by it - but when we asked the staff if someone had been in our room (we were worried that we'd been robbed) they were unhelpful to the point of insulting - we actually caught one making faces behind our backs.",
      "rate": 2.0,
      "tripDate": " August 2005"
    },
    {
      "title": "Wouldn't stay again",
      "text": "We stayed in this hostel for our first 2 nights in Toronto and were glad to move to a different hostel. We didn't find the staff that friendly, the bathrooms weren't very clean, and I found the beds werent very comfortable and swayed everytime I turned over which wasn't very nice when I had a stranger sleeping below me. The good thing about the hostel is the bar but to be honest there are plently of bars in the area which were better than staying in the hostel.",
      "rate": 2.0,
      "tripDate": " January 2007"
    },
    {
      "title": "Great for Backbackers",
      "text": "Loved staying in the GVB so much that I kept coming back throughout my Canada trip. The crowd's very young and the bar had a really nice atmosphere with themed nights throughout the week. It can be a bit grotty at times, but the atmosphere more than makes up for it.",
      "rate": 4.0,
      "tripDate": " June 2005"
    },
    {
      "title": "Horrendous - Nightmare of a place.",
      "text": "I wouldn't recommend this place to anyone. We checked in a few days ago, they had messed up our reservations, a few hours later we got sorted.So we made our way up the stairs to head to the room, the smell was overwhelmingly bad... don't know how people put up with it.The rooms were an absolute disgrace, stained carpets, cobwebs everywhere and the pillow they give you is a nice mixture of yellow stains and a \"cream\" color.The toilets were equally as bad, the smell... the dirt everywhere. We couldn't shower there it was so bad.The kitchen was disgusting, with food covered washcloths and towels, the fridge was just filled with flies and disgusting food, and there seemed to be a few homeless guys wandering around the kitchen.The baggage area was absolute stink also, they really need to clean the place. The windows in the whole building were filthy, and the staff could really do with cleaning the place. I doubt they own a vacuum and the majority of the place is carpeted.I would give this place 0/5 if I could, the only thing they could do is burn it down and go again.We stayed in Canadiana the following night, and it was 1,000 times better, as we entered there was someone using the vacuum and people cleaning things.",
      "rate": 1.0,
      "tripDate": " September 2012"
    },
    {
      "title": "Best Place to Stay In Toronto",
      "text": "Global Village was the best hostel Ive ever stayed at! The staff there are fantastic and so friendly and helpful. The rooms are clean, comfortable and mixed - which is great. The hostel is right beside everywhere - bus station subways etc. Its the only hostel ive been in with a full bar at seriously discounted prices. Some of my best nights in Toronto were spent there. Its a great way to meet other travellers doing the same thing-especially if your on your own. Full kitchen which comes equipped with everything you might need, TV room with all channels, books games etc. I met some of the nicest people from all over the world and would definitely recommend it to anyone looking to go to Toronto - Did I mention its cheap too??",
      "rate": 5.0,
      "tripDate": null
    },
    {
      "title": "Loved Toronto, hated the hostel!!",
      "text": "Toronto was such an amazing city, with fantastic tourist attractions, places to eat and unusual activities for two people in their early 20's. The global backpackers village however, was to put it nicely - awful. Aside from the numerous bed bites I had from my face down to the backs of my legs, I had to use my own t-shirt OVER the top of the pillowcase because it was SO stained, I had to buy my own towel because not one member of staff explained they had towels their for guests (Not that I would want to use one if it was in the same condition as the bed sheets), I had to constantly go back down three flights of stairs to ask the person on reception to fix the 'security' swipe card they gave me for my door, I had to avoid touching the mouldy green shower curtain in the girls bathroom and the smell of damp in the hallways and the bedrooms put me off sleeping. I have stayed in numerous hostels before - in Italy, Prague, UK etc etc and none of them were as filthy as this one. I am not even a fussy person either, but the thin mattress and human hair covered carpets were a step too far. The only positives I can honestly find from staying here is the fact you get pancakes in the morning, there is a place to keep luggage if you want to go into the city, check out time is late and there is an outside area when it is hot. Yes it was a cheap place to stay but in all honestly I think the place needs knocking down and starting again.I wouldn't recommend it.",
      "rate": 1.0,
      "tripDate": " August 2012"
    },
    {
      "title": "No creía las críticas hasta que lo experimenté por mí misma",
      "text": "Desventajas: Por motivos que yo no elegí tuve que hospedarme una noche en este hostel. Es viejísimo, hay goteras en el techo, está todo bastante sucio y parece que esté a punto de caerse. Las habitaciones son tan pequeñas que no caben las mochilas y las personas a la vez. La cocina es asquerosa y huele a orina, sí, de verdad que no estoy exagerando, hay un baño cerca y apesta. Ventajas: es muy barato (sobre 24$ noche) y está incluido el desayuno y está más o menos céntrico, se puede caminar a downtown. Tb hay un LCBO justo en frente (donde se compran las bebidas alcohólicas). Yo solo aguanté una noche y me volví a otro hostel (HI Toronto)",
      "rate": 1.0,
      "tripDate": " September 2010"
    },
    {
      "title": "Fell in love with GVB",
      "text": "The Global Village Backpackers hostel in Toronto had excellent customer service. The staff is super friendly, informative and interactive. They went out of their way to help us meet the other guests. The place has a great bar and living room area where we met the greatest people from around the world. We even went out as a group one evening to bar hop Toronto!The environment is artsy, funky, very clean and comfortable. Pay phones and PCs are available in the lobby. There is a full kitchen for fixing meals and a relaxed outdoor patio for sunning or having parties.We met several other guests who made reservations at the International Hostel in town, and changed over to GVB after seeing the conditions of the former.Overall we found GVB exceptional and are looking forward to staying there again.",
      "rate": 5.0,
      "tripDate": null
    },
    {
      "title": "Amazing staff.",
      "text": "The staff was awesome -- unbelievably helpful in every situation. I am shocked at some of the reviews that criticize them. Unless there have been recent changes, I couldn't disagree more. They were quick to answer questions, knowledgeable, and always kind. It's a VERY old building, and it shows. If you're looking for glamor, this isn't the place for you. We saw the cleaning staff in action often, but things are quite worn down. But if you're looking for a cheap bed in the best location imaginable (every major tourist-y location is walkable from it), then this is the place for you.",
      "rate": 3.0,
      "tripDate": " January 2014"
    },
    {
      "title": "The chassis of my car is cleaner",
      "text": "Dirty old hostel. We found belongings of former residents, human and non-human. My floor had only one men's shower for 15 rooms (x 4 persons), and was out of order. Toilet was clogged most of the time. There was gum on my bed, bloodstains on my mattress and dark stains on my sheets. My pillow was yellow, but must once have been white. Light switch button on the wall didn't work, fortunately there was another way to put the lights on. Breakfast consist of cereal, pancakes with maple syrup and... yeah.. thats pretty much it. Staff is friendly, but incapable. Having read the other reviews, I was lucky not to have any bed bugs bites, but yes, there are mice. On the plus side, location is good.",
      "rate": 1.0,
      "tripDate": " April 2013"
    },
    {
      "title": "Terrible excuse for a backpackers",
      "text": "How this place is allowed to operate is beyond me. Cleanliness? Well more appropriate to list is filthiness. Doesn't look like a cleaner has set their eyes on this building. Grimy, slimy filth bowl. Flies everywhere in the kitchen, i spotted 3 mice on 2 different floors and several people in my dorm had bed bug bites - no wonder i checked out the next morning.The positives? Location is perfect, just a shame management don't appear to have any desire upgrade the facilities. Staff - RUDE. When i brought down the 'clean' sheets i was given at check in - which had several blood/god knows what streaks on them, the staff member gave me another set but put the filthy ones back on the shelf for another poor guest/victim.Ideal place to shoot a reality horror film, otherwise stay clear of this revolting tip.",
      "rate": 1.0,
      "tripDate": " November 2012"
    },
    {
      "title": "No. Just, no.",
      "text": "Telling you not to stay here could be my best advice I'd ever given. Rude customer service (when you could find someone to help you), a stench to all rooms, and an infestation of bed bugs. This place should be condemned.",
      "rate": 1.0,
      "tripDate": " August 2012"
    },
    {
      "title": "Charming Place",
      "text": "I kind of hate rating this down to average, but honesty requires it. I had  a wonderful three night stay. The Irish girl checking us in was exceptionally friendly and helpful, giving a warm reception. It is cheap, which drew me, and when I pay cheap I cannot ask for modern new facilities. The place is definitely on the old side and so its not perfect,but my bed slept well, clean sheets and towels were provided and hot showers with actual changing room behind the shower stall door, which is a luxury! Free breakfast is definitely a plus,free,fast WiFi, free computer use, and right downtown! The bar is unique and cool, and is open till 2:00 A.M., so you may wish to consider that if you cannot sleep through noise. I would definitely stay here again!",
      "rate": 3.0,
      "tripDate": " January 2013"
    },
    {
      "title": "A hostel of character.",
      "text": "It's cheap and that usually means that you are not going to get, nor should you expect a 4 star hotel. We paid for a double bed, private room which was a bit pricey considering but we were travelling peak season and everywhere was chocka full and at 11pm, roaming for cheaper accommodations was just not going to happen.It's a little seedy, and some of the walls and banisters are a little uneven, showing it's age but I actually kind of liked it and found it charming. They had an outdoors bar, which was also open to the public. The drinks were cheap,the bartender was a bit of a rascal, and it had a kind of backdoor neighborhood BBQ feel to it.Internet is free with 3 computers for use. We had a nice pancake breakfast with gallons of maple syrup. Breakfast is a somewhat haphazard affair, but it was yum. Overall, the staff were friendly and helpful.If you stay relaxed,  and be a little patient, then you will enjoy your stay.",
      "rate": 5.0,
      "tripDate": " July 2012"
    },
    {
      "title": "Better than expected",
      "text": "I stayed here in November for a week, I was hesitant at first to book after reading all the awful reviews but it was by far the cheapest hostel in  town and money was a big factor for me. I found a special on line for $25 a bed but then was offered the weekly rate when I arrived. Only $165 dollars! (Also, the fact that there was a bar really sucked me in as I've met some of my closest friends socialising in backpackers bars all over the world). I don't usually write reviews but this hostel seems to be getting a unfairly bad rep. Yes it's an old building and there was a couple toilets out of order during my stay but I always found a working facility to use and never had to wait. The staff were all super nice, they let you know about nightly events.  I joined in on Trivia night and sang karaoke. (badly) I did see housekeeping around everyday in the bathrooms and hoovering my room (this wakes you up at about 11 if you`re a late sleeper) but if you`re a bit obsessive about cleanliness this may not be the place for you as you can tell it`s seen better days. If you like people, having a good time and old school hostels then stay here, You`ll have a blast!",
      "rate": 4.0,
      "tripDate": " November 2012"
    },
    {
      "title": "Do not stay here.",
      "text": "This is the worst hostel we have ever stayed in. The rooms are really dirty and smell really bad. Ours appeared not to have been cleaned for months. Plus we were in a mixed dorm that appeared to have a man living in it permanently. He had things everywhere and draped sheets across the bunks to create a \"room\".The bathrooms are filthy. Only one shower on our floor had hot water, and it was disgusting too. The toilet seat was broken in the ladies, so it lent against your back when you used it.Some of the staff are nice, but most of the them are unhelpful. They don't appear to know or care much about the city, couldn't offer advice on what to see/do during a two day stay. I would not stay here again. Try Planet Traveler or The Canadiana. They are a short walk away, maybe a few dollars more, but definitely worth it.",
      "rate": 1.0,
      "tripDate": " September 2012"
    },
    {
      "title": "Smells like death!",
      "text": "I can honestly say this is the crappiest, most disgusting, smelly, dirty and badly run hostel I've ever stayed at.  We stayed in a dorm, and whilst I dont expect that much for $22 per bed, I at least expect the place to be clean and tidy.  The smell in the room and in the corridor outside was unbearable, hard to describe how bad it was.  The bedlinen and carpets were stained and filthy, the toilets and washrooms were an absolute disgrace! Looks as if they are never cleaned out.  The staff are friendly and approachable, but overall, its a shocking disgrace of a hostel.",
      "rate": 1.0,
      "tripDate": " August 2012"
    },
    {
      "title": "Not worth the hardship",
      "text": "I would not recommend staying here. Yes, it is low budget, but if you're not super penny pinching, for only 20-30 bucks more you can get WAY BETTER. This place's rooms have no private bathrooms, the beds are in really poor condition, and you are NOT ALLOWED TO BRING ANY FOOD OR BEVERAGE into your room... so, no drinking or eating your own food, you gotta go out and buy it... which pretty much negates the saving money part of it. We took one look at our room and cancelled our reservation. They gave us a hard time cancelling too. If you're really struggling for money and you don't mind the BARE MINIMUM and no partying, then this might be ok. Otherwise, do yourself a favor and go somewhere else.",
      "rate": 2.0,
      "tripDate": " September 2012"
    },
    {
      "title": "Don't waste your time coming near it.",
      "text": "It's a pretty dire place. I had the misfortune of staying here as the organization that brought me to Canada gave me a few free nights in this place. I'm glad it was free. Had I have paid I would have been hugely disappointing, especially as it is not really that cheap and you can stay elsewhere for the same price. Being in the middle of Downtown on two major streets, you would have at least expected there to be double glazing/air con. But no to either, resulting in a very poor nights sleep. The staff speak to you like your being a massive inconvenience. Even if there are no issues, God help you if there are issues, I highly doubt the staff would even been bothered to help, let alone know what to do. The place is dirty and stained, the bathrooms smell. The female bathroom on the first floor has only one shower and one toilet. The are huge gaps along the door so anyone walking past will get an eyeful.  Overall it is a grimy, unkept and noisy place that I hope I never have to visit again!",
      "rate": 1.0,
      "tripDate": " June 2012"
    },
    {
      "title": "Wrong choice!",
      "text": "Welcome smell was pee when going up the stairs to the room.Matress was really old and painful. Carpet was broken in places, and looked dirty.The smell in the room was just disgusting, the low and tiny window didn't let much air going through.This place is a scam !We moved away to the Global Guesthouse on Spadina, same price and way better !",
      "rate": 1.0,
      "tripDate": " September 2013"
    },
    {
      "title": "Terrible!",
      "text": "The only good thing is about the location, that is pretty good. The staff was rude, the female washroom was very dirty and with no toilet paper. The linens were dirty and all areas were stinky. The staff took off my food without  The worst hostel ever! very dirty and stinky!",
      "rate": 1.0,
      "tripDate": " September 2013"
    },
    {
      "title": "Disgusting",
      "text": "My girlfriend and I stayed here for 2 nights, as we wanted to enjoy Toronto, but on a bit of a budget. We're both realistic in what we expect from hostels, having stayed in many across Europe, Asia and America...but this was the worst. Apart from the location, there is nothing positive to say. The whole place is just disgusting, and feels as though it is only being held together by the grime and dirt that must be embedded in its walls. the majority of the staff were arrogant and clueless. I could say more, but I get the feeling that some of the staff there would probably enjoy reading reviews like this. I wouldn't stay here again if u paid me.",
      "rate": 1.0,
      "tripDate": " August 2013"
    },
    {
      "title": "the wrong hostel for the first nights in Toronto",
      "text": "With my review I don't want to offend anyone. Its mainly criticism about the condition of the hostel and NOT about the staff.  I always wanted to travel to Canada. My dream came true and I was able to took off 4 weeks of vacation from work. To see more of the country itself I booked the Schooner tour via the Moose Travel Network (which was awesome!). They offered me to stay at the Global Village Backpackers for the first 3 days I was in Toronto until the tour starts to a descent price (Now I know why). At this point I would recommend everyone to book another hostel instead (e.g. Canadiana Backpackers Inn, which is a pick up spot of the tour bus as well)My flight had 3,5 hrs delay, which was departing from London Heathrow airport, so I came in late around 01:30 a.m. All you want at that time is a good bed in a more or less clean room. The receptionist (staff in general) was really nice and did an awesome job! After I received the linen and towell I directly went up upstairs. The stairway was pretty shabby and tended to be inclined to the left side. As soon I entered the bed room an intense smell of urine came up my nose. It was sooo disgusting. Finally I ended up lying on the top of a shaky double bed. This was my first night in Toronto and my first impression of a canadian hostel. I still decided to stay at the GVB for two more nights, but already booked a hotel for the time after the tour was finished.Not everything was bad in general. The patio in the backyard was amazing! It was a good spot to meet new people, having a beer with them for a reasonable price! Also the living area, which had huge pool table was really nice and convenient. Every morning the staff served you a good breakfast (pancakes, toast, cereals, coffee, etc.), which I really enjoyed.On every stop of our trip through the east of Canada we stopped at some great hostels! I guess this one was just the one out of a million you should not stay for the first time being in Canada. It definitely can give you a wrong impression of canadian hostelry.In the end I have to say I had the time of my life in Canada so far and I am pretty sure If the owner(s) of the Global Village Backpackers is / are willing to invest money into their hostel it will get better ratings from guests soon.",
      "rate": 2.0,
      "tripDate": " June 2013"
    },
    {
      "title": "Do not stay here. Needs bulldozing at best. Renovations at least. Staff are pleasant.",
      "text": "I have no issues with the staff. My disdaine is related to the accommodation itself. 1) the place is falling apart & because they lease the property they don't spend money maintaining the showers or anything else. 2) the beds are the worst I've slept on. Period. 3) the under sheet provided didn't fit the mattress = useless 4) the hostel is located next to a 24hr tram service that meant no sleep. 5) when I entered the room I found 2 broken fans. Why these were not disposed of, I haven't a clue. 6) the bathrooms are shocking. The showers are so crap I got out as quickly as possible & discovered that there's no privacy when you get out of the shower. The 'shower' managed Luke warm at best. I had to turn the second shower on to stop the first from making strange sounds & strange movements. 7) there is 1 male & 1 female toilet to service an entire floor. Each room has on average 6 people per room. Approx 12 rooms per floor = pathetic 8) bottom basement recently flooded. Unavoidable? Yes. Mopped recently? No. = horrible smells, wet floors, no fun. 9) lockers located in basement. $5 deposit & 99c charge per day. Staff must assist in opening locked door to basement each time. = bloody annoying if you're forgetful. 10) no alcohol allowed because they have a bar = more expense for budget travelers. 11) bathrooms were dirty when I went for a shower at 7:30am. I had some company. Black hairs at my feet. = yes it's part of traveling but still... Yuck. The girls were cleaning the ladies at the time & due to a time commitment I couldn't wait for the bathroom to be cleaned. Am sure had I waited the hairs would have gone. At least I hope so! Positive note: 1) The Aussie from Melbourne who cooked pancakes for breakfast. Good guy, nice pancakes. Conclusion: after 1 night of a 3 night booking I am checking out. Luckily I have a friends couch to crash on. I've travelled extensively & battled through some dumps called accommodation & this place is up there with the worst of the worst. I'd hate to stay here in the winter. You'd freeze to death! Spend some money on renovations or close the place down. Otherwise you'll go out of business in a short period of time.",
      "rate": 1.0,
      "tripDate": " July 2013"
    },
    {
      "title": "Don't waste your time!",
      "text": "This hostel was due to be our first stop on a 10 city tour of Canada and the US with my boyfriend and even though the reviews were pretty bad I was attracted by the cheap price and good location.After 13hours of travelling I was looking forward to a hot shower and, more than anything, a chance to brush my teeth. I think, in my overtired state, I overlooked the shabby reception interior with the prospect of cleanliness once we got upstairs.However, what I couldnt overlook was the distinct smell of urine in the hallways and up the stairs. Or the shabby and dirty aesthetic. Or the out of order toilet. Or the dirty and smelly shower. Or the hard bed. Or the plug sockets located halfway up the wall. I certainly couldnt overlook the lack of bathroom to brush my teeth in!So we decided to get out and found a much nicer hostel called Planet Traveller located slightly further out but worth the extra cost by miles!!Perhaps the only positive comment I can provide, except for the location, was the discretion of the receptionist when we decided to leave. She gave us a full refund without any questions asked. Although, to me, it seemed a little odd that she did not question our reason for leaving...as if it were a regular occurrence?!",
      "rate": 1.0,
      "tripDate": " June 2013"
    },
    {
      "title": "Global Village",
      "text": "Location is great,on the edge of fashion district, central to the kensington markets and lake. cleanliness is on the down side, bathrooms are grotty. Nice outdoor bar and pool table area. would not stay here again.",
      "rate": 3.0,
      "tripDate": " May 2013"
    },
    {
      "title": "Not Good",
      "text": "I have stayed at a lot of hostels over the past few years and this one is the worst. I have not experienced a place so bad, the smell of urine in the hallways, no toilet paper in washrooms, showers were not cleaned the weekend I was there. The power went off nightly, not sure what was going on, but the longest it was off about 1 hour. Don't stay here, I read the reviews before I stayed here and said it couldn't be that bad, well it is.",
      "rate": 1.0,
      "tripDate": " April 2013"
    },
    {
      "title": "One of the worst hostels I've ever stayed in.",
      "text": "I completed a 2 year world wide trip and this was one of the worst hostels I came across. It was dark, dingy, damp/moldy and the staff were arrogant and rude, After a couple of nights a large group of us moved to the Canadiana, much cleaner and fresher.",
      "rate": 1.0,
      "tripDate": " June 2012"
    },
    {
      "title": "Mice hostel",
      "text": "This hostel is invested with mice. Besides hearing them crawl around during the night, they munched through bags and ate all our food.... pretty disgusting!!The staff is nice however and the bathrooms were fine.",
      "rate": 1.0,
      "tripDate": " April 2013"
    },
    {
      "title": "Loved it!",
      "text": "My friend and I very much enjoyed Global Village Backpackers; therefore, we extended our stay for an extra night.  The staff makes this hostel as wonderful as it is!  Martin and both Bens at the front desk ensure that one has a comfortable and pleasant stay.  I will never forget them and their wonderful customer service. It may not be easy to find privacy if staying with various people in one room; however, this is to be expected and encourages one to meet new individuals!  It is an ideal location!  :)",
      "rate": 4.0,
      "tripDate": " October 2013"
    },
    {
      "title": "Could have been better",
      "text": "Definitely not the best hostel where I've stayed, not even close to it.I stayed in a four people room, and we found a mouse in it when we came back one night. The staff were not surprised when we tell them.I was happy when I knew we would have got a breakfast, but it turned out to be just a long queue waiting for a pancake and a coffee, not even bread with jam. Better go to some bar. The place is big but it looks like abandoned and the quality of the hostel could be improved greatly.During the night the noise from the street is very loud, but that's the price you pay for a nice location.We went there for a weekend trip in Toronto, all young guys, but I wouldn't suggest going there if you don't belong to this category.",
      "rate": 2.0,
      "tripDate": " November 2012"
    },
    {
      "title": "Filthy & Friendly",
      "text": "For CAD$ 30 a night You cant complain! you pay for what you get! The staff is friendly and very helpfull. They \"clean\" once a day. Are you are person that are sinsitive to filth and dirt do not stay here. Not unusual to find hair from the person that showered before you in the showerroom. Im glad there are separated showers! There is a popular backyard with a bar that are very popular. So popular is the bar that it's not unusual to see local slutts picking up lonely male travellers for a free drink or to in return for some romance in one of the cubicals at the unisextoilette situated behind the kitchen, maybe thats why GVB offers complimentary condoms over the reception desk? The rooms are dirthy, without AC and airfreshner, sleeping can be a challenge at nights. And with noisy bunkbeds doesent makes it better trying to sleep. But for a small amount a night and with great location:- overall a filthy but entertaining experience.",
      "rate": 2.0,
      "tripDate": " July 2012"
    },
    {
      "title": "Don't have any expectations, remember this is a HOSTEL!",
      "text": "It saddens me to see so many people hated their experience at GVB.I've been 3 times now, and i would go back any day. I've had the best times at this hostel, it's bang in the centre of the entertainment district, and about a 20 minutute walk to dundas sq. Yes, its grubby here and there but it's really it's nothing. I've met the best people at this hostel, and the bar and patio area is great, staff are friendly and there is lots of info on what to do in toronto and around the area. There are only a few things that i could think of to complain, and thats the lockers and air conditioning. Don't expect to lock your belongings away as lockers don't exist, just a room in the basement where everyone puts their stuff.. saying that, i left mine there worried that it wouldn't be there when i got back to it but it was fine... fine for 3 weeks straight! Another thing is, Toronto is HOT in the summer, and sharing a room with other people in that heat is kinda unbearable at night... sort out some air conditioning please!When i think of Toronto i think of this place straight away, i love it.Overall, i love this place. Perfect for backpackers and everyone is so friendly.",
      "rate": 3.0,
      "tripDate": " June 2011"
    },
    {
      "title": "a grim hole",
      "text": "I have been to a lot of hostels in my time but Global village Backpackers easily ranks as the worst place on earth. I had the pleasure of spending 5 days in this decrepit dank hole and each day revealed new and exciting lows in the experience. First off our private room was about the size of the double bed leaving little space to maneuver about. The floors were sticky and the strong stingy musk of body odor filled the air. The paper thin walls allowed us the hear literally every single noise in the building including other guests copulating and possibly self pleasuring and the noise from the street made the experience of getting a bit of kip akin to lying next to an air raid siren. If you enjoy a strong overpowering smell of human excrement , you will love the communal bathroom which actually manages to smell better than the bedroom.The shower room is in serious need of repair with tiles from the wall strewn on the shower tray and dirt caked into the floors.The kitchen, which is \"currently undergoing renovations\" and seems like it has been since the 1940's, is filled with barely functional appliances and conveniently a non functioning AC unit. I even spotted a rat lurking about the windowsill.If I have anything positive to say about this awful building is that at least some of the staff are pleasant. The australian guy and Irish girl were both approachable and helpful, though the english chap who looked like will young was a bit of a bollocks.Overall, I rather sleep on the abandoned ferris wheel in Chernobyl than ever go near this building again.",
      "rate": 1.0,
      "tripDate": " August 2011"
    },
    {
      "title": "Horrid stay due to unexpected guests.",
      "text": "I stayed here for 4 nights and found this hostel dreadful. We were told upon arrival that you weren't allowed to eat food in the room, which we didn't. But we had brought chocolate over for friends and didn't think it was safe to leave in the kitchen. So we left it in our suitcase. We moved to a hotel after the four nights and my friend discovered that the chocolate had been eaten. So we rang the hostel and talked to them about it and we were told that they don't allow food in the room as they have a problem with rats. We had to get all our clothes washed and when we asked about a bill they told us they wouldn't pay but we could come back to them and get the clothes washed there but it would take a full day. We'd flown over from Ireland and were going to a convention and would miss out on a lot of stuff we'd paid good money for. The staff we in no way helpful or apologetic about the fact that the hostel was rat infested, my friends chocolate for friends had been eaten and that we had to get all of our clothes washed. Also the air conditioning was awful, the toilets were dirty and had gaps between the cubicles, so people could see in and the staff weren't friendly or helpful.",
      "rate": 1.0,
      "tripDate": " July 2007"
    },
    {
      "title": "great hostel",
      "text": "Stayed here three times now and loved it... in a dorm twice and then in a private room (shared bath) Both very basic and have stayed in cleaner hostels but atmosphere more than makes up for it and its by no means bad. Its also in a great location and within easy walking distance of major sites, good bars etc.Staff are great and cheap brekkie is good.  Brightly coloured place makes it nice and cheery and bar is good fun with cheap prices and a great beer garden for the summer.  Big common room too with pool table, sofas, internet etc, staff also put on events like bbqs etc in summer.... although these and the bar can make it noisy if your'e trying to sleep, but most hostels are noisy!They have locker storage for you to leave your bags in if you check out before your flight etc and are right on a tram line for transport. They also have links with the magic bus tour running to Niagara Falls. (pickup from hostel)  I had heard mixed reviews of this but me and my boyfriend had a great time, it was really good fun and you see loads more than the more expensive tours (you stop at a vineyard for a tasting, a mystery stop and at viewpoints) and have more than enough time at the falls to do the maid of the mist or whatever. Would recommend both the hostel and the tour to Niagara very highly, I think its the best hostel Ive stayed in.",
      "rate": 5.0,
      "tripDate": " May 2004"
    },
    {
      "title": "Hippsterviertel ",
      "text": "Ein sehr gutes Hostel was die Lage angeht für junge Leute, es liegt quasi direkt im kensington market wo immer was los ist mit vielen Bars,Restaurants und kleinen Geschäften, die Räumlichkeiten sind auf das Minimum begrenzt mit einfachen Bett (unbequeme Matratze) und einem Spint, die öffentlichen Räume wie Küche und Aufenthaltsräume sind sehr schön eingerichtet und laden zum zusammenkommen ein, was dort gut ist ist am Bad und den sanitären Anlagen allerdings mehr als schlecht diese sollte man wirklich mal generalsanieren aber ja für den einen oder andern jungen Backpacker ist auch das kein Problem und er wird seinen Aufenthalt hier auf alle Fälle genießen können bei einem Bier in der Bar gegenüber PS: WLAN funktioniert im 3 Stock so gut wie gar nicht dafür hat man Empfang in der nächsten Bar 😂😂",
      "rate": 3.0,
      "tripDate": " August 2016"
    },
    {
      "title": "Rats, Bedbugs, Cochroaches",
      "text": "I saw one guy who left the place, his arms looked he had chickenpox.  That was due to the bedbugs.The refrigerator never gets cleaned so all the food gets smashed together, which means more abandoned/rotting food and less space to put new food.  The staff doesn't seem to care.  The place does have a lot of tables.  WiFi goes out for hours.  It was very cold, at least when I was there.",
      "rate": 2.0,
      "tripDate": " November 2013"
    },
    {
      "title": "Would not pay 1 cent to live there",
      "text": "It is not worth the cheap price - will never stay there again. Broken showers and dirty washrooms, no ventilation, dirty rooms with unbeliveble smells and inedible breakfast. and no safe place to put your bags. I will never stay there again. not even if I got paid for it.",
      "rate": 1.0,
      "tripDate": " November 2012"
    }
  ]
}