{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Grand Motel Toronto",
    "url": "/Hotel_Review-g155019-d681156-Reviews-Grand_Motel_Toronto-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.5",
      "reviewCount": 50
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "4626 Kingston Rd",
      "addressLocality": "Toronto",
      "postalCode": "M1E 2P6",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-s/01/ce/73/67/grounds.jpg?w=500&h=-1&s=1"
  },
  "description": "Our boutique motel is clean and comfortable. While it is conveniently located along the main Toronto roadway, its positioning provides for restful and quite stay. The motel is in close proximity to both the city and nature. The location offers a variety of activities, ranging from experiencing city life and attractions to hiking in parks or visiting Lake Ontario beaches and wildlife reserves. We are connected to highway exits, public transit, GO and VIA rail.",
  "featues": [
    "Free parking",
    "Free High Speed Internet (WiFi)",
    "Wifi",
    "Pool",
    "Hot tub",
    "Vending machine",
    "Non-smoking hotel",
    "Outdoor furniture",
    "Air conditioning",
    "Housekeeping",
    "Kitchenette",
    "Microwave",
    "Refrigerator",
    "Bridal suite",
    "Non-smoking rooms"
  ],
  "reviews": [
    {
      "title": "NOT IMPRESSED",
      "text": "I've stayed here a few times with my family, never had any issues, it's a decent place. One reason why we choose this motel is to have access to the pool. Great when you have kids. I was told the pool would be open at 9am so my daughter could swim before check out. Was it open? No! The woman on the phone was extremely ignorant about it when I asked why its not open when I was TOLD it would be the day prior. Today she said not until noon. Kinda useless when we have to checkout at 11am. When your paying nearly $100 for a motel room I thought this was absolutely ridiculous.",
      "rate": 3.0,
      "tripDate": " June 2013"
    },
    {
      "title": "Perfect Little Getaway",
      "text": "For starters, this isn't a posh, four-star establishment, but it doesn't try to be.  Wanting to give my girlfriend a night of fun before she headed oversees (but not having much in the way of funds), the Jacuzzi rooms caught my attention.  I called late Saturday afternoon and a friendly voice said they'd hold a room for me.  I checked in, $100/night (tax included) with a $50 deposit.  They didn't require a credit card, just a valid drivers license.The room was a bit dated but very clean - you could even smell the remnants of the cleaning products (which was easily aired out).  Long story short: we had such a good time that we woke up the next day and paid for another night.  Now we have a weekend full of memories neither of us will forget!",
      "rate": 4.0,
      "tripDate": " September 2010"
    },
    {
      "title": "Reasonble stay for a reasonable price.",
      "text": "\"Reasonable\" is a good word to describe this hotel and its price.  We would be willing to stay there again sometime. While it is an older motel, and near (but not on) a busy road (Kingston), the rooms are reasonably maintained, clean, quiet, and seemingly safe. The parking lot shows signs of age, but it is also clean and in decent shape.  The lady at the desk was gracious, and when I asked for a ground-floor room, she noted that it would have helped them had I noted that in my on-line reservation -- I took that to mean that a better room may have been available had I made earlier arrangements. The room we had was clean and reasonably maintained. Still, there were a few cobwebs in a couple corners, and there were spots were some additional \"finish-work\" maintenance would have made nice improvements. We didn't see any problem with the door locks being insecure (as noted in a previous review). There were several spots of paint chips peeling away from the metal door frame, and in a few spots elsewhere in the room, but in general the paint was nicely done.  All of the plumbing worked well, though there was no stopper for the sink. All of the grout work was in good shape, though there was a bit of mildew in a few spots. A number of spots of caulking were recent and nicely done -- no old and deteriorated caulking.  The curtains were in good shape. The air conditioner worked well and quietly, though we only used it for the fan.  The beds were comfortable and the bedding was clean and in great condition. We were not expecting to use the pool, though it was closed -- perhaps for the \"off season\". The wi-fi worked well.  We never used the TV, though a newer flat screen TV with a cable connection was available. A small refrigerator and a microwave were both available, though we didn't use either. The motel is in a good location with a number of reasonable restaurants nearby. There is reasonable access to Its location also has reasonable access to the 401 expressway, and the Toronto Zoo is not far away. Morningside Park is reasonably close for jogging or cycling.",
      "rate": 3.0,
      "tripDate": " September 2016"
    },
    {
      "title": "Don't let the great reviews fool you. BUYER BEWARE",
      "text": "I booked a room with 2 double beds for June 25 - 29th/13, for my niece, her girlfriend and a 3 year old via email.  The online reservation form asked for my credit card number and the dates I would require accommodation  for.  Shortly after I received a confirmation stating the room was booked and my credit card would only be charged for the first night and once they arrive the balance would be put on my credit card.  My niece arrived around 7 pm on June 25th and there was no one at the desk.  My niece called my on her cell phone to let me know they had arrived at this motel but there was no one around.  The lady finally came and was extremely rude to my niece.  She did not even say hello.  When my niece gave her name she said they were not aware a 3 year old would be accompanying them and was very very nasty to my niece.  My niece called me in tears because here she was dropped off by a limo to some motel with a very nasty lady who was clearly annoyed they were there.  I attempted to speak with this woman to advise her of the confirmation number that was supplied to me when I made the reservation.  She again said she did not know a child would also be there.  When I read the email I sent her and she responded to it by confirming the room, she denied it and was just a horrible person.  My niece went to the motel next door where the service was good.  I booked this motel for a reason and that is because it had great reviews so I was completely shocked to receive the service we received from that nasty lady.  I think Trip advisor needs to re evaluate this motel.  This motel is not child friendly and their customer service skills need immediate attention.  I would not recommend this motel to my worst enemy.",
      "rate": 1.0,
      "tripDate": " June 2013"
    },
    {
      "title": "Worst motel and service I ever had!",
      "text": "So let me just start by saying we were really exited for our first family trip with our 8-month old son! When we arrived, we were satisfied with the room. It was clean, a little dated but with the price, you can't ask for more. When we wanted to leave for diner, my husband locked the door and gave it a small push to ensure it was locked properly and to our surprise, the door opened. We flagged down two employees who then tried but couldn't open it but every time my husband did, it could. Anyway we weren't comfortable leaving with our door unlocked. The locksmith came to check, proceeded to try and convince us to leave and he would keep an eye on our room... We asked if they could lock the deadbolt until our return as it was getting late. On our return, they had entered the room when we were gone, fixed the lock and the owner started to yell at my husband, yell in front of my son, that he was the one that broke the lock.... She wanted us to pay for it and wouldn't open the door. My husband had to threaten to call the police for her to open the door. Needless to say, we ended up getting a refund and staying in a MUCH better motel (all new) 2 blocks down the street. The way she was yelling at us is the most unprofessional I have EVER been treated in my life. If it was my husband who broke it, we would have had no problem to pay... I would never recommend this motel and if I could, I would give it zero star.",
      "rate": 1.0,
      "tripDate": " July 2016"
    },
    {
      "title": "What a NIGHTMARE!!!",
      "text": "My boyfriend and I were looking for a fun time in Toronto last weekend. I did a little research on different places to stay and came upon \"The Grande Motel\". The ad. read, \"Hot Tub in Room\". I thought this would be a neat thing because I had never stayed in a room with a hot tub in it before.   We arrived at the motel, the staff (some guy) seemed friendly enough. So we paid $100 dollars for the night and entered the room promptly.   The first thing that caught my attention as I walked in the room was the smell. It smelled similar to a wet dog and really stinky flatulence combined. My boyfriend claimed he couldn't smell it but I think he was just too excited to get me in the hot tub. ;)   Aside from the stench, the room seemed fairly clean until I went to put our liquor in the fridge. The seam that closes the bar fridge was filthy! It was like it hadn't been cleaned in years!! I was completely appalled.   By now I was beginning to worry about the hygeine the maid used to (that is if there was a maid). I grabbed a piece of toilet paper and opened the fridge with it and placed the alcohol inside.   We had a dip in the hot tub then hung our towels and swimsuits, had a few drinks, then dozed off later that evening.   I woke up to use the washroom and to my ultimate disgust there were slimy worms all over the floor so I was forced to inch my way around them so that I didn't have to touch them and quickly used the toilet and darted back into the bed area. I woke my boyfriend to come look at the eerie sight and he was as shocked and grossed out as I was. He told me to come to bed, the morning would be there soon and we would go complain upon sunrise since there was no one in the office when we needed to make the complaint.   We awoke early and inched around the worms, some dead by now, to take our very quick shower. It was about 8:00am and we went to go talk to the man in the office (We had to buzz him down and he didn't look pleased) even though the office was closed until 9:00am.   Expecting a refund, we showed the man some worms in the cup and he laughed and told us it was normal and there was nothing he could do about it. He took our information and made my boyfriend sign something saying he would not write anything about our awful night. (I did not sign as I was not asked... if I was asked, I would never sign such a thing.)   We left, unhappy and with the total \"heebie-jeebies\".   If I could say one nice thing about the place it would be that I was glad that at the very least, we weren't being chased around by murderers... it wasn't a horror flick, it was a NIGHTMARE!!",
      "rate": 1.0,
      "tripDate": " September 2007"
    },
    {
      "title": "JUST BECAUSE YOU MAKE A RESERVATION DOES NOT GUARANTEE YOU A ROOM",
      "text": "We had a reservation (they took our credit card number and gave us a reservation number) but when we arrived we were told that they didn't have a room for us.I asked how that was possible and was told that perhaps the part--time person took the reservation.NO APOLOGY, NO ATTEMPT TO HELP - JUST A SHRUG. The lady at the front desk wouldn't even look at the reservation number, or check their computer system - just kept repeating that they had no rooms.",
      "rate": 1.0,
      "tripDate": " July 2015"
    },
    {
      "title": "Great price and excellent friendly service.",
      "text": "While there are many motels along this stretch of Kingston Rd. This one I fully recommend. The service was very friendly and the room neat and clean.It was exactly as described, TV, Wifi, Heater, Washroom toilet, tub, shower. even a microwave. Also, the price was affordable. I will definitely return to this establishment whenever i see the need.",
      "rate": 5.0,
      "tripDate": " February 2018"
    },
    {
      "title": "Little disappointed",
      "text": "Well for the price it was one of the cheaper ones I found for just one night. The front desk staff was friendly. The room was very dated, but for the most part was clean. Had a small microwave and fridge. The big downfall was the super slow internet.",
      "rate": 2.0,
      "tripDate": " June 2017"
    },
    {
      "title": "Fix the A/C!",
      "text": "I expected more after reading the other reviews. Everything looked dated and past its prime. On the plus side it was clean. But it was a very hot night. We turned on the air conditioner and all through the night it rattled and squealed. A choice between sweat all night or too noisy to sleep. A person shouldn't wake up more tired than when they went to bed.",
      "rate": 1.0,
      "tripDate": " May 2016"
    },
    {
      "title": "Good services, good price and clean room",
      "text": "Found A jewel among all hotels in Toronto, nice bigger room, very clean, fine furnitures, and out of noisy traffic. Easy access to highway 401 and Garden express way. Arrived Toronto in the morning from Buffalo, went through lake shore visiting CN tower, Kensington market and Chinatown. After all the hassles of fighting traffic, it was very nice to settle down in a very secluded, quiet and peaceful motel for a good night rest.         WiFi reception was good, no interruptions.",
      "rate": 5.0,
      "tripDate": " July 2016"
    },
    {
      "title": "Good Value",
      "text": "The room was clean and was not outdated. The room had multiple locks which made it seem more secure and had a nice screen door to get some fresh air. The air conditioning and free wifi was a huge plus. Definitely a good stay for the price. Just be aware that it isn't actually in Toronto but instead about a half hour away.",
      "rate": 4.0,
      "tripDate": " May 2016"
    },
    {
      "title": "Very good and clean for such a price",
      "text": "I paid a very reasonable for Toronto price to stay here. I found the rooms to be clean and comfortable, which is all that I could ask for. I found the staff to be very friendly and responsive to my concerns. All I had to do is ask. The rooms looked updated with flat screen tv and fridge and a microwave and free wifi with a good signal.They even accommodated me by providing me a ground floor room because I had a problem climbing stairs even though I did not book a ground floor room for the same price, although the room was updated.I also was pleasantly surprised that they accommodated me in deluxe room without extra charge.  I stayed for three days and had room service every day. I was given new towels every day, the room service was great and by the time I came back it was cleaned very well.  The linens and towels were also very fresh and white. The location was also very good, convenient to down town and safe area. I find that it was the best place to stay close to downtown for the reasonable price. I recommend this place to anyone who is looking for a reasonable price in a clean comfortable place in a good location.",
      "rate": 5.0,
      "tripDate": " October 2015"
    },
    {
      "title": "Pleasantly surprised",
      "text": "I'm in a non smoking room with a single bed. This place is pretty good. Nice large room. Dated but clean and well laid out. Flat screen TV, :-). Motel 6 in Brampton didn't have one.One disappointment, WiFi not getting to my room on the second floor.I'd stay here again.",
      "rate": 4.0,
      "tripDate": " October 2015"
    },
    {
      "title": "Nice place",
      "text": "It was 770$ (tax included) for two rooms for a week. The rooms were clean, also was the swimming pool. We had a small (very small!) fridge and a microwave, so we were able to cook our own food. We also brought with us a smal oven for the same reason. The motel was at half an hour drive from every attraction. We recommand this motel for a cheap and nice stay in Toronto.",
      "rate": 4.0,
      "tripDate": " July 2010"
    },
    {
      "title": "Nice motel, off the main road. Great value for the money.",
      "text": "I was looking for a place to stay with my girlfriend that wasn't too expensive and came across the grand motel.  I read the reviews here and was impressed (there was one negative review but it didn't seem to fit with all the other reviews), so I called them up.  The guy at the desk was friendly and he let us check out a couple of rooms when we got there. I ended up getting a Jacuzzi room for $100.  The room was large and clean.  The Jacuzzi was fairly big (we took the square one, the honeymoon suite had a heart shaped one that wasn't as big).  Overall I have to say that for the money this place is probably the best MOTEL in the area.  It isn't the Marriot, but for half the money you can't ask for more if you just need a place to stay. The bed was a little on the springy/squeeky side and the linens looked tacky, but overall a decent motel.",
      "rate": 4.0,
      "tripDate": " October 2009"
    },
    {
      "title": "Great stay and rate!",
      "text": "My boyfriend and I were looking for a place where we could stay for the night that wasn't too expensive. Once we arrived at the Grand Motel we were very surprised! Our room was clean and was fully equipped with a T.V, microwave and mini fridge. The beds were very comfortable. Our bathroom was small but that didn't bother us. Nearby there are banks, grocery stores and restaurants. If you show your CAA/ AAA card you receive a discount! I recommend this motel for people who are looking for a place to stay in a quiet area at a reasonable price. I will defiantly stay here again.",
      "rate": 4.0,
      "tripDate": " June 2009"
    },
    {
      "title": "A great place at a great price in a nice quiet area. Highly recommended.",
      "text": "I have stayed at this motel every time I visit Toronto. It is a great motel for the price. Very clean and quiet. Me and my girlfriend stay here for two weeks at a time, twice a year. I have not found anything better for the price and location. If you don't mind long transit rides to get into downtown Toronto, which takes roughly forty five minutes, then this is the place for you.",
      "rate": 5.0,
      "tripDate": " April 2008"
    },
    {
      "title": "The nice place to stay",
      "text": "I stayed in Grand motel for a couple of days in August.The place was neat and the price was reasonable.The motel is not new, but well maintained. I liked the outdoor pool and a fish pond the most. The staff was friendly and my stay was very comfortable.There is a chinese food restaurant next door to the motel. I will definitely recommend it to my friends.",
      "rate": 4.0,
      "tripDate": " August 2008"
    },
    {
      "title": "Closed!",
      "text": "This is no longer a motel. It is a housing complex owned by Fred Victor Housing. You will be met by security and asked to leave the property.If you do not leave the parking lot immediately, police will be called to escort you off the property. There is no parking aloud at all for visitors who come to call on residents either. All visitors must check in and out at the office. No smoking is allowed near the building and the parking lot is very tiny and difficult to turn around in. If you are going to visit someone, you are better off meeting them somewhere else - like the restaurant in the mall next door or the library a few blocks away .",
      "rate": 1.0,
      "tripDate": " October 2022"
    },
    {
      "title": "The best value in Toronto",
      "text": "I find that this motel has the best price to quality ratio in the city, which is what I discovered after comparing prices online and actually looking at places. The room was very clean and warm, had a good size TV, and the bed was comfortable. It also has a vintage American motel look that's unique these days. Overall, I had a pleasant stay without having to pay ridiculous Toronto prices.",
      "rate": 5.0,
      "tripDate": " December 2015"
    },
    {
      "title": "HORRIBLE!",
      "text": "This place was awful. I was laying on the bed talking with my friend on the phone when a bug crawled onto me, I immediately jumped up and look on the bed to take a closer look, and there was a bed bug. I immediately went to the front desk to report it to the manager & she told me that it was completely “ impossible “ . I explained to her that I had collected the bug in a cup as evidence & she continued to say it was not a possibility what-so-ever & refused to come to the room and see the bug. After I had given up in speaking with her, I returned to my room to pack up all my belongings and she entered about 5 minutes after, when I tried to show her the bug she told me that I was a liar & I made up the whole story. She told me if I wanted to talk to someone I should phone the police.. the police would not be able to do anything about this situation. She refused to give me any sort of refund after I was only there for shy of 3 hours and the room was in next to perfect condition other then sheets moved on one bed. I was completely mortified and went outside to wait for my Uber: while waiting for my Uber she came up to me and told me that she had called the police on ME! For what? I was never rude to her, I was completely calm and polite even after being called a liar and being denied any sort of refund. This is absolutely the WORST place I have ever stayed at. The manager is completely rude & unprofessional when it comes to complaints. This is NO way to run a business. I am mortified by the way I was treated.",
      "rate": 1.0,
      "tripDate": " October 2018"
    },
    {
      "title": "Best place under new managment!",
      "text": "I'm giving it 5★ because they deserve! The guy at the desk was very friendly and honest.Total new management and they have changed and renovated whole motel what I saw from outside and including my room of course. I was there for 1 night from Montreal and price was also great. There wasn't any problem in my room and everything was in order! towel, tv, fridge, microwave, etc.People who lived here before did some vandalism and misconducts, so that new management kept their name and ID numbers. If next time these people show up we will not rent them our any room, says the front desk guy. Another great thing, you will get the free wifi, you just need to ask front desk, they will provide the access. This place was perfect for me and definetly I'm staying here next time. During previous mismanagement there's some negetive reviews but these problems has been solved. Go there and check for yourself! Mohamed Youssef Ronny, Montreal",
      "rate": 5.0,
      "tripDate": " August 2016"
    },
    {
      "title": "Simple, clean, affordable",
      "text": "There's nothing to it than what it's supposed to be: a simple motel, 2 floors, parking. Clean rooms with two large beds, TV, Hot water. Some of the rooms has a hot tub. The prices are reasonable. The location, 20 minutes drive from Toronto downtown, is a great advantage.",
      "rate": 4.0,
      "tripDate": " November 2013"
    },
    {
      "title": "the grand motel is great",
      "text": "i have been staying here at the grand motel for 4 weeks now,im on a vacation from belfast northern ireland and i think the motel lives up to mits name it is grand in every way friendley manager and very helpfull the rest  of the staff cleaning ladies are very efficent at there job and also very friendly i will defnitley return here again on my next visit to toronto i would defnitley recomend the grand motel to all my friends and to every one else who will be looking for somewhere to stay in torontp the best of irish luck to the manager allister and his wife from frank mcclinton room 26",
      "rate": 5.0,
      "tripDate": " July 2010"
    },
    {
      "title": "Horrible Customer Service",
      "text": "I booked a reservation a week before my check-in on Nov 09/19. There was an issue with my reservation and my CC so I had to call the hotel to rectify the situation (morning of Nov 09 2019). I spoke to a female staff and she wasn't being helpful to my request, leading to my reservation getting cancelled (not my choice.) The female staff hanged up the phone on me while I was addressing my issue to her.",
      "rate": 1.0,
      "tripDate": " November 2019"
    },
    {
      "title": "affordable clean and friendly",
      "text": "very affordable clean and friendly staff the grounds have lots of flowers and green foliage and has a very clean outside pool ask for a new room as they are updating their rooms room has mini fridge and microwave clean towels everyday",
      "rate": 5.0,
      "tripDate": " July 2019"
    },
    {
      "title": "Exact expectation for a motel!",
      "text": "We ordered two rooms. The front desk called us upfront to confirm the check-in time. The location is close to the street but pretty quite. The rooms looks old but the most importance is clean and no \"special\" smell. That's what I expected to live in a motel. There is enough free parking lots but free wifi is not fast. You can not have wonderful experience but it's a good place to sleep.",
      "rate": 4.0,
      "tripDate": " August 2017"
    },
    {
      "title": "Nothing Grand about the GMT",
      "text": "I recently booked at the GMT based upon the high ratings online but they were not deserved. The bed was comfy but my room was clean but dated and dark and in need of the most basic upkeep. As examples, light fixtures were out of alignment, the toilet seat was chipped, and the vent on the door of the bathroom was rusty and falling off such that the metal ground across the floor when the door was opened or closed, making a nasty sound. WiFi was fine. This is a motel that needs better maintenance.",
      "rate": 3.0,
      "tripDate": " June 2017"
    },
    {
      "title": "best spot in the area",
      "text": "have stayed a few times.. its a good spot... even has a pool... clean comfortable.. nice owners.... good choice .. better than any others in the neighborhood ... for the price... little fridge and microwave..  has different room options if you want more than this...",
      "rate": 4.0,
      "tripDate": " August 2016"
    }
  ]
}