{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Grand Royal Condos - CN Tower",
    "url": "/Hotel_Review-g155019-d11980077-Reviews-Grand_Royal_Condos_CN_Tower-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.5",
      "reviewCount": 11
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "300 Front St W",
      "addressLocality": "Toronto",
      "postalCode": "M5V 0E9",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0e/1e/b1/ba/grand-royal-condos-cn.jpg?w=500&h=-1&s=1"
  },
  "description": "located 657 feet from CN Tower, Grand Royal Condos - CN Tower offers accommodation in Toronto. Guests benefit from a balcony and an outdoor pool. Private parking is available on site.The kitchen features a dishwasher, an oven, and a microwave, as well as a coffee machine and a kettle. A flat-screen TV with cable channels is featured. Other facilities at Grand Royal Condos - CN Tower includes a hot tub.",
  "featues": [
    "Parking",
    "Free High Speed Internet (WiFi)",
    "Fitness Center with Gym / Workout Room",
    "Pool",
    "Restaurant",
    "Game room",
    "Airport transportation",
    "Non-smoking hotel",
    "Wifi",
    "Clothes dryer",
    "Laundry service",
    "Washing machine",
    "Air conditioning",
    "Seating area",
    "Iron",
    "Wake-up service / alarm clock",
    "Kitchenette",
    "Dishwasher",
    "Bath / shower",
    "Complimentary toiletries",
    "Microwave",
    "Refrigerator",
    "Kitchenware",
    "Hair dryer",
    "Non-smoking rooms",
    "Suites",
    "Family rooms"
  ],
  "reviews": [
    {
      "title": "Unbeatable Location",
      "text": "My family of 2 adults + 3 tweens (13,10,10) just returned from a great week-long stay in Toronto. It was the first time we'd been to the city and I hemmed and hawed about whether or not to stay in the city or an outer town. We considered Mississauga, which was significantly cheaper, but a friend of mine familiar with the city recommended we stay downtown. The location of Grand Royal Condos is unbeatable. The CN Tower and Aquarium are literally across the street and there are lots of places to eat nearby in walking distance (including a Starbucks right downstairs). There's a grocery store at the end of the block for essentials (especially when travelling with children). Cookware in the unit was limited but it was nice to just have a fridge and microwave for leftovers. The full washer/dryer was so nice. The apartment is small in square footage but we never felt like we were on top of each other. The metro is one block away and there are lots of things to do within a 15 min walk radius (St Lawrence Market, China Town, Flatiron Building, Theatre, Rogers Centre). Traffic in the city is a pain because there's only one major highway and so many people are travelling in/out of the city for work. I don't recommend renting a car though I believe there is dedicated parking on site. Taxis and Uber are usually nearby if you want or need to go further out.",
      "rate": 4.0,
      "tripDate": " October 2018"
    },
    {
      "title": "First time in Canada",
      "text": "Chose this Condo, based on its location, even though it was more expensive than we usually pay, first impression was a little difficulty in locating the building, it is known by its address and not as Grand Royal Condos, on arrival we were met by security on Reception, who were not particularly engaging or helpfulThe room itself was spacious and well equipped, minus the lack of tea towels! We were fortunate to have a view towards the CN Tower, which was absolutely amazing, especially at night.The positives for this Condo, was the location, spacious, and comfortableThe negatives were the security staff on Reception, several lifts were not in operation, leading to delays on  most occasions, the WiFi did'nt work, whilst the Apartment was generally clean, several areas had been missed ( behind the settees and the glazed tiling to the shower area )Overall we would recommend but with reservations",
      "rate": 4.0,
      "tripDate": " May 2019"
    },
    {
      "title": "Incredible value",
      "text": "On pickup from the airport, our driver asked why myself & teenage daughter had come in winter to Toronto? \"Because it's a treat for her 18th birthday!\" This happened a couple of times during our week-long stay which was a off-putting start.The condo was magnificent & at £745 ($1250 Canadian dollars) each; including flights, baggage & private transfer - was a true bargain!Our immediate impression was sullied though by the furniture in reception, which is falling to pieces & spoils an otherwise acceptable first impression.Only one lift was working for 45 floors, so as you can imagine wait times could be 10 minutes or so on occasion.                                  However, the condo itself had a superb view of the CN tower & financial district. Also; 2 bedrooms, 2 bathrooms, living area, kitchen area with dishwasher, cooker, utility room with washing machine & tumble dryer.....outstanding amenities.There is a $500 refundable breakage deposit which due to our late arrival we never paid, as we never actually met the manager, but we left the condo in immaculate condition anyhow. Please note: there are no guest services unlike a hotel & reception is serviced only by a security team whose command of the English language is limited by the majority of  them.If like us,  you have a late evening flight home; reception has no storage facilities which is a concern. However, after speaking to a security guard who did speak English - was told that if you turn left on Front St; the Intercontinental hotel just 5 mins walk away would store your bags for $5 each.Finally, a great stay was had, but pray   the fire alarm doesn't go off at 4.45am on the first night & like us you have to race down 34 flights or more!",
      "rate": 4.0,
      "tripDate": " February 2019"
    },
    {
      "title": "Dont - Just don't.  Great locations, great looking building, poor maintenance",
      "text": "The end of a 3 week trip to Canada turned into a farce through a lack of maintenance and care.Front door didn't lock, other doors not closing, furniture broken or damaged.Ended up leaving early as we couldn't get the sheer number of issues resolved.  Seems to be an issue with the building so the apartment we stayed in showed the same signs as all - front doors not closing, warming of the wood.  All blamed on the climate and proximity to the lake.Honestly, avoid.  Great location, good looking building but no care or proper maintenance.  Worst place on our trip.",
      "rate": 1.0,
      "tripDate": " October 2021"
    },
    {
      "title": "Beautiful apartment with view",
      "text": "I just spent Easter weekend with a group of friends and we had a great time. The city is beautiful and for the 24th floor the view is amazing. The location is great because it is easy to walk around the city and you are very close to the CN tower, the aquarium and the stadium. The apartment was very elegant, clean and everything worked perfectly. The only flaw is the elevator that take a huge amount of time to go up and down so you end up waiting even 10 minutes.",
      "rate": 5.0,
      "tripDate": " March 2018"
    },
    {
      "title": "Worst service I have EVER received",
      "text": "I booked this in early October for a stay this weekend to celebrate a very special beautiful woman's birthday.  On Wednesday, we received the terrible news of the passing of her sister and my aunt.  I contacted the manager immediately and directly via voice message, text and email to discuss the cancellation for the weekend.  I did not receive any call back.  I contacted again and asked for a solution.  His only offer was a $500 cancellation fee or full price.  I contacted Bookings.com to assist and was provided 3 options, cancel at $400 plus tax, give it to someone else or change the dates which would then be non-refundable.  We decided to change the date and were told the new date would be $500 more even though there was a lower non-refundable rate available for this date.  The manager then increased the price of the cancellation stating we waited too long (even though we had been in touch with Bookings.com daily trying desperately to sort this out).  The manager charged us for 1/2 of the cleaning fee even though we have never stepped foot on the property.  The manager stated he was annoyed and the end result was the customer paying more.  This was an absolutely unnecessary added stress to an already very difficult and stressful event.  I appreciate it is a business but at what cost!",
      "rate": 1.0,
      "tripDate": " November 2017"
    },
    {
      "title": "Excellent location and service!",
      "text": "A modern, clean and elegant place. I was very happy to see that mattresses were spotless and were wrapped in covers :). All blankets were white, pillow cases and pillows were clean inside out and smelled fresh. The condo had an amazing view of CN Tower from balcony and bedrooms. CN Tower, Rogers Centre and Ripleys aquarium were literally walking distance.  I requested a room with a beautiful view prior to my arrival. The staff was very friendly and cooperative. This place is not a hotel and because of this I had to sign a rental agreement which ensured that if I damage the property or make any noise I will be responsible for any consequences. Initially I didn't want to sign the rental agreement but during my stay I realized that it was the right thing to do because it keeps me and the residents safe. The lobby was beautiful and this place was 3 minutes walk to Rogers Centre, and many famous restaurants. I would recommend this place to everyone who wants to stay in the heart of downtown Toronto and appreciated modern unique clean space.",
      "rate": 5.0,
      "tripDate": " November 2016"
    },
    {
      "title": "Blast In The Winter!",
      "text": "I visited this condo with my family of 3. Loved the alluring interior designs, as well as the breath-taking views from the windows. Check-in process was very smooth. Very close to all the major attractions.",
      "rate": 5.0,
      "tripDate": " February 2018"
    },
    {
      "title": "WORST Accommodation and Service",
      "text": "Please do not book with this company - the Condo bathroom door was broken, there was no live TV the service is rubbish - they just want your money. We were promised housekeeping and never got it throughout our entire stay. Kashif is the rep for this company and he misleads you just so can book with him. Stay anywhere else but not here. We were very disappointed.",
      "rate": 1.0,
      "tripDate": " December 2017"
    },
    {
      "title": "it was a blast",
      "text": "Apartment was clean and building location is amazing,it was very convenience for my work. Apartment has really nice CN tower view.Building has nice 24hr Gym. I will come back again stay with them. Xxx",
      "rate": 5.0,
      "tripDate": " January 2017"
    }
  ]
}