{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Hav A Nap Motel",
    "url": "/Hotel_Review-g155019-d1471786-Reviews-Hav_A_Nap_Motel-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "2.0",
      "reviewCount": 14
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "2733 Kingston Rd",
      "addressLocality": "Toronto",
      "postalCode": "M1M 1M6",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/03/d3/2d/e4/hav-a-nap-motel.jpg?w=500&h=-1&s=1"
  },
  "description": null,
  "featues": [
    "Free High Speed Internet (WiFi)",
    "Wifi",
    "Non-smoking hotel",
    "Air conditioning",
    "Non-smoking rooms",
    "Smoking rooms available"
  ],
  "reviews": [
    {
      "title": "Keep away from this motel !",
      "text": "Sorry for my english... It was a very terrible experience... the room was very dirty, the bedsheets were full of spots (I think there were spots of previous sexual performances...), the bedcover had holes by cigarette... I left my cup of coffee in the room and when I came back I have found also mouse's excrements... It was very very cheap, but I slept all dressed because of the disgust...",
      "rate": 1.0,
      "tripDate": " September 2009"
    },
    {
      "title": "This is a place of 'Ill Repute'",
      "text": "I live around the block from this motel and have poked my head in the door (because of the work I do).Everyone laughts at this place so I just wanted to warn any serious travelers about its reputation.  If you are in Scarborough to cheat on your spouse (and you are paying someone for their time) then this could be considered but even then this is 'low-end'.",
      "rate": 1.0,
      "tripDate": " January 2013"
    },
    {
      "title": "A nightmare!!!",
      "text": "The picture here is a joke!!! NOT THIS PLACE, for sure. This is worst place I've ever stayed in my life. The entire time I was afraid of catching an infection, no joke. Every single thing about it is nasty. The walls, the floors, the bathroom...looks like if a murder was committed there and it was never cleaned up. Full of spider webs with insects on them, stains of all kinds...the sheets were burned with cigarettes. I couldnt sleep the whole night thinking about mice and roaches. AVOID this place!!!! the $40 I spent were definitely not invested in housekeeping.",
      "rate": 1.0,
      "tripDate": " October 2015"
    },
    {
      "title": "What a JOKE",
      "text": "This place is a dump. Absolutely disgusting rooms and horrible front desk service. I'd rather sleep under a bridge or in a sewer. This place isnt even rodent worthy! If you want to stay at a hotel on Kingston road I'd say, don't,  but if you have to go to the comfort inn.",
      "rate": 1.0,
      "tripDate": " June 2015"
    },
    {
      "title": "I rather sleep on broken glass.",
      "text": "I got the room for a night and didn't even end up staying the night. The room was absolutely disgusting. There was fecies on the walls, a beetle on the bed, ashes on the carpet from someone previously smoking in it, the bed was completely sunken in and the carpet by the window AC looked like someone was murdered there with a disgusting amount of blood stains. When I went up to ask if we could get a refund the lady said refunds are only allowed within the first 20 mins and we were 22 mins. We asked for a vacuum atleast and she wouldn't even provide us with that. Regardless, don't even bother going to HAV a nap you're better off with the super 8 down the street a little. That room was not worth 65$/ a night.",
      "rate": 1.0,
      "tripDate": " June 2014"
    },
    {
      "title": "Bed bugs?",
      "text": "Yesterday afternoon I spent a few hours at this motel. I layed on the bed and watched TV for about an hour. My skin was perfectly fine then... It wasnt until I got home that night that I noticed my back felt slightly irritated. When I examined my back in the mirror, the top of my back was covered with red bumps. I wore a tank top that exposed the top portion of my back to the notel that afternoon. I've never had problems with acne in my life. My back was 100% spotless before I went to the motel yesterday afternoon. Now it looks as if I'm suffering with severe acne..I'm beyond pissed off.",
      "rate": 3.0,
      "tripDate": " June 2012"
    },
    {
      "title": "Hav A Bed Bug Motel",
      "text": "After spending more than a week at this Motel, began to notice scattered red bumps on certain parts of my body, coming to the conclusion that they were Bed Bug Bites, as the rooms were infested with them. They post a certification stating it has been pest controlled, which is clearly for show. Not going to go in any further about the other problems with this place, figured you got the point... This place bites... Literally. Not sure what williamssamantha2040 was smoking, but Kodet has nailed it right on. Stay far away from this spot, unless you're a bug collector of course.",
      "rate": 1.0,
      "tripDate": " March 2012"
    },
    {
      "title": "A place I can rely on whenever I come next to Toronto",
      "text": "Came on a business trip and since this happens to be the first motel closest to downtown it had to be my obvious choice provided everything else would be good. I went to reception to realize the variety of rooms they had which is an exception on kingston road and decided to book the one with jacuzzi. As I entered i could see everything perfectly placed and excelled tidiness which I never experienced in a motel ever before. I hopefully plan to come next summer with my kids for fishing in lake ontario which, again, this motel falls closest to and i shall try their rooms with kitchen n dinning. I recommend this place anyday to all.",
      "rate": 4.0,
      "tripDate": " February 2011"
    },
    {
      "title": "Piece of crap",
      "text": "Not even a hooker would accept going near that place.  Bugs all over, stinky and filthy sheets...broken everything.  I was drunk, what can I say, if you want a nap you are better off with a rub and tug.",
      "rate": 1.0,
      "tripDate": " May 2015"
    },
    {
      "title": "very very bad",
      "text": "This motel is perfect for the Bulldozer ...Piece of garbage ...bugs all over the place Bathroom  disgusting ...easily you can get some foot disease...Needs MAJOR RENOVATION ...I would not recomend this for anybody ..Piece of garbage the hotel....even the reception area . I can imagine the people who owns the hotel what kine conditions they live if this hotel is suitable for them.....the woman who said to me \"nothing is wrong with the motel\" carpets are completely destroyed . DO NOT GO TO THIS HOTEL !!!!!!!!!",
      "rate": 1.0,
      "tripDate": " May 2015"
    },
    {
      "title": "an excellent stay at a great place in Toronto",
      "text": "I have stayed for five months at the Hav A Nap Motel and I have found both the staff and the level of service extremely good. The rooms are very comfortable and well maintained. The area of the Motel where I stayed was quiet and the management is on duty 24 hours a day to handle any requests that I have. We are close to all the amenities and close to the downtown . The surrounding area is pleasent and the local people very friendly. This stay is temporary , as I am having some work done on my condo, but a better temporary location for myself and my wife I could not have gotten during this time and the weekly rates are very reasonable.",
      "rate": 5.0,
      "tripDate": " February 2013"
    },
    {
      "title": "Disgusting",
      "text": "I told the owner I wanted a different room or have someone come in and clean or give us a refund. He said no and we were forced to stay in these conditions. Never go to this place. I also called the city of Toronto and was told they will do something about it. I did a follow up and apparently they won't do anything about this place till I provide everything in writing.",
      "rate": 1.0,
      "tripDate": " February 2018"
    },
    {
      "title": "Great place",
      "text": "I though the place was great the staff were very helpful and the room was very cozy I will be back for sure it is 8The motel is very close to the beaches and I had a nice time I didn't find any bugs and I hàd ç was",
      "rate": 3.0,
      "tripDate": " September 2017"
    },
    {
      "title": "Bad",
      "text": "This motel was bad.  The room was dingy and smelly.  Linens and towels very used.   Shady vibes from other guests.  Staff were ok.  Wouldn’t return or recommend.  Could be a better experience with new linens and cleaner rooms.",
      "rate": 1.0,
      "tripDate": " November 2017"
    }
  ]
}