{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Hav-Inn Suites - CN Tower & Convention Centre",
    "url": "/Hotel_Review-g155019-d12563509-Reviews-Hav_Inn_Suites_CN_Tower_Convention_Centre-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "2.0",
      "reviewCount": 6
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "300 Front St W",
      "addressLocality": "Toronto",
      "postalCode": "M5V 0E9",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/14/2e/b1/a2/hav-inn-suites-cn-tower.jpg?w=500&h=400&s=1"
  },
  "description": null,
  "featues": [
    "Private pool",
    "Clothes dryer",
    "Washing machine",
    "Air conditioning",
    "Sofa",
    "Telephone",
    "Clothes rack",
    "Coffee / tea maker",
    "Kitchenette",
    "Bath / shower",
    "Complimentary toiletries",
    "Iron",
    "Dishwasher",
    "Microwave",
    "Refrigerator",
    "Kitchenware",
    "Hair dryer"
  ],
  "reviews": [
    {
      "title": "HORRIBLE CUSTOMER SERVICE",
      "text": "I booked a place at Hav-inn suites and received a notification saying that my card needed to be updated. I proceeded by re-entering my card again, correctly. The place then cancelled my booking and said it was due to an invalid credit card despite there being sufficient funds and nothing wrong with the card. I called the location and spoke with a man named Mohammed and he told me to book somewhere else and I told him that most places were booked and I wanted to book there, he proceeded by telling me that I was wasting my time. I called a few days later to speak with somebody else and again, Mohammad answered the phone and realized it was me and he said I told you before book somewhere else! Therefore, I asked to speak to a manager or supervisor and he said that they don’t come to the phone. I asked if there was anything I could do and he said no and again rushed me off the phone.I called booking.com and spoke to a very friendly and helpful agent who was willing to help me, despite it not really being his problem as it was a problem with Hav-Inn Suites. The agent also called Hav-Inn Suites and spoke to the man and told me that I was right, that Mohammad was not professional at all, refused to give the agent his name and that it seemed that Mohammad was turning away several guests. The agent told me that Mohammad informed him that I had to email pictures of my credit card and my government photo ID to the Hav-Inn Suites email in order to confirm my booking. I opted out of this because like the agent agreed, this is VERY sketchy. I recommend to everyone not to book here, looks great and so forth however wouldn’t wanna stay at a place with such awful customer service. I don’t usually post my experiences, but I wouldn’t want anyone to have to deal with this hassle as well. Happy travels!",
      "rate": 1.0,
      "tripDate": " June 2018"
    },
    {
      "title": "Know What to Expect",
      "text": "My wife and I just finished a 3 night stay in this condo building.  There is so much you need to know.  First of all this is a private residential condo tower in a great location and NOT A HOTEL.  There are dozens of companies that bought units in this building and basically \"airbnb them out\".  The so-called check-in/out is the concierge desk in the lobby of the building.  Don't expect anything out of them (let alone a dinner reservation) as they are security guards and that is it.  They will turn over the key to you that \"Hav-Inn\" left for them but you MUST KNOW your unit number before showing up.  They ask for ID then just give you the key.  The building puts up a nice facade.  Lovely modern high-rise that was finished in 2014 with a clean lobby area and some very nice amenities such as the roof top pool on the lower tower.  However the elevator situation is a complete disaster.  They constantly break down and we were trapped in one for 10 minutes before it decided to move again.  My wife was going nuts. The express elevators from the ground to the 28th to 50th floor were either all out of order or one was operational.  The elevators that service ground to the 27th floor were a bit more reliable and usually only one was out of order.  Huge line-ups and very angry guests and residences.  Most times we took the lower elevators up to the 27th and then walked up the fire stairs to our 29th floor unit and then do the reverse to get down.  Was a total disaster!Our unit was 2905 which was a corner unit on the NE side.  Great views from the small balcony.  The exterior of the building and the windows on the inside and outside of our unit (even the accessible windows that one could clean) were very dirty.  On the deck was an old indoor/outdoor green carpet piled up in the corner with a bunch of broken glass and cigarette butts on it.  The inside  of the unit was clean and generally comfortable but looking very tired.  This would be from multiple people staying there since day one.  The TV was also an adventure to figure out.  I wonder when the last time the owner(s) even came to look at the unit.  Would I stay here again?  If I had too.....probably,  but there is no way my wife will.  The elevator situation makes you a nervous wreck!!  We would just pay the extra money and stay in a regular hotel and there are tons to choose from in downtown Toronto.  The city is absolutely fabulous and I must say the condo tower is perfectly located especially if you are a tourist.  The real losers though are the resident owners who live full time in the building as that is their home.  The strata council obviously approves short-term rentals which is destroying the building and quality of life for owners and long term renters.  Just for that alone would be another reason why I wouldn't stay there again.  I do really feel for these folks.",
      "rate": 3.0,
      "tripDate": " August 2019"
    },
    {
      "title": "Terrible",
      "text": "Great location, but staff are extremely rude. They did not allow me to enter, even though it was very sick, but so far so good because there are rules, but I ended up dozing on the sofa because I had to wait for 3 hours, then the receptionist came and yelled clapping my ears saying that it was forbidden to sleep in the lobby . The apartment was dirty, with forgotten clothes from previous guests and some furniture in poor condition of conservation, total disgust.",
      "rate": 1.0,
      "tripDate": " August 2018"
    },
    {
      "title": "The WORST service ever!",
      "text": "If I could give a minus rate for this property, I will be very pleased to do so. Booked a room for my Director on her trip to Toronto for a conference. Should be staying on 20 - 23 June 2017, however, received a very unpleasant notification telling the reservation has been cancelled. The reason was \"the invalid credit card.\" And on another email they wrote: \"Always wonder why poeple like you waste other people time and money. So disgusting.\" I am sorry, whoever the staff wrote that on the email, it's clearly don't understand hospitality service nor industry.If the credit card was the issue they should HAVE contacted us in the first place to verify and clarify the reservation. I wrote an email asking about their clarification but received a surprisingly worse respond saying:Dear Guest, Your booking as been canceled. We will not be releasing the key. Your booking is no longer vaild in the system.Thanks,Guest Services I fully understand the reservation was cancelled, but WHY they didn't even try to reach us to clarify the credit card?!!! This is unacceptable!!!This is not my first time nor my Director first time to travel and to book an accommodation, we know the rules.",
      "rate": 1.0,
      "tripDate": " June 2017"
    }
  ]
}