{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Hilton Toronto",
    "url": "/Hotel_Review-g155019-d183091-Reviews-Hilton_Toronto-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.0",
      "reviewCount": 4058
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "145 Richmond Street West",
      "addressLocality": "Toronto",
      "postalCode": "M5H 2L2",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2c/14/f1/6e/lobby.jpg?w=500&h=-1&s=1"
  },
  "description": "Located in the center of Toronto's urban downtown, the Hilton Toronto is a 10 minute walk from all the city has to offer. We are walking distance from the Metro Toronto Convention Center, Union Station, the theater district, China town, city hall and connected to all major office towers. Our oversized guestrooms start at 364 sq. ft. with north or south facing views. Decorated in subtle tones with the latest amenities they evoke a sense of calm and restfulness for a good nights sleep. Guests can relax with a dip in our indoor/outdoor pool, open year-round, with a seasonal licensed patio or recharge with a work out in our recently upgraded 24-hour fitness center which features a sauna and change room. Our hotel in Toronto also offers 22,000 sq. ft. of flexible ballroom space, 6 breakout rooms & large foyer space.",
  "featues": [
    "Valet parking",
    "Wifi",
    "Pool",
    "Fitness Center with Gym / Workout Room",
    "Bar / lounge",
    "Tennis court",
    "Children's television networks",
    "Taxi service",
    "Paid wifi",
    "Pool / beach towels",
    "Pool with view",
    "Indoor pool",
    "Outdoor pool",
    "Heated pool",
    "Fitness / spa locker rooms",
    "Restaurant",
    "Breakfast available",
    "Breakfast buffet",
    "Breakfast in the room",
    "Complimentary Instant Coffee",
    "Happy hour",
    "Kid-friendly buffet",
    "Kids' meals",
    "Outdoor dining area",
    "Wine / champagne",
    "Business Center with Internet Access",
    "Conference facilities",
    "Banquet room",
    "Meeting rooms",
    "24-hour security",
    "Baggage storage",
    "Concierge",
    "Currency exchange",
    "Executive lounge access",
    "Non-smoking hotel",
    "Outdoor furniture",
    "Sun deck",
    "Sun loungers / beach chairs",
    "Sun terrace",
    "Sun umbrellas",
    "ATM on site",
    "Doorperson",
    "24-hour front desk",
    "Express check-in / check-out",
    "Dry cleaning",
    "Laundry service",
    "Ironing service",
    "Blackout curtains",
    "Air conditioning",
    "Desk",
    "Housekeeping",
    "Coffee / tea maker",
    "Cable / satellite TV",
    "Sofa bed",
    "Walk-in shower",
    "Interconnected rooms available",
    "Room service",
    "Safe",
    "Seating area",
    "Sofa",
    "Telephone",
    "Wardrobe / closet",
    "Iron",
    "Private bathrooms",
    "Wake-up service / alarm clock",
    "Refrigerator",
    "Flatscreen TV",
    "On-demand movies",
    "Hair dryer",
    "City view",
    "Landmark view",
    "Non-smoking rooms",
    "Suites"
  ],
  "reviews": [
    {
      "title": "Great location, immaculate place and service",
      "text": "Great place to stay for a night (or more) in order to explore Toronto. Perfect location (just W of Yonge St and less than a 10 minute walk away from Yonge/Dundas). Immaculately clean room, very quiet and the upper floors boast a great view. Make sure to ride with one of the two scenic elevators! The indoor/outdoor pool comes in handy when it's sizzling hot downtown. Very kind reception staff. Thank you!",
      "rate": 5.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Comfortable room; great views",
      "text": "I had a great stay at the Hilton Toronto.  When checking in I was given the choice of a room close to the elevator but on a high floor, or a room far from the elevator but facing the brick wall of the performing arts centre across the street.  Despite the warning of elevator noise I chose the high floor.  The elevator is audible, but it sounds sort of like a strong wind, as opposed to anything metal or clanking.  It did not bother my sleep at all.The bedroom was spacious; the bathroom just big enough for two people's toiletries bags.  The bed was comfortable with a really nice duvet and four big pillows with varying softness.The room was advertised to have bathrobes, but none were there upon my arrival.  A call to the front desk though, resulted in the quick delivery of bathrobes and slippers, and also a toothbrush and toothpaste since I forgot mine.  (I swear I've never done that before.)The hotel links up to Toronto's underground PATH system, so after checking out I was able to walk indoors all the way to Union Station to catch a VIA Rail train.",
      "rate": 5.0,
      "tripDate": " December 2019"
    },
    {
      "title": "Some Pluses  over shadowed by Some Negatives ",
      "text": "stayed here Nov 5th , 2022  with my mother and children Pluses Great location for getting to a lot of  places downtown like the Scotiabank Arena Aquarium Eaton Centre City Hall ROM etclots of great restaurants nearby to have a nice dinner out front door staff was very helpful in getting us a taxi in a quick manner beds were comfy the indoor and outdoor  pool was very enjoyable negatives check in for the room wasn't ready till 4 pm unless we wanted to pay an additional $40  for an earlier room but already dropping $424 plus tax for the room we said no  and with a 5 pm formal wear  function it didn't leave much time to get ready especially when one of the guests is an eldery disabled lady and as well two young  kids  . Our room was ready for us finally at 3:58 pm and with check out at 11:00 am we paid $424 plus tax for a room for 19 hours also for $424 when we finally got to the room after the lengthy wait for the room to be ready when my wife went to use the shower there was long black hairs all around the drainwhen I went to the fridge in the room to put items in for later to be cold the previous occupants plastic bag of Korean BBQ and soup was still in the fridge at night the windows are not very sound proof so there was a combination of Old City Hall clock tower going off every 15 mins and the 2 am car horns on University ave I understand that on a Saturday night in Downtown Toronto that the cost of a hotel room wouldn't be cheap and I also understand in the tourism industry places are trying to recoup COVID loses by putting significant increases on their prices but I expect that for $424 a night with the Hiltons reputation that I wouldn't be waiting till almost dinner for a room  with a sign in the lobby stating that being clean and safe was their #1 priority that had a room with  significant hair in the shower  and the previous guests meals in the fridge . I expect that at a Comfort Inn but I don't pay $424 for a room there Overall its a good hotel with nice rooms and a good location but next time I have a function in Toronto I will most likely look at any of the many other hotels down there in hopes of a better experience",
      "rate": 4.0,
      "tripDate": " November 2022"
    },
    {
      "title": "Disappointing Stay",
      "text": "After booking the executive floor, found out the executive lounge was closed for the week. Was promised I was first on the list for an upgrade to make up for it, but of course that never came to fruition. Room was average with a nice window view, but gross stains on the bedcover and lack of attention to the details did not live up to a Hilton Executive King suite by any means. The buffet breakfast, another supposed consolation for not having the executive lounge open, was horrifying. Eggs looked like soup and most core items were in a constant state of running out with people milling around everywhere waiting for more to come. Coffee was like dirty dishwater and we ended up leaving to go eat elsewhere, so needless to say the free breakfast was of no value. Very disappointing for a long time Hilton gold/diamond member. Certainly not worth the points I used. Lot's of hotels in Toronto. We'll most likely choose differently next time. Oh, and the cost of parking was ridiculous. Especially for the slow, slow service.",
      "rate": 2.0,
      "tripDate": " December 2019"
    },
    {
      "title": "Great location service is hit and miss",
      "text": "The hotel is in a great location a short walk from all the major sights in the city.The check in was fairly easy and the room was very nice. We had a nice view of the North side of the the city. Room 2722.The staff was either great or useless. When we asked for more towels at the front desk nobody bothered to send a message to housekeeping to bring it up. It took two calls and a two hour wait.On the Saturday night it started to rain and they closed the outdoor lounge and had everyone move into the hallway close to the pool. We were told by the front desk that they would open up the indoor bar/lounge for food and drinks. It they never did. The waiter’s and lounge staff didn’t want to go through the trouble to open the hotel bar on a Saturday night at 7:00 pm.I must however give a “well done” to our server Kevin during Sunday morning breakfast. His professionalism and high quality service made me realize that I can’t place all the Hilton employees in the same category.The management might want to have Kevin retrain some of the other employees in customer service.I will be returning to Toronto frequently in the next few months and will give the Hilton another chance in a few weeks.",
      "rate": 3.0,
      "tripDate": " August 2021"
    },
    {
      "title": "Door zapped me ouch",
      "text": "I wish the night staff girl would be my girlfriend. I very much enjoyed her hospitality and the fact that she ensured my skip the dishes remained till I was able to pick it up. The door was horrifying though every time I tried getting into my room I’d be shocked and my finger would go numb for a bit.",
      "rate": 2.0,
      "tripDate": " May 2021"
    },
    {
      "title": "Loved it TOO much!",
      "text": "We are definitely becoming Hilton people.Sometimes downtown hotels can be a bit sketchy, but this one has been maintained and beautiful without being pretentious.The room was beautiful and functional with high sleep quality.We got the opportunity to use the Executive Lounge which made our stay so nice!  It was wonderful to be able to have a bite to eat in the lounge or hang out there after dinner, it really adds to the experience.We thought we HAD to use the valet parking but it was optional once we got there which was nice, we like that and about $15 dollars cheaper.The location was easy easy to find off the Don Valley parking lot, and we saw many people arrive from Union Station.Definitely a great option for downtown stays!",
      "rate": 5.0,
      "tripDate": " April 2022"
    },
    {
      "title": "Lord Daryl Morris ",
      "text": "Really close to all high lights  welcoming and warm staff great service.  A room with a view  of the c&n tower   Checked in out of the snow which just added to the view.  Love it     Full b fast for 27 dollars In room dining. And rail busses just around the corner      Front desk staff can really   Only to happy to help find your way around 👍",
      "rate": 4.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Great hotel, great location!",
      "text": "This hotel is ideal for exploring Toronto. An easy walk to the train station, CN Tower and Aquarium. The rooms are comfortable and extremely spacious with housekeeping carried out daily, definitely no complaints. I didn’t eat here as it’s a bit pricey but across the road is “Green Box” an eco friendly, affordable cafe that serves amazing food that you can take out or eat on the premises. Also just down to the next block you will find Landwer, nice food choice and good service. I loved the pool area as it was very hot when I stayed and you can relax and sunbathe if you’re not exploring. All in all a lovely stay!",
      "rate": 5.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Outdoor heat pool, Attentive Service, Scenic Elevator,  Spacious Room",
      "text": "The Hilton Toronto was a great choice during the recent phase 1 opening because it had an outdoor pool. The staff at the hotel were very attentive and kind.Reasons why you should choose Hilton:1) The staff care about your stay - biggest shoutout to Eira! The front desk (FD) texts you throughout your stay to ensure that you are satisfied with your room and amenities (free water at FD), answer any questions, and communicate when you plan to check out (Love how I don't need to call the front desk for anything) 2) Heated outdoor pool! Although phase 1 kept the sauna and gym closed, the outdoor pool is half indoor and outdoor. So if you want to stay away from the sun or want extra warmth, you can swim inside. There is a staff who checks your reservation and ensure you are social distancing.3) Nice rooms - our room was mostly clean except for the fingerprints on the extended mirror. Not a huge deal as I didn't use it but just a heads up! Also, they have a mini fridge so you can keep your leftovers or pastries in there. 4) I love how they have a scenic elevator where you can see the sunset as you go back to your room or see the view of DT in the morning 5) The location is convenient in my opinion. It is located across the touristy Toronto sign and places like Dundas/ Butter Baker (15 mins),  Distillery District (34 mins), St. Lawrance (25min ~) aren't that far if you love to walk which I did.",
      "rate": 5.0,
      "tripDate": " June 2021"
    },
    {
      "title": "Excellent location with a glass elevator! Yes, please!",
      "text": "Excellent location in the heart of the city, close to a subway stop and within walking distance to many attractions. Our room was clean and well appointed. Our favorite thing in this hotel is the glass elevator, so fun! It’s also located close to many restaurants and coffee shops. Consider becoming a Hilton Honors member and you’ll receive a complimentary continental breakfast, drinks throughout your stay and complimentary upgrades of rooms/suites. The restaurant/bar is convenient, but pricey. Please note that there is a daily parking fee, so just be mindful of additional costs. But hey! You’ll be in a comfortable hotel in an outstanding location and you’ll get glass elevator rides!",
      "rate": 5.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Clean room, comfy beds, fun pool",
      "text": "The rooms were clean and lots of towels and toiletries provided. Lovely view from the room. The scenic elevator is neat. Check in was efficient, no concerns with staff who were always polite and smiling. Convenient location. If there over the weekend skip the valet parking and park yourself, rates current as of April 2022  were 20.00 for 24 hrs 7am to 7am. Coffee makers in room. The pool was open at night so it was nice to swim inside/outside and look at the CN tower in the dark as you can see it from the pool. My one comment about something not so great was the “mini-fridge” it was more like a bar fridge and kept things barely cool, not really cold if you’re looking to store leftovers like we were. Not sure if ours was broken or whether this is common for the bar fridge with glass door type ones. I would definitely stay here again.",
      "rate": 5.0,
      "tripDate": " April 2022"
    },
    {
      "title": "Fantastic Hotel, Staff and Location",
      "text": "We stayed at this Hotel for 5 nights at the start of our Canadian adventure which was part of our wedding anniversary celebrations.Check-in was quick and efficient with Jay and we were allocated a room on the 26th floor which had great views. The room was large, spotlessly clean, and more than adequate for our needs. Additional features were a fridge (kept our water VERY cold), a safe and tea/coffee making facilities. Plenty of towels too. Our room was serviced every day. All of the staff were very friendly, helpful and welcoming. Lexi on Reception was particularly helpful when I was trying to liaise with the company providing our transport to Niagara Falls at the end of our stay. Abbas on the Concierge Desk was also a delight, greeting us with a smile each time we entered the building.The hotel's location is ideal as it is within easy walking distance of Toronto Union Station as well as the various places of interest. We had no problem finding our way around and walked miles!Thanks to everyone for making the start of our Canadian adventure so special.",
      "rate": 5.0,
      "tripDate": " May 2022"
    },
    {
      "title": "The best of a few",
      "text": "My work has brought me to Toronto a few times since November 2020. I've stayed at several downtown hotels, and there's no doubt that the Hilton Toronto has been the best!From the valet parking to the check-in, everyone went beyond the call of duty to make me feel comfortable, cared for and safe. The rooms I stayed in were all very well appointed, clean and quiet.My only disappointment was that the Starbucks in the building closed, but that had nothing to do with the hotel, and a friendly person at the front desk directed me to a nearby location. If you're seeking a stylish experience at a very reasonable rate, this is for you.When I enquired about returning with my family for a biking adventure around Toronto, I was graciously told that the hotel could store our bikes for us. I don't know if they can offer that all the time, or is a function of the reduced capacity; nevertheless my request was handled perfectly!Impressive!",
      "rate": 5.0,
      "tripDate": " March 2021"
    },
    {
      "title": "Great hotel but needs a few small updates",
      "text": "Overall, I enjoyed my stay at the Hilton Toronto. The location is very convenient to see the sites, the staff were helpful and polite, and everything was very clean. They also took COVID seriously and guests adhered to local requirements for mask usage & elevator capacities.My reasons for not giving this hotel a 5 star rating:-The door stuck to the point where we needed to allow extra time prior to leaving/entering the room to get it open. We are able bodied 30 somethings and have never faced such a physical challenge with a door! It got easier throughout the stay but it was surprisingly difficult.-There are an unusually small number of accessible electric outlets in the room. For travelers with multiple devices (like me), this might not be preferred.-There is an outlet on the wall on each side of the bed. Unfortunately, these are very loose and need to be tightened. They looked too fragile to use.",
      "rate": 4.0,
      "tripDate": " September 2021"
    },
    {
      "title": "Nice Stay at the Hilton Toronto",
      "text": "The King Corner Room on the Executive Floor had been recently renovated and was spacious and comfortable.       The bathroom shower was large and the handheld shower head had plenty of pressure and was great to use.       The room had a beautiful view of the city and the bed was extremely comfortable.There was a door to the stairway that leads up one floor right to the door of the Executive Lounge where one is greeted by Mary, who has been concierge of the EL for many years.      The breakfast was ample and the coffee machines allowed for a selection of coffee choices.       The evening reception had a nice selection of food choices as well.The convention hotel was across the street but as a Hilton Diamond member I always stay at Hilton properties if possible.       Staying at the Hilton Toronto was an excellent decision.",
      "rate": 5.0,
      "tripDate": " October 2022"
    },
    {
      "title": "Avoid Cutting back on Diamond & Gold benefits ",
      "text": "Location is in a good location but the hotel is trying to cut back on diamond & gold benefits. At check-in the front desk told me i will receive $18 food credit which I thought would cover the free continental breakfast that gold & diamond get for free.Next morning I went for breakfast and saw on my bill that the continental breakfast is $23. I went to the front desk to complain why my credit didn't cover my continental breakfast and she said that Hilton Toronto is running the United States system of just giving a food & beverage credit. I showed her my phone that shows that hotels outside of the United States is to provide members a continental breakfast so my credit should atleast be the value of a continental breakfast which is $23. Later on the day I called and emailed hilton customer service to explain  what happened and they said the hotel should not be providing  a credit that is less then  cost of continental breakfast and the credit should be $23 instead of $18. Next day I showed the email to front desk and after they read the email they apologized and gave me vouchers for full breakfast buffet.",
      "rate": 1.0,
      "tripDate": " May 2022"
    },
    {
      "title": "Great location, good service, and would recommend it.",
      "text": "We had such a Wonderful stay at the Hilton Toronto.  Amazing downtown location with good service and really comfy beds! Chose this hotel due to location and the Executive lounge over the other Hilton hotels in the city and it was the perfect choice. We also had great city views.I was excited that the Hotel offers some complementary currency exchange. Really convenient and nice service. They offer exchange for USD, British Pound, Euro, and Swiss Franc. No fees, but I believe it is just slightly lower rate.Only negatives is that checkin was at 3pm and there was a delay. We did arrive early at 2:30pm but had to wait until 3:45pm before our room was ready. The other housekeeping was not done by 4:30pm and I used the app to message and stopped by on the way to the pool to see why and make sure it was taken care of. I really didn’t appreciate the tone and attitude of the front desk worker I spoke with at that time. Not cool.  She was short, rude, and did not care to listen. Other than that, the stay was great. We stayed 5 days/ 4 nights. Loved the hotel and the additional quality service we received. Would absolutely stay here again and would recommend this hotel.",
      "rate": 4.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Hilton didnt survive COVID",
      "text": "Am a Diamond Club member and so disappointed with Hilton. No USB ports in any rooms. Room smelt like sheets that had been  left in a bin for months stuffy and musty with little air flow. Parking cost 74 dollars for 19 hours absolutely ridiculous but they don’t tell you when you check in that valet is only $50.00. Hilton has not made it past Covid - moving to the Marriott thanks but no thanks Hilton.",
      "rate": 2.0,
      "tripDate": " December 2022"
    },
    {
      "title": "Great hotel in downtown Toronto",
      "text": "I was here for a business trip in late June, 2022.  We decided to pay for the upgrade to the Executive level, and for 2 people (or more), it is worth it to access the lounge for the great breakfast and dinner appetizers (that could be used as a full meal).  The fitness center had good equipment that was well maintained.  The wifi in the room worked  well, and the room was clean.  The staff was very nice during our interactions.",
      "rate": 4.0,
      "tripDate": " June 2022"
    },
    {
      "title": "An embarrassment to the Hilton Brand!",
      "text": "As a lifetime diamond VIP it saddens me to write this review having stayed here many times.  This hotel is a total embarrassment to the Hilton Brand.     The long lines at the elevator banks are an early indication that the stay will be a disaster.   The entire lobby has been torn up and there is no one to talk to anywhere.  The executive lounge is a total joke.  The attitude of all the staff if you are lucky enough to find one to talk to is basically how would I know.  The lounge has no water and no coffee cups and chairs that are so worn out you are almost sitting on the floor.   The showers in the rooms have no water and the air conditioner is so old the noise is deafening.   I actually almost pulled the refrigerator out from the wall to stop it vibrating the entire room.     I remember in years back there were wonderful staff in the lounge that prided themselves on service and quality.   Who ever owns this location has decimated the staff and tries to squeeze every penny out of guests.   Long gone are even paper cups in the room let alone real glass in the room.  And as a Diamond VIP I am treated special??     So sad how far this hotel has fallen.  One of the worst Hiltons in the World!",
      "rate": 1.0,
      "tripDate": " July 2023"
    },
    {
      "title": "Hilton Downtown Toronto",
      "text": "Very good location.  Front desk is helpful and attentive.  The room was large and the internet good.  However the hotel is dated.  The room is dark, the furniture dated and the carpets in the hallway had ripples in it.  I picked the hotel because of the location and Hilton Honors but this hotel is past due for room renovations.  Unfortunately the service at breakfast was less than satisfactory but that was due to an inattentive waiter.",
      "rate": 3.0,
      "tripDate": " January 2020"
    },
    {
      "title": "High Customer Care",
      "text": "Always feel at home when checking in at this hotel. The check in staff is very friendly and efficient. Although the hotel is going through some room upgrades the staff makes sure that you are not inconvenienced. But what makes your stay feel homely is the Executive Longe staff, in particular Mary and Jim. They both go out of their way to make you feel at home and that any issues are resolved immediately. Again “kudos” to Mery and Jim.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Location is a winner but hotel is dated",
      "text": "Firstly this hotel is in a fantastic location for sightseeing, but like some other Hilton’s this one could do with renovating to maintain 4 star rating. The room was very spacious, with individual room temperature controls. The king size bed was super comfortable! There was a tiny bath with shower in the bathroom area, which was fine. The room was clean and the housekeeping staff were very good and friendly! Recommend supplying a kettle for the coffee bags and tea bags rather than a coffee pod machine that does not have any pods. The Sheraton Hotel is across the street and there are so many shops nearby. A taxi cab to the airport is 60 dollars this included 4 persons and 3 larger cases. Safe within room was a good feature, plenty toiletries provided too!There is a restaurant in the lobby but we did not try it due to the choice in the city. Rooms could do with a freshen up especially the carpets!",
      "rate": 3.0,
      "tripDate": " October 2022"
    },
    {
      "title": "Tired Hotel in a Great Location",
      "text": "Firstly, the best part of this hotel is its’ location. Nowhere is further than 15 mins walk away, and for further afield areas the metro is close by.The hotel itself is very dated and tired now, I’m surprised Hilton hasn’t renovated this already. The rooms are still kept clean but it doesn’t help the experience when the furniture, decor and interior is poor.One key tip is to avoid the hotel breakfast and go across the street to Landwer Cafe - amazing.",
      "rate": 3.0,
      "tripDate": " December 2019"
    },
    {
      "title": "Hilton Downtown",
      "text": "The hotel is nice… the scenic elevator made for some extra fun elevator trips for the kids, the rooms themselves are clean, the location is great, and the pool is lovely. The staff were all so wonderful too. A few areas to improve… the windows out of the room could use a wash as it’s hard to even see out of them anymore, the breakfast-to-go that was included was not a lot of breakfast and could be called more of a snack than a meal. Overall we would go back again as the amenities couldn’t be beat for the price.",
      "rate": 3.0,
      "tripDate": " July 2021"
    },
    {
      "title": "Great location, dated property and average stay",
      "text": "This Hilton property is in a great location in Toronto.  However, our stay was average honestly and I felt this property was a bit dated and in need of an update.  The breakfast provided was subpar, and even the warm breakfast (not included) was average and definitely not worth the money out of pocket.  Didn't receive many of the common Gold benefits I have received at other Hilton properties, like a free upgrade, bottled water, etc.  The walls were quite thin, the water pressure in the shower lacking, no hot tubs, etc.  One would think that at its premier property in Toronto, Hilton would make an effort to make this property stand out.",
      "rate": 3.0,
      "tripDate": " September 2021"
    },
    {
      "title": "A bit dated",
      "text": "This is in a very good downtown location but the rooms and bathrooms have started showing their age. Plus parking is very expensive and service levels can be improved. The only good things are the nice business center in the plush lobby and the Starbucks on the ground floor.",
      "rate": 3.0,
      "tripDate": " October 2020"
    },
    {
      "title": "Amazing Birthday Weekend Getaway",
      "text": "I was lucky enough to snag an extended weekend stay at the Toronto Hilton. It is a great hotel! The location is perfect if you want to explore all that Toronto downtown has to offer. Close to the subway, the theatre district, the financial district. A short street car to the garment district. The rooms are large and comfortable. I had the distinct pleasure of a Junior suite. I love the indoor/outdoor pool. The feeling of snow melting on your face as you swim is something to be experienced. The staff are wonderful. They are warm and friendly. They welcome you like old friends. While all of the staff from Room attendants and servers, to front desk to bellman and valets make any stay great, two people stand out from this stay. Mary, the Executive Lounge host exemplifies the Hilton ideal of Be Hospitable. She manages to connect with every person who walks into the Executive lounge. She is warm and friendly and just an all round wonderful person. She remembers you by name and even if it is your first visit to the Lounge, Mary treats you like an old friend, welcoming you with warmth and sincerity. This warm reception makes every visit a distinctly pleasurable. The other stand out is Anthony the host at breakfast. Even if I am not at this hotel for many month's, Anthony remembers my name. He is always friendly and remembers the little things that make a difference in a guests experience.I strongly encourage everyone to visit this hotel and experience the amazing hospitality for yourself.",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Great Visit Until The Valet Wrecked My Car",
      "text": "Please avoid using the valets at all costs, if you value your vehicle at all. Hotel itself is nice, the rooftop pool is nice. The hotel windows were completely filthy, which doesn’t set a good visual reference for cleanliness. Brought our own disinfectant and wipes, so didn’t notice if the room was overly dirty or not. Parking policy is extremely vague. Which brings me to the valet situation. I parked my car with the valet after being talked into it by the person at the valet stand. The next day, when I had the car pulled up, I discovered they had parked it over the curb at the front of the hotel. When leaving, it scraped the everloving hell out of my bumper. No one said a word, and pretended not to notice the huge scraping sound as I tried to pull away. Avoid using it all costs please. Had a good visit until that point. Don’t know if I would consider using this location again or not.",
      "rate": 1.0,
      "tripDate": " August 2021"
    }
  ]
}