{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Hipster Bachelor Pads",
    "url": "/Hotel_Review-g155019-d17414455-Reviews-Hipster_Bachelor_Pads-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "1.0",
      "reviewCount": 4
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "1417 Dundas St W",
      "addressLocality": "Toronto",
      "postalCode": "M6J 1Y4",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/1d/8c/e3/74/hipster-bachelor-pads.jpg?w=500&h=400&s=1"
  },
  "description": null,
  "featues": [],
  "reviews": [
    {
      "title": "The worst experience of my life!!",
      "text": "What was suppose to be cousin and his beautiful brides special day, soon turned sour due to the unprofessionalism of Erica the owner of the “Hipster Bachelor Pads Hotel” located on 1417 Dundas St. West (main intersection Dundas and Gladstone). Firstly the space does not provide hand soap, toilet paper, or garbage bags, the individual who rents the space is responsible to provide this. Seeing as this is listed as a “hotel” should hand soap, toilet paper, and garbage bags not be provided?  For all guests we only had access to one washroom, with a faulty toilet and a door that did not close properly or lock. This required either a person to stand outside and let others know the washroom was occupied, or to lock the main door to the room. As the bride was walking down the aisle (hallway), with bouquet in hand to the ceremony, Erica felt the need to begin to ruin the day by saying water damage was caused to the room below do to the cooler. The coolers had not been there that long to cause what Erica was claiming they did. Throughout the evening Erica became extremely rude and hostile. She blamed the coolers that were on the floor for water damage in the room bellow. Mind you these coolers were no leaking, and did not leave any marks or puddles on the floor. There were clear signs of water damage on the floor, such as the floor curling up at the edges and the faux wood being worn away, but these were not things that occurred that day or night, these were things that have occurred over time, possibly from the toilet which is not set in place properly and has little to no caulking around its base. When Erica came to complain about said water damage she began moping the floor with a wet mop, but not only the room she began moping the hall way almost as to say the water from the coolers a spread out of the room and into the hall. Erica began using profanities and yelling at the guests. For someone who claims to be a business owner, she is quite unprofessional and has no customer service what-so-ever. The space had been rented from 9:30 am to 10 pm at night. Around 9:00 pm Erica and her two children began to stay in the room, locking the door and not allowing us in to the space that was paid for until 10 pm. At the end of the evening we were required to take all garbage with us and dispose of it as this space did not have a dumpster or area to dispose of garbage.As we were clearing out Erica and her daughter began to claim that items that were brought to help set up the event space belong to them. To the very last moment when we had finished taking everything down and exiting the building Erica was extremely rude. Name calling, trying to intimidate us, and rile up guests.",
      "rate": 1.0,
      "tripDate": " August 2021"
    },
    {
      "title": "Small wedding reception",
      "text": "There's very good reasons why this venue is priced the way it is. Avoid it at all costs. Extremely dated water damage on floors in the room close to the first back patio that to any halfway intelligent person this was clearly caused by the leaking/clogged toilet that clogged on every flush. Tried to hold a security deposit hostage. This wasn't  \"Erica's \"first time pulling this scam.  The building isn't up to fire code. No fire alarms,  no covid protocol signs posted. Unprofessional business practices are in full effect here. Guest were told by the \" owner, Erica \" to go to nearby restaurants to use the restroom. No attempts were made to rectify any issues. Every step of the way the \" owner \" wanted extra money for everything, suggesting to rent another room at full price to use the restroom. Certain things are cheap for a reason. Save yourself the trouble and embarrassment.",
      "rate": 1.0,
      "tripDate": " August 2021"
    },
    {
      "title": "Run from this place!",
      "text": "I only wish I had thoroughly read and believed the reviews before booking. The owner who gave 2 different names is likely the worse part of the experience, rude and trying to start arguments. I rarely write reviews but I had to for this place. If you're looking to book an event please do not fall prey to this, they will try to get every cent out of you as well as blame damage done on you. They will lie to your face but at least with a smile.",
      "rate": 1.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Avoid at all costs",
      "text": "We had booked this patio space to hold our wedding ceremony and reception, and it was an awful experience. There were lots of issues with management, their professionalism, and the event space itself. This place provides nothing except a speaker system and a couple tables, everything has to be rented by you and brought up two treacherous flights of stairs with no elevator where the hallway narrows at 24 inches at one point. You have to bring everything, and I mean EVERYTHING including tables, chairs, catering/bar supplies, toilet paper, even soap! Then you have to take everything with you, including all the garbage bags that you dispose of yourself since they don't have a dumpster. They have no parking, so all your guests will spend extra time trying to find street parking where space is already limited downtown. You will only have access to one bathroom for everyone, and the bathroom has this janky sliding door that’s hard to close. If someone is standing just outside the door, you will have no privacy. And when the sliding door is closed, you can still see into the bathroom at certain angles through the cracks of where the door meets the wall.  Tiffany/Erica will try to nickel and dime you wherever they can, including charging an extra $175 to have their string lights removed so a tent can be put up to protect your event from rain. After we had paid in full for the booking for our wedding, we asked if we could visit the space with our wedding planner- a common practice after a venue is booked.  Tiffany wanted to charge us just to do a walkthrough.  She ended up not charging us, but caused great unnecessary stress nonetheless.The kitchen is shared with tenants, so the fridge is filled with other peoples food which management refuses to move for bookings. We had requested and agreed upon 2 fridge racks cleared for the caterer, however only one rack was provided.  Upon the groom first introducing himself, management's first communication was curt and they told him they would take the security deposit if the walls were scuffed, bearing in mind their hallways were already scuffed from precious events. The hallways are extremely cramped and narrow to 24 inches wide at one point. Erica felt the need to inform me of a water leak when I was literally holding my bouquet and walking to the altar to get married. They claimed a water leak caused by a rented cooler on the floor filled with ice leaked into the room down below. Then after they changed their story and claimed the ice on the counter leaked and caused water damage. It was clear there was already previous water damage.  Chipped lament exposing particle board underneath and warping of the floorboards was indicative of previous water leakage. Overall an awful experience and I would not recommend this place to anyone trying to hold a wedding reception or dinner party here.",
      "rate": 1.0,
      "tripDate": " August 2021"
    }
  ]
}