{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Holiday Inn Express Toronto-North York, an IHG Hotel",
    "url": "/Hotel_Review-g155019-d181966-Reviews-Holiday_Inn_Express_Toronto_North_York_an_IHG_Hotel-Toronto_Ontario.html",
    "priceRange": "$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.5",
      "reviewCount": 262
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "30 Norfinch Drive",
      "addressLocality": "Toronto",
      "postalCode": "M3N 1X1",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2b/24/0b/10/front-desk.jpg?w=500&h=-1&s=1"
  },
  "description": null,
  "featues": [
    "Free parking",
    "Free High Speed Internet (WiFi)",
    "Fitness Center with Gym / Workout Room",
    "Pool",
    "Free breakfast",
    "Children Activities (Kid / Family Friendly)",
    "Pets Allowed ( Dog / Pet Friendly )",
    "Business Center with Internet Access",
    "Parking",
    "Wifi",
    "Pool / beach towels",
    "Indoor pool",
    "Heated pool",
    "Shallow end in pool",
    "Breakfast available",
    "Breakfast buffet",
    "Complimentary tea",
    "Kid-friendly buffet",
    "Vending machine",
    "Conference facilities",
    "Meeting rooms",
    "Baggage storage",
    "Non-smoking hotel",
    "ATM on site",
    "24-hour front desk",
    "Dry cleaning",
    "Laundry service",
    "Self-serve laundry",
    "Ironing service",
    "Air conditioning",
    "Desk",
    "Housekeeping",
    "Safe",
    "Coffee / tea maker",
    "Microwave",
    "Cable / satellite TV",
    "Walk-in shower",
    "Telephone",
    "Iron",
    "Wake-up service / alarm clock",
    "Refrigerator",
    "Flatscreen TV",
    "Hair dryer",
    "City view",
    "Non-smoking rooms",
    "Family rooms"
  ],
  "reviews": [
    {
      "title": "BETTER THAN EXPECTED",
      "text": "Stayed here for four nights (SA-WE) on a business trip, chasing a cheap rate and some IHG points.  I usually stay close to the airport but decided to try out this location and was very happy with how central it was to my appointments all over the GTA.If you're looking for a newly-renovated or new HIE this is not the place.  With that said the room was spotless, the common areas were kept clean (even though I visited during a snowstorm which always leads to a mess on the floors at least), and the breakfast was above average for an HIE.  The breakfast room was larger than most and I never had trouble finding parking right in front, two things that drive me crazy at many hotels (nowhere to sit and nowhere to park)!I would not pay top dollar for this hotel but if you can find it reasonably priced for your stay there's absolutely nothing wrong with it.",
      "rate": 4.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Affordable lacks comfort",
      "text": "Rooms are tiny and beds extremely uncomfortable. Hard mattress and double bed extremely small. Breakfast was a great selection.Parking was free but tight spots. Hotel staff (front desk) was not overly friendly.Room does have a fridge and microwave.",
      "rate": 3.0,
      "tripDate": " April 2016"
    },
    {
      "title": "Average property that could make some simple changes",
      "text": "Here is one of those properties that could get another star very easily by making some simple changes. First off, typical check-in, staff were average, but their English was good (something becoming more rare every day in the Toronto area). A few simple tweaks like good eye contact or a good smile and a great 1st impression would of been made to an otherwise average check-in. Snack choices at the area to the rear of the desk are very limited, double or triple the choices or get a vending machine that can offer a wider selection. I asked for Milk and indicated that I did not care how much it cost, the staff member was nice enough to grab some off the buffet breakfast fridge and gave it to me free. Why not stock it in the fridge and charge for it? Lobby was clean, and public areas were in good shape. The pool was absolutely freezing, and I like it a bit on the cool side, kids were in there for 5 mins and had to leave. Should be turned up at least 5-8 degrees. The gym is your typical small area with an elliptical, a couple of tread mills, and a variety of dumb bells, nothing special but it was clean and all machines were working. No cups for water, but I usually bring my own so no big deal. Room was clean and had a coffee maker and microwave, but no in room movies or video games for the kids. There needs to be some sort of entertainment for families, if we had known there were no in house movies we would of not booked. Family tradition to watch a movie or two before bed. We stayed at another hotel not far from here that gave the kids a welcome pack, was nothing more then a cool room key and some colouring book stuff but established themselves off the bat as family friendly. The wifi signal was good throughout the property. And then there was the buffet breakfast in the mornings... ok first off go early or late because from 8-9:30 it is an absolute zoo. Be prepared to bring your breakfast back to the room because seating area will be full up. The buffet is set up in a totally backwards fashion, really there should be some sort of arrows on the floor indicating which direction people should flow, but the area should be broken up into 4 stations around the room. The toasting area is in the middle and there are borderline shoving matches to get in and out - crazy. If they broke the buffet into four and had it in each corner of the room, things would not only flow better, but it would be much easier for staff to stock. Whoever set this up was someone that must not of given it a lot of thought, or had no experience in knowing how large groups \"attack\" a buffet. People will follow arrows and instructions, but when neither of those are there chaos ensues.Check out was good, no hidden costs and was strait forward.Long and short of it is that I will not stay here again unless the following was done: 1)Pool temperature turned up, or Jacuzzi is installed. 2)Breakfast buffet setup is altered to some sort of set up that makes sense.3)Some in-house entertainment must be offered in the rooms.   4)The property makes some sort of effort to make the kids feel welcome.Do the above and I will not just come back, but recommend the property to others.",
      "rate": 3.0,
      "tripDate": " August 2015"
    },
    {
      "title": "Dissatisfied ",
      "text": "Came here for a hockey tournament. Hotel is nice , rooms are nice .. ample parking, easy access to surrounding areas… But then everything else with this property is GARBAGE.. breakfast is worthy of young street peddlers ..  pool is OVER dosed  with chlorine.. no towels available.. I respect the rules and regulations of the hotel…. But. You can not expect to host  MULTIPLE hockey teams from all over the region and not be accommodating to their needs/ requests.  I understand you have no liquor license, but that does does not mean that alcohol cannot be consumed in your hotel . Also, if you wish to enforce your “policy” then be consistent. Don’t pick and choose which floors/ areas you’re going to enforce. Your” security guard “ is an absolute joke and needs to find another job. I’m not writing this review out of spite, but more out of respect for future guests that need to know that they are not booking a room for your needs   , it’s just for your $$$ .   The front desk staff is very robotic ( they’re doing just what they’re told ) and will not accommodate anything.  Very disappointing experience",
      "rate": 1.0,
      "tripDate": " January 2024"
    },
    {
      "title": "If you're traveling on business, don't come here!",
      "text": "Hotel with major management problems. My check-in took 30 minutes even though I had a full reservation. When I arrived in the room, the temperature was 60F (15C) and the heating didn't work. I had to move the wardrobe myself to reactivate the breaker because the reception was not answering the phone at 8 pm. The toilet wouldn't flush, so I adjusted the float myself. Then I had to return some emails but the internet wasn't working. The next morning, the room temperature (726) was 78f (26C) and there was no hot water for the shower (just lukewarm). Maintenance came to replace the thermostat after a discussion with the manager. The hot water was never repaired. Never again... I will continue to go to Hilton Garden Toronto",
      "rate": 1.0,
      "tripDate": " April 2024"
    },
    {
      "title": "Filthy, with horrible service at the front desk ......",
      "text": "It started out badly when a girl with a bad attitude at the front desk told me perhaps I should go next-door to the best Western. That was the best part of the stay. The rooms are dated and filthy, with the oldest hotel pool I’ve stayed at in 20 years. I’m going to stick with the girl at the front desk’s suggestion that you stay next-door at best Western ........ 👎",
      "rate": 2.0,
      "tripDate": " January 2020"
    },
    {
      "title": "ACCESSIBLE?  NOT!",
      "text": "We stayed in an \"accessible\" room, but it does not meet the needs of a handicapped person. The bed is too high.  The bathroom is too small for a wheelchair to fit in.  The toilet is kindergarten height with no elbow room and a railing that is useless because it is right up against the sink.  The shower is walk-in, with handrails, but there is no bench or chair and the floor was slippery when soapy.  To get cool air from the hairdryer, you need to keep your finger on the button the whole time.  There was no holder for the toilet paper.",
      "rate": 2.0,
      "tripDate": " August 2023"
    },
    {
      "title": "Bad experiences ever",
      "text": "Went yesterday with my husband and they change us 3 rooms before ww find one make sence. One didnt have water for shower the other one smell like a dead body. The last one was Ok but we found hair everywhere.",
      "rate": 1.0,
      "tripDate": " May 2020"
    },
    {
      "title": "Disappointment after Disappointment",
      "text": "Family Vacation Time - the one time all summer that my sister and I get away with the kids. Picked this hotel as it was close to the Zoo and Wonderland, and it had a \"new pool\". Disappointment #1: Not sure what was new about the pool, but the chlorine levels were so high, the kids jumped in and jumped right back out. All 3 spent the next 30 minutes standing under showers to stop the burning in their eyes, on their faces and on their bodies. Disappointment #2: No Cot. Although requested, the staff refused to provide a cot (indicating that there were already 2 double beds in the room, so we didn't need a cot too). Sorry, but a 9 year old boy does not like sleeping with his 6 year old sister. So, we finally begged for a couple of extra blankets and he slept on the floor.  Disappointment #3: Loud Ceiling Fans in the bathroom. Ours woke my son up in the middle of the night (you can't go into the bathroom without turning on the fan AND the light). He thought that a plane was landing in the bedroom.  Disappointment #4: Housekeeping knocked on our door at 7:30 in the freaking morning to see if we had left the room.  (No, there are no \"Do Not Disturb\" signs...but come on, 7:30 AM?)  This woke the kids up....thanks a lot.  Disappointment #5: \"Business Centre\" is in the hallway beside the breakfast room so, no chance to quietly do any business before leaving.  Disappointment #6:  Extremely rude staff at the front desk who seemed to go out of their way to not meet our needs! Long story - the 6 year old lost a tooth at the zoo, we called the hotel to ask them to leave a note for us at the front desk stating \"The Tooth Fairy knows you are at the hotel and will get your tooth, no worries\" so that the 6 year old could calm down.  When we checked in - NO NOTE. They staff didn't know about our call and no record was on our confirmation. At check out, turns out the man who took our call was working - he proceeded to lecture us (in front of our 3 children) on how it was not a good idea for parents to tell the kids that the Tooth Fairy was real and then gave us an article out of the newspaper!Now, it is no ones business but ours as to how we raise our kids. If you can't do someone a favor because it goes against your religious/moral beliefs, then you should not be working in an industry where customer service is required.  We left this hotel absolutely furious.  This is NOT about whether it is a good/bad idea to teach children about the Tooth Fairy or Santa Claus - this is about a simple request to leave a note for a 6 year old child.  If we had asked to have a room facing North because (FOR EXAMPLE), I needed to face north to pray, then I should receive a room facing North (and not a lecture that I can pray facing in any direction).Needless to say, we will never ever stay at this hotel again.  (And I didn't even tell you about the sandal incident....*sigh*)",
      "rate": 1.0,
      "tripDate": " July 2015"
    },
    {
      "title": "Really really filthy..unhelpful staff, dangerous neighbourhood",
      "text": "Looks okay on the outside but aging on the inside.  Located in a dangerous, dumpy neighbourhood, ironically right beside the local police station.  VERY SMALL ROOMS for 2013 standards.  Overall not up to Holiday Inn Standards either.  Carpets were disgusting through entire building.  Front desk staff really unhelpful, and frankly quite rude, bordering on useless.  My room wasn't cleaned properly--again front desk had no explanation or suggestion for the problem.  Insufficient coffee supply throughout the day.  The windows were fogging up so I decided to use a cloth and wipe the windows myself--came out black coloured!  Again, front desk didn't really care.  When you don't care about your own hotel, you don't really care about your guests!  Many better choices people.  A friend helped me bring up my luggage and even they were shocked at the state of the place.  This is not a real gem for Toronto; in fact, a real embarrasment to Toronto and Holiday Inn.  Keep looking even a few streets or neighbourhoods away.",
      "rate": 1.0,
      "tripDate": " November 2013"
    },
    {
      "title": "Great breakfast buffet!",
      "text": "I stayed here for business and brought my daughter with me. The buffet was very good! They had yogurt, boiled eggs, oatmeal, toast, bagels, cinnamon buns, eggs, sausage and/or bacon, pancakes, cereal, fruit, ... My daughter really enjoyed the pool and the rooms are a good size with a small fridge and microwave. It's very close to restaurants, fast food, pharmacy and grocery store. Close to the highway as well. Excellent price too! Would stay again!",
      "rate": 4.0,
      "tripDate": " February 2017"
    },
    {
      "title": "Great stay!",
      "text": "I stayed three nights Wed. to Sat.. Clean, quiet, and very good free breakfast (both hot and cold options). Easy 1/2 hour drive to and from downtown Toronto so long as you don't hit rush hour. Very short drive to Vaughan Mills mall and close to drive to other big shopping centres. It was a very enjoyable stay.",
      "rate": 4.0,
      "tripDate": " November 2016"
    },
    {
      "title": "Nadine 4th floor housekeeper",
      "text": "Nadine was fantastic very nice and friendly anything we needed she there for us .It made our stay very enjoyable.if we are ever back in Toronto we would stay here again because of her.we were here for a wedding, The hotel was a good location for us",
      "rate": 4.0,
      "tripDate": " September 2016"
    },
    {
      "title": "HOLIDAY INN EXPRESS NORTH YORK",
      "text": "We came to Toronto for a wedding and also a mini vacation.   the city is beautiful the people are friendly and the same goes for this holiday inn.  good location, ,very clean, well kept, friendly, good breakfast, comfortable beds, good wifi and most of all a big shout out to nadine, 4th floor housekeeper.  she makes you feel welcome with a  friendly big \"good morning, have a good day\" every day.  her cheerful attitude alone gives us a reason to choose this location when we return to toronto.",
      "rate": 5.0,
      "tripDate": " September 2016"
    },
    {
      "title": "Very comfortable - good value",
      "text": "This was a good location.   Very close to 407 and Finch and hwy 400.  It had free parking which was great for Toronto.  Large selection of breakfast items at their free breakfast.  Free wifi too.  The room had a couch and mini bar frig too.Bed was comfortable with a choice of pillows. Service was quick and friendly.I'd stay there again on my next trip to Toronto.   Recommended.",
      "rate": 5.0,
      "tripDate": " September 2016"
    },
    {
      "title": "Visit to Toronto-good value for the money",
      "text": "When I did my research about where to stay while visiting Toronto, I selected this hotel due to its superior rating on Travel Advisor. My expectations were entirely met. For those desiring to visit Toronto, and stay with family in an affordable but well appointed setting, this is a great choice. The staff were courteous and well informed. Cortney in the front desk was quite helpful in helping us get to the bus stand, bus routes, and subway information, Shri was helpful in providing us with information about where to eat-and when we checked out early, upon our request, provided us with fruits and milk for our long drive back. The breakfast items were plentiful. If you are driving your own car and like to visit Toronto, note that one can get to downtown in about 15-20 minutes (weekends and off rush hours) but it can take up to 45 minutes during rush hour. There are plenty of fast food restaurants and a money changer (Western Union open for 24 hours) in a walking distance of 5-10 minutes. There is a police station next to the hotel, so it is quite safe! The #36 bus route goes up and down Finch Avenue and to the subway station. Again, the travel time is based on the time of the day. We spent three nights and were pleased with the cleaning of the room. The WiFi was mostly OK-no complaints. Overall, a great value for the money.",
      "rate": 5.0,
      "tripDate": " July 2016"
    },
    {
      "title": "Nice",
      "text": "I stayed here with a hockey team. The staff was very friendly, the hotel was nice and clean. There were several teams the weekend we stayed so I would think that others might have been bothered but the staff was amazing to let the kids have fun and hang out.",
      "rate": 4.0,
      "tripDate": " June 2016"
    },
    {
      "title": "You hear EVERYTHING in this hotel & don't get out the blacklight!",
      "text": "I travel 75% of the time for work. No sound insulation! Every breath and sigh, every footstep, every word of every person walking down the hall, you hear in your room. And that is with the air conditioner running in my room..  Wifi was sporadic at best.. Spooky Spots on the upholstery...Ewww! Don't get out the blacklight!",
      "rate": 2.0,
      "tripDate": " June 2016"
    },
    {
      "title": "Not impressed.",
      "text": "I don't like to write bad reviews but I had to this time. I have stayed here twice already and each time there has been a problem checking in. First they did not have my reservation ready and I had to juggle rooms because they had no rooms apparently? The second they lost my companies billing info so I had to \"pre authorize\" my credit card which is not a problem, so I thought. They told me that they aren't going to charge my card but wait for billing info to be faxed in the morning? Well after charging me and my company this is not cool Holiday inn!",
      "rate": 2.0,
      "tripDate": " June 2016"
    },
    {
      "title": "Fair value.",
      "text": "Nice hotel. It’s not fancy but it is functional.It offers open parking and is relatively close to the airport.Good beds and good breakfast.The staff was very helpful and overall the experience was good.",
      "rate": 3.0,
      "tripDate": " May 2016"
    },
    {
      "title": "Medical Visit",
      "text": "I was searching for a reasonable priced hotel in the North York area because downtown hotels are just too expensive. This Holiday Inn Express was the most reasonably priced one in the area.  I have been here several times before. It's pretty well my go to place if I have things to do in downtown Toronto.It has easy access to major highways like 400, 401, 407 and is only 8km from Pearson International Airport, but it's not an airport hotel. The TTC Subway line 1 extension from Sheppard West Station to Vaughn Mills Shopping Centre makes my commute to downtown even easier! The nearest Subway station is now only 3km away instead of the original 10km to Sheppard west Station. Finch West station at the corner of Keele and Finch West. See TTC web sight for more information.The check in at the  hotel was fast and courteous. Parking is FREE! in the hotel lot. Lots of room to park. The wifi is good. The room was exactly what I was expecting. It was very inviting.The AC was not working at first. I looked at it and all it needed was that the plug in for the AC had 2 buttons on the side of it. I pushed one of them. The green light came on and the AC worked. The control panel was on the wall it was easy to operate.The TV was fine. The only thing I found was that the remotes batteries were low. The beds were very comfortable if you like a soft bed. There were 2 lounge chairs and a desk chair with a desk to do whatever work you have to do. Fridge and microwave a big +.The bathroom was very clean and well lighted. There was only a shower, no tub. But the shower could easily fit 2 people....The only things I found were there was a hole in the bathroom door that was previously patched. Could have done a better job and used paint that matched the colour of the door. There were 2 small holes on the back of the door where the hook was. they were not fixed yet. the blackout curtains worked great! The breakfast was typical for a Holiday Inn Express.We were there 2 nights. Over all the stay was fine for us. Actually this was the best stay I have had here!The price was a little high for 2 nights, but it is high season and prices are always higher in the Summer.Do I recommend this hotel? Yes. Would I stay here again? Yes.",
      "rate": 4.0,
      "tripDate": " August 2018"
    },
    {
      "title": "Tranquil HIX with competitive rates ... but in a rough area.",
      "text": "Stayed three nights in April 2018.Pros:+ Rooms recently renovated, up to HIX Canada standard+ All equipped with an HDTV, fridge, microwave, several outlets+ Heavenly beds, quiet hotel, slept great+ Spacious bathroom with decent ergonomic water pressure+ Solid HIX breakfast offering with pleasant staff+ Two business centre PCs with decent speed and 15-minute auto logout to prevent kids from hoarding to play games+ 5-minute walk to bus 36 on Finch, which runs every 10 minutes to the new Finch West station. Then a pleasant 40-minute subway ride to Union. Overall, takes an hour to get downtown using public transit, saving both time & money+ Usually offers very good rates for the GTANeutral:+/- Small windows, but you can open to better regulate room temperature & get fresh airCons:- Check-in slow- No Platinum room upgrade, just the automatic 500 welcome points- Some channels not in HD (TSN etc.)- 1 of 2 elevators not working, lone one working PAINFULLY SLOW. Often used mid-morning by housekeeping/linens/garbage. More than once on a ride with staff how hit EVERY SINGLE FLOOR BUTTON. Spent many slow rides cramped in the corner- Located near Jane & Finch, a notoriously rough area. Don't walk alone here- Nothing of note within walking distance, thus the HIX is mainly a sleeping quarters",
      "rate": 4.0,
      "tripDate": " April 2018"
    },
    {
      "title": "good Hotel, quiet place",
      "text": "It was very clean and nice rooms, with good staffs , cosy place and good value, with free breakfast. for checking we were waiting long time, there were 2 staff with 4 new arrived guest, but we just wait in queue for long time!",
      "rate": 3.0,
      "tripDate": " June 2015"
    },
    {
      "title": "Far Away from downtown Toronto",
      "text": "If your idea is to stay here and visit downtown Toronto, we'd suggest you choose elsewhere.  The hotel is in an area not close to anything, except for the police station next door.The room was small and wifi did not work well.  The room and bathroom were clean and the front desk people were very helpful.When asking about where to eat, we were told that there is a high end Italian Restaurant at the end of the street and about 5 or 10 minutes away, there were other places to eat.  We went down the highway and there was a shopping center or sorts there, but nothing looked appealing to stop and eat.I do have to say that there breakfast room is one of the nicest that I have seen in the Holiday Inn Express hotels.  As a platinum member, Ive been to a lot of hotels where the breakfast room is small, and cramped, but not this one.  Very roomy, it looks quite new and the assortment of breakfast items pleased everyone in the family.Again, if you stay here with the idea of going to downtown Toronto, think again.  On our next visit we will choose a Holiday Inn in the downtown area.  Also the lack of food establishments nearby is another minus.",
      "rate": 3.0,
      "tripDate": " June 2015"
    },
    {
      "title": "Dated; good staff who correct deficiencies quickly",
      "text": "Its been many years since I stayed there last, but the place has changed, and is badly in need of renovations.  We had several plumbing problems during a recent many night stay.  Staff assured us that it would be quickly remedied: and it was!  Breakfasts were okay, but very overcrowded.The room was clean; staff were friendly and helpful.  Their recommendation for a late night dinner location nearby was perfect.Location for us was a compromise, and it turned out to be a good compromise.",
      "rate": 3.0,
      "tripDate": " October 2019"
    },
    {
      "title": "Good Size Room but Dated",
      "text": "We stay outside the city because parking is free and free breakfast.  But this hotel still has crowned breakfast.  If you get there after 8:30, you have to wait for a long time.  The carpet is not very clean in our room and it smells a little.  In general, the hotel is dated.  Location is okay.  Without traffic, 24 minutes to Harbor area.",
      "rate": 4.0,
      "tripDate": " August 2019"
    },
    {
      "title": "Nothing fancy",
      "text": "Very basic hotel, but the room was clean and there was a comfortable bed. Breakfast was decent. Service was ok.Not much in the area for food and shopping, and lots of strange people staying there.one of the elevators was broken.",
      "rate": 4.0,
      "tripDate": " March 2019"
    },
    {
      "title": "YIKES!  Cheap, but you get what you pay for.",
      "text": "Checked in on a cool Toronto evening.  Check in was friendly and swift.  I went to the room and began to settle in when I noticed a big bug crawling up the wall.  I squished it.  I then pulled back the covers of the bed and YIKES!  I was not happy with what I saw.  Called the front desk to get someone up to fix the mess, but they had no staff, so another room was offered.  They said they would give me 1,000 points.  I have not seen these.The back up room was fine.  Breakfast was just ok.  Stayed on 6th floor which is a good idea if you decide to take the risk of staying here.",
      "rate": 2.0,
      "tripDate": " October 2018"
    },
    {
      "title": "Holiday Bin...Express!",
      "text": "This hotel merits a whole new category of rating on Trip Advisor below the terrible rating,  a mere terrible rating would be too complimentary for this hotel horror! I have stayed in a large number of hotels around the world over many years. Many hotels were excellent, some were mediocre, a few were poor but only one hotel can be described as total garbage, the Holiday Bin Express! I cannot think of one positive comment to pass on this hotel. The room itself was ugly, in dire need of renovation and offered hardly any facilities, not even a mini safe or a proper wardrobe. The few facilities that were offered were of unacceptable standards. The air conditioning made a noise like a tractor on its last legs, the curtains were too small for the window and did not block the light or the horrible view from the window,None of the television channels worked rendering the TV of purely ornamental value. The bathroom was depressing and dingy and there was unsightly mould growing on the shower base which looked like some kind of experiment to develop a new penicillin! Our teenage children were staying in another room and their toilet didn't flush properly despite making a non stop noise resembling a small waterfall. Maybe the highlight of our stay or should I say the \" no light\" was the way that the hotel dealt with a regional power cut! No backup generator and a failure to activate the emergency lighting in the staircase meant that the guests had to dangerously navigate flights of stairs in total darkness; this typifies the appalling low standards this hotel has set for itself. The front desk administration followed the lead of the awful state of the hotel itself. Our credit card was blocked in the amount of $800 when we arrived as a condition of our stay although I'm not quite sure what it was meant to cover; possibly the value of the whole hotel itself in its current state!! When I checked out I was told that the receipt was given to my wife who was outside in the taxi at the time which was taking us to the airport.It was not given to her.Fortunately I asked the front desk to email me a copy of this receipt which they confirmed they would do.Unfortunately they have still not done so despite the fact that 4 days have passed since we checked out of the hotel. We originally booked this hotel largely because of its proximity to Canada's Wonderland. It is actually not that near, about a 15 minute drive away and there are a number of hotels which are much nicer and nearer.Interestingly it is no longer mentioned on the Wonderland website. On the other hand if you want to experience Canada's Horrorland, this is the hotel for you!",
      "rate": 1.0,
      "tripDate": " July 2018"
    },
    {
      "title": "great hotel-very accomodating",
      "text": "We booked this hotel through hotels.com who informed us on the phone that we would get an airport shuttle and parking for the week was free, we therefore booked a hotel the night prior to flying out for holiday and the night of return. Upon getting to the hotel, we were informed there is no shuttle or parking for the week. HOWEVER, even though we had not booked directly through Holiday Inn Express they ensured that we had a van to take us to the airport and they allowed us to park our vehicle for the week free of charge. KUDOS to Holiday inn express--this is one of our favorite chains for this reason!",
      "rate": 5.0,
      "tripDate": " March 2017"
    },
    {
      "title": "Disaster in the lobby",
      "text": "I just stayed at the Holiday Inn on Norfinch . I am totally disappointed in the lobby manager and counter staff. I had questioned the counter rep and when she could not respond she said as she rolled her eyes that the other guy can help. When the shift manager with the dred locks attended.  He could not answer.  He treated us like kids. He used Walmart in reference to our request.This hotel was always in a rough state. They upgraded most of this location.  Look OK.  Breakfast is OK.  But I think the staff needed a change up. 2 stays in 2 months. Both very disappointing.",
      "rate": 1.0,
      "tripDate": " March 2016"
    },
    {
      "title": "Hassle",
      "text": "I paid cash for my room and yet the hotel still took the money off my credit card and it has been a huge hassle to get my money back. Interest Free loan or what??? I am very disappointed in this hotel for billing me twice for the room and deposit. I stayed at the hotel once and was billed twice and now it's a huge ordeal to get my money back. They said it will take ten business days which is unacceptable in my book and I will not be staying at the hotel again. I do not recommend it to anyone .",
      "rate": 1.0,
      "tripDate": " July 2014"
    },
    {
      "title": "Do not recommend staying at this Holiday Inn!",
      "text": "Me and a couple friends decided to stay at this hotel to attend a local 2 day festival. When we returned to the hotel room the 2nd night we found that the room was not cleaned and no towels were replaced, The house keepers left an empty pizza box and didn't empty any garbage bins in the room. didn't even make the bed, and did not replace any dirty towels. When it came time to check out I was told I would have to pay $25 EXTRA because we left the room \"dirty\".  The only reason the room was dirty was because the house keepers didn't clean the room. Didn't pay over $500 to have to make my own bed. My friends and I will NEVER return to any holiday inn. Staff was rude and disrespectful towards us.",
      "rate": 1.0,
      "tripDate": " August 2015"
    },
    {
      "title": "Worst Holiday Inn",
      "text": "I have been to several Holiday Inns for work and sometimes while on vacation.  Usually it's a pleasant experience.  However this place was elbow normal Holiday Inn standards.  The room is not inviting, very unhappy guy at the rece",
      "rate": 2.0,
      "tripDate": " August 2014"
    },
    {
      "title": "Lazy Housekeepers",
      "text": "Hotel was nice.. front desk staff was very friendly and helpful, however on our 1st out of 3 days we left around 12:30pm for a festival, we left a note on one of the beds for the sheets to be changed. Later that night, we got back and noticed the housekeeper did not do anything to the bed, she left the blankets and sheets balled up in the corner of the bed.. she didn't even vaccum the floor. The only thing she did do was change the garbage bags and new towels. Very disappointed. Second day we didn't even bother taking our do not disturb sign off since it was pointless. Not happy with the housekeeping.... will not return to this hotel.",
      "rate": 2.0,
      "tripDate": " August 2015"
    },
    {
      "title": "Newly Renovated.....too bad they did not reno their price!!",
      "text": "Overall this hotel is very nice, newly renovated and the staff does an okay job at ensuring comfort. Sadly, the best western right next door is the same price for a suite than this HINN is for their basic room.I was very mad that this hotel would not help us when we were constantly disturbed by running children up and down the halls at 2. 3 and 4am. We struck back by taking more than our fair share when leaving the hotel...immature of us but good luck replacing those bed linen!!Their breakfast bar/buffet is okay (I suggest giving the pancakes in under a minute machine a try).",
      "rate": 2.0,
      "tripDate": " May 2015"
    },
    {
      "title": "Need to see when the work are over",
      "text": "Unfortunatelly I have been here during work in progress, they mare making some changes so you may have some difficult to walk in and out due to works .Frankly speaking I have been disapointed , normally I fully trust Holiday Inn , in my opinion the price during this period should be much cheaper because customer they have problem , during brekfast is not even think about you get food in one room and walk out in a full of dust corridor with your dishes and go in another room (where i smelt also cigarette ..probably from worker ) , this really disapointed me because I paid normall price (120$ daily ) and Hotel is under work .No gym awaillable , the room are ok , big and clean and ethernet is very fast but you must be aware that cannot keep the light on in the bathroom ( the fan is too noisy ) so I don't want to give a 0 stars but they must improve a lot",
      "rate": 2.0,
      "tripDate": " April 2015"
    },
    {
      "title": "They false advertise Free Parking at Canada's Wonderland",
      "text": "When I checked in I asked about the \"Value added Free Parking\" they advertised for Canada's Wonderland.  It costs $20 normally to park there.  The front desk said that wasn't included in the package I got.  So I asked if I could switch packages and give up my \"Free Shuttle\" for the free parking.  He said \"Sure, its $25 more.\"  So how is that FREE?  Its not only NOT free but $5 MORE than Canada's Wonderland charges.  I argued the definition of free for 10 minutes and then asked for the manager.  \"He wont be in for 3 days\". WOW. Ok so I called back after 3 days.  The manager (the same gentleman that responds to these reviews) said the clerk was right.  Finally after arguing the definition of FREE for 10 more minutes he says \"You wouldn't even know it was more if you didn't try to switch packages and anyway its the end of the season\".  So that's what kind of customer service to expect.  Also they rejected my review on there sight for no valid reason.",
      "rate": 1.0,
      "tripDate": " September 2014"
    },
    {
      "title": "Small rooms, poor service",
      "text": "I would like to give it 3 stars but was just so disappointed with the service it gets just 2.Usually the HI express has decent sized rooms, these were tiny by comparison. As a gold member, I had asked for something larger and was told they are all like this?!Offered to pay more, (should get an upgrade due to status) but was told that's all they have.Neighborhood was not great either. It was close to a business I was visiting, but I think the value is better closer to the airport.",
      "rate": 2.0,
      "tripDate": " March 2016"
    },
    {
      "title": "Awful experience - not worth even considering it",
      "text": "We´ve stayed in other HIE, with an overall good experience, but this was horrible! We arrived at the hotel at night and the first shock was the strong ashtray stink in our room. It smelled like people had smoked ten packs in there, even though it was a smoke-free hotel (we later found out that we were the seventh person that day to complain about the cigarrette smell)We asked the staff to give us another room, but they told us they didn´t have another one in the same category. We had paid for a King size bed room, but they gave us a much smaller room in return. Breakfast was also terrible, but the worst of all, was the really bad disposition of the staff, they just don't care. We paid US120 for the room, but for the same price you can do a lot better.",
      "rate": 2.0,
      "tripDate": " June 2014"
    }
  ]
}