{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Holiday Inn Toronto-Airport East, an IHG Hotel",
    "url": "/Hotel_Review-g155019-d181988-Reviews-Holiday_Inn_Toronto_Airport_East_an_IHG_Hotel-Toronto_Ontario.html",
    "priceRange": "$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.5",
      "reviewCount": 512
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "600 Dixon Road",
      "addressLocality": "Toronto",
      "postalCode": "M9W 1J1",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2c/02/6a/1f/welcome-to-our-hotel.jpg?w=500&h=400&s=1"
  },
  "description": "Welcome to Holiday Inn Toronto Airport East strategically located just minutes away from Pearson International Airport. Enjoy our complimentary 24-hour airport shuttle. Just moments from major highways, the hotel provides easy access to downtown Toronto and business centres making it an ideal choice.  The Toronto Congress Centre is a 5 minute walk with the Toronto International Centre a quick 10 minute drive.Explore local attractions such as Sherway Gardens Mall, The Paramount Fine Foods Centre, Canada's Wonderland, Woodbine Racetrack & Slots & LEGOLAND Discovery Centre,. Relax in one of our 192 oversized guest rooms, featuring a mini fridge and microwave (upon request), executive workspace with ergonomic chair, pillow top mattress, duvet, and selection of firm and soft pillows. Kick back and watch TV on our 50\" flat screen HD TVs or surf the Internet with our complimentary state-of-the-art fiber optic Wi-Fi.Start your day off right with breakfast in the hotel.",
  "featues": [
    "Valet parking",
    "Free High Speed Internet (WiFi)",
    "Fitness Center with Gym / Workout Room",
    "Pool",
    "Restaurant",
    "Free airport transportation",
    "Business Center with Internet Access",
    "Conference facilities",
    "Paid private parking on-site",
    "Wifi",
    "Indoor pool",
    "Heated pool",
    "Vending machine",
    "Free shuttle or taxi services",
    "Airport transportation",
    "Shuttle bus service",
    "Car hire",
    "Banquet room",
    "Meeting rooms",
    "Baggage storage",
    "Gift shop",
    "Newspaper",
    "Non-smoking hotel",
    "Shops",
    "ATM on site",
    "24-hour front desk",
    "Dry cleaning",
    "Laundry service",
    "Self-serve laundry",
    "Ironing service",
    "Allergy-free room",
    "Air conditioning",
    "Housekeeping",
    "Room service",
    "Safe",
    "Flatscreen TV",
    "Non-smoking rooms",
    "Suites"
  ],
  "reviews": [
    {
      "title": "Staff was very helpful advising where to visit in the city and how to get there. Attentive to our needs. Shuttle availa",
      "text": "Staff is very attentive to our needs. We arrived late at night. Room was clean.  Bed was comfortable Helpful in directions to the city of where to go in short time. Shuttle available from hotel to the airport which we needed. Coffee available in room using a Keurig",
      "rate": 4.0,
      "tripDate": " May 2023"
    },
    {
      "title": "Quarantine stay with kids",
      "text": "Pros: The staff was excellent: really friendly and accommodating. They gave us a room with access to an outdoor courtyard, which was really helpful for the kids. The room was comfortable and mostly clean (we found a couple of long black hairs in the bathroom that did not belong to us). Cons: Only two but big ones. Sorry Perkins, but we found the food pretty gross and the restaurant customer service average. I was initially happy to see kids meals offered but then disappointed that they were so unhealthy. For example, there were 4 types of sugary pancake options and the macaroni cheese was like kraft dinner. The adult meals were a bit better but not much. Where were the healthy options? Even the salads were 90% iceberg lettuce. Each meal seemed to be layered in grease or processed. The first day of quarantine food was good but after 2 meals we couldn't stomach it anymore.",
      "rate": 3.0,
      "tripDate": " June 2021"
    },
    {
      "title": "Holiday Inn Toronto Airport East",
      "text": "After arriving in Toronto on Jan 05/22 at 7:30 AM from Fredericton, NB, I made a quick call to Holiday Inn Toronto Airport East while at the luggage carousel at YYZ & asked if it was possible to get an early check-in.They quickly accommodated my request and in no time, I was able to lay down & relax after 48 hours without any sleep. In addition to the prompt customer service, they also assisted by delivering my lost luggage to my room.I did have a slight glitch with the wi-fi, but when I asked for help at the front desk, they quickly showed me how to navigate the system.After I checked out, they also provided me a quiet place where I could work until I was able to get a ride home.To everyone at Holiday Inn, thank you for all of your help!",
      "rate": 4.0,
      "tripDate": " January 2022"
    },
    {
      "title": "Very unreasonable",
      "text": "We had planned to stay at the Holiday Inn for a night during a stopover in Toronto while on vacation. Unfortunately our travel plans changed due to the winter storm that affected flights into Toronto but the hotel manager refused to allow us to change our reservation and insisted on charging us for the night we were unable to use. Very unreasonable to deal with if you ask me. We won’t be staying there or any other Holiday Inns in the future as a result of this and would not recommend it to anyone else either.",
      "rate": 1.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Horrible hotel. DO NOT STAY EVER, pay more if you want a pleasant experience",
      "text": "First of all, I checked into the hotel at 12:30 at night because of a late flight. The hotel management took forever to check us in, when were super tired and wanted to sleep. He was taking a long time on the computer (other hotels are very quick) and started asking us if we want a Holiday Inn account, we said we used to but we don't normally stay at Holiday Inns so we weren't interested that much, he proceeded to ask for contact info to check if we have an account, he was searching for our account for a long time and realized that he couldn't find it. The check-in process probably took 20 minutes in the middle of the night. When we wake up in the morning and start getting ready for breakfast, the fire alarm goes off in the whole hotel but there was no fire. I went to have breakfast and there was another false fire alarm that lasted a bit. Hotel management didn't even apologize. Hotel management was also super rude. When I came back to my room after a day of sightseeing, my room wasn't even cleaned even though there were a lot of housekeepers with their carts in the hallways. My towels were on the floor and my trash was overflowing. In the 4 nights I stayed, nobody ever came to clean my room even though they were all working in the hallways. I went to the front desk to complain and he didn't even apologize, and then he sees the housekeeper by accident and tells me \"Oh, go talk to him\". No sense of manners at the front desk. Next, the Perkins restaurant was AWFUL. It took FOREVER for them to cook my food even though there was absolutely no line, only a few tables here and there. When they came to take my order and I requested water, it took them 20 minutes just to bring water (other restaurants do that right away even if its busy, but it was empty). Since the water was 20 mins, I waited 1 hour for my food. In addition, the waiter wanted to seat us at a dirty table with salt. By the way, when we came to the restaurant, the floor was dirty with scraps and wrappers. When I would come to the restaurant, tables were empty with all the leftover dishes and cups, and when I left after my dinner, those tables were still the same with all those plates. Absolutely no service at this restaurant. some of the waiters kept arguing with me and changed their policies on the meal voucher that I got from the hotel. the meal voucher was a joke, I still had to pay for my food. Shoutout to Travis, that was the only waiter that was attentive and helpful. Other than that, I paid USD $180 a night to stay here and it was not worth the money for the trashy customer service.",
      "rate": 1.0,
      "tripDate": " July 2022"
    },
    {
      "title": "excellent customer service",
      "text": "We have stayed at this property many times, usually before an early morning flight to a sunny destination. This hotel offers everything you could want, comfortable, spacious, scrupulously clean rooms, beautiful heated pool, restaurant and bar on site. It has been recently renovated to a very high standard. However given all that the main reason for my review is the excellent customer service we received from the manage Shivant, he far exceeded our expectations with his professional, friendly manner to make sure we had everything we needed. I would not hesitate to recommend  this hotel to anyone and for sure we will stay  there again before our next flight in November. thank you again to Shivant and all the staff...........",
      "rate": 5.0,
      "tripDate": " May 2022"
    },
    {
      "title": "A night of respite",
      "text": "Due to an airline’s ineptness, we were placed at this hotel. I hadn’t stayed at a Holiday Inn in a long time but i was so happy to have stayed here. We were feeling super bummed on missing a day of vacation, but the front desk staff ( I wish I could remember her name ) was so nice and helpful. The room was super clean, comfortable and well appointed. The shuttle drivers were very helpful as well and we were so happy to have such a nice Canadian experience.If you find yourself here, know you’re in good hands!",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Dirty, run down room",
      "text": "I stayed 5 nights at this Holiday Inn airport east. It looks like they may be building an addition or replacing the current hotel which was built in the 70’s or 80’s. With some updates this older hotel is the definition of lipstick on a pig. I was able to check in early which was a plus as I arrived to the hotel at 1:30pm. I found my room to be tidy but unclean. There was dirt on the carpet, black hair stuck to everything and a used q-tip on the bathroom floor. The over all room condition was poor. Mismatched damaged furniture with cigarette burns in multiple places. I received new towels once during my stay and on the third day the house keeping took away my face cloths and didn’t replace them. I also ran out of toilet paper which they didn’t replace. I called down to the front desk and they said they would bring it up but never did. I had to speak to a cleaner in the hallway who gave me some. Not to mention the room smelt like stinky gym shoes. The fitness facility was average. Lots of cardio machines and weights. But again cleanliness was an issue. There was no cleaner to wipe off the gym equipment after use, no towels and no fan. I made mention to the front desk staff there was no cleaner for the equipment on my first day but I worked out other days and they never added any cleaner to the room. I guess this place is fine if you need to spend one night or a place to stay before catching a flight but I wouldn’t recommend it otherwise. I personally wouldn’t stay here again.",
      "rate": 2.0,
      "tripDate": " April 2024"
    },
    {
      "title": "do not recommend",
      "text": "I would not recommend this hotel to anyone. The location is great but that is it.Our first room had a broken loud fan on the furnace. The next room had half empty bottles of water, no TV remote and a broken shower.  My daughter in another room needed a crib which they  knew about. When it wasn't delivered  she tried calling down the the desk and her phone didn't work. She found out the front desk knew this because they tried calling her to say there were no more cribs. They didnt send anyone to tell her in person.? They also messed up our parking. The end",
      "rate": 1.0,
      "tripDate": " January 2020"
    },
    {
      "title": "this is a review for the booking experience",
      "text": "I booked the quarantine stay here for my parents for the very near future.I must say, Nadeen was INCREDIBLE !I called so many hotels before to ask and inquire, they all lacked the care, efficiency and experience.I explained how my mother is claustrophobic and how we need a window that opens and preferably a sliding door. She immediately booked me a ground floor room with sliding doors. This meant the world to us!Out of all the other government approved hotels this one shows the most care and understanding for the quarantine clients, allow for walks around the property and much more. who ever the manager there is, you are doing great! and Nadeen was such a sweet fresh breeze on a hot and complicated day.Thank you, we look forward to my parents stay!",
      "rate": 5.0,
      "tripDate": " July 2021"
    },
    {
      "title": "Stuck in Toronto weather",
      "text": "After a stressful 3 hours of sitting on plane and then told flight cancelled. It was so refreshing to speak to Saed the desk clerk. He thoroughly welcomed me, gave me an upgrade and went over all the amenities. Asked if I required a wake up call and thanked me for being a loyal customer. The food was very good.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Good Night",
      "text": "Stayed the night before our trip and also the night returning from our trip, the staff  are pleasant and helpful, the rooms were lovely and clean, the bed comfortable. The shuttle was prompt and convenient. Several good dining choices within walking distance. We would definitely stay at this property again",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Avoid",
      "text": "This was the hotel selected by Air Canada after a missed connection. We shuttled over from the airport and the appearance was bad from the outside and entry. Check in was slow. The room was semi-clean and in a poor state of affairs.  One of the two beds were broken but after a long day of travel we were too tired to dispute the issues. I would avoid this hotel as there are other better options nearby.",
      "rate": 2.0,
      "tripDate": " June 2024"
    },
    {
      "title": "My worst ever Holiday Inn Stay",
      "text": "Visited Toronto on a business trip and stayed 3 nights in this Hotel.Looked ok for the purpose, near to the Airport and easy drive to the City. Basic.On the second night a group of over a dozen people arrived and simply made a party until 5:00 AM, despite all the complains, the Hotel management was useless.Empty bottles on corridor floors, they smoked in the corridors, party loud, even blood was already on corridors... nothing... Called the reception several times and no one answered, come down to the reception for 5 occasions and nothing changed. Full disrespect... I can say I was victim of Racism by the Hotel management.",
      "rate": 1.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Great place to stay.",
      "text": "I stayed here for 30 days & the staff is fabulous. They are on top of cleanliness and the amenities are nice. I recommend  and family to stay there. Management was very professional and had a great sense of humor. All around a great experience. Great Team!!CheersMichelle",
      "rate": 5.0,
      "tripDate": " September 2023"
    },
    {
      "title": "Nice Rooms Shuttle Service horrible",
      "text": "The rooms are nice and clean. Having Perkins restaurant on site a bonus.However the Airport Shuttle is not so good. 45minute turn around. When waiting at 130 am and not coming till 220am after a phone call at 2am. Saw every other hotel shuttle twice before we even had one come. Not impressed.",
      "rate": 5.0,
      "tripDate": " March 2017"
    },
    {
      "title": "Hotel not bad , restaurant poor...parking a total rip-off",
      "text": "Stayed for 5 nights in this hotel. The toilet was blocked as soon as we arrived. The pool looks nowhere near as good as the photo. The restaurant was poor and grubby. wine was totally over priced even for Canada. Room was ok if a bit noisey as was near the airport. Staff on the desk are less than polite as has been reported several times. The parking was a complete rip-off , they charged us for parking outside a Perkins Restuarant in a public carpark even though my booking said that all charges and fees had been paid. The staff were rude would not listen and called me a liar. $70 to park in a public car park is a rip-off. Dont stay here if you can find somewhere else.",
      "rate": 2.0,
      "tripDate": " July 2012"
    },
    {
      "title": "Not up to par with other Holiday Inns",
      "text": "We on an overnight stop-over so we chose this hotel as it was listed as close to Toronto Airport and we only needed an average quality hotel for a decent night's sleep.  Getting to the shuttle wasn't a good start.  We phoned the hotel to ask where to meet the shuttle and were told to ask someone at the airport - the front desk could have told us to go down a floor from the international arrivals level, as the Commissionaire we had to ask did.  The shuttle is contracted out and runs every 30 minutes; the driver insisted everyone had to be seated so it was lucky that the two extra people were able to squeeze into seats together, and yet even though we were overfull the shuttle still went to Terminal 3 before taking us for a much longer distance than the hotel website indicates it is from the airport.  In retrospect we should have taken a taxi instead, although the shuttle back to the airport was quick and easy.Check in was slow but friendly.  We were given a room on the \"business floor\", as we had reserved.  The hotel layout is odd; two floors at the lobby and pool area, with the main tower at the far end.  The corridor was hot and had an unpleasant odour.  We had to navigate around a group of teens roaming the hallway and put up with the elevator - which is a long walk from the lobby - stopping at every floor because the teens who exited as we entered had pushed the buttons for every floor.  The room was tidy but the carpet looked and felt grimy - thankfully we travel with hotel slippers.  The room temperature was extremely hot, making for a sweaty night's sleep.  There was virtually no air flow from the AC system so we had to resort to sleeping with the window open; fortunately air traffic stops between midnight and 6am, otherwise the noise wouldn't have made that an option.  The attached Perkins restaurant is open 24 hours, which made getting a meal easy; the food and service isn't high quality but it is adequate and inexpensive.I've stayed in many Holiday Inns and this one wasn't quite up to snuff.",
      "rate": 2.0,
      "tripDate": " July 2012"
    },
    {
      "title": "Superb Stay, Park and Fly Hotel...",
      "text": "We had the opportunity to stay at the Holiday Inn Toronto Airport  East Hotel on 9 Apr 12.First off, easy to find and easy to drive to; we live in Barrie but arrived via Ottawa.Second, AND the most important, the parking is ON-SITE and NOT on another far-away parking lot, it was very pleasant to park for the week, bring your bags into the room, and depart via the shuttle without any hassle, TY Holiday INN!Third, room was beautiful, very well renovated, you should have zero negative feedback about these rooms. Very comfortable beds, large bathrooms with plenty of hot strong water showers, and room service and front desk service above-average, seriously. Oh, and if you are not in the mood to drive around the Toronto Airport area, do yourself a favour and order up the pizza from room service! We ordered this 'pizza' service twice in the same night and believe me the pizza delivered hot and fresh at our door probably surpassed most pizza places I know! Delicious!There WAS a coffee maker in the room, bonus for a 2am cup of java.But there was no fridge in the room so the beer had to be put into the bathroom sink, with plenty of ice, to keep cold until the pizza arrived, no big deal!Front lobby check in was a bit bizarre if you were on the 2nd floor, since you have to walk the length of the hotel to find an elevator,or hump or bags to the upper floor; usually the elevator is right beside the lobby, different here but manageble!Rooms were comfortable and clean, but the signage in the hotel could use an update, they were a bit confusing unless you took the opportunity to walk around BEFORE you actually wanted the convenience shop or pool area.Transfers to and from the airport are timed and they stuck to the times.All in all an excellent value for those individuals travelling to Southern Destinations and looking to minimize the affect of a 625 am flight, hence the 4am departure.GREAT VALUE!",
      "rate": 5.0,
      "tripDate": " April 2012"
    },
    {
      "title": "ONE OF THE WORST HOTEL EXPERIENCES, EVER!",
      "text": "Easily one of the worst hotel experiences I’ve ever had.  We actually checked out a day early even though it was pre-paid.  Needless to say, there was NO credit applied and I’m afraid I’ll be fighting that refund battle for months to come.  We frequently stay at Holiday Inns – they are moderately priced and usually good value for the money.  But that was NOT the case in their Toronto “Airport East” hotel (note there are two Holiday Inns near the Toronto airport – this review refers to the “Airport East” hotel).  Here is a list of the problems we encountered in only two days/nights there  --* Hotel-wide Power outage: we spent ½ day in the dark.  The hotel turned off the power to the entire building (for “maintenance” caused by “storm damage”) one of the two days we spent there and the power was off for ½ the day.  The hotel did not even have emergency lights in any hallway.  All but the main hallway were pitch black and we navigated by cell phone. Is that even legal?  Aren’t there fire laws in Toronto?  Unfortunately, that was a day we had planned to stay in our room for most of the day (for reasons that would take too long to explain).  We spent the day with no power, no air, no lights, no TV, no Wifi, etc. … with no prior notice or apologies from the hotel.  After the fact, they claimed they had called all the rooms to warn then – we got no such call and spoke to other guests who also received no prior notice of this power outage.  The only notice we saw (about ½ hour before the power was cut) was a small sign typed on 8 ½ x 11 paper, taped to one of the side doors to the parking lot.   Their restaurant was closed, needless to say, during the outage.* Bugs:  Bugs on the floor, bugs flying around the room.  When I spoke to the front desk about it they said “that’s because we are on the first floor”.   Seriously.  * Room not secure:  First floor room door to the outside was not secure – this “patio” door to the outside did not lock properly.  There was a double sliding glass door – one locked, the other didn’t.  * Key Cards did not work: Speaking of poor security, I had to have each of our two key cards changed four times in two days.  Literally every time we got back to our room, one of our key cards did not work and one of us had to go all the way back to the front desk to have a new one made.  This is a large, sprawling hotel – the walk to the front desk was about 3 city blocks long (that’s mentioned in several other reviews of this place).  That got old … fast!  * Carpeting wet:  There were wet spots all over the carpeting.  This was a “Pet room”. We had one of our dogs with us.  We have traveled enough with dogs over the years to know that hotels always put you in the “pet rooms” when you bring a dog.  I don’t expect perfection in a pet room but this was gross -- our dog’s incessant sniffing told us what the wet spots were.  (no, he did not make the wet spots; they were already there…).    * Hairs in the bed: The only good thing about this hotel was that the beds were comfortable.  However, there were long dark hairs in the “clean” white sheets in the bed.  Nasty.  * Mildew: The entire hotel reeked of mildew and/or room freshener spray – the kind of stuff that’s sprayed to cover the small of mildew!* Poor quality WiFi:  The front desk gives you a WiFi login with your key card when you check in.  Seems great but the WiFi is so poor it only shows up with one bar on the WiFi icon on your phone most of the time, if at all and every time it goes out you have to log in again.  The Wifi was so bad that my phone kept reverting back to cellular and since I’m from the U.S., those Canadian cellular roaming charges can add up.  Of course, during the ½ day the power was out there was no WiFi at all.  Can’t wait to see my cell bill after all of this!  * Ripped off for parking:  When we checked in they told us the refrigerator was complimentary (it was) and so was the parking (it was not).  Parking was charged at $12.39 per day.  What hotel … especially an airport hotel … charges guests for parking?  Even hotels in midtown Manhattan that have their own lots comp their guests’ parking!  * Non-responsive surly front desk:   It started with a request for a refrigerator.  When I booked this hotel I called them directly to request a small refrigerator in the room for medication (I called the hotel to see if they had mini-bars; they did not so I requested a small refrigerator).   When we checked in, I reminded them of the request and was told it was already in the room.  It was not.  When I called the desk from the room about the refrigerator, they were surly, saying “I told you it was coming, why are you calling?” and I was told to “be patient – it will be there”.  Actually they didn’t say it was coming when I checked in – they actually said it was already there or I wouldn’t have wasted my breath calling the desk.  It arrived about a ½ hour later.  Fortunately the small cooler bag the medication was in had retained its chill or we could have had a major problem.  Read on about other episodes with their front desk –* After five hours without power on the day they cut the hotel’s power I went out to the desk to ask when power was being restored.  The two men behind the desk claimed they knew nothing and that I should “ask her”, pointing to a woman in a Holiday Inn uniform standing in the lobby surrounding by people complaining.  All she could do was say over and over again that everyone had been notified by phone of the outage (as if that made it OK) which we were not.  * When we checked out a day earlier than planned because of how horrendous this place was, they refused to credit us for the day … they refused to do just about anything.  They were surly and generally unhelpful.  Note that I never saw the same person at the front desk twice in the two days I was there.  Yet all had just about the same degree of surliness.  * Note: this hotel is obviously a Holiday Inn franchise and it seems to commonly respond to complaints made in online reviews.  Now that I’ve stayed there, I believe every negative review but not any of the hotel management’s defensive posts.  No doubt they’ll respond to this review as well.",
      "rate": 1.0,
      "tripDate": " August 2013"
    },
    {
      "title": "Ok hotel but pricey",
      "text": "Too expensive for what it offers. We paid $302 for a room with double queen bed for one night. It is close to the airport, but the facilities are just average. Lobby is small. There is shuttle service to the airport. There is a restaurant annexed to the hotel. They charge $50 for early check-in. Staff was generally nice but there was a female desk clerk who seemed annoyed that we cancelled our early check after she had charged my card.",
      "rate": 3.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Overall would not recommend",
      "text": "Room smelled like stinky feet. Bed was comfortable but very expensive for what we got. Lots of noise overnight.Restaurant was overpriced and food not great quality especially the deserts terrible. Overall will not stay here again.",
      "rate": 3.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Great stay",
      "text": "This hotel was very good. It was recently updated and the rooms are very spacious and clean. The staff are also very friendly and accommodating. Some rooms are very far away from the front desk but nothing crazy. Just need to ask for ones closer to the desk. The attached restaurant was decent but extremely high prices. The beds are great here. I will stay again!",
      "rate": 5.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Good. But long shuttle.",
      "text": "Nice and clean room. Fully renovated. My only issue was the free airport shuttle, maybe i wasn’t lucky, but I waited over 45 minutes at Pearson for the shuttle to arrive. Other hotels shuttle kept coming but not mine! The next morning shuttle was scheduled at 5:35 but only arrived at 5:40, it’s okay i mean but in this business being on time is a must.",
      "rate": 4.0,
      "tripDate": " November 2021"
    },
    {
      "title": "Convenient",
      "text": "Stayed over night before heading to Pearson on vacation. Pleased with the newly renovated room. Check in was easy and all staff we encountered were friendly. We took the shuttle to and from the airport. Overall convenient and positive experience. Good place for a quick overnight stay before a flight.",
      "rate": 4.0,
      "tripDate": " January 2020"
    },
    {
      "title": "stayed after and before flight back home to BC",
      "text": "Comfortable rooms, restaurant on site, friendly lounge. Only thing is that I have a disability and it was long trek to my room. I tried to get a room closer to lobby but I couldn't be accommodated. I will consider staying here again if I find myself back in the area.",
      "rate": 4.0,
      "tripDate": " September 2021"
    },
    {
      "title": "Disgusting",
      "text": "The staff was very rude petty and ignorant to me. The floor was dirty when I checked in and so shower was dirty with hairs from the last customer who stayed. Very disgusting. I had asked for a late checkout and they told me it was okay. Then when it was time to check out, they told me that I never asked, which is a lie and took my deposit which is very unfair very rude, petty and ignorant. This place was a waste of my money. Don’t come here.",
      "rate": 1.0,
      "tripDate": " March 2024"
    },
    {
      "title": "Overnight stay",
      "text": "We stayed at the hotel  the night before our flight to punta Cana. Hotel staff were great and they gave us the rooms on the ground floor as requested.  Rooms very clean and bed very comfortable. Airport shuttle service was great and when we returned the staff again was very nice.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "👌🏻👌🏻👌🏻",
      "text": "Stayed there for a night before flying to the Bahamas. They provided airport pickup and drop off which is definitely a plus. The room was fairly consider its an airport hotel. Didn’t dine in, so I cannot comment on the restaurant, overall it’s good.",
      "rate": 4.0,
      "tripDate": " December 2019"
    },
    {
      "title": "Good but noisy",
      "text": "Overnight in Toronto (Westjet voucher). Great rooms. Comfy bed. Friendly staff. We had a large room on the 5th floor. But very noisy (corridor and planes) ... so spleeping is so so. Perkins restaurant in building",
      "rate": 3.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Randomly cancelled days before flight to Canada during covid. Much stress",
      "text": "I was naturally somewhat nervous about my trip, lots of bookings and requirements for my travel to Canada due to covid. I had booked the three day mandatory hotel quarantine at the holiday Inn at toronto airport yet when I wake up this morning (3 days before I am due to travel) to find an email that my booking for this hotel had been cancelled, with no explanation and no possibility to rebook I was a little stressed and annoyed to say the least! I called and nobody answered. I emailed and nobody responded. I had to frantically look for another acceptable hotel to quarantine in, change all of my documents and legal requirements to my new hotel booking, which btw I was VERY lucky to get without spending half my bank balance at the Hilton. Very disappointed and made me very stressed. An explanation or reason, response or compensation would have been very much appreciated, but alas that standard room was not to be mine.",
      "rate": 1.0,
      "tripDate": " April 2021"
    },
    {
      "title": "Stay Clear- Not Good Service",
      "text": "This hotel does not represent the Holiday Brand.  The management that run this place are a joke.  It is so cheap on service that we could not get even an envelope.The rooms are fixed up, but no glasses, no coffee, and the bath tubs are dangerous.The shuttle service is fake, belongs to the airport. Could not get any help at 3am when trying to get to the hotel.  This hotel gives the Holiday Inn a bad name.  The front desk is a joke, no one ever answers the phone, and do not believe them when they tell you about long term parking, we left our vehicle in the parking lot, no security. You will be stuck paying for a service that does not exist.  We were lucky, nothing happened to our car.  Chose carefully, it is not always about price...",
      "rate": 2.0,
      "tripDate": " July 2022"
    },
    {
      "title": "One overnight is OK",
      "text": "We usually booked hotels at Markham when visiting our relatives in Toronto as they live nearby. However, the Homewood Markham we stayed before was so wear bad that we had to cancel our 2nd night. It was hard to believe all decent hotels sold out at our 2nd night that we found this HI was still opened. This is new and clean which we appreciated. But don’t be surprised to heard airplanes departure and landing as this was airport hotel. The soundproof was acceptable standard.  The downside was the $20 parking fee. It was at no where but charged us almost the same rate as Hilton Quebec ($22) at Quebec downtown!",
      "rate": 3.0,
      "tripDate": " May 2022"
    },
    {
      "title": "Touring Toronto",
      "text": "Regular shuttle to and from airport. Shuttle driver very helpful in giving tips on how to access union station transit to and from downtown. We arrived early and they accommodated us by allowing us to check in. Room was spacious and clean. Small lounge on site for drinks from 5 to 11.  Restaurants within walking distance. Pool and green space available to enjoy.",
      "rate": 5.0,
      "tripDate": " August 2022"
    },
    {
      "title": "AMAZING SURPRISE",
      "text": "I booked this hotel for my parents 3 nights quarantine and 1 night for me.  To be honest, they surprise me how organized they are to deal with this situation and how they treat us.  Julie at the front desk was very informative and kind,  she explained to me step by step what we have to do during our stay.   Marc was very diligent as well.  Good job guys.  Under the actual circumstances, I was not expecting good food, but again they surprise me. The food from the hotel restaurant (Perkins) was excellent,  and every meal was served on time.  The hotel was renovated recently so my room and bathroom were in excellent condition.  Pros: Rooms,  Service, Food.  Cons:  $20/night for Parking, but this is Toronto, so nothing is free.",
      "rate": 5.0,
      "tripDate": " May 2021"
    },
    {
      "title": "Hotel Airport. Customer Service-1  Cleanliness -0",
      "text": "We arrived late due to a delayed / lost luggage flight situation. The condition of the property is nice upon entry, friendly guest service agent- knowledgeable. Appreciated his recommendation to be down early for the shuttle. Did not appreciate the rattle of the AC unit all night, the cleanliness of the room ( see photos). Poor condition. If it wasn't so late, we would of approached the desk and asked to be moved. That's how bad the room condition was. I know a lot of the clientele are airport, this still means cleanliness needs to be a priority. Management should take a closer look at the condition of the rooms before putting it in clean.  Your guests are spending hard earned money.",
      "rate": 2.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Average but Ok",
      "text": "Average room in average Holiday Inn.  Gentleman’s t the front desk was friendly and the gentleman running the lobby bar named Jonathan was friendly.The airport shuttle was on point and in time to the minute for both of our shuttles.Room was not bad and all you need for a few hour sleep for a layover.  I would say while they have been renovated in recent years they are quite load as people walk by in hallway.",
      "rate": 3.0,
      "tripDate": " December 2021"
    },
    {
      "title": "DO NOT STAY AT THIS HOTEL.",
      "text": "Stayed at this hotel on night of 12th November . As our taxi was approaching the entrance, a large coach pulled in , in front of us. Reception was then full of the occupants of this coach, who were Afghan refugees. The noise was such that I could not speak to the reception staff. They were not wearing masks and children were running around unsupervised. Later that evening, I attempted to go to the bar for a drink, but such was the noise that I went back to my room. However, that was just as bad, as the noise continued most of the night in the corridors, loud voices and people running about. Next morning, once again, the reception area was  crowded with these people just hanging about and children playing. The reception staff did not seem particularly concerned. Again, no masks were being worn, and certainly no social distancing. When I paid my bill, and mentioned this to the lady on reception, she said she would credit me with 5000 IHG points. Ten days later, and I have not received these points. Staff not at all concerned with the comfort of regular guests. Would definitely not stay at this hotel again.",
      "rate": 1.0,
      "tripDate": " November 2021"
    },
    {
      "title": "Terrible experience",
      "text": "We stayed here for a few hours due to a cancelled flight. We were put in a room that connected and unfortunately our neighbors let their dogs bark almost the entire time we were there. I called the desk once and when we left mentioned it again. The response was “we told them but they do not control the dogs”.   Between the dogs and their activities that we could hear over our white noise app, we did not sleep at all. Do not recommend.",
      "rate": 1.0,
      "tripDate": " June 2024"
    },
    {
      "title": "We slept on these dirty, bloody sheets",
      "text": "My family checked into the hotel on March 29, 2024. The room had 2 beds. My wife immediately noticed that the bed was not fresh, but then decided that perhaps this washing method or the washing powder had a neutral smell. But after 2 days, dried drops of blood were found on the bed sheets, the bed sheets had not been washed after the previous occupants of this room. that's just terrible!! How can a hotel with such a name do such a thing! It can be very dangerous to human skin health. My wife slept on these dirty, bloody sheets , and my one-year-old child lay on it! Bed linen is not changed in this hotel!",
      "rate": 1.0,
      "tripDate": " April 2024"
    }
  ]
}