{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Holiday Inn Toronto Downtown Centre, an IHG Hotel",
    "url": "/Hotel_Review-g155019-d188212-Reviews-Holiday_Inn_Toronto_Downtown_Centre_an_IHG_Hotel-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.5",
      "reviewCount": 2187
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "30 Carlton Street",
      "addressLocality": "Toronto",
      "postalCode": "M5B 2E9",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/06/91/fa/e0/double-double--v3350313.jpg?w=500&h=-1&s=1"
  },
  "description": "Modern renovated hotel in the heart of Downtown Toronto with meeting rooms, an all-day restaurant, an indoor pool and Fitness CentreThe Holiday Inn® Toronto Downtown Centre hotel is only half a block from the College Subway Station, offering swift access to city attractions. It's an easy walk to the Eaton Centre and Toronto's Michelin rated restaurants and nightclubs.Concerts and Blue Jays baseball games at the Rogers Centre, as well as Maple Leaf's hockey and Raptors basketball at the Scotiabank Arena, are all a short subway ride away. Art lovers can drive to the Theatre District, Art Gallery of Ontario or the Royal Ontario Museum in 10 minutes. Have a drink at the Distillery district or book a VIP table at the Rebel venue.Considering a meeting place in the downtown core? Our fully renovated meeting rooms offer you everything you need. Catering and customized packages can be arranged for parties, weddings, and business events.",
  "featues": [
    "Paid private parking on-site",
    "Free High Speed Internet (WiFi)",
    "Pool",
    "Fitness Center with Gym / Workout Room",
    "Bar / lounge",
    "Kids stay free",
    "Business Center with Internet Access",
    "Conference facilities",
    "Parking garage",
    "Wifi",
    "Indoor pool",
    "Heated pool",
    "Shallow end in pool",
    "Restaurant",
    "Breakfast available",
    "Breakfast buffet",
    "Complimentary Instant Coffee",
    "Kids' meals",
    "Vending machine",
    "Banquet room",
    "Meeting rooms",
    "24-hour security",
    "Baggage storage",
    "Concierge",
    "Currency exchange",
    "Gift shop",
    "Non-smoking hotel",
    "ATM on site",
    "24-hour check-in",
    "24-hour front desk",
    "Express check-in / check-out",
    "Dry cleaning",
    "Laundry service",
    "Ironing service",
    "Blackout curtains",
    "Air conditioning",
    "Desk",
    "Housekeeping",
    "Room service",
    "Refrigerator",
    "Flatscreen TV",
    "Bath / shower",
    "Safe",
    "Telephone",
    "Wardrobe / closet",
    "Iron",
    "Laptop safe",
    "Private bathrooms",
    "Tile / marble floor",
    "Wake-up service / alarm clock",
    "Radio",
    "Complimentary toiletries",
    "Hair dryer",
    "City view",
    "Non-smoking rooms",
    "Suites"
  ],
  "reviews": [
    {
      "title": "Price reasonable holiday inn",
      "text": "The room is clean but the washroom is a bit tight. The noise proof is bad and you hear the noise from concourse and room nearby.There is big windows in 22F and it is just nice.The breakfast is ok and crowd with many customer inside.There is parking offering in and out benefits for you over the night with $30 per day.Laundry also cheap for $4 wash and dry and laundry room secure with room key require to access it, which is great for long time traveler after a long trip.Staff is nice and helpful for questions and help need like getting coin for laundry.Location is great with many shop and food nearby and convenient access to college station.",
      "rate": 4.0,
      "tripDate": " October 2022"
    },
    {
      "title": "Good bed... and that's about it",
      "text": "I feel a bit guilty leaving this review -- I stayed at this hotel August '21 and my personal feeling is that everyone gets a bit of leniency during pandemic times. The bed was clean, large, and comfortable. The room was missing towels (I made multiple calls to housekeeping, got a busy signal every single time) until finally someone from front desk brought some up. The carpeted floor really needed a vacuum: it was covered with dust clumps. And I kept finding long strands of (someone else's) hair everywhere: on the floor, in the bed, in the bathroom. This hotel is situated within steps of the gay village, which was really convenient for me, and the price was right. It's a pity there wasn't slightly more attention paid to cleanliness.",
      "rate": 3.0,
      "tripDate": " August 2021"
    },
    {
      "title": "Very good business hotel",
      "text": "I enjoyed my 10 day business stay here; the staff are super friendly and helpful, and the rooms are clean and modern. Be aware that the rooms are very small, at least mine was and I'm unaware of other size options. When mentioned this to one of the staff, the response was that the hotel had been a former University residence that had been converted, hence the 'dorm' room feel. But only in size--kudos for making the best use of space and thank you for the plentiful plug ins without having to shuffle furniture around!  Desk space was small, and I would have appreciated a good quality task light. Very comfy bed and fittings, and I appreciated the sans carpet.I was most disappointed to see that the hotel is still using single use plastic containers for shampoo etc, as well as disposable cups in the rooms. Such a waste! Breakfast was included and I always brought breakfast up to my room. Unlike other hotels I've stayed out, rather just allowing the breakfast on a normal plate, they always provided a disposable takeout container. Again, so wasteful and not environmentally conscious. Breakfasts were nice with several hot/cold options, albeit unfailingly exactly the same day in and day out which did get tiring after a 10 day stay. On the 6th floor (if a remember correctly)  very close to the fitness center/pool entry, there is a lovely outdoor sitting area that most guests did not seem to be aware of.",
      "rate": 4.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Clean and comfortable ",
      "text": "My connection flight was canceled and my luggage didnt make it to Toronto. The staff is very friendly they gave me some deodorant and toothpaste and thooth brush. The hotel is clean the beds are comfortable my only complaint would be the bathroom is tight would definitely stay there again",
      "rate": 5.0,
      "tripDate": " June 2023"
    },
    {
      "title": "NEVER AGAIN!",
      "text": "There is a lot of room for improvement. I paid $30 for an early check-in before 4 pm. I was first given a room where many things were in bad condition: The closet doors wouldn't slide. One of the drawers wouldn't open, a lamp wouldn't turn on, the tv cable was disconnected and there was humidity and holes in the walls, and mold growing in the corners of the room close to the windows.I had to ask for another room that was in better condition but when I moved there, the safety box was not working and had to wait until 4 pm for someone to fix the problem which was not fully fixed because one of the digits in the safety box screen wasn't showing. All of this made me be fully settle down around 4 pm, so the early check-in was completely useless. I asked if any of the fees could be waived and the manager was kind enough to offer free breakfasts every morning of my stay but I don't think this was enough for all the inconvenience.On my 2nd to last day, I extended my stay for 1 additional night, and even though I paid a higher rate for that additional night because of the short notice, when I asked for 1 additional breakfast voucher they said \"We're giving you another breakfast voucher but this will be the last one\". That same day I asked for fresh towels in the morning. They never arrived. I had to call a 2nd time around in the afternoon to have them delivered to my room.And despite asking for a quiet room and vice-versa (they could hear me) I could hear the noisy neighbours in the next room (or it was above I'm unsure) through the A/C ducts. No privacy whatsoever, not at all.I've always stayed at Holiday Inn properties and have always received decent to excellent service. I honestly don't know what's going on at Holiday Inn Downtown Toronto.",
      "rate": 1.0,
      "tripDate": " September 2021"
    },
    {
      "title": "The room was not cleaned from previous guest",
      "text": "First of, my family and I were in Toronto for our daughter's appointment at Saint-Michael’s hospital, since she suffers from cystic fibrosis, which a life threatening disease.  The first night, we got in late since we are 8 hours North of Toronto.  We wanted to surprise our daughter and make her feel special, so we got her her own King Suit.  She was very excited to have her own privacy but so tired from the trip, that once at Holiday Inn, Downtown Center, we immediately went to bed.  She needed a good night sleep to be emotionally and physically  ready for the long day ahead of her.The next day, we spent the hole day at the hospital, and got back to the rooms at 9 pm (we didn’t even have super).  At that time, my daughter went to her room to shower, (then spoil her with room service, that did not happen) BUT noticed that the bathroom had not been cleaned from the previous guests.  There was long hairs all over the washroom (she has short hair) that did not belong to her and was very disgusted.  She had to come and shower in our room. Since we were all exhausted from our long day of testing at the hospital, I told her that I would take care of it in the morning.  Well, that did not go well!  I spoke with the receptionist at front desk and she offered us a $50 rebate for the room that cost us $310.67.  She apologized and very understanding, but couldn’t do any more for us.  I asked to speak to her manager, Brendan Jayawardene.  He came out and started saying that we should have told the front desk the first night and that it was our fault for not making them aware of the problem (Which I understand, but there was a reason why she did not see it the first night), without leaving me the chance to explain the reason of the this delay. I wanted to show him the pictures of the room and he told me that he didn’t need to see them and said rudely: Well you should of told us before and there is nothing else I can do for you.  I responded that I was giving them a chance to rectify this problem before going to head office with this and he said : Do what you got to do! and left. He did not apologize, was speaking with a condescending tone, did not give me the chance to explain the reasoning why she didn’t see the hair the first night,  nor give us a compensation of some kind for our disappointing stay.This was very frustrating for us and ruined our stay.  We ended up checking out ahead of time since we didn’t feel comfortable staying another night.  We hope that no other families have to go through this, especially when you planned a special stay for someone you love, trying to encourage them and make them feel “normal” for a couple of nights.",
      "rate": 1.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Average",
      "text": "We stayed here for 4 days in July 22. The hotel is very average and possibly due to location overpriced for it offers. Rooms seem tired and have a slight damp smell. Air-con even though set for 68 degrees F (20 Celsius) seem to work for a while and then it resets itself to warm the room instead!?!?Breakfast which was included in the rate booked via Booking.com was not really worth it. Selection was poor to say the least (we had better breakfast selections in HI Express) and queues were massive all 4 days. I would give it a miss and choose to eat somewhere local. As IHG Gold member I was trying to book this hotel direct but it was more expensive than via Booking.com. When I filed a claim with IHG I was told that their Best Price Guarantee could not be honoured even though I provided all the necessary links. Yet again I was let down by their so called loyalty programme which I will be leaving soon. Big plus of this hotel is it's location in the heart of Downtown Toronto so within walking distance to all the attractions and amenities Toronto offers.",
      "rate": 3.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Disappointed",
      "text": "First, the employees at the front desk, lobby and housekeeping are amazing! The hotel is clean and comfortable. BUT....the rooms are tiny. No view, had to keep curtains closed for privacy (19th floor) No sitting area or tub chair, I banged my head on the wall mounted TV going to the washroom at night more than once. No mirror over the sink. The bathroom doors are so squeaky that they wake up anyone else in the room. The staff is aware of this and seem exasperated by maintenance. The 14.99 breakfast buffet is not recommended. though convenient and well priced it is really a bad experience. Promptly seated the servers seemed rushed and trained to move people out and turn over customers ASAP. The food is like in an institution. Not sure if the scrambled eggs had real eggs in them and were tasteless. The French toast were dry toast with little evidence of egg wash, just a sprinkle of icing sugar. Again tasteless and inedible, Baked beans were tasteless but Bacon was good. Good selection of yoghurts and fruit. For a more enjoyable relaxed and tastier brekkie there are a few diners close by that are cheaper and better options for a relaxed meal.  3 minute walk to \"Frans\" is highly recommended. \"Eggspectations\" across the street as well... 300$ plus a night. Hopefully they can put some profits into oil for the bathroom doors and a couple of real eggs. But..Great location.",
      "rate": 3.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Great location and wonderful staff",
      "text": "When arrived in pure Covid Stage 2 wonderfulness. I stayed here before and like the proximity to everything by foot. The parking is not easy to find as it is on the back street and narrow with driving on the left and exit on the right. I find the price steep but that is Toronto and I was aware of the price before booking so was not a hidden charge. We  booked through a third party so this only gave us vouchers for 2 people instead of 4. (Booked as two adults, 2 teens: 17 + 14). This was not an issue as the \"two adults\" went down and got meals for 4 people (kids under 14 eat free and well, they were sleeping in the room) So we got our breakfast for 4. Parking allows you to go in and out. Pool was still closed unfortunately. Rooms were clean so cannot complain.",
      "rate": 5.0,
      "tripDate": " July 2020"
    },
    {
      "title": "Excellent customer serviceand food - they go the extra mile!",
      "text": "I visit this hotel frequently to facilitate workshops for Executive Assistants.  On my return to the hotel the staff greet me like a long lost friend and make me feel very welcome which is lovely when I travel on my own.  All the staff are friendly and it is obvious they enjoy working here. Today I have been even more impressed - their mission is to \"exceed expectations and make your stay as pleasant and comfortable as possible\" which they certainly do.  In particular Monika Kobayashi who is head of conferencing and always makes sure my workshops are organised and run well (along with all the conference staff) helped me beyond her role with Customs and DHL in order to get my materials here on time. The training rooms are great, the staff are well organised and efficient, the bedrooms are good and the food is delicious. I highly recommend this hotel and especially for conferences. The staff are considerate, thoughtful and I look forward to returning as I believe it is the customer service that makes the difference between hotels.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Hostel or hotel?",
      "text": "We stayed at this hotel last night. When we arrived after a three hour drive both my wife and I had to really use the bathroom. In order to access the bathrooms in the lobby you need a room key. So we got in line behind three other couples. One person working the desk (6:30 pm). Almost thirty minutes later we got checked in and we’re able to use the lobby bathroom! Then we got to our room. It was basically a dungeon. Window the size of a show box and looked at a gutter. Next the tv wouldn’t work because of no signal. Our bathroom stunk like wet mold, there were half used bottles of body lotions on the sink. Also they gave us a handicapped  access room. Not a huge deal however if I was handicapped and was told there were no more rooms available I would be pretty upset. We stay downtown often for events and don’t think we would ever stay here again. After travelling Europe this felt ALOT like a cheap hostel.",
      "rate": 2.0,
      "tripDate": " April 2022"
    },
    {
      "title": "Be careful with your credit card deposit",
      "text": "It seems that our case is a usual practice at this hotel. We stayed at the Holiday Inn Toronto Downtown Centre Hotel my family of 6 from the  30th June to 3rd July in two rooms. The reservation was made on the internet travel agency stayforlong.com and had been completely paid 10 days before our stay. At the frontdesk we were asked to have a security deposit with my credit card to cover possible damages. After getting back home, I realized that I had a on hold charge of 973,58 € (I assume this is the deposit), but I also had two additional charges of 486,97 € without explanation. After complaining to stayforlong and emailing twice the hotel, I've had no reply so far, and the 973 € charge is still in my credit card account 15 days after leaving the hotelIf the someone from the hotel management happens to read this review, as they don`t seem interested in reading customer's emails, please solve this problem as soon as possible.",
      "rate": 1.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Pass if you can",
      "text": "It may have been something in its day but time has taken its toll…along with the care by its housekeepers and their overseers. Small dated furnishings but still charging high value dollars. Honestly disappointed and cannot recommend…from dusty coat rack bar in the closet, closet door off track, strange wires through walls, and paper towels stuffed in air vents..kinda sketchy…lamps that are off kilter or had bulbs missing…you decide from my review..",
      "rate": 3.0,
      "tripDate": " November 2021"
    },
    {
      "title": "Small rooms but clean and upgraded",
      "text": "Good front desk customer service.  The king room was small, bathroom is configured to maximize space and there's not much of a sitting area, the desk space is quite crammed and wasn't thought out by the planners. There's no carpets so chances of bed bugs spreading is much less, so the room was quite clean.  You might find it noisy at night if you keep the window open.  If you need more space, there's king with just that but is more money of course.  We didn't do the breakfast buffet because the hotel was sold out.  We ended up across the street at Eggspectation, probably comparable to the hotel fare in price and quality.",
      "rate": 3.0,
      "tripDate": " January 2023"
    },
    {
      "title": "Good location good food and excellent staff ",
      "text": "Arrived at the hotel from airport and check in was smooth and easy. Room was nice and clean although maybe slightly on the small side for 3, a family of 4 would be quite a squeeze. Hotel is in a good location just a 15 minute walk from Dundas Square, and about a 45 minute walk away from the CN Tower. Nice little gift shop in the reception area, restaurant and bar was a good place relax after a day out sightseeing and the food served in the evening was excellent as were the 2 girls serving ( didn't catch their names). Breakfast was a variety of fruit, cereal, pastries and cooked with plenty of coffee and juice available.Would definitely recommend and definitely stay here again",
      "rate": 4.0,
      "tripDate": " April 2022"
    },
    {
      "title": "Great hotel location for 3 events (ok for 2 more)",
      "text": "Booked 2 nights through CIBC travel agent. $900 for 2 nights including parking and breakfast (you can do better through expedia).  Breakfast was a line up to get in between 9-10 am, but sit down buffet options were pretty broad. Every staff member was personable and professional. Ideally located to do our 5 downtown events, and a couple of minutes walk from College subway station linking to Union Station. We went to Ripleys aquarium (super packed with class tours), and cn tower in the mid day, and Blue jays game at night (easy jaunt by subway) plus casa loma and royal ontario museum on day 2 (short uber drive to save time). Found a discarded insulin needle by table leg when we were cleaning up (not mine), but otherwise very clean. You will need to ask for more towels if there are more than 2 of you in the room.",
      "rate": 4.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Location and staff - that s it",
      "text": "Stayin there right now and I can tell there is really nothing justifying such a high price. Staff is nice, location is great.. and thats about it. Room is old, stained walls, small room, found multiple hair on the floor, lots of noise coming from college street, breakfast an additional $15. Very disappointed",
      "rate": 2.0,
      "tripDate": " October 2021"
    },
    {
      "title": "Disappointing!",
      "text": "We booked this last minute for Valentine’s Day. The room was incredibly small. No room to walk around, same for the bathroom. Room decor was dated except for one painting that is shown in all the booking sites to make the room appear modern. The worst was there is no hot water - only lukewarm at best and no water pressure.  The heating was also not working. It was freezing when we walked in and then shot up to 90. We had to turn it off to sleep because the automatic function was broken.",
      "rate": 2.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Great location",
      "text": "Great location in downtown with all amenities nearby, particularly for someone that doesn't plan to drive, otherwise, be prepared to pay for parking, $30/day.  Room size isn't spacious due to its location.  We could barely open our standard size luggage.  Room and bathroom is clean but bathroom ceiling starts to peel off.  Note there is no daily room service, you'll have to book ahead of time.  Staff was friendly.",
      "rate": 4.0,
      "tripDate": " August 2021"
    },
    {
      "title": "Enjoyed my stay...but my invoice is incorrect.",
      "text": "I checked into this hotel Dec. 4/2022 at approximately 3.45PM. The gal on the deskgave me the payment machine & left a deposit. When I went into my room, I was very happy at what I saw. The room was lovely..king size bed, large tv, Keurig coffee maker with coffee, bottled water, a small fridge, & a safe to keep belongings protected. Also the room was the right temperature & for the two nights I stayed, I enjoyed good sleep. The bathroom is on the smaller side, but I'm accustomed to this. The only thing was that the hand soap container was empty, but no worries, I took soap from the shower. The water pressure for the sink was not strong at all, but I managed what I needed. Upon check-out, the gal on the desk asked if the remaining balance was to be charged to the same credit card number which was used at check-in. I told her \"yes\". She then printed off the invoice, & handed me a copy. When I got home, I checked the balance on my credit card, & much to my confusion, there was $100.00 more than what should be in my estimation. If I'm given a receipt for a certain amount of monies & the balance shows as $0, then there should not be a descrepancy of $100.00. What confuses the matter further, is the date whichis showing in the credit card area of my online banking. It shows $100.00 more than what's on my receipt, but the date is Dec. 4/2022. Indeed the $100. deposit should be dated, & the amount charged this morning should be dated Dec. 6/2022.Everything is itemized on my receipt...& the total was $579.37., yet the amounton my online banking is showing $679.37 again, descrepancy of $100.00. Please note, that the invoice says \"Balance $0.00 because everything was charged to mycredit card. Considering everything is itemized along with the cost is listed on myreceipt., thereby totaling $579.37. My big question is how come my receipt totalwas $579.37, yet the amount charged to my credit card is $679.37. Someone fromCustomer relations spoke at length with me & she will be sending all the informationto hopefully bring this situation to resolution. Bottom line...the Holiday Inn Downtown is very very nice. It is located on Carlton St., very near College. I would highly recommend this hotel to anyone visiting Toronto in the mentioned area.",
      "rate": 5.0,
      "tripDate": " December 2022"
    },
    {
      "title": "Felt discriminated against",
      "text": "When we got into the room , we first were blasted by the heat , after a hour of having the thermostat on low AC and still overwhelmed by the heat we called the front desk to be informed that this hotel disconnects the ac for the winter ! On top of that the bathroom fan does not work. The toilet keeps draining we fixed on our own and the kind man at the nights front desk offered to switch us rooms but we’re to tired to pack up and move again, I suffer from C.O.P.DI was heading to pick up dinner from the restaurant down stairs and was stopped by a manager lady in the lobby who asked me to put on a mask . I explained I have copd she replied rudely to me that she’s gonna need my room number so she can let security know to keep an eye on my and that they are going to need to limit my mobility in the hotel !!!!!!! What kinda illegal crap is that this isn’t the Soviet Holliday inn on Carlton is it ! Definitely would not recommend this place to any one especially if you suffer from any kinda disabilities that can make it hard for us people to weak a mask .",
      "rate": 1.0,
      "tripDate": " November 2020"
    },
    {
      "title": "Nice average holiday Inn",
      "text": "Location is good.  Close to public transportation, CVS  and a diner with pretty good food. Beautiful lobby and friendly front desk staff.   Room and bathroom were  small and clean ( carpet could use vacuuming) but fit the purpose for two nights stay.  Small dresser in closet with a safe that didn’t work.  Beds comfortable I suggest higher floor because we could hear street noise on second floor. Room had a slight stench to it but we didn’t spend too much time in the room anyway. Hall configuration was a little strange and very narrow  with signs of wear and tear and again the carpet needed vacuuming.  Small Microwave in its own room next to the laundry room.    Maid comes earlier (2nd floor) and she will open the door quickly so put your do not disturb sign up if you’re not an early riser. Didn’t use the hotel resturant.  Would probably stay again.",
      "rate": 3.0,
      "tripDate": " May 2022"
    },
    {
      "title": "Excellent client service and location",
      "text": "My husband and I stayed in a king room with a beautiful city view.  We have stayed at this hotel numerous times, many thanks to George Desilva and Christine Briggs who ensures this location offers excellent client care.  They truly do care about their guests.  Our room was very clean and nicely renovated.  We had a great sleep, with a comfortable bed in a quiet area.  We didn’t use the pool this visit, but it is very nice with access to an outside terrace.  Breakfast is always delicious.   We enjoy this location also for the ease of access in and out of the city, as well as parking ease.",
      "rate": 5.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Great service, very nearly perfect!",
      "text": "Let me say right off the bat, my one missing star is simply because of the bath products. There is no bar soap available in the hotel. The only thing available to wash your hands and body is an insanely, much-too-fragrant liquid soap/wash by Dove. I asked the front desk if I could have bar soap instead for the shower but they told me the IHG policy is the liquid soaps only. It's a tiny complaint but it is a bit unusual and I really found the scent so strong (you can smell it on your hands for HOURS) BUT THAT ALL SAID...I really did enjoy staying here and would highly recommend it. Alex at the front desk was such a lovely person, so friendly and helpful. Alex deserves major kudos, a warm, kind check-in experience sets the tone for a pleasant stay and Alex did exactly that for me. I asked for a quiet room as high up as he could put me and even though there are 20+ floors, I found room 724 to be perfect. The room is not incredibly spacious but for myself traveling solo it was fab. The King bed was comfy, the pillows were wonderful, the free bottled water was great. The hotel is mere steps from the subway not to mention central enough you can walk to a lot of places (if you like getting your steps in, like me) I honestly felt very happy with myself for booking my brief stay at this property. I think it's absurd to not offer bar soap to guests who request it and I hope that IHG will consider changing this policy.",
      "rate": 4.0,
      "tripDate": " September 2023"
    },
    {
      "title": "Small Rooms",
      "text": "We stayed at this hotel during our first year in Canada when we watched the Santa Claus Parade for the very first time. That was eleven years ago. I therefore think its time to do another review of this hotel because our last stay was 11 years ago which was quite a long time.When we first stayed here my main complaint was how small the rooms were and they haven't really changed, they are still small.I think this has  one of the smallest Holiday Inn rooms that we have stayed inThe only saving grace of this hotel is its location. It is less than 5 minutes walk to the nearest subway station which is good for us since we didn't bring our car. It is also just a few steps away from a large supermarket and several restaurants. You can easily walk and enjoy the different attractions in downtown Toronto because of its accessibility by foot and by subway.",
      "rate": 3.0,
      "tripDate": " November 2021"
    },
    {
      "title": "What a shabby and expensive hotel",
      "text": "Tiny, expensive room with shabby paintwork, various bodged repairs (silicon sealant on toilet to repair hinge). I paid over £800 for four nights. Really poor value for money. Staff were pleasant and professional.",
      "rate": 2.0,
      "tripDate": " March 2020"
    },
    {
      "title": "Not Impressed",
      "text": "My boyfriend and I stayed one night at this hotel in January 2023 and I was far from impressed. We got to our room and it had scuff marks all over the walls, and the string to pull up the curtains was screwed out of the wall,  the pillows had black and yellow marks on them and when I pulled the duvet down there were black marks all over the sheets and little black hairs. I called down to the front desk and and they gave us a new room, when we got to that room the sheets were just as dirty. My boyfriend called down to the front desk and they said they would bring new sheets up, we had to get going to a play so they said they would come up and change the sheets while we were gone. I expected to come back to the hotel room with the bed made with new clean sheets but all they did was just put the sheets folded up on the bed, so when we got back from play we had to strip the bed and make it, and on top of that there were still two pillowcases missing. My boyfriend called down to the front desk and no one answered so he went down to the front desk to explain what had happened and that we were not impressed and all they did was comp our parking. From my experience, I would not recommend this Holiday Inn. The staff was friendly enough but it seems like the cleanliness of the hotel is not their top priority. I know there are renos in the hotel going on right now and they seem a little preoccupied with that. I usually enjoy my stays at Holiday Inns, but this one was just off.",
      "rate": 2.0,
      "tripDate": " January 2023"
    },
    {
      "title": "Convenient location but needs improvement",
      "text": "Hotel room was clean and comfortable, if a little small (the pictures are deceptive), but lots of small things could be improved.  There is a pool available but it is not mentioned on any of the hotel information provided.  The pool itself is heavily chlorinated however it does not appear much is done to keep a supply of towels in the change room (signage advises users to get a towel from the change room) nor to keep the pool skimmed to minimize the hair in the water.  We had four people booked in the room (as indicated on our reservation) but only three towels were provided.  The Kleenex box was almost empty and was not changed the next day.  The air conditioning unit is quite complicated and no explanations were provided. Given the price we paid per night we expected a higher level of service than received and would certainly be hesitant to stay there again.",
      "rate": 3.0,
      "tripDate": " August 2023"
    },
    {
      "title": "One of the worst trips ever",
      "text": "Where should I start! We travelled as a family to Toronto for the final leg of our visit to see family there. We were a party of 4 adults (1 disabled) 1 senior and 4 children (1 baby).When we arrived at the entrance to Carlton Street we were immediately greeted by the 2 huge trailers holding the tram rails which are currently being installed in the road, from early morning to late at night. Once we found parking for the hotel which was an extra cost, which at $30 a night wasn’t expected, we then walked into a hotel under complete renovation. This became an issue when at 8 am on the first morning we could hear drilling throughout the building. This was also made worse by the smoke alarm going off at 3am and having to walk down the fire escape into the street to be greeted by 5 fire trucks. The alarms were triggered by something or someone on he first floor. The next day the alarms went off again, and this caused the lifts to stop for a few hours. When I called the front desk to ask how I was get a pram and baby downstairs I was basically told ‘oh well’.As mentioned by others, the rooms are really small. The breakfast if it wasn’t included in the cost isn’t worth $22. We were offered the chance to skip the check queue if we paid $200 to a certain member of staff who I won’t name.The swimming pool had bits in the bottom of pool, had loads of hair in it and hardly had any towels in the changing rooms.The only plus points I could give this hotel is it is very close to the subway which makes getting around Toronto so easy. And the best part was the restaurant staff who couldn’t have been more friendlier and helpful.",
      "rate": 1.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Expensive, clean, but decent hotel in a great location.",
      "text": "This is a decent holiday, which is well located in a central area close to the subway and tram stops (and supermarkets). We stayed for two weeks, and whilst it does some things well, others need more ironing out.Highlights:Location is superb. Though there are ‘colourful characters’ who wander the streets nearby, and can pester you if you smoke. They are largely harmless though. Philip behind the bar, is brilliant. Funny, thoughtful, and kind. A real gem of a guy.Housekeeping (we are room 1025) are excellent. The room is modern, clean, the beds are comfy and although small, is enough for two people. The hotel security guard (guy with the glasses) is friendly and professional. Areas which need more improvement:At check in, our room was not ready, despite it being 7:30pm at night.There is a very confusing hotel policy which states that you if you stay more than one week, they will randomly take money from your credit card in odd and unexplained amounts - why not just take one payment at the beginning? I would have loved a wine glass for my room, and when I asked reception, they said they couldn’t get one as the bar and restaurant were closed. Almost every other hotel (in over 40 countries I have been too) can get you a glass. Instead, I had the plastic cups in the room, which isn’t ideal. This might seem minor, but these are the touches you expect from a four star hotel.The worst part are the old fashioned and antiquated lifts/elevators. Huge bottleneck queues would line up to try to get into them, and often, one or sometimes two (of four) wouldn’t work. This could be exasperating. The hotel terrace seemed a little sad looking. You have to call a number to order, it rarely looks busy and seems underused. It has so much potential. Similarly, the lobby seems to be a really underused space, which would work well as a coffee shop area, rather than underused seating.Finally, it’s really expensive. This hotel is a lot of money, and it doesn’t even include breakfast, which is a crazy amount of money on top of the cost of the room. Overall, a decent hotel, which seems to need a lot more polishing around the edges and a better use of what it could be.",
      "rate": 3.0,
      "tripDate": " August 2023"
    }
  ]
}