{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Holiday Inn Express & Suites Toronto Airport South, an IHG Hotel",
    "url": "/Hotel_Review-g155019-d24946904-Reviews-Holiday_Inn_Express_Suites_Toronto_Airport_South_an_IHG_Hotel-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.5",
      "reviewCount": 19
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "25 International Blvd",
      "addressLocality": "Toronto",
      "postalCode": "M9W 6H3",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2c/02/40/f3/welcome-to-the-brand.jpg?w=500&h=-1&s=1"
  },
  "description": "Welcome to the brand-new Holiday Inn Express & Suites Toronto Airport South, located near Downtown Toronto and just minutes away from Toronto Pearson Airport. Conveniently positioned close to highways 401, 407, and 400, our hotel offers easy access for both corporate and leisure travelers. Surrounded by prominent companies including Ledcor Canada, Bayer Inc, Heineken Canada, Lifelabs Medical Lab, The International Centre, and Toronto Congress Centre, our hotel is ideal for business travelers. For some family fun, nearby attractions include the Woodbine Entertainment Centre and Wet N Wild Water Park. Enjoy our 24-hour free airport shuttle service, providing transportation to and from Toronto Pearson Airport and the UP Express train station, offering a quick 20-minute service to Downtown Toronto. Our accommodations feature complimentary Wi-Fi and an Express Start® Hot Breakfast. Stay active at our 24-hour Fitness Centre.",
  "featues": [
    "Electric vehicle charging station",
    "Free High Speed Internet (WiFi)",
    "Fitness Center with Gym / Workout Room",
    "Pool",
    "Free breakfast",
    "Children Activities (Kid / Family Friendly)",
    "Pets Allowed ( Dog / Pet Friendly )",
    "Free airport transportation",
    "Paid private parking on-site",
    "Wifi",
    "Breakfast available",
    "Snack bar",
    "Free shuttle or taxi services",
    "Airport transportation",
    "Shuttle bus service",
    "Meeting rooms",
    "Non-smoking hotel",
    "ATM on site",
    "24-hour front desk",
    "Dry cleaning",
    "Laundry service",
    "Air conditioning",
    "Housekeeping",
    "Non-smoking rooms"
  ],
  "reviews": [
    {
      "title": "Great Stay",
      "text": "We stayed at this hotel because my son and I wanted to do some plane-spotting.  Unfortunately we didn't get on the right foot with the staff because we booked a room with a runway view and they gave us a room on the other side of the hotel.  We talked to them about it and they did a work-around to put us in a room with a runway view.  The staff even went up to the room to check it out first and let us approve it before they went back downstairs to the lobby.  We appreciate their help on this.The hotel itself is great and I was really excited to stay at this hotel because it is really new.  The staff told us the hotel opened up in April 2023.  The room is really comfortable and modern.  Everything is clean and they are generous with the soap and shampoo.  It is not the travel size you see in typical hotels, but they are large bottles of Dove hanging against the wall.  The beds were really comfortable and we slept really well.  Breakfast was great; loved their warm cinnamon buns.  My wife and daughter loved the sausage.  My son enjoyed the pancake maker.  There is a lot of variety for food as there were also bagels, muffins, toast, cereal, yogurt, baked beans and cheese omelette.  You can definitely feel full after eating and the staff are actively replenishing food so nothing runs out.I would recommend staying at this hotel and would do so again.",
      "rate": 5.0,
      "tripDate": " July 2023"
    },
    {
      "title": "Great airport hotel",
      "text": "We usually book at the IHG hotel on Dixon but thought we'd give this \"new\" hotel a try. This will be our go-to hotel in the future!This is a new hotel. Very clean, great reception staff (thanks Maheen), Platinum status recognized with room upgrade.Room was spacious with lounger and couch. Large walk-in shower with wall mounted Dove products. Funky lighting in the room. We had to search for the light above the closet armoire (look near the side door, which holds the iron).Usual Holiday Inn Express breakfast, but regularly refreshed and best bacon I've ever had (airfryer???)Indoor pool, exercise room, and washers and dryers for guest use ($2 per load for washing and drying).Shuttle was just a short drive from airport and leaves hotel at 10 past and 40 minutes to the hour. When we visited, the hotel was used by passengers with missed flights, so worth booking in advance and getting to lobby early for shuttle.",
      "rate": 5.0,
      "tripDate": " January 2024"
    },
    {
      "title": "Family long weekend; great stay",
      "text": "We enjoyed our family long weekend, this is an ideal location, only a few minutes shuttle to the airport.We were able to grab the shuttle to the airport each day and from there take the UP Express and GO Bus to where ever we wanted to go.The hotel staff are such a pleasure to talk to, and helpful with every little detail (thanks for the pizza place recommendation- it was perfect!)It was great having breakfast included, and they have a generous selection to choose from!We were bummed the pool isn’t operational yet, but we knew that before we went, so we are looking forward to enjoying it another time.  We would definitely stay here again, and would recommend it to anybody looking for a clean affordable hotel near the airport.  Our room faced the airport and the kids were happier to watch that then the tv (thanks!)And worth noting that we were near the elevator, but it wasn’t a noise issue at all (as we’ve experienced elsewhere in the past) (Side note, we were pleased that the room temperature was consistent (and the cooling/heating system quiet!)Great all around experience!",
      "rate": 5.0,
      "tripDate": " October 2023"
    },
    {
      "title": "Amazing staff!",
      "text": "My husband and I spent 7 nights at this hotel. The staff are simply amazing! They made us feel at home.The room was impeccable and also very big.We especially chose this hotel because it’s new and very centralized.The shuttle runs every 30 minutes which is a plus.Only hiccup the fire alarm went off after 2am forcing everyone out. And we had no water on the day of check out. We had to use another room to shower. The lady in house keeping who took us to use the other room was very pleasant, sorry that I didn’t get her name.Everything else was perfect.Grace at check in was so gracious!Pardeep was so warm and friendly. Gianni at the breakfast area was awesome with her warmth and politeness. She ensured that nothing ran out.Fernanda also at the breakfast area was extremely helpful. Ricardo was very polite he was so willing to help us store our luggage. Thank you guys for being so amazing!",
      "rate": 5.0,
      "tripDate": " June 2023"
    },
    {
      "title": "Good Hotel for Airport Layover",
      "text": "This hotel is new (opened in April); it is nice and clean.  At check-in they upgraded me as IHG Diamond to a room type that they call a suite (which it isn't, really), but anyway it's bigger than the entry level room so nothing to complain about regarding the upgrade especially since at Holiday Inn Express brand many hotels only have one room type and therefore no upgrade possible, so at least here the loyalty recognition was positive.  The room was fairly spacious and entirely satisfactory for a quick one-night layover from the airport.  The bathroom was bright and the stand-alone shower was a plus.  Since most guests here probably come from the airport, I would also mention that they have a free shuttle bus available which was on time.  Considering the price, I could not find much to complain about this hotel, including staff at reception which was friendly and polite.",
      "rate": 5.0,
      "tripDate": " October 2023"
    },
    {
      "title": "Excellent stay",
      "text": "We were here in November and December on a trip south. Both times we were greeted by Maheen at the front desk. The welcome couldn't have been friendlier. Likewise everything was waiting for us and we were in our room in no time. The rooms were very quiet, especially for an airport hotel. The bed was huge and extremely comfortable. The shuttle to the airport runs every half hour at 10 and 40 minutes after the hour. All in all a 5 out 5 experience. And the breakfast was very good too.",
      "rate": 5.0,
      "tripDate": " November 2023"
    },
    {
      "title": "Amazing Stay at Holiday Inn Express & Suites Toronto Airport South",
      "text": "We spent 4 nights at the new Holiday Inn Express & Suites Toronto Airport South in June 2023. Thanks to our IHG Platinum Status, we received a complimentary upgrade to a spacious 2 Queen Suite Runway View with Sofa Bed. Ahmad, Emilia, and Bhuvan made our stay very hospitable. We were pleasantly surprised by the room, which had two queen beds, a sofa bed, a tub, and a microwave – perfect for families. It truly exceeded our expectations! Rooms are extremely comfortable and spotless. I highly recommend this property and can't wait to stay here again on our next trip. The experience was fantastic, and the upgraded room, along with the warm hospitality, made our stay truly memorable. If you're planning a trip to Toronto, this Holiday Inn Express & Suites Toronto Airport South is a top choice! 5/5 Stars!",
      "rate": 5.0,
      "tripDate": " June 2023"
    },
    {
      "title": "Perfect",
      "text": "Perfect hotel. Spotless clean. Amazing staff, polite and helpful. They provide complimentary breakfast with many sweet and savory options (scramble egg, omelette, bacon and sausages, pastries, fresh juices, porridge and much more). The day of the departure they also offered breakfast to go!",
      "rate": 5.0,
      "tripDate": " May 2024"
    },
    {
      "title": "Horrible Service!",
      "text": "Horrible Service! Made a mistake contacting this hotel. My flight was cancelled last minute and I had to find accommodation. I contacted the Hotel front desk and they advised me that they had few rooms available and I can come by. He also advised me that he will hold the room for me until I arrive. I arrived within 10 minutes to the hotel. There were few other customers that had their flight cancelled as well. The same front desk person helped the other customers that came after me and stated that he will help me afterwards. I waited roughly 30 mins for all customers to be helped with and the same front desk person advised me he did not have any more rooms available and he was not able to accommodate. He gave the available rooms to the customers that came after me. I am unsure as to why the front desk person decided to assist the customers that came after me before hand. I will definitely not recommend Holiday Inn to anyone. They mentioned their quality of service to their customers but not sure where that \"quality of service\" went when I came in. Probably a big mistake to ever come here! Do not recommend",
      "rate": 1.0,
      "tripDate": " June 2024"
    },
    {
      "title": "No deposit  refund warning!",
      "text": "I have stayed at the Holiday Inn Express & Suites Toronto Airport South twice. On my first visit, my security deposit was not refunded even after 10 days. However, Anshul helped me very well and handled the issue immediately.On my second visit, I checked out on October 8th, but my security deposit has not been refunded yet (today is October 30th). I have traveled across Canada for a long time, and I have never experienced such unprofessional handling of a security deposit refund.I am very disappointed with the hotel's management. I have contacted them several times, but they have not provided any response at all.I would not recommend this hotel to anyone, especially if you are concerned about receiving your security deposit back on time.",
      "rate": 1.0,
      "tripDate": " October 2023"
    },
    {
      "title": "Hotel staff does everything they can to help your stay be pleasant",
      "text": "I showed up and had some misunderstandings of charges and processes of bookings. I made my issues known with the hotel staff. I had them continue to attempt to correct the concerns I had and soumya and her team made every attempt to make things right all throughout the week. They completely turned around what I perceived to be a bad experience into a good experience. This hotel staff really cares that it's guests are having the best experience possible and I will definitely stay here again",
      "rate": 5.0,
      "tripDate": " May 2024"
    },
    {
      "title": "Good service",
      "text": "This new hotel was great - the staff were very friendly and helpful. Breakfast had a good selection and the staff were about cleaning the space as soon as people left. We had a very very late checkin and used their airport shuttle service.  I called once I arrived and shuttle arrived within 10 minutes. It’s a 24hr continuing loop service but, due to the very late arrival 3am I had to call to get picked up as the drivers were doing their shift change.",
      "rate": 5.0,
      "tripDate": " April 2024"
    },
    {
      "title": "A good night's sleep ",
      "text": "Spent one night here after an overseas flight. Check in took a bit longer than expected but all ended well. The room was clean and comfortable. Nice big walk-in shower. And the hotel was surprisingly quiet considering how many people were meeting in the lobby. We got a good night of sleep. The breakfast was what has become the normal in hotels. No surprises here. Decent enough to stay here next time through.",
      "rate": 4.0,
      "tripDate": " May 2024"
    },
    {
      "title": "The bed was comfy",
      "text": "The bed was comfy...everything else could use a deep refresh. Still bitter about paying $215 for an 8 hour stay. Breakfast was $25! I'll eat somewhere else tyvm. Bathroom door on a roller track presumably because the frames were shot. Fan on the heater couldn't be turned off.",
      "rate": 3.0,
      "tripDate": " January 2024"
    },
    {
      "title": "Stay here!",
      "text": "This hotel is Very Clean!!  Check in was very quick and easy.   Rooms very clean and set up for connivence.   Included breakfast was very good, coffee was good.  Nice pool and work out facilities.  All employees we encountered were nice and polite.",
      "rate": 5.0,
      "tripDate": " March 2024"
    },
    {
      "title": "Great new hotel with great staff!",
      "text": "A new hotel that is amazing in style and comfort. The staff were very accommodating and professional. The room was nice and clean. The bed was comfortable and the bathroom was a good size. The room had nice amenities such as large tv, fridge and breakfast.",
      "rate": 5.0,
      "tripDate": " November 2023"
    },
    {
      "title": "First-Rate Service Makes a Difference",
      "text": "A little context: I have spent many hundreds of room-nights in hotels over the years, most of them while on business and most of them at IHG properties. I am rarely compelled to write a review for reasons good or bad.That said, during a recent business trip I had the opportunity to stay at this property for just one night. The staff and service were so good I feel compelled to write this review. To keep it simple and succinct: the staff EXUDED a genuine caring and commitment to service. How they interacted, their graciousness, their willingness to be helpful, the thank you card in the room - my experience was that they genuinely cared about providing outstanding service. What a breath of fresh air! Especially as we see the ongoing degradation of service in so many situations these days.Thank you! Keep up the great work. Yes, emphatically, first-rate service does still make a difference!",
      "rate": 5.0,
      "tripDate": " January 2024"
    },
    {
      "title": "This is what all mid-priced airport hotels should strive for",
      "text": "This recently-opened hotel is what all mid-priced airport hotels should strive for.It is quiet and spotless. The rooms are spacious, well-designed and have a fresh contemporary look. I've never seen so many electrical outlets in a room.I normally pass on complimentary hotel breakfasts because I'm so tired of them. I didn't this time, probably because of the warm and fresh cinnamon rolls. I hope Marriott notices this.I enjoyed having a showered tall enough for a NBA player and how they eliminated all those small plastic bottles of shampoo in favor of dispensers.I picked this place because I had signed up for an IHG credit card so I could get some free nights on my motorcycle trip. In other words, I'm not this hotel's target customer. Flight info was display on a monitor in the airy lobby.There are several EV charging stations next to the front door.I do wish it had a restaurant, but that's asking a lot at this price point. There is the mediocre Arizona Grill & Lounge a short walk down the road.They only nit I would pick was a lack of a notepad and pen in the room.",
      "rate": 4.0,
      "tripDate": " July 2023"
    },
    {
      "title": "Well-reported hotel",
      "text": "Friendly hotel with friendly staff, beautiful large room with good bedding, bathroom with toiletries. Very clean room. Breakfast with everything from savory to sweet. Close to the airport, no plane noise. Located in a place where there are only offices.",
      "rate": 4.0,
      "tripDate": " July 2023"
    }
  ]
}