{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Holiday Inn Express Toronto East - Scarborough, an IHG Hotel",
    "url": "/Hotel_Review-g155019-d181956-Reviews-Holiday_Inn_Express_Toronto_East_Scarborough_an_IHG_Hotel-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.0",
      "reviewCount": 347
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "50 Estate Drive",
      "addressLocality": "Toronto",
      "postalCode": "M1H 2Z1",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2c/02/5d/5c/welcome-to-the-holiday.jpg?w=500&h=-1&s=1"
  },
  "description": "Welcome to the Holiday Inn Express Toronto East only 4.3km from Aquatics Centre & Field House and 25km to downtown Toronto!Located in the heart of Scarborough, the Holiday Inn Express Toronto East hotel is located near the Centennial College, the University of Toronto-Scarborough Campus and the Seneca College. When staying with us, at the Holiday Inn Express Toronto East, visit the famous Metro Toronto Zoo, home of the giant Pandas.Avoid the hustle bustle of downtown as we are steps away from public transportation that could take you to the subway which would get you to downtown for events or you could drive to these events within 30-45 minutes based on traffic. We are in close proximity to: the Scarborough Grace Hospital, the Centenary Hospital, the Scarborough General Hospital and the North York General Hospital. Also nearby, the Scarborough Golf Club is located approximately 4 km. The hockey arena Canlan Ice Scarborough is 7km from the hotel.",
  "featues": [
    "Free parking",
    "Free High Speed Internet (WiFi)",
    "Fitness Center with Gym / Workout Room",
    "Free breakfast",
    "Business Center with Internet Access",
    "Meeting rooms",
    "BBQ facilities",
    "Baggage storage",
    "Parking",
    "Wifi",
    "Breakfast available",
    "Breakfast buffet",
    "Currency exchange",
    "Newspaper",
    "Non-smoking hotel",
    "ATM on site",
    "24-hour front desk",
    "Express check-in / check-out",
    "Dry cleaning",
    "Laundry service",
    "Ironing service",
    "Air conditioning",
    "Housekeeping",
    "Safe",
    "Flatscreen TV",
    "Non-smoking rooms",
    "Family rooms"
  ],
  "reviews": [
    {
      "title": "Really great for the price",
      "text": "Stay at the King Executive (its usually 80 or 90 bucks). Large-ish room with a nice brick wall on the side of the bed. Comfortable room & comfortable breakfast and sitting areas. Plus 2 computers that are connected to the internet in the main area.Continental breakfasts are always poor, but at least this place has warm cinnamon buns.",
      "rate": 4.0,
      "tripDate": null
    },
    {
      "title": "Great place to stay....",
      "text": "I highly recommend this place to stay in Scarborough. The room is spacious, and clean. The amenities in this hotel was wonderful. I enjoyed the morning continental breakfast. They served the essentials like cereal, cinnamin buns, coffee, tea, hard boiled eggs, juices, and toast. The fitness room was small but it was enough to break a sweat and continue your daily exercise if you workout on a regular basis. They also had two computers and a printer for use if you needed the internet. The employees were friendly and very attentive. Next door to the hotel there's a restaurant (The Keg) and the steaks are Mmm, Mmm, Delicious....",
      "rate": 4.0,
      "tripDate": null
    },
    {
      "title": "Can't wait to return!!",
      "text": "I was very pleased with my stay at this Holiday Inn Express. I arrived tired and thirty minutes early. Unlike some hotels that have had me wait in the lobby until check in time, they checked me in immediately! The staff was polite, friendly and courteous. Not only is the hotel conveniently located right off the 401, but the Keg Steakhouse is adjacent to the hotels parking lot. VERY CONVENIENT!!  The continental breakfast was delicious and plentiful. I would definitely recommend this hotel and I look forward to my next stay.",
      "rate": 5.0,
      "tripDate": " May 2012"
    },
    {
      "title": "2nd Class Treatment",
      "text": "My husband and I , along with our two young children overnighted at the Holiday Inn Express Toronto East while in town for a family function. Our booking, made via Priceline, was for 2 adults, 2 children and specified a non-smoking room. Upon arrival, we were promptly informed that we would be given a King sized, smoking room. When we indicated that this was not what we had requested, we were advised that we could not make changes to our room type, that they were fully booked by clients who had booked directly through the hotel, and that since we booked via Priceline, we were \"getting what we paid for\". We asked for no special treatment, only what Priceline guaranteed which was  a non smoking room, and  2 double beds. The front desk attendant called the manager on duty over, who proceeded to inform us that he did not believe his property should be offered on Priceline, and that this happens often; it is a huge problem between Priceline and Holiday Inn at a corporate level. None of which is either professional from a client experience standpoint or my problem as a paying guest. It was a missed opportunity to impress us as Priceline is often the gateway for a client to get to know either a chain or a specific property. Had it been managed properly, there could have been potential to attract me as a frequent guest. Miraculously, after escalating our compliant, a room became available despite being told repeatedly that the hotel was booked solid. With a 4 and 6 yr old in tow and a non refundable reservation, this experience has tarnished my view of the Holiday Inn Express overall. I feel the need to say that neither the Doubletree by Hilton, nor the Best Western Plus, or Hampton Inn & Suites have ever made us feel like thieves or less important than any other guest, due to our booking on Priceline. Their standards of excellence would dictate that this behaviour is not only unprofessional, it is bad for business. I will never again stay at this chain, which by the way, was mediocre, at best, reeked of cigarette smoke in the lobby and we paid only $30 less than their rack rate. Way to make a client feel appreciated.",
      "rate": 2.0,
      "tripDate": " August 2014"
    },
    {
      "title": "Makes Me Appreciate the Hampton Inn",
      "text": "I travel a lot for business, and stay in hotels on average once a week.  Typically, I stay at a Hampton Inn or Hilton Garden Inn.  Perhaps I've been spoiled by my stays at these chains, but the Holiday Inn Express left a fair bit to be desired.  First, when checking-in there was one person ahead of me.  She was being taken care of by one employee while 2 others stood behind the counter.  I waited patiently while they conversed and after a couple of minutes, one of them finally asked if they could help me.  Standing in line in my winter coat with briefcase and luggage in hand, apparently it was not obvious enough.  Checking in was long drawn out process.  Keep in mind that my reservations are made with my corporate card through an accredited travel agency.  I was asked to fill out tons of paperwork including name, address, email, phone, etc, despite this information already having been provided to the hotel when my reservation was made by the agency (I know as I was copied on the reservation confirmation).  After 15 minutes of wasting my time, I finally made my way to my room.  Upon entering, I noticed that the heat was cranked (manual temp control) and the room was around 85 degrees (estimating since there is no thermostat in the room).  Immediately, I turned on the cold air (it was -20 degrees outside) to try to get the room to a reasonable temperature.  Looking around the room I noticed there was no desk, which was something I wanted to do some on that evening.  The only thing in the room was a round table with a lounge chair - not exactly something that is user friendly for working on a laptop.  I returned to the desk to see if I could change rooms, as I didn't want to wait in a sauna as the room cooled and if there was a room that had a work desk.  Was told they were close to capacity and couldn't do anything about it.  Returned to my room to the phone ringing.  It was the girl at the desk asking if everything was okay with my room.  Really?  Did that just happen?  Anyways, after settling in a bit I began noticing everything that just told me I wasn't staying one of my usual hotels - no fridge, no desk, poor lighting, rock hard beds, 4 pillows all marked \"firm\" (I think the idea of marking them is so that you have a choice between firm and soft, but don't let me tell you how to run your hotel), good luck finding an electrical plug, noisy radiator and not so clean room/bathroom.  Complimentary breakfast was disgusting.  After a couple of bites, I passed on the complimentary salmonella.  I stayed here because it was close to where I needed to be, but next time it's worth driving the extra half hour and staying at closest Hilton Garden Inn or Hampton, especially considering the Holiday Inn was the same price.",
      "rate": 2.0,
      "tripDate": " January 2014"
    },
    {
      "title": "Excellent experience overall. Quiet clean & staff very helpful & polite & professional.",
      "text": "From the moment I got there until I left I felt all the staff had my best interest at heart. I choose the hotels i stay in carefully & online this one looked great. It truly was 10 out of 10. Super quiet clean great breakfast but the staff really set this hotel apart.  They all were fantastic.",
      "rate": 5.0,
      "tripDate": " May 2013"
    },
    {
      "title": "Didn't linger but seemed okay for a stopover",
      "text": "My husband and I were on our way to Bar Harbor, Maine via Toronto and Montreal.  We checked in about 8pm.  There was no line and we were greeted by a nice gentleman who informed us of breakfast.  Our room was clean, quiet and comfortable, really, what more can you ask for in a room.  We ate next door at The Keg and had a great meal.  The breakfast was very typical of the \"free breakfast\" and did the trick until our next meal.  It was a little packed in the dining area but we managed to find a table.  I would go back under the same circumstances. A nice stopover.",
      "rate": 3.0,
      "tripDate": " July 2014"
    },
    {
      "title": "Pleasant Stay but not that awesome.",
      "text": "This is the place that you would want to stay for a short period of time. Obviously its not a five star hotel and you shouldn't expect 5 star treatment, in terms of, having people help you with your bags and helping you settle you in. Having said that, it is a nice place. It is kept clean and neat. Note that, they only give you complementary breakfast, hence, for lunch and dinner, you will need to go look for food. There are nearby fast food places and coffee shops, so you won't starve. The front desk people were very helpful and helped a lot considering I was new to the area.The rooms were big and clean. I had a single room with two queen beds. So sleep was comfortable. The room also had heat.There was WiFi and some computers in the lounge if that is something that you care for.My stay was pleasant and short. If you are looking for a place to stay for a long time, this is not the place because of an extreme lack of things to do.But if its 'express' it will be a pleasant stay.",
      "rate": 3.0,
      "tripDate": " December 2013"
    },
    {
      "title": "Worth The Money",
      "text": "Stayed here for 6 nights. The staff was very courteous. I requested a fridge/Microwave for the room, and the guy at the desk brought it down himself (there is no elevator)! The rooms are kinda dull, with brick wall on one side, but very spacious. The carpet needs updating. I drove to the Hockey hall of Fame, which took about 10 minutes. It is a great price to pay if you are just visiting to see the sites. You save alot by staying here and driving a little longer, but you have more cash to spend! The location is very convienient to 401, and all the attractions (HHOF,CN Tower,Hard Rock etc) are all withn a short, easy drive. There is a nice (little pricey) restaurant next door (The Keg) and a small gas station/mini-mart on the corner. Breakfast was decent, had a great selection to choose from. Would highly recommend to stay here versus downtown.The in-room internet worked great. Be sure and bring your own ethernet cord as they sell their cords for 20.00$$!",
      "rate": 3.0,
      "tripDate": " July 2006"
    },
    {
      "title": "Good value",
      "text": "We stayed just for one night and we were very pleased with the room.  The only improvement would be better lighting in the bathroom needed for make-up application.  The continental breakfast is quite good with cereals, breads, bagels,muffins, cinnamon buns,and hardboiled eggs.  Most of all the coffee was quite decent, not your usual watered down variety.",
      "rate": 5.0,
      "tripDate": " November 2005"
    },
    {
      "title": "Comfortable hotel handy for the 401",
      "text": "Six of us stayed on a Tuesday night.  We chose this location as we were attending a Blue Jays game and this hotel is very handy to the 401 and Eglinton GO Train station is a simple 10 minute drive away.  The decor is bright and modern and the rooms are large and well appointed.  Breakfast is included and is the usual hotel self serve fare.",
      "rate": 4.0,
      "tripDate": " June 2017"
    },
    {
      "title": "Convenient, friendly and economical",
      "text": "I have been a regular guest of this Express Holiday Inn for over 10 years, mostly on business. Furthermore, I can tell you I have never been disappointed with the treatment from a superb collection of staff members. Whether it is front desk check-in, to the housekeeping through to the free breakfast, there has never been anything to complain about. And, if you consider a hotel room a \"home away from home\" that is saying quite a lot. Don't expect Fairmont luxury, this is an economy-minded hotel but do expect complete value for your money. One visit where \"Angela\" checks you in will convince you it is going to remain in your memory as one of the most pleasant hotel stays ever!",
      "rate": 5.0,
      "tripDate": " May 2017"
    },
    {
      "title": "A friendly place",
      "text": "I stayed here for one night on business and as with most other Holiday Inns I've been to I found the place to be very nice. The staff on the front desk were very helpful and breakfast in the morning had lots to choose from. The room was pretty standard but very comfortable and clean. If I found myself working in the area again I would certainly stay here.",
      "rate": 4.0,
      "tripDate": " September 2016"
    },
    {
      "title": "Pleasant and Comfortable Stay",
      "text": "First time staying at the HI Express Toronto East. Convenient location next to 401. Stayed in a spacious 2 Queen Bed room. Beds were comfortable and room was clean. Nice added touch of a power bar with multiple outlets between the beds to charge up all of our electronics. Although the hotel is close to 401, we never heard any noise from the highway. Enjoyed the standard Holiday Inn Express breakfast in the morning. Staff were very nice and professional. Hotel is in close proximity of several restaurants and the Scarborough Town Centre. Free parking.",
      "rate": 4.0,
      "tripDate": " March 2017"
    },
    {
      "title": "Toronto Blues Jays visit",
      "text": "Stayed for two nights. Easy access to downtown via 401and Don Valley if you have a car. Price was right and breakfast was quite adequate. I would stay again. Room was clean and quite. Staff friendly and helpful.",
      "rate": 4.0,
      "tripDate": " August 2016"
    },
    {
      "title": "Never again.",
      "text": "Staff was not very helpful at all.  Their free breakfast was cold and very low pickings.  I understand smoking was still allowed but fir them to place me in a smoking room when requested a non smoking room was not very professional.  Then turned around and said ibcouldnt get a non smoking room cause they just filled up yet i booked month in advance.  And with yhe smoking.  Allowe ld people to amoke in hallways and smoke weed as well so bad we can smell it on other side of hotel.  When staff was told about it we were told oh well.  Onlygood yhing was room was clean.  That was it....shoukd of stayed in a cardboard box.",
      "rate": 1.0,
      "tripDate": " July 2016"
    },
    {
      "title": "Manage Your Expectations & It'll Be Great!!",
      "text": "My wife and I just returned from a 4 night stay at the Holiday Inn Express Toronto East.  We were slightly apprehensive at first based on some of the reviews that we had read; I’m glad we moved forward.  To be honest, managing expectations is the key.  We actually had an excellent stay.First, the location is unbeatable if you’re staying in Toronto and don’t necessarily wish to be downtown.  The hotel is right off the 401 Expressway which you WILL need to get where you’re going.  You’ve got a Petro Canada gas station right on the corner, a McDonald’s on the other corner and a Tim Horton’s just up the road.  Not to mention you, you have Markham Station approximately a mile down the road for your 24 hour dining needs.  You’re also about 2 or 3 exits down on the 401 from the Toronto Zoo exit.The hotel itself is very quaint.  When you're inside, you almost feel as if you’re in a cabin in the woods.  The décor, especially in the lobby is very wood cabin esque.  Now don’t get me wrong, previous reviews are somewhat correct that the hotel is a little dated and in need of some updating.  But again….managing expectations are the key.  Our room was a double room and was very clean.  Lighting could have been a bit better overall.  There was an entrance hallway light, 1 tall lamp and 1 lamp between the beds.  There definitely needs to be a bit more lighting.  There were multiple power strips in the room to take care of your outlet needs to charge all of your devices.  The bathroom was spacious and probably better lit than the room itself.  Water pressure was excellent in the shower.  While we never saw the housekeeping staff, our room was back in tip top shape each evening when we returned.We took advantage of the complimentary breakfast in the lobby on one of the mornings of our stay.  The lay out was decent; eggs, sausage, pancakes, cereals, fruits and all of your breakfast beverages.  The lobby also has coffee available all day which is a plus.  There are also computer workstations and printers available in the lobby if needed.If you’re in the greater Toronto area looking for an accommodation that provides great value and won’t break the bank, I’d highly recommend this property.  I would not hesitate to return.  The location is great.  The facility is decent and it delivers what you need.  This isn’t a 5 star property.  Maybe not even a 4 star, but it was a great little gem.  I’d be back in a heartbeat.",
      "rate": 4.0,
      "tripDate": " June 2016"
    },
    {
      "title": "Dated, Not Very Clean",
      "text": "Check in was quick. Room was a bit dated. Pulled back the bedding to find a dirty tissue on the bed under the covers which leads me to believe that the bedding had not been changed since the previous guest.",
      "rate": 2.0,
      "tripDate": " May 2016"
    },
    {
      "title": "Hospital visit stay",
      "text": "Everything was great! The staff were very friendly, welcoming and helpful. I got a call shortly after I checked into the room to make sure it was as expected. The use of styrofoam in the breakfast area is the only complaint I have, but that might be a head office decision. The use of compostable one-time-use breakfast plates, cups and bowls would be wonderful for the environment and a great addition to all Holiday Inns!",
      "rate": 5.0,
      "tripDate": " April 2016"
    },
    {
      "title": "Relaxing stay",
      "text": "Although the exterior of this hotel looked a bit older than I had expected, we found it had the features that travelers most value: excellent bed, clean and modern room, free WiFi, and that wonderful added bonus--a plentiful breakfast every morning, with good coffee and a gracious staff. It is in a small industrial park off Markham, just south of 407 and near the Scarborough Town Centre mall and subway station, for easy access into downtown Toronto. Rouge Park is to the east. Will definitely stay here again!",
      "rate": 4.0,
      "tripDate": " August 2015"
    },
    {
      "title": "Cozy feel",
      "text": "Had a good experience for our 3 night stay. Rooms were clean, hotel has plenty of parking and staff are friendly. The breakfast selection was better during the week as opposed to the weekend but that's minor. Convenient to fast food, fine dining, gas and  major interstates.",
      "rate": 4.0,
      "tripDate": " March 2015"
    },
    {
      "title": "Good location for a short stay",
      "text": "We had hoped for a location downtown, but the Toronto International Film Festival literally had almost every room in the city sold out.  In the end, the location served us well to visit friends in that part of the city.  There is a major shopping center nearby and the Keg steakhouse right next door.  Located right next to the highway it was also a good starting point for our next trip.On check-in the staff were friendly and efficient.  As a matter of fact, every employee we encountered was friendly and helpful.My first impression of the parking lot was that it would not be adequate, but I later learned that it wrapped around the hotel on three sides so it's easy to pick an entrance close to your room.Being an \"Express\" location I did not have the same expectations I would place on the regular holiday inns, but what we got was quite good.  The only short coming I noted was the lack of an in-room safe - I like to lock up passports and extra cash when I go out.The room was quite large enough and properly cleaned.  My wife's first comment was that they had not left bottles of drinking water, but of course we were now in Canada and the tap water is 100% safe to drink.  I had thought there would be noise from the nearby highway, but it seems there is sufficient insulation and good quality windows so that we heard none.  The temperature control system was different than I've seen before.  Just set the desired temperature and it would figure out if heating or cooling was needed.  This came in handy when there was a rapid drop in temperature overnight.Breakfast surprised me!  Of course it's not the same variety one would expect at a 5 star hotel, but it was still better than I've experienced at some other places and it exceeded my expectations.",
      "rate": 4.0,
      "tripDate": " September 2014"
    },
    {
      "title": "Nice enough!",
      "text": "Stayed here a couple of nights, Staff are friendly and make a lot of effort to make things decent for guests. The place is clean, there is free coffee and tea in the lobby. The room was clean. The only negatives I can think of are that the towels in the bathroom looked a bit worn out, and the WiFi service they offer isn't the greatest. Everything else was pretty good. They do have a complimentary breakfast here, we didn't have it but if and when we stay here again we will give it a try. I would come back here.",
      "rate": 4.0,
      "tripDate": " August 2014"
    },
    {
      "title": "overnight stay",
      "text": "Hotel was clean, staff were very friendly and helpful.  Breakfast was the typical complimentary breakfast with scrambled eggs, sausage, cereal, pancakes etc.  Bathroom in room was updated and clean.  Check in was quick and we received a courtesy call 20 minutes after we got in our room to ensure everything was OK.  The only issue was that i found the bed was too hard but that is a preference thing.Hotel was close to restaurants, stores and a theatre.  Very close to the 401 for convenience.",
      "rate": 3.0,
      "tripDate": " July 2014"
    },
    {
      "title": "Clean, safe and excellent value",
      "text": "I stayed at this hotel for four nights and was very satisfied. Less than $100 a night included a full hot breakfast and parking. My room was clean, spacious and comfortable. It felt safe and the staff were friendly. Although it's not downtown, the hotel is only a couple of minutes off the 401 and there are many restaurants nearby, including the Keg which is next door. It's close to the Toronto Zoo and the Scarborough Town Centre and is only about a 30-minute drive to downtown Toronto. I definitely will be returning.",
      "rate": 4.0,
      "tripDate": " April 2012"
    },
    {
      "title": "Free Parking is a bonus",
      "text": "For Toronto price reasonable and close to highway 401. Good enough self-serve breakfast included. Clean, friendly and free parking. Do not try to get from downtown to hotel in rush hour but normally less than 30 minutes into center.",
      "rate": 4.0,
      "tripDate": " March 2012"
    },
    {
      "title": "A great place for a good night's sleep",
      "text": "This Holiday Inn is well situated just off the 401 at Markham Road and adjacent to the Keg Steak House.. The hotel staff are very helpful and courteous. The rooms are clean, quiet and modern with free internet. Good rates compared with downtown hotels and free parking all add up to great value. There is nothing fancy or pretentious here just a good place for travellers to spend a night.",
      "rate": 4.0,
      "tripDate": " February 2012"
    },
    {
      "title": "Very dissapointed and insulted!",
      "text": "I have stayed at this hotel a few times and I must say this, being in the tourism industry, and knowing how competitive the market is - CUSTOMER SERVICE is key.  A previous review said that the staff are not genuine and I would have to agree.Note: If you do not have a credit card - beware.  It's a BIG issue.  The first two times were not, and then they change the policies every time I visited this place.  The gentleman at the front desk makes everything a problem from checking in to checking out.  If Mr. DeSouza would like more information please provide me with an e-mail address and I will gladly give you more information. The front desk agent was not only RUDE but he told his \"trainee\" to SHUT UP in front of me.  Not very professional.   Here's where it gets interesting.  I come to the front desk to check out and because i left a cash deposit - Mr. unprofessional at the desk makes it a point to call the housekeeping to see if the room was ok.  The housekeeping says YES.  He proceeds to give me my deposit......I walk outside and there he is in his business suit walking in the snow and asks me: excuse me miss did you by mistake take the towels!!!!!!!!! ARE YOU KIDDING ME.  First - check with your housekeeping staff.  The towels are in the bathtub.  I have travelled to many places and stayed in over 200 hotels.  NEVER in my life have I ever felt like a thief and felt this unwelcomed.The rooms are ok.  The lobby DOES smell like smoke (where the tv/couch area is).I highly suggest a change of staff or some very extensive customer service training.",
      "rate": 2.0,
      "tripDate": " March 2011"
    },
    {
      "title": "Decent budget hotel ",
      "text": "It’s a simple, typical budget hotel. Hotel is clean, rooms were clean and quiet, comfortable beds, good water pressure and lots of hot water.  There is nothing special about the hotel, but there is absolutely nothing wrong with it either. Staff here are great, the young women at the front desk were very friendly and helpful.  Our AC wasn’t working when we arrived, we called down and within minutes the service guy was at the door.  He assessed the ac unit and determined it needed to be replaced, he was back with a new one in 20 mins. Excellent service!Didn’t get up in time to try the breakfast, so can’t comment on that. Don’t be looking to stay at the ritz Carlton here, this place is very simple and no frills. But if you want a good nights sleep in a comfortable bed with a clean room and good service, I’d definitely recommend.",
      "rate": 4.0,
      "tripDate": " September 2019"
    },
    {
      "title": "We would stay again",
      "text": "My wife and I stayed here due to a wedding we were attending during Memorial Day Weekend. We had a bit of a hiccup checking in because we came in the middle of the night after a flight from Atlanta...we had previously requested an early check-in but it did not go through so we ended up paying for an \"extra\" night. The rooms were clean and very spacious. The Keurig coffee machines were a nice touch. The breakfast served every morning was actually pretty good. As far as the negatives, the only main one I have is the placement of the television in the far corner of the room away from the bed, or at least have a bigger screen. I would suggest adding bathmats to the showers.. I had a bit of a time standing, and as a person that had a recent hip replacement, this would be very critical. One more suggestion is that the hotel change the entrance doors to the automatic kind so that older patrons would be able to get through the doors with luggage. A great hotel and a decent price...I would come back again.",
      "rate": 4.0,
      "tripDate": " May 2019"
    },
    {
      "title": "****NICE STAY****",
      "text": "This hotel was like the average Holiday Inn.  I am always satisfied with my stay.  This once was tidy, clean, but the staff made the stay even better.  They were friendly and knowledgeable about sites and directions.  Can't wait to go back to visit and stay there again.",
      "rate": 4.0,
      "tripDate": " June 2019"
    },
    {
      "title": "My wife's handbag with cash, credit cards, driver licence, passports stolen from hotel lobby",
      "text": "We stayed at this during Sept. 11-13, 2015. We have selected this hotel based on it’s rating on Tripadvisor. Overall services were average, no complain. However, this hotel serious safety/security problem.  Any people can enter this hotel through multiple entry points without any screening. As a result, non-resident thieves can enter the lobby and masked with hotel duelers and steal their properties. They have stolen my wife’s handbag with all our cash, cards and travel documents. Hotel personnel seems not much enthusiastic to listen our problem. Seems like this type of occurrences are regular phenomenon of this hotel.",
      "rate": 3.0,
      "tripDate": " September 2015"
    },
    {
      "title": "Nice Holiday Inn Express in North York",
      "text": "Nice Holiday inn Express in North York, clean rooms, excellent bedding, AC worked well. Friendly staff, breakfast had a nice variety. everything you expect from Holiday Inn Express. Near shopping, easy parking. Would stay here if in the area.",
      "rate": 4.0,
      "tripDate": " July 2015"
    },
    {
      "title": "Awesome service",
      "text": "Spent one night with teenagers going to Vans Warped Tour. Hotel is very clean, lobby areas bright and fresh, rooms are standard but comfortable and very clean. The service was outstanding, check in was fast and friendly, they gave us excellent advice on how to drive into the city during Pam Am and for restaurants, we opted for,the Keg, right next door. Next morning,girls slept in and showed up for the complimentary breakfast at 9:40, only to find out that it was over at 9:30. The staff were so accommodating, bringing us warm cinnamon rolls, oatmeal, fruit.juice, coffee and tea are always available. To top it all off, the lady at the front desk offered tech support to my daughter who was having trouble connecting and sending in a summer school assignment from her laptop. Great location, right off th 401, excellent service.",
      "rate": 5.0,
      "tripDate": " July 2015"
    },
    {
      "title": "Group of 50 kids handled great",
      "text": "The hotel was great.  They managed to get us all in one area and close to the lobby so we could keep an eye on the action.  The hotel had a lobby area on the second floor that came in handy for the kids to socialize instead of having slamming doors if they went visiting all the friends.  The breakfast attendant was prepared for the group as well as had a meeting room set up for any over flow.  Conveniences are close like the Keg steakhouse and a gas station.  Fast food is a 5 minute walk and the mall is a very close 4 minute drive away.  Spoke to a manager and he said they will be renovating soon.  The rooms were were good but need a little modernization but the bed was comfortable and no out side noise was detected as I faced hwy 401",
      "rate": 5.0,
      "tripDate": " May 2015"
    },
    {
      "title": "Great Experience",
      "text": "My wife and I stayed here for two nights while visiting Toronto. The room was clean, the staff were helpful and friendly. It is located right off the highway so getting to Toronto was easy except for the traffic. Nearby are restaurants and fast food places and the malls are nearby.",
      "rate": 5.0,
      "tripDate": " May 2015"
    },
    {
      "title": "Amazing caring staff",
      "text": "I was there for a hospital visit. Staff recognised me on arrival, were helpful,and caring.I was offered coffee in the early morning,they got me a taxi in minutes. The hotel is very clean only minor problem the hot water was a few minutes coming I guess because of the early hour.",
      "rate": 5.0,
      "tripDate": " May 2015"
    },
    {
      "title": "Quiet",
      "text": "Quiet room, 2nd level, no need for heat or air conditioning, good sleep. Far enough off 401 (2 blocks via street) to reduce noise. Small window at bottom can be opened. Good breakfast, including yogurt, banana, orange juice, scrambled eggs, toast, etc. Rather pricey but it was a holiday weekend, hotel full.",
      "rate": 5.0,
      "tripDate": " May 2015"
    },
    {
      "title": "Great place to stay when you visit Toronto",
      "text": "Safe, well maintained and clean. The front desk was always friendly and check in was fast. The reason we chose this hotel is that it is three minutes away from Scarborough Town Center. If you want to visit Toronto the best way to do it is to ride in on the subway. There is free parking at Scarborough Town Center and you can catch the subway there and ride into downtown Toronto.",
      "rate": 5.0,
      "tripDate": " May 2015"
    },
    {
      "title": "Overall good for Holiday Inn Express and they do strive for great service",
      "text": "Was a little wary of some of the reviews on here but overall I think they are unjustified. People need to remember it's a Holiday Inn Express and as such mirror their comments to the brand and the offering. For seasoned travellers, you would know the levels of the IHG brand and expectations of service.I had a warm welcome, thanking me for my membership, reconfirming my rate and the hotel offerings. Room was standard - clean, decent size and good internet and TV channels. I am still undecided on the bed- was it too hard, old or just about right? I will reserve judgement as I cant make up my mind.Breakfast was OK - again for the brand one should not expect breakfast at Tiffanys! Checkout was great - how was your stay and confirming all the details of my stay.",
      "rate": 4.0,
      "tripDate": " March 2015"
    }
  ]
}