{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Holiday Inn Toronto International Airport, an IHG Hotel",
    "url": "/Hotel_Review-g155019-d181984-Reviews-Holiday_Inn_Toronto_International_Airport_an_IHG_Hotel-Toronto_Ontario.html",
    "priceRange": "$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.5",
      "reviewCount": 1045
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "970 Dixon Road Rexdale",
      "addressLocality": "Toronto",
      "postalCode": "M9W 1J9",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2c/3f/86/28/welcome-to-holiday-inn.jpg?w=500&h=-1&s=1"
  },
  "description": "Toronto Airport Hotel sits near the International Centre The Holiday Inn® Toronto International Airport (YYZ) welcomes you to our airport hotel conveniently located minutes from Toronto's Pearson International Airport. Easy access to Highway 401, 427 and 407 will put guests just minutes away from Toronto attractions. You'll love our 24-hour airport shuttle service and accessible location. We're close to the Toronto Congress Centre and Toronto International Centre. Our flexible 20,000 sq ft of meeting facilities are the best among Toronto airport hotels. Combined with award-winning catering, we are ideal for any event. Nearby attractions like the Woodbine Entertainment Centre and Wet N Wild Water Park offer family fun. The Hotel includes 451 guest rooms and suites to complement the inviting lobby, public areas and over 20,000sq. ft. of flexible conference space.",
  "featues": [
    "Valet parking",
    "Free High Speed Internet (WiFi)",
    "Fitness Center with Gym / Workout Room",
    "Pool",
    "Bar / lounge",
    "Bowling offsite",
    "Patio",
    "Kids stay free",
    "Paid public parking on-site",
    "Wifi",
    "Fitness / spa locker rooms",
    "Pool / beach towels",
    "Indoor pool",
    "Heated pool",
    "Shallow end in pool",
    "Coffee shop",
    "Restaurant",
    "Breakfast available",
    "Breakfast buffet",
    "Complimentary Instant Coffee",
    "Complimentary tea",
    "Kids' meals",
    "Outdoor dining area",
    "Special diet menus",
    "Wine / champagne",
    "Vending machine",
    "Water park offsite",
    "Children's television networks",
    "Highchairs available",
    "Car hire",
    "Taxi service",
    "Business Center with Internet Access",
    "Conference facilities",
    "Banquet room",
    "Meeting rooms",
    "Couples massage",
    "Facial treatments",
    "Foot bath",
    "Foot massage",
    "Full body massage",
    "Hand massage",
    "Manicure",
    "Massage",
    "Neck massage",
    "Pedicure",
    "Baggage storage",
    "Concierge",
    "Convenience store",
    "Currency exchange",
    "Non-smoking hotel",
    "Outdoor furniture",
    "ATM on site",
    "Doorperson",
    "First aid kit",
    "Umbrella",
    "24-hour check-in",
    "24-hour front desk",
    "Express check-in / check-out",
    "Dry cleaning",
    "Laundry service",
    "Self-serve laundry",
    "Washing machine",
    "Allergy-free room",
    "Blackout curtains",
    "Air conditioning",
    "Desk",
    "Housekeeping",
    "Coffee / tea maker",
    "Cable / satellite TV",
    "Bath / shower",
    "Interconnected rooms available",
    "Room service",
    "Seating area",
    "Telephone",
    "Clothes rack",
    "Iron",
    "Private bathrooms",
    "Tile / marble floor",
    "Wake-up service / alarm clock",
    "Refrigerator",
    "Flatscreen TV",
    "On-demand movies",
    "Radio",
    "Complimentary toiletries",
    "Hair dryer",
    "Non-smoking rooms",
    "Suites",
    "Family rooms"
  ],
  "reviews": [
    {
      "title": "Great last minute accommodation.",
      "text": "Had an unexpected overnight stay after our flight was canceled last minute due to poor weather. A fair price for the night and only a few minutes from the airport via Uber. Unfortunately there was a bit of a mix up with our reservation but, upon arrival, Nicolas was able to help straighten it all out and we were able to get a room right away and sleep comfortably. We were tired and he was polite, calm, and genuinely helpful. Thank you, Nicholas! The fifth floor is a 24-hour quiet floor, which was great. Very quiet and easy to sleep.",
      "rate": 5.0,
      "tripDate": " June 2024"
    },
    {
      "title": "good for stay, park and fly",
      "text": "We stayed here for one night before our trip south and left our car in the parking garage for 8 days. The lineup for the airport shuttle in the morning was so long that there wasn't room on the shuttle for everyone. Since it was 5am and the hotel is so close to the airport, the driver was back within 15 minutes and we still made it to the airport with plenty of time to spare. The front desk staff and shuttle driver were all friendly and helpful. The room was clean and the bed was comfortable. We'll stay here again before our next flight.",
      "rate": 4.0,
      "tripDate": " April 2023"
    },
    {
      "title": "Nice place to stay",
      "text": "The hotel price and facilities are good for a 3 star rating, Ping is the housekeeper for my room, she is so friendly and helpful! If this hotel could offer slippers and drinking water inside the room would be great, since I have to go to second floor for drinking water.",
      "rate": 5.0,
      "tripDate": " June 2024"
    },
    {
      "title": "Best hospitality by Jayesh and Nick",
      "text": "Best hospitality by Jayesh and Nick, I have ever encountered in my life. So helpful and there for me.  A memory to remember. Ambience is royal and modern. So amiable. The music , the ambience. Their promptness to the guest and best service. Jayesh treated me as the family member and Nick a best companion. Thank you guys",
      "rate": 5.0,
      "tripDate": " May 2024"
    },
    {
      "title": "No soap. Quick shuttle to airport.",
      "text": "Arrived at hotel Friday evening and checked in. They ask if I need to park…,huh? I made the reso via. Third party booking company and I spent 15 min on phone confirming our night of stay and departure and return. Had the lady verify that I was booked for parking!! Clerk says oh that’s the 2nd time that’s happened today! Well wtf! I had to pay out $147 for 7 days of parking on top of the $250 I was charged for room and parking so I thought. I wasn’t impressed but we need a place to sleep and park while on vacation so I pay the fee. No soap in room, like literally not a bar of soap. Thank goodness my hubby is a smart cookie and he thinks of these things and had a bar of soap. I’ve contacted the company I booked with and I await a reply. Shuttle is quick and efficient to Pearson!",
      "rate": 2.0,
      "tripDate": " January 2024"
    },
    {
      "title": "Research for best price.",
      "text": "We stayed here previously and were convinced to join the IHG Rewards program which promises the best price, etc, etc. This stay of 2 nights was less than our expectations for the price.I should state that we did not park a vehicle so we didn't incur an additional fee for parking. The food while excellent is over priced and drinks are hiway robbery. Upon check in we were told that we could have a late check out which we declined and were advised should we change our mind \"just let us know\".  When our flight was delayed we asked for a 2pm check out and were declined.I grabbed what I assumed to be a clean towel off of the top shelf on the towel rack and proceeded to dry my hair after my shower. When I went to dry my face and body I noticed it was filthy.  Brown spots and streaks all over it.  I was disgusted. I took pictures and reported it to the front desk. Our first stay at this hotel was booked through trevrluro and ironically I got an email advertisement the night before check out. The price  was $60 and $70 per night less than what we paid. So much for the IHG Reward Program best price guarantee. My free program costed me $130 more than I would have paid booking indirectly through another party.  BUYER BEWARE. Check your search engines before you book direct with this hotel for the best pricing!",
      "rate": 3.0,
      "tripDate": " December 2023"
    },
    {
      "title": "Incorrect website information and poor customer service",
      "text": "Scam of a place. The website says there is no airport shuttle (they will probably update it by the time this review is published) so we got a $28 taxi for a 2 min cab ride. When we got to the hotel and said “we thought there was a shuttle?” They said yes we do. I showed the manager the website that said no shuttle and his response was that they have 3 separate websites and that they may not all be correct, and that in any case it’s the responsibility of my travel agent to advise the at there is a hotel shuttle. They would not take responsibility for the fact their website had the wrong info which led us to take a taxi. For $28, they could have reimbursed us and made things right, but they chose not to.",
      "rate": 1.0,
      "tripDate": " December 2023"
    },
    {
      "title": "Larry is great at his job! ",
      "text": "Larry the doorman is great! So friendly and very good at his job. :) He is friendly and joking around with everyone coming in and out of the hotel. Made me feel like I was coming home each time we came in the front doors.",
      "rate": 5.0,
      "tripDate": " November 2023"
    },
    {
      "title": "Needs renovations",
      "text": "My company booked this hotel. It’s not a good hotel. The customer service is great! The hotel is dated. In desperate need of  renovations. I’m not sure about other hotels in the area. Please, check the reviews of the surrounding area or book downtown Toronto. Safe travels! .",
      "rate": 2.0,
      "tripDate": " November 2023"
    },
    {
      "title": "Close to the Airport and Quiet",
      "text": "The hotel we normally stay in was booked so this became our alternative.  Great alternative.  We stayed overnight with the stay and fly option.  It was slightly more expensive but very manageable.The hotel is easy to find on Dixon Rd.   Check in was easy.  Staff were friendly and helpful, explaining parking, restaurant option, airport shuttle and our room.The room was easy to find, no idea how full the hotel was.  The restaurant if just off the lobby and had room but we didn't explore their menu.  The room was spacious, clean and comfortable.  We were opposite the elevators but our room was very quiet.  We never heard any hallway noise at all - very impressive.  Coffee machine in the room was good, bathroom accessories were provided.Shuttle run to the airport was very smooth, runs about every half hour.  Takes about 5 minutes to get from the hotel to the airport.  The pickup shuttle from the airport was a little behind, about 20 minutes but really at the end of the day, it was seamless and the delay was not a big issue.Parking was good, controlled access.  On return from our trip, we received a checkout stub to use for parking control to exit the lot.",
      "rate": 4.0,
      "tripDate": " September 2023"
    },
    {
      "title": "Good stay",
      "text": "The room was nice and the bed was comfortable. The food in the bistro was delicious and we ordered various meals. I loved that kids ate free(although one waitress charged me for my daughter and refused to take it off). They also have a computer lounge. I loved the shuttle and everyone was nice.",
      "rate": 4.0,
      "tripDate": " April 2023"
    },
    {
      "title": "No soap. Quick shuttle to airport.",
      "text": "Arrived at hotel Friday evening and checked in. They ask if I need to park…,huh? I made the reso via. Third party booking company and I spent 15 min on phone confirming our night of stay and departure and return. Had the lady verify that I was booked for parking!! Clerk says oh that’s the 2nd time that’s happened today! Well wtf! I had to pay out $147 for 7 days of parking on top of the $250 I was charged for room and parking so I thought. I wasn’t impressed but we need a place to sleep and park while on vacation so I pay the fee. No soap in room, like literally not a bar of soap. Thank goodness my hubby is a smart cookie and he thinks of these things and had a bar of soap. I’ve contacted the company I booked with and I await a reply. Shuttle is quick and efficient to Pearson!",
      "rate": 2.0,
      "tripDate": " January 2024"
    },
    {
      "title": "Power outage two nights in a row!",
      "text": "Do not waste your money. It's not worth the time and hassle. Stayed here for the first time last night and was greeted with an electrical issues that resulted in is us not having power for 6 hours. When approaching customer service about it they were apathetic and literally said \"what would you like me to do about it, It's an electrical issue\". The hotel has power everywhere else so your welcomed to go there\". This response alone let me know that they could careless and were \"annoyed\" with so many people bringing up their concerns about this major issue.They also attempted to make it seem like this was a new issue when infact other guest revealed that the same thing had occurred the night before and in the past. Please don't be fooled by the pictures. If a concern arises that is outside of your control they will do little to nothing to help or even empathize. Manager will try to commet on this review and say sorry about your experience when the truth of the matter is he's who I spoke to and he was very rude. Please don't be fooled.",
      "rate": 1.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Great Park and fly.",
      "text": "This hotel is amazing for anyone flying out of Toronto. The rooms are spacious and newly renovated. The amenities are great including a pool and bar. Parking is some of the best in the area. It's nice to come back to a car that is not covered in snow. Shuttle to and from terminal 1 was a breeze. We will definitely stay here again.",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "I am going to try another YYZ hotel next time",
      "text": "What I liked:1. They have parking available for your car while you are away flying. What I didn't like:1. The check in counter hosts were consistently in-personable.   I walked down the street to the local Subway for supper where I found a couple of guys who seem glad to me.  At least I felt cared for there. 2. Shuttle at arrival took 45 minutes.  I may have missed it a couple of times because their bus had Embassy Suites on the side of the van. Confusing.3. The dreaded small bathtub shower. 4 The worst was the noise air conditioner.  It would be so loud I had to mute myself on a zoom call.  It was very annoying.  I took a video of it but alas, I can't up load it on Trip Advisor. I want you to know I am not kidding about the noise.",
      "rate": 3.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Surprising quality",
      "text": "The staff makes this otherwise ordinary airport hotel quite exceptional. I've been part of a nonprofit group hosting conferences here for years and it's been excellent. The location is very convenient for those traveling by car or Pearson.",
      "rate": 4.0,
      "tripDate": " March 2020"
    },
    {
      "title": "It's tired, but does the job",
      "text": "Stayed here with an 8-night parking package in January. This won't be a long review. This is a tired building. Reception is nice and quick, but the hallways and rooms show that this IHG property is an OG (or appears to be) and needs a refresh. The rooms are stuffy and old looking. The washrooms look like they're straight out of a 60's apartment with a sliding door, the showers have the awkward old low-flow heads, and the AC units leave something to be desired. It was like Katy Perry, I was hot, then I was cold. I wouldn't not stay here again, but if you're looking for anything more than a basic Motel 6 experience at an IHG property, book elsewhere.",
      "rate": 3.0,
      "tripDate": " January 2023"
    },
    {
      "title": "Close to the airport with spacious rooms",
      "text": "Spacious rooms, cosy beds and good service. This hotel has everything you need when staying close to the airport. There's even a shuttle service.Small suggestion would be for breakfast: vegan and non dairy options would be welcome.",
      "rate": 4.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Dishonest",
      "text": "I had an event that was canceled on February 2020 for an event in October 2020 due to the Pandemic.  I was promised/ approved a refund on a down payment for the event. Until now, I still do not have my money back! I was told to be patient due to the difficulties in the business. But more than 6 months waiting for my money without a response from the hotel to even manage my expectation is ridiculous. Avoid this hotel at all costs! Honesty in the service industry should be a priority.  You can't count on this hotel for that.",
      "rate": 1.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Stay at the Hampton instead",
      "text": "The shuttle driver went out of his way to be very rude to the women ahead of us.The room was dirty and had a bloody face cloth left untouched in the washroom.The fan for hot/cold is ancient and extremely loud, so much so that you can't sleep. I have always had exemplary service at the Hampton, I will not stray from them again.",
      "rate": 1.0,
      "tripDate": " October 2021"
    },
    {
      "title": "Very noisy air conditioner and wouldn't shut off properly",
      "text": "Three nights in August. Stayed here because it is close to the airport (late arrival on the first night) and they had a Platinum match offer with other brands. Because I was an IHG member and the match offer, the room provided was on the club floor which was supposedly an upgrade from a regular room.The room was clean but basic without much feeling of being a superior room. Only a few amenities that made it feel special. The major complaint was the under-window air conditioner/fan that roared when in use and the fan could not be turned to a lower and quieter level. At night, we tried to turn the unit off, but during the night it kept trying repeatedly to turn on for a few moments before shutting off and was very noisy when it did that. There was also some early morning noise from aircraft taking off from the airport.Refer to my review of the Sheraton Toronto Airport Hotel on the same trip for a comparison of a club floor room.Overall, an average hotel experience.",
      "rate": 3.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Close to the Airport and Quiet",
      "text": "The hotel we normally stay in was booked so this became our alternative.  Great alternative.  We stayed overnight with the stay and fly option.  It was slightly more expensive but very manageable.The hotel is easy to find on Dixon Rd.   Check in was easy.  Staff were friendly and helpful, explaining parking, restaurant option, airport shuttle and our room.The room was easy to find, no idea how full the hotel was.  The restaurant if just off the lobby and had room but we didn't explore their menu.  The room was spacious, clean and comfortable.  We were opposite the elevators but our room was very quiet.  We never heard any hallway noise at all - very impressive.  Coffee machine in the room was good, bathroom accessories were provided.Shuttle run to the airport was very smooth, runs about every half hour.  Takes about 5 minutes to get from the hotel to the airport.  The pickup shuttle from the airport was a little behind, about 20 minutes but really at the end of the day, it was seamless and the delay was not a big issue.Parking was good, controlled access.  On return from our trip, we received a checkout stub to use for parking control to exit the lot.",
      "rate": 4.0,
      "tripDate": " September 2023"
    },
    {
      "title": "Will not return",
      "text": "Room was dirty, missing TV remote, no microwave, small in size, squeaky mattress etc.  We were only there for 12hr or so but I'd pick another location next time I'm flying out of Toronto.  I will say the parking option was nice but the airport shuttle was filled with people from another hotel when the arrived to ours???",
      "rate": 2.0,
      "tripDate": " November 2021"
    },
    {
      "title": "Great place to stay",
      "text": "I booked the hotel online and received great customer service from day one. All the staff is so friendly and helpful and this one shuttle drive gotta love him. The food was amazing from bistro YYZ limited staff because of covid but wow they are great people. I would definitely stay here again in a heart beat. You think being so close to the airport the planes would keep you awake, do not hear a thing. Thank you holiday inn see you soon.",
      "rate": 5.0,
      "tripDate": " July 2020"
    },
    {
      "title": "Very nice",
      "text": "It’s a very clean fresh looking hotel. It looks new to me. The staff at the restaurant were efficient. I think they handled everyone well considering I don’t think they expected that many people due to the snow storm. They have a shuttle to the airport I plan on being on in the morning. Hopefully that goes well 😀",
      "rate": 5.0,
      "tripDate": " February 2022"
    },
    {
      "title": "Excellent!",
      "text": "It was a very short stay but the hotel turned out excellent. Reception was fast and pleasant . The bus shuttle runs every half hour 24 hours/ day. The room was large and clean. Bed was comfortable too. When I needed some hot water, the bar downstairs happily gave me it. I wish I could stay longer.",
      "rate": 5.0,
      "tripDate": " August 2023"
    },
    {
      "title": "Great before/after vacation stay",
      "text": "Everything was great except there was no fridge in room.  I had to throw out my leftover meal (I have 1/2 stomach and have to eat every 4 hrs) and after 2 hrs some food isn't safe to eat.  Maybe ask for a fridge, if they have any.  Also, continental breakfast was not included for some reason ?  Ask when you are booking.  It was ackward because bistro had to go look it up.",
      "rate": 4.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Room Smell",
      "text": "First walking into this hotel it looked very nice, but once we entered our room I was knocked back by the most breath taking smell. It was obviously sprayed with some kind of ungodly so called freshener I’ve ever smelt, so bad that I had to sleep with a mask on. I called Guest Services and housekeeping arrived but said nothing and left again. If you have any kind of allergies or breathing disorders I would not choose this hotel. This hotel do need to be updated, especially the bathroom. But in saying that the beds are comfortable but not enough for us to ever return to this place.",
      "rate": 2.0,
      "tripDate": " June 2023"
    },
    {
      "title": "Bad airport hotel. Avoid.",
      "text": "I’m shocked this hotel has decent ratings. This is a very bad airport hotel, especially for the cost. Rooms are small and outdated. Our bathroom was not stocked with any amenities (no toilet paper, no shampoo, etc) and the drains were clogged. Some of the elevators were out of service and the hotel doesn’t look like it’s had much maintenance or sprucing up in a decade. No water provided for IHG elites and the vending machines didn’t work in the hallways. The only good thing about the hotel is that it’s convenient to YYZ and is walking distance to a few chain restaurants. Would not recommend staying here.",
      "rate": 1.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Never Again",
      "text": "My husband and I stayed here for one night before a flight out of Pearson. We stayed to park the car for the week and the free shuttle. We needed to take the first shuttle out and got down to the  lobby 25 minutes before the scheduled time. The hotel knows it’s the holiday season and how many people would be needing shuttles and yet they had one small shuttle show up. It was totally unorganized with people budding in front of people who had waited. We didn’t get on it and ended up paying for an Uber. They should have had more then 1 bus for the first ride out for the day. Then coming back we didn’t realize there were 2 Holiday Inns on Dixon Rd and got on the wrong bus. The guy dumped us at the wrong hotel and then we had to again pay for an Uber to get back to the correct hotel. We spoke to someone at both hotels and they were zero help. I also had a manager contact me who basically said sorry for your luck. Great customer service. LolWe have stayed at the Hilton a couple of times before flying and have never had any issue. We will never stay at this hotel again. If your looking for a good place to stay before a flight don’t pick the Holiday Inn.",
      "rate": 2.0,
      "tripDate": " December 2021"
    },
    {
      "title": "If you are a parent, think twice, before you book",
      "text": "Our grandchildren were separated from their mother at CDG Paris and flew on their own to Toronto, a city that they had never visited.This hotel was booked and paid for  by us to receive them and their mother for one night.Upon their arrival they were told, understandably, that Ontario regulations said as minors, that they cannot book in.However, no help was given, the only suggestion was, they return to the airport, in the dark, at night, after a long flight, and sleep on a bench.This they did and, thankfully, they were unharmed.Would you be happy to have a child or grandchild of yours treated like this.The hotel, while refusing to reimburse, a side issue, kept saying they could have stayed in their lobby but they were NOT told this by duty staff.Our daughter, booked in to stay tonight after Air France rebooked her, has been offered a free breakfast in compensation, WOW!We hope that the hotel learn from this, and their parent company, and have a   policy in place to deal with an issue like this in the future, and ensure employees are trained.",
      "rate": 1.0,
      "tripDate": " July 2023"
    },
    {
      "title": "Amazing customer service and business support",
      "text": "I want to take the opportunity to appreciate the hotel general manager and the hotel staff for support during the years. The new general manager and the accounting division, hotel front desk and the restaurant, and every other department helped our Majestic Angel Spa become #3 of 384 spa's and wellness in Toronto with our hard working staff. We came across an issue in the spa and needed immediate help. The hotel engineer group have been extremely helpful to us from John, Frank and their team, they help us fix small issues around the spa, which we are unable to fix since we are therapists and deal with skin and body care, we definitely can take your back pain away or remove your acne or decrease wrinkles but we can't do everything, this is a totally different field.  Also, the hotel housekeeping group especially Cecilia, who cleaned our customer's area who left a big mess, without any conditions, we never forget your amazing customer service and we respect your work ethic a lot.  A special thank you to Shayan who helped us fix a horrible problem we haven't seen in years. He was so kind and helped us right away without expecting anything in return. When I was desperate, because I asked others for help but they refused to help me, I suddenly ran into a young engineer, who is Shayan in the hallway of the hotel and I asked him if he could help me just for two minutes of his time and he immediately said no problem. He immediately helped me, he was very brave and very determined to help us solve this difficult problem. I don't know how to describe the feeling of gratitude at that time, this is the reason I want to make a true article to share with you. I was hopeless and Shayan came to save the day. I appreciated him from the bottom of my heart.We need more amazing people like Shayan around the world and the world will be a more beautiful place.Spa Director of Majestic Angel SpaAngela Si",
      "rate": 5.0,
      "tripDate": " August 2023"
    },
    {
      "title": "Indifferent service",
      "text": "Service in hotel restaurant was slow - had to ask several times for help.  Also, breakfast isn’t served until 7am Sunday - had early flight and nobody would even serve a cup of coffee. No water in room to drink.  Room air conditioner kept self setting to high fan - noisy and couldn’t sleep. Would not recommend this place",
      "rate": 2.0,
      "tripDate": " March 2023"
    },
    {
      "title": "Great experience.",
      "text": "Hotel was clean, comfortable and very welcoming to an exhausted travelling family.Check in was efficient, no problem at all. Shuttle service was great even with a big group both pickup and airport drop off.",
      "rate": 5.0,
      "tripDate": " March 2022"
    },
    {
      "title": "Value money more then then people",
      "text": "they value $200 more then people’s health. They would rather risk their staff and customers a chance of getting Covid then to allow me to cancel without paying the penalty. Obviously I am not that kind of person who would risk someone’s life. So I guess I’m paying the penalty just would think with the way things are right now they would be more helpful. I did cancel 6 days before I was supposed to arrive",
      "rate": 1.0,
      "tripDate": " January 2022"
    },
    {
      "title": "Incorrect website information and poor customer service",
      "text": "Scam of a place. The website says there is no airport shuttle (they will probably update it by the time this review is published) so we got a $28 taxi for a 2 min cab ride. When we got to the hotel and said “we thought there was a shuttle?” They said yes we do. I showed the manager the website that said no shuttle and his response was that they have 3 separate websites and that they may not all be correct, and that in any case it’s the responsibility of my travel agent to advise the at there is a hotel shuttle. They would not take responsibility for the fact their website had the wrong info which led us to take a taxi. For $28, they could have reimbursed us and made things right, but they chose not to.",
      "rate": 1.0,
      "tripDate": " December 2023"
    },
    {
      "title": "Not the cleanest room..",
      "text": "I just spent three nights here in an accessible room.  It was not very pleasant.  The room was filthy, with grime and spots of liquid on the walls, baseboards, doors, light switches, you name it.  When you walked into the room, you immediately noticed that when they laid the manufactured flooring, they left 1/2 inch gaps between the ends of each length of board,  it was the oddest thing and looked horrible and completely like no one cared another to do it properly.  The staff were all quite friendly, and I didn’t bring the issues to their attention until I checked out because I didn’t want to move rooms and they didn’t have any other accessible ones.  When I did show the manager the pictures I took, aside from asking me to send him the pictures, I got no response.  No thank you, no sorry, nothing.  Overall, not super impressed, I’d give this one a pass in the future.",
      "rate": 3.0,
      "tripDate": " May 2022"
    },
    {
      "title": "Ok place. Nothing special",
      "text": "The front desk is a busy place and the lineups were big. They should have more staff come out when it’s busy. But the staff are very friendly. I had a minor issue that was dealt with promptly and they were very accommodating. The hotel layout is different but not an issue. The hallways are dated but the rooms are okay. The beds are comfortable and room is clean. The bathroom seems to have heated floors which is a great feature.  The restaurant was good and had friendly staff. It is unfortunate that the convenience store was closed even though the hours posted said it should be open.   It is disappointing when you want a late night snack. Overall it’s not a bad place and would consider staying here again",
      "rate": 4.0,
      "tripDate": " November 2022"
    },
    {
      "title": "bad experience",
      "text": "I randomly chose this hotel for the Covid three days isolation requirement.Everything was really bad. Old and dirty, awful service, cheap furniture, horrible food delivered at the door, unreasonable price (950 Canadian dollars) and no refundable (in the end I only stayed 24 hours). Arguably one of the worst hotel where I ever stayed in my life. A real rip off.To avoid at least for the quarantine requirement",
      "rate": 1.0,
      "tripDate": " July 2021"
    },
    {
      "title": "Not recommended.",
      "text": "Got the airport shuttle to the hotel. I asked the driver if it was Holiday Inn International  (I knew there were a few) and he said yes. He dropped me at another Holiday Inn. I asked the receptionist how to get to the one I had booked and was told to walk ‘four lights’. I asked how far that was and she repeated ‘four lights’. I walked a mile up the road with two cases at ten o’clock on a very cold night not sure where I was going.  Eventually got to the right hotel and the receptionist thought it was funny. I didn’t. I was also told I was too late for food which was disappointing. The bar was open for another ten minutes so before I went to my room I had a beer for my dinner. The room itself was ok and spacious but one of the bedside lights didn’t work. I told the receptionist the next morning as was told maintenance would fix it. When I got back at night it still didn’t work. I again informed reception and was told it would be fixed. It wasn’t. I gave up asking and just put up with it. The temperature control unit was extremely noisy so I had to either put up with a hot room or noise. Either way it didn’t make for a comfortable sleep.  The other issue in the room was a hole in the wall with wiring showing behind it. Just as well there were no young kids with me. The room was not cleaned or serviced at all during my visit. I had to ask for more coffee frequently. The soap ran out on day two.The bistro was ok but only had a very limited selection. The staff in that area were very welcoming. All in all the Holiday Inn International is a tired old hotel and could do with a major refurbishment. There are plenty of other hotels in the area. I will use one of them next time.",
      "rate": 2.0,
      "tripDate": " March 2022"
    }
  ]
}