{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Hotel Ocho",
    "url": "/Hotel_Review-g155019-d2180062-Reviews-Hotel_Ocho-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.0",
      "reviewCount": 204
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "195 Spadina Ave",
      "addressLocality": "Toronto",
      "postalCode": "M5T 2C5",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/06/8c/c7/e7/hotel-ocho.jpg?w=500&h=-1&s=1"
  },
  "description": "Hotel Ocho is the newest hotel in downtown Toronto, which opened its doors on June 15th 2011. Hotel Ocho offers modern boutique-style accommodations featuring our perfectly eclectic mix of visual arts on a backdrop of historical architectural and modern European influenced renovations. Exposed wood beams, steel, white marble and black granite are carried from our bar & lounge to our dining room, and into our cozy hotel rooms. Standard Queen, Superior King & Deluxe King all host plush beds with Egyptian cotton sheets, flat screen TVs and waterfall showerheads. Hotel Ocho offers FREE WI-FI in the entire building. We are conveniently located at the meeting point of downtown Toronto’s key neighbourhoods. Within a 10-minute stroll, our guests will encounter the Bohemian spirit of Kensington Market, hustle and bustle of China Town, night life of King West and Richmond St. Entertainment Districts and one of a kind shopping experience of Queen Street West in Toronto’s Fashion District . eat • drink • sleep. Room type: Deluxe King Room This room offers a large tub and white marble.Room type: Superior King Room This room has black granite floors in the bathroom.Room type: Standard Queen Room.",
  "featues": [
    "Free High Speed Internet (WiFi)",
    "Wifi",
    "Bar / lounge",
    "Bicycle rental",
    "Nightclub / DJ",
    "Baggage storage",
    "Non-smoking hotel",
    "24-hour front desk",
    "Coffee shop",
    "Restaurant",
    "Soundproof rooms",
    "Air conditioning",
    "Desk",
    "Telephone",
    "Iron",
    "Flatscreen TV",
    "Bath / shower",
    "Hair dryer",
    "Wake-up service / alarm clock",
    "Non-smoking rooms"
  ],
  "reviews": [
    {
      "title": "Nice boutique hotel in a great location",
      "text": "Our room was big and comfortable, the parking garage down the street was inexpensive and felt very safe, and the staff were very nice. The only cons were that the bathroom doesn’t have a door so there was really no privacy when using the facilities. Also the entrance is not handicapped accessible which was not an issue for us but could be for some people.",
      "rate": 4.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Not designed for efficiency & comfort",
      "text": "We think that our DELUXE room is oddly set-up. The bed is in the middle of the room. TV is in front of the bed. You can watch TV if you are in bed or sitting at a narrow table behind the headboard. The sofa is against the wall & faces the back of the TV. The worst feature is a low wall separating the bath from the rest of the room. There is a privacy curtain.. The result is that there is no sound or good light separation between the bath & bed. Any sound in the bath room  will be heard by the other person in the room. The refrigerator is a square one with not much room. No coffee machine or microwave.  Free coffee & hot water downstairs in the morning but that was not mentioned on checking in.  A big bath but no separation between toilet & the rest; the toilet faces the shower. .Separate shower & tub. The shower could use some minor repair. For us the big tub is a waste of space. Parking is cheap nights & weekends, both next door & two blocks away. It is $4/hr week days. Surprisingly the room is quiet even though it is a corner one on Spadina.  Unable to upload photo.",
      "rate": 3.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Really nice chic hotel",
      "text": "Really nice hotel, for the really good rates you can get. The one thing is that the rooms don’t have fridges. However, the staff is super helpful, they really helped me when I needed to add a few extra days to my stay, by shuffling the reservations around to be able to fit me in. Great hotel overall.",
      "rate": 5.0,
      "tripDate": " May 2021"
    },
    {
      "title": "Just be prepared to be a second class guest!",
      "text": "Staying at the hotel and went to the bar for a glass of wine.  There is a private event on in the bar and was told I cannot use the bar. The hotel and bar are separate, staying here does not entitle you to use the facilities of the bar and restaurant! If we had known that we would have booked elsewhere. They gave me a glass of wine free of charge that I had to take to my room! In other words you’re a second class citizen please leave and go to your room. That’s not a great way to treat guests that are paying you.",
      "rate": 1.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Nice hotel, staff and best location",
      "text": "Had a very comfortable stay here. But we could have loved to have a door for to to h we toilet. Got quick help for a small problem we had. So glad we stayed here. The managers  were very agreeable about keeping our luggage before and after our stay.",
      "rate": 5.0,
      "tripDate": " May 2022"
    },
    {
      "title": "Outstanding Service & Cool hotel",
      "text": "This hotel has some cool style and great staff. Tyson, Emily & Jordan are the team members that made my experience great. The food in the restaurant was great along with the cocktails. The team was also very accommodating when my plans changed. The location is perfect to downtown. I highly recommend this place, thanks for making my stay great!!! Ocho stars!",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "One night stay",
      "text": "This quirky boutique  hotel was lovely.  Close to Chinatown  and easy walk to the Union train Station.  Reception and bar staff friendly and helpful.   Room was clean and bed very comfortable.  Shower was great.  would have liked a kettle in the room but otherwise great place.   Would definitely return or recommend.",
      "rate": 4.0,
      "tripDate": " May 2022"
    },
    {
      "title": "We loved this hotel",
      "text": "The hotel is brand new with a restaurant/bar downstairs. I liked our room very much. The staff was great, the location is very good, everything was perfect!",
      "rate": 5.0,
      "tripDate": " June 2011"
    },
    {
      "title": "Hotel Ocho Wedding Reception",
      "text": "We recently had our wedding reception at Hotel Ocho and we highly recommend it to couples in search of the perfect downtown wedding venue. We searched a ton of T.O’s top urban venues and found a hidden gem. Located just north of Queen on Spadina, most people wouldn’t expect to find an elegant, yet unique venue. But, Ocho’s turn of the century vibe really gives Distillery District venues a run for their money. The venue is outfitted with a well-stocked premium bar on each floor and uniquely captures the feeling of a historical factory, couple with modern elements of glass, steel and marble. Rish, the event manager and her staff were extremely professional and attentive. The chef also ensured that the details of our menu panned out just as we imagined. Without a doubt, we urge couples to try the food out next time you’re in the neighbourhood. Hopefully, you’ll fall in love with the charm of Ocho just as we did. Definitely a 5 out of 5 on food, venue style, service and staff!",
      "rate": 5.0,
      "tripDate": " June 2014"
    },
    {
      "title": "Nice staff, home made food, good location ",
      "text": "BUT: It is a former warehouse of something similar, converted into a hotel.It looks functional with high ceilings and brick walls but it is not at all. In most rooms the bed is in the center, between all walls. Big windows allows to enter a lot of light and a lot of staring neighbors. So you should close the window shades, but then the light is scarce, in the room as well as in the bathroom.No wardrobe, no chest of drawers, no night table.Windows can’t be opened and the AC works in a yes/no mode, without levels.Receptionist is hidden under the stairs, no wonder that he leaves whenever he can.Breakfast is included but rather scarce.But to be honest: the friendly staff makes you feel good!",
      "rate": 2.0,
      "tripDate": " September 2019"
    },
    {
      "title": "Great Wedding/Event Venue!",
      "text": "My wife and I booked Ocho (upstairs and downstairs) for our wedding reception in May, and I'm pretty sure all had a great time.  I'm in the financial services business, and great customer service is what I have to live on a daily basis, so in a big city like Toronto that can be hard to come by sometimes.  From the day we found Ocho and started conversing with them about our event they were flexible, caring and dedicated to pulling this off for us.  Dealing with 'real people' was exactly what we were looking for, and a rare find in a big city (ie versus \"pick wedding package A, B, C\" at a big chain hotel)   We had approx. 120 people, so pretty close to max capacity (130 is max I think for sit down dinner upstairs), and we were able to bring in different tables and chairs for the reception, as well as decorate to our liking.  Everything went smoothly throughout the evening, and the staff attended to everyone's needs.  We also stayed the night in the best room they have, and was a great space with a lot of room to move around.  PRO's:  Dealing with Rish (event planner), overall pricing, wide selection of beers that aren’t overpriced, ability to test full meal before selecting for your wedding, temperature inside was perfectly controlled, venue looked very cool, accommodating staff. CON, only 1, not everything can be perfect!:  Since we stayed in the hotel the night of, as well as a couple of other friends booked the hotel, we woke up hungry.  (Would be cool to have breakfast menu available for the day after maybe, if possible).  There were croissants and coffee, but we were told afterwards this cost $5 each. Not the end of the world, I was probably just hung over and cranky, we thought the snacks and coffee would be included in the room rate.But, overall great evening, would recommend to anyone looking to have a wedding that's not \"Package A,B,C\"  :)",
      "rate": 5.0,
      "tripDate": " May 2014"
    },
    {
      "title": "Wonderful boutique hotel that is centrally located and reasonably priced",
      "text": "I have stayed in the Hotel Ocho about 3 times.  I have stayed there from the beginning and I am happy to report the service did not experience growing pains but has remained consistently above average.  I have never had any issues.  The staff are courteous, accommodating and attentive.  They were prompt with my request for champagne bucket and flutes.  Immediate delivery of towels (though I am not sure if there is a staff on call through the late over night). You can get some amazing last minute rates though it is a small boutique style hotel that is often sold out.  So book in advance if schedule permits.  The location is on Queen St. West so accessible to shopping, restaurants and on the ttc line.  Last time I stayed in room 34.  The rooms are compact but quite a perfect lay out.  The bed was comfortable.  Room was quiet.  I loved the 'rain' shower and counter space in washroom.  The bar has a nightly special and great little energy.  I have not made it to the bar while the kitchen is still open.  I have been impressed with the lunch menu offerings on the display board and keep meaning to come back to try the food.  Next time I may try to get a corner room or an upgraded suite. Check in after hours may be an issue as I am not sure if there is someone on desk duty.",
      "rate": 4.0,
      "tripDate": " March 2013"
    },
    {
      "title": "Business Trip stay",
      "text": "I stayed here for a business trip for two nights, and the room was great. Felt like a modern, hip apartment. I loved it. The food downstairs was great - I highly recommend the risotto - and the location wasn't too bad. The reception was under the stairs - a little odd, but no other space I guess. The one con I had was the Internet connection. It was horrible in my room. Didn't really work there, so I went to the bar to get my work done since the wifi worked there. Not exactly convenient. Once they fix that, I'd recommend it for a cool weekend getaway stay.",
      "rate": 3.0,
      "tripDate": " October 2012"
    },
    {
      "title": "Back to the 60's",
      "text": "The title of this review is a reflection of the 'feel' of the place.  It's an odd place.  As noted in a previous review, the receptions desk (it's really a table) is hidden underneath the stairs.  When we arrived, the receptionist leaned over the second floor balcony to see if we wanted a table. You see, when you enter the establishment you are in a restaurant.  He was friendly enough and when he found out we were there to check-in, he slid down the bannister to the first floor.  It was all slightly odd and had a hippie-type feel to it.  The room was nice but oddly arranged.  The bed is in the centre of the room, while the night table is situated behind the bed. This leaves you with nothing to set your book or glasses on unless you reach behind the headboard to place it on the table.  Not terribly convenient.  The room was clean and the bed was extremely comfortable.  It took me awhile to figure out the state of the art shower controls.  There is no bathtub but the shower has two controls and I had a bit of difficulty getting it turned on.  Once I figured it out, there were no complaints.  The water coming out of shower head was strong and hot. The lights in the room were rather weak for reading and there was only one chair in the room. You can hear street noise in the room.    I love the feel of the neighbourhood since you are in Chinatown.  Lots of interesting small stores.",
      "rate": 4.0,
      "tripDate": " September 2012"
    },
    {
      "title": "Cool, convenient",
      "text": "Tiny, loft-like hotel.  The rooms are a little small, but hip. Nice bar downstairs.  Great location between Chinatown and Queen Street West in midst of fashion district.  Easy access to public transport, tons of great restaurants and bars.  Two tiny complaints:  1. the rooms are not completely sound proof, so if you scream during sex we will probably be staring at you during breakfast. 2. the parking lot next door (to the south) is ridiculously strict, I got a $25 ticket in the 2 minutes it took me to figure out that the lot is not connected to the hotel.  Park on the north side while you unload.  There's public parking nearby.",
      "rate": 5.0,
      "tripDate": " August 2012"
    },
    {
      "title": "A decent boutique hotel downtown, perfect location",
      "text": "I stayed there last week (May 28th) for one night for a festival downtown. The location could not be more perfect, right near Spadina and Queen, steps from the shops, the theatres and lots of restaurants. This is a very small boutique hotel and there is much to like: high quality sheets and pillows, modern glass shower and fixtures. The price is perfect (about $150 a night) and parking is a very good deal a block north (Green P, underground) for about $17 for 24 hours! The room is very small, not much more than a bed and a desk opposite the headboard, but it's perfect for a place to lay your head after a busy day. The air conditioning is VERY LOUD, but it perfectly screens out the noise of a busy Spadina outside.This place tries a little too hard to be hip - the door numbers are drawn in magic marker, the hallway floor is lined with routers (free wifi is included) and our key is actually a key, on a little clip that you can easily add to your keys.Gripes? Well, pulling up the mattress to check for bed bugs (NONE) I found a giant tube of candy that had obviously been left by the previous tenant. Strike one for the cleaners.Security is simply a locking handle on the door - no deadbolts, chains or anything that is commonplace on any other hotel. This is downtown Toronto, there are lots of homeless and if someone left a side door open it would be a much easier path to your valuables. Those should be upgraded.Breakfast is advertised as unlimited continental and only 4.99 a person, but obviously little attention is paid to this - the breakfast is an afterthought. Arriving at the very late hour of 9 am I found no coffee, one muffin, no fruit, no juice and one chocolate croissant. Staff merely shrugged and said there was no more of anything - after I had prepaid for breakfast. I did manage to get some coffee and some juice, and ONE orange, but if you are going to advertise all you can eat continental breakfast, at least have SOMETHING TO EAT.In spite of these shortcomings I would stay again - I just wouldn't eat there, I wouldn't leave my laptop unchained in my room. The location is too good to pass up and the staff were friendly, mostly helpful and the place was clean.",
      "rate": 3.0,
      "tripDate": " May 2012"
    },
    {
      "title": "Very unique hotel and restaurant, great location",
      "text": "We are half way through our 2 night stay at Ocho. Everything has been very unique thus far.You are greeted by the friendly bar staff on arrival and the check in desk is under a staircase. You get real keys for your room (such pressure not to lose them!), they take old fashioned photocopies of your ID and credit card instead of swiping a pre-auth, and then Jamal the GM personally showed us to our room.Nice, compact room that is only lacking in a small dresser to put away clothes. There is a suitcase rack and rail with 4 hangers though. Bathroom is modern and spacious - the shower is too except the temperature control knob is broken and so you have to fiddle with it a bit. The midnight to 7am lockdown (only entry and exit is one door through a stairwell) of the building has me a bit anxious for tonight as we'll be rolling in pretty late, but it makes sense with only 12 rooms. Bed is super comfortable, I had a great sleep!We had a late tapas dinner in the bar/restaurant and enjoyed the eclectic jazz/spoken word band that was playing. I have already mentioned to Jamal that the wine list is sorely lacking for such an avant garde bar and restaurant. With \"local\" being such a popular concept now, Ocho should be featuring Niagara wines that are both affordable and MUCH tastier than the Chilean options on the wine list right now. The service was excellent and we really enjoyed the evening.We will definitely stay at the hotel again because it is conveniently located by the entertainment district (read Office Pub) which we frequent quite regularly.",
      "rate": 4.0,
      "tripDate": " May 2012"
    },
    {
      "title": "Oustanding service in a stylish place",
      "text": "This is a very small boutique hotel that's friendly and funky. They made me feel at home for a short stay and when I left my (computer) mouse behind, they cheerfully mailed it back to me, even though it was international mail. i've unfortunately left things behind at hotels before and they always \"disappear.\" This is not some anonymous place -- the owners' passion shows through.",
      "rate": 5.0,
      "tripDate": " January 2012"
    },
    {
      "title": "Funky and friendly",
      "text": "We stayed here for three night last weekend on a quick trip to Toronto - and had a great time!  The reno is tasteful and maintains the traditional brick and wood of the warehouse while feeling clean and modern, if a little unfinished in areas.  Location is fabulous between downtown entertainment, Queen shopping, and College or Kensington dining.  The bathroom was large and the bed was comfortable.  The Queen room was quite tight with the bed in the middle of the room and with only one chair, so it is not a place to hang out...unless you are horizontal.   But, the main, and big plus, was the comfortable lounge/restaurant area downstairs which truly extended the usable space.  We spent a whole afternoon and evening working on a project with laptops and felt completely comfortable, getting service as needed but never pressured to move-on.  This atmosphere made it feel much more hospitable and friendly than most hotels - and for this I will return.  Also, as others have commented, some of the services are a little more haphazard than you would expect in most hotels.  In terms of both design and staff we felt like we had stepped into a buzzing start-up IT firm run by lots of young and hip 30-somethings.  But they are enthusiastic and friendly, which more than made up for the odd unchanged towel etc. in my books - but is certainly not for everyone.  All in all we were extremely satisfied for the $150ish a night deal, but I would certainly not pay the regular $300 rate that was listed until they work out the kinks.",
      "rate": 4.0,
      "tripDate": " November 2011"
    },
    {
      "title": "Petit Boutique Hotel has much going for it.",
      "text": "Stayed one night for business – Great location, on Spadina/Queen St West (Close to Toronto City Center Airport) This petit boutique hotel (12 rooms only) has much going for it. The staff was friendly. Great modern loft/ warehouse design, the bed was very comfortable, the room was spacious and the ambient light.Staying for longer period of time there are no dressers, very little space to hang clothes, no in-room coffee, and had difficulties getting internet service in the room. Personally loved the open concept bathroom but only had a shower no tub. Had lunch and an after work snacks and bottle of wine in restaurant – staff friendly and helpful. Downside no breakfast (ended up at McDonald’s down the street).Would definitely stay again – it would be even better with breakfast service.",
      "rate": 4.0,
      "tripDate": " September 2011"
    },
    {
      "title": "Great friendly hotel",
      "text": "This hotel we stayed for just a single night, but the rooms are really nice. The bed is in the middle of the room and the bathroom is well appointed.  We have to highlight the friendly staff, especially Richard.  He was really geniune and helpful, and had a great Canadian sense of humour.",
      "rate": 5.0,
      "tripDate": " October 2016"
    },
    {
      "title": "Wonderful wedding venue",
      "text": "My wife and I got married at Ocho in spring 2015 and had a wonderful experience. The venue is beautiful, and in a great downtown Toronto location - it's a great all-in-one option with fantastic spaces for ceremony, dinner and dancing. The fact that it's also a restaurant and hotel made it great for our out-of-town family, and was perfect for getting ready before the ceremony and taking a few photos. The staff, including event planner Rish, were warm and accommodating throughout the process and on the day of the event. (We're a same-sex couple, and no one so much as blinked about it.) Our food was absolutely delicious - everything was so wonderful during our tasting we had trouble choosing what to serve! They were totally able to make a couple of modifications to the menu to suit our preferences and the dietary restrictions of our guests.Basically, Ocho was a great, low stress way to have the wedding of our dreams. They've clearly got wedding planning down to an art, and because much of the day was included as part of their package, we were able to focus on what really mattered, as opposed to negotiating with a million separate vendors or stressing about the details. We had a great feeling about it the moment we first walked for our tour, and it worked out even better than expected.",
      "rate": 5.0,
      "tripDate": " September 2015"
    },
    {
      "title": "Great stay at a great price",
      "text": "Spent two nights in Toronto with my teenage son and wanted to stay some place different.  Found the Hotel Ocho after a lot of looking around on TripAdvisor and other sites and couldn't be happier. Very stylish adaptive reuse of small factory with contemporary, clean rooms.  Rooms are a bit small, but bathrooms are huge and showers are great. Wonderful restaurant was a nice surprise (see my separate review for that), and there are many, many other places to eat and drink within a short walk. Hotel sits at the junction of the Queen Street Design District and Chinatown and is a short distance from downtown destinations like the CN Tower. Even better, Toronto Bike Share has a station right out the front door so it was very easy to get almost anywhere. Hotel has no parking of its own, but several public lots are very close, safe and reasonable. Manager is very friendly and very helpful with recommendations on restaurants, sites and entertainment. This place beats all chains and the price is an excellent value.",
      "rate": 5.0,
      "tripDate": " July 2016"
    },
    {
      "title": "Great location - cool spot",
      "text": "Great location for walking to many of Toronto's cool neighborhoods. Parking was right next door and fairly cheap. Really friendly staff and hip coffee/bar area. The rooms are very basic, but comfortable, and the price is good. Had a nice experience and would return!",
      "rate": 4.0,
      "tripDate": " June 2016"
    },
    {
      "title": "Great boutique hotel in fabulous location",
      "text": "We normally stay at the Gladstone but didn't want to be so far west for this trip. We found Ocho which had a more central location for our trip.Hotel is small, but has everything you'd need for a short trip. Rooms are clean and modern with a big window that lets in plenty of natural light and a super comfy bed. Bathrooms are fabulous with a lovely rainshower (waaaay better than the microscopic Gladstone bathrooms). Yeah the carpet needs to be changed (I'm sure the hardwood floors must be gorgeous underneath) and the bathroom pocket door oiled (and maybe cleaned a little more thoroughly) but nothing that was a turn-off for us.Check-in was fun (with a thorough tour) ; check-out was a breeze (just leave you keys and that's it!).Bar downstairs is cool with drink specials that can be fun before going back to your room at night.All in all, it was a great stay, and I would definitely recommend the place.",
      "rate": 5.0,
      "tripDate": " July 2015"
    },
    {
      "title": "Amazing Stay.",
      "text": "Stayed at hotel for two nights solo. Read previous reviews that checkin counter will be under stairs. Arrived around 4pm. As I walked in I was greeted and asked it I wanted a table to checking in. Lady that checked me in was very nice, checked me in, showed me to my room and let me know how the hotel works. I was given my keys to the room (one for the room and one for side door if coming in after hours). Thought this was a good personal touch of showing me to my room. I received room 33 which was on the third floor. Loved the room as the hotel is modern and industrial in one package. Bed is placed in the middle of the room with large window with desk and chair placed behind the bed and bathroom is large and modern with rainfall shower head that was wonderful.. Bed was comfortable. Hotel was quiet and close/walking distance to all attractions. Hotel is in perfect location with bixie bikes right outside. Hotel has no parking but a green garage is located two blocks away at reasonable prices. Hotel is is the middle of china town with all the food options you could ask for. Perfect hotel and will stay here again while in Toronto. One note I would give to management is to add clocks that display time on wall since the clock is placed on desk located behind bed.",
      "rate": 5.0,
      "tripDate": " July 2015"
    },
    {
      "title": " BOUTIQUE STYLE HIDDEN GEM OF CALM IN CHINATOWN",
      "text": "The Ocho might just be one of the best kept hospitality secrets in TO! Sure it's not for the high maintenance types who'll whine about having to schlep their own luggage, and amenities like a gym/spa/niteclub and all the other things you end up paying through the nose for at those other painfully ostentatious hotels are non existent here, but, what the Ocho lacks in peripherals, it more than makes up for in character, boutique chic, location and value!The Deluxe suite I enjoyed arguably has one of the sexiest bathrooms for a boutique hotel in Toronto, spacious open concept with marble floors, separate glass shower and a deep soaker tub complete with a remote control Partition curtain so you can indulge in some private rub-a-dub tub time. Also worth mentioning, the complimentary wifi totally held up during a relentless marathon of cozy-in-bed Netflixing which is impressive!Service at the Ocho is genuinely amiable, no fake grins or empty small talk here! From the moment I spoke on the phone with the ebulliently friendly Richard to book a room, to the helpfulness of the barstaff and even the owner herself is around to personally take queries from guests, you get the sense that staying at the Ocho is less like staying at some stuck up 5-star and more like hanging out at a cool interior design collective.                           If a convenient downtown casual chillaxed boutique hotel vibe is your thing, then The Ocho is definitely the hidden gem that you want to find.",
      "rate": 5.0,
      "tripDate": " December 2014"
    },
    {
      "title": "One of my favorite hotel stays",
      "text": "I stayed here on my first trip to Toronto in September. The location was amazing, an easy walking distance from everywhere I wanted to go. The staff was so helpful and cool about helping me find places I wanted to go. They also upgraded my room at no cost because an extra room was open (it was a random Wednesday night). The hotel was very cool and modern, with a loft feel to it. It was in a very safe area too, I'm a girl who walked back to the hotel at night alone and didn't even feel a little nervous at any point. It's really a nice location. There were also rentable bikes right outside the hotel, which was nice to have so readily available. It's an easy drive to the hotel, it's right on one of the main roads. Just be prepared, there is no parking on site, but there are underground parking decks that aren't far away and don't cost too much. I plan to stay at this hotel every time I come back to Toronto (which will hopefully be soon)!",
      "rate": 5.0,
      "tripDate": " September 2014"
    },
    {
      "title": "Great Location",
      "text": "This hotel was in a great location!  The rooms are modern and spacious.  Beds were very comfortable!  Walls were thin though and you could hear anyone walking through the hallway.  Very friendly and helpful staff.  We would stay here again.",
      "rate": 4.0,
      "tripDate": " September 2014"
    },
    {
      "title": "Very comfortable stay",
      "text": "Nice night spent here. Arrival slightly odd, into the restaurant and down some stairs,but very friendly welcome. Room was great, very comfortable, slightly tight space-wise (it was almost possible to fit the chair behind the desk), but overall nicely designed. Bathroom was a bit rough around the edges in places - shelf missing in shower etc but really just minor points. Free mineral water was appreciated, as was the very good value continental breakfast in the morning - just $5.Restaurant food however was spectacularly bad - see separate review of their restaurant.",
      "rate": 4.0,
      "tripDate": " September 2014"
    },
    {
      "title": "“Good location to go out party - do not expect luxury”",
      "text": "I stayed in this Chinatown spot a few days during the week. Staff was very welcoming, however this hotel offers no luxury otherwise. The room was quiet. No noise from the street. Large shower with good pressure and water temp. Staff was helpful, especially when I noted them about the clogged toilet and ventilation noise. Both were fixed the same day. The location is near the best party spots of town - but little far from business.Wifi was good and there was an iron in the room.Toilets got clogged couple times, but fixed the following day. Large window opens to street/opposite building - need to be careful with privacy.",
      "rate": 3.0,
      "tripDate": " October 2016"
    },
    {
      "title": "Excellent boutique hotel in fantastic location",
      "text": "We were greeted by Richard upon arrival and enjoyed the BEST service from the very beginning to the end of our trip. We stayed in Room 32 which has a comfortable king bed and a lovely big shower with great water pressure. It's a big room with a couch for additional seating. Free wifi was included. The bar downstairs was friendly and warm. The menu was incredible and we enjoyed a couple of cocktails in the bar. Richard arranged our taxi to the airport and helped with bags. He is the poster guy for excellent customer service! Location was very good, right on the edges of Chinatown and close to the entertainment centre. Although our stay was short, we would definitely stay there again. Highly recommended!",
      "rate": 5.0,
      "tripDate": " January 2016"
    },
    {
      "title": "Amazing Fall Wedding at Hotel Ocho",
      "text": "Hotel Ocho was the venue for our wedding and we were thrilled with everything! We had both floors (140 people), a standing ceremony and cocktail reception with an awesome dance floor on the ground level (complete with dj both). We have so much to say about the venue and will break it down into a few categories:pre planning-Rish and Jamal were helpful in planning the event. Rish got back to our emails in a timely fashion and answered ALL of our questions (we had many). She was polite and willing to negotiate on things. It was helpful that we went to the venue a few times before our wedding where Rish gave us tours and talked us through how we wanted the venue to look. appearance-Hotel Ocho looked amazing at our wedding. We knew we liked the spot with its exposed brick, original wood, accent credenza table and mid-century modern tables but with the candles and flowers that we added the venue looked GORGEOUS. We liked that all we had to do was bring in flowers and candles and the rest of the set up Ocho took care of. Plus, they asked us how we wanted things to be set up and flow which was accommodating. We used 2 hotel rooms for getting ready on the day of and they are cool, clean and spacious. For our marriage signing ceremony we used a suite and it actually fit 18 people seated, comfortably. The other room we used for make up/hair it was big enough. Further the pictures turned out great because the light coming in through the big windows was natural and beautiful. We also took pictures on the second floor lounge which was a great set up for family photos.Food-Part of the appeal of Ocho was the food was all in-house and we loved the food from our tasting there. Their event food list is quite comprehensive and we choose a bunch of platters, canapés, and passed food for our event. Because we wanted everything to be finger food, Ocho actually worked with us to create new menu items so we could get what we envisioned. So we added things like pad thai in take out containers, caesar salad in waffle cones, fish and chips and more. We did the menu a month before the wedding and we weren't sure how it would work out given the specifics of what we wanted but we were enthusiastically surprised. The food was amazing!!! All our guests loved the options and still talk about how delicious everything was. We were also happy with the bar choices.Service-Rish, Jamal and their team worked incredibly hard to be on top of things on the day of the wedding and we felt like our guests were well taken care of.Overall it was the perfect venue for us, it reduced our stress, was gorgeous and the food was awesome. We had our dj play amazing music and our guests danced, ate and drank all night! We had so much fun and a large part of that is attributed to the fact that we didn't have to worry.Final note on expenses. We definitely found Hotel Ocho was the most affordable (and cool) venue we looked at.",
      "rate": 5.0,
      "tripDate": " November 2014"
    },
    {
      "title": "Which Oasis of Calm and Comfort??",
      "text": "This hotel describes itself as a \"stylish oasis of calm and comfort” but I guess this is just because the writer of this sentence did not stay there once. The bed is very uncomfortable and the music in the restaurant is too loud. There was also a party one night and no quick notice was deemed appropriate. So not recommended for those with jet lag.On the first day the door was left open by the housekeeping and the management did not even take it seriously. So we were just lucky that our stuff weren’t stolen on our first day in Canada. Our room was not cleaned up on the second day, although we did not put any do not disturb sign on the door. Again, relaxed management.The room was clean but there is no closet. It was so humid that the sheets were constantly moist. I guess that can also be the cause of the weird smell. The location is ok as it is close to the queens street.  Although I prefer to stay in boutique hotels, I recommend future travellers to stay in a good old reliable chain hotel in the financial district rather than having a bad experience.I kindly recommend the management to stay in other boutique hotels in order to gain insights of customer satisfaction policies and to best serve their guests.",
      "rate": 2.0,
      "tripDate": " September 2014"
    },
    {
      "title": "Great find, pity about the rudeness",
      "text": "Overall we had a good experience staying at this hotel. Mostly this was due to the wonderful location and the pleasing design of the building.The big disappointment, however, was the unfriendliness/arrogance of the staff. I couldn't believe how aloof they were. There was a function on in the lobby/bar/restaurant the night we arrived, which we had to walk through to check in, and I was treated as if I had crashed a party. First, I had to ask the bartender if this was the hotel. When another staff member came over, she looked me up and down, and told me check-in was usually at 3pm when I asked, confused, if we were in the right place and could we check into the hotel. Ridiculous. Anyway, suffice to say I felt no warmth from the staff over the 5 day stay.Rooms are interestingly and nicely decorated, the bed was comfy. However, the bathroom has terrible lighting - couldn't see a thing in the mirror. I would recommend putting a mirror in the bedroom so a girl can actually put on makeup with some light.",
      "rate": 3.0,
      "tripDate": " May 2014"
    },
    {
      "title": "Authenticity in the heart of the beast",
      "text": "I love this place.  Hotel Ocho gave me exactly what I needed, an exquisitely quiet room in a funky boutique hotel -- along with the perfect balance of thoughtful attentiveness and personal space, without the faintest whiff of grasping servitude or fake corporate bonhomie.  When I called at midnight to say that my flight was delayed six hours, they knew exactly who I was and when I arrived exhausted at 6am I was given a warm sympathetic welcome and a late check-out without question. My room had bare brick walls, windows that opened, a thoughtful layout and a comfy bed. When I crawled out of bed in the early afternoon, I was delighted to find that the cafe downstairs had excellent espresso, free wi-fi and and natural sun-light: just what I needed to jump start my day.  And finally, when I checked out, I was delighted to see that the price of my stay included no surprises - except that it was so reasonable.",
      "rate": 5.0,
      "tripDate": " December 2011"
    },
    {
      "title": "very friedly staff and sleep elegantly designed loft rooms",
      "text": "I stayed here with my daughter in mid August and we loved this hotel, from the staff who made a point of getting to know us on a first name basis, the beautifully designed loft style rooms and the nice cafe on the ground floor and the mezzanine which offered a great brunch on weekends and nice cocktails in the evenings.  The owner went out of her way to help us with finding our way around, with storing our suitcases when we went on a side trip and was in general very hospitable.  We are based in Milan, Italy and recognize good design (nd good capuccino!) when we see it, we had both hereat Hotel Ocho!",
      "rate": 5.0,
      "tripDate": " August 2011"
    },
    {
      "title": "great location, fabulous rooms and excellent service.",
      "text": "we have been looking for something downtown, loft-modern style hotel rooms to stay during our one year anniversary. This hotel is a hidden jewel, we couldn't believe our luck. It's close to anywhere we want to go and the rooms are beautiful and stylish decorated. The restaurant has great food and nice cocktails. It was a wonderful experience.",
      "rate": 5.0,
      "tripDate": " July 2011"
    },
    {
      "title": "We were quite pleased and will return",
      "text": "We travel to Toronto frequently and generally stay at a centrally located \"franchise\" hotel. No more. On our last trip to Toronto, at the suggestion of a family member, we stayed at Ocho, a small (12 rooms) centrally-located, brand-new hotel. The rooms are comfortable, bright, and airy with many large windows. What we particularly liked were the natural brick walls and the wood beamed ceilings. As you would expect in a brand-new hotel, everything is spotless. Management is friendly and helpful. And there is a restaurant on the ground floor, which serves quite tasty meals.",
      "rate": 4.0,
      "tripDate": " July 2011"
    },
    {
      "title": "Great 2 Star hotel...",
      "text": "I wanted to love this place, and I probably would have been super pleased if it had been billed as 2 star (ok, 2.5 star) accommodations. However, what poses as minimalist is really just cheaply done. The construction looks like poorly executed DIY, even though I think the idea and the aesthetic are great. E.g. paint smudges from the walls on the exposed wood rafters, carpet installed on the stairs without padding. The upkeep has been just as bad. The walls were covered in smudges from bags and other bumps, bleach stains on the carpet, water stains on the wood furniture. And the cleaning is downright gross. The phone in the room probably hadn't been cleaned since it was installed, there were dust and cobwebs in the \"hard to reach\" places, and for some reason they didn't empty the trash while I was there. None of this ruined my stay, which was complemented by a truly divine duvet. However, it makes what could have been an excellent hipster boutique hotel into an expensive motel with an eye for creative design. Now that I know, might stay again, if the price is right--but it'd have to be much cheaper than the relatively nearby chains, which abound.",
      "rate": 3.0,
      "tripDate": " June 2018"
    }
  ]
}