{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Hotel X Toronto By Library Hotel Collection",
    "url": "/Hotel_Review-g155019-d13234261-Reviews-Hotel_X_Toronto_By_Library_Hotel_Collection-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.5",
      "reviewCount": 1524
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "111 Princes' Blvd",
      "addressLocality": "Toronto",
      "postalCode": "M6K 3C3",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/15/7e/4c/bd/library-club-lounge.jpg?w=500&h=400&s=1"
  },
  "description": "Hotel X Toronto, an urban oasis in the heart of downtown, redefines luxury with a perfect blend of modern elegance and exceptional service. Nestled on the picturesque shores of Lake Ontario, our hotel offers breathtaking views, upscale amenities, and unparalleled hospitality. Guests can indulge in world-class dining, relax at the serene rooftop pool, or rejuvenate at the award-winning Guerlain Spa. Art enthusiasts can explore the stunning Kandy Gallery, showcasing stunning photography from around the world. Conveniently located near iconic attractions like the CN Tower, Rogers Centre, Budweiser Stage, and Exhibition Place, Hotel X Toronto is ideal for both business and leisure travelers. Discover unparalleled comfort and style at Hotel X Toronto. It's about you. It's about the view.",
  "featues": [
    "Electric vehicle charging station",
    "Free High Speed Internet (WiFi)",
    "Pool",
    "Fitness Center with Gym / Workout Room",
    "Bar / lounge",
    "Squash",
    "Tennis court",
    "Babysitting",
    "Valet parking",
    "Paid private parking on-site",
    "Wifi",
    "Pool / beach towels",
    "Rooftop pool",
    "Pool with view",
    "Indoor pool",
    "Outdoor pool",
    "Heated pool",
    "Yoga classes",
    "Yoga room",
    "Fitness / spa locker rooms",
    "Fitness classes",
    "Personal trainer",
    "Sauna",
    "Coffee shop",
    "Restaurant",
    "Breakfast available",
    "Breakfast buffet",
    "Complimentary Instant Coffee",
    "Complimentary tea",
    "Happy hour",
    "Kids' meals",
    "Outdoor dining area",
    "Snack bar",
    "Special diet menus",
    "Rooftop bar",
    "Aerobics",
    "Patio",
    "Table tennis",
    "Board games / puzzles",
    "Video game console",
    "Books, DVDs, music for children",
    "Indoor play area for children",
    "Children Activities (Kid / Family Friendly)",
    "Kids club",
    "Highchairs available",
    "Pets Allowed ( Dog / Pet Friendly )",
    "Free shuttle or taxi services",
    "Airport transportation",
    "Car hire",
    "Taxi service",
    "Business Center with Internet Access",
    "Conference facilities",
    "Banquet room",
    "Meeting rooms",
    "Spa",
    "Body wrap",
    "Couples massage",
    "Facial treatments",
    "Foot massage",
    "Full body massage",
    "Hand massage",
    "Makeup services",
    "Manicure",
    "Massage",
    "Neck massage",
    "Pedicure",
    "Steam room",
    "Waxing services",
    "Rooftop terrace",
    "24-hour security",
    "Baggage storage",
    "Concierge",
    "Convenience store",
    "Currency exchange",
    "Gift shop",
    "Non-smoking hotel",
    "Outdoor furniture",
    "Sun deck",
    "Sun loungers / beach chairs",
    "Sun terrace",
    "ATM on site",
    "Doorperson",
    "First aid kit",
    "Umbrella",
    "24-hour check-in",
    "24-hour front desk",
    "Express check-in / check-out",
    "Private check-in / check-out",
    "Dry cleaning",
    "Laundry service",
    "Ironing service",
    "Shoeshine",
    "Allergy-free room",
    "Blackout curtains",
    "Air conditioning",
    "Desk",
    "Housekeeping",
    "Coffee / tea maker",
    "Cable / satellite TV",
    "Complimentary toiletries",
    "Bathrobes",
    "Interconnected rooms available",
    "Room service",
    "Safe",
    "Seating area",
    "Telephone",
    "VIP room facilities",
    "Wardrobe / closet",
    "Bottled water",
    "Iron",
    "Private bathrooms",
    "Wake-up service / alarm clock",
    "Refrigerator",
    "Flatscreen TV",
    "iPod docking station",
    "Hair dryer",
    "Ocean view",
    "City view",
    "Landmark view",
    "Bridal suite",
    "Non-smoking rooms",
    "Suites",
    "Family rooms"
  ],
  "reviews": [
    {
      "title": "Amazing Stay at Hotel X",
      "text": "I wanted to do something special for my husband's birthday this year and when I passed by this hotel on my way home from a meeting one day, it immediately captured my eye and thought that this hotel and location was perfect to surprise my husband on a mini getaway for his birthday in the city. I made reservations 2 days before we checked in and because I wanted to make my husbands surprise birthday extra special, I decided to upgrade our room. I quickly called the hotel to make the arrangements and they made the changes with no problem. On the day of our check-in I decided last minute that I wanted to include balloons and a small dessert prior to checking in. When I spoke to the concierge, she said that they required up to 24hrs notice to have the balloons set up in which I understood and accepted that it was okay. Once we arrived, the hotel was beautiful! We were greeted by smiling faces and the reception staff were so nice. They even gave our son a little stuffed animal as a welcome gift. When we got to our room and I opened the door, to my surprise there were balloons and a small pastry that read \"Happy Birthday\". They gave us a stunning view of the city which added the extra surprise! Everything in the room was spotless and so clean. They were even so thoughtful to include some bath essentials for my son and had laid them so nicely in the crib. A few minutes after settling into the hotel room, we heard a knock on the door. When we opened it, my husband received a special delivery of a bucket of beer. At this moment, we were beyond grateful for the amazing treatment we received from this hotel. We have never been treated with upmost tremendous service. Everything about this hotel was spectacular - from the staff, to the decor, the room and the most comfortable bed I've ever slept in, and just overall experience. This hotel lives up to it's standards and beyond. I couldn't have been more pleased that I chose Hotel X to surprise my husband with on his birthday. This is one of our top hotels thus far. We would definitely stay here again! Thank you Hotel X for your wonderful service!!",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Can't Wait To Go Back",
      "text": "We chose to stay here based on a friend's recommendation, and the service, amenities, food, views, and value were outstanding! We were in a junior suite, which was spacious, came with everything you could possibly need (robe, slippers, umbrella, etc), was absolutely silent on a Saturday/Sunday night, and included access to the Library Lounge. We paid for breakfast at Maxx's on our first morning, and utilized the complimentary breakfast in the lounge on our second day. The staff were terrific, room service was great, all of the bars had great city views, the art gallery on the lower level was gorgeous, and the rooftop pool even has an accessibility chair to lower people into the water. They have truly thought of everything. It was too cold to enjoy the wraparound balcony but we look forward to coming back in better weather!",
      "rate": 5.0,
      "tripDate": " December 2019"
    },
    {
      "title": "Group Getaway",
      "text": "I live in Toronto and selected this hotel to host a group weekend to celebrate an upcoming wedding. I met 7 out-of-town guests on Friday. From the moment we pulled up until we checked out, the staff was authentically courteous. The hotel exceeded my expectations from the website and online photos. We used a number of the amenities during our 2 night stay. Hot yoga, gym equipment, pool and steam rooms were enjoyed the first day. The pool is partially indoors with access (swim under the glass divider) to the outdoor pool. It is fully heated and we swam outside during the snowstorm!  The indoor pool is very limited for space. Most of the pool space is outdoor.  We had the package that included 4:30 wine and cheese as well as the continental breakfast. Both services were superb. With our own curiosity tour, we saw the multiple squash courts, the 10XTO fitness facilities and dined in Maxx's restaurant. All amenities impressed everyone in our group. We had free self parking and it was very easy and hassle free access to the hotel elevator. Every employee, no matter what part of the hotel you were in, had a smile and were eager to help however needed. You can certainly come here and have no reason to leave if you're looking for a getaway to chill and treat yourself. I live 15 min away and plan to book family Staycations in the near future.",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Best Staycation!",
      "text": "My stay here was so amazing! It was a great staycation. The COVID protocol is on point. All the staff wear their masks correctly, self cleaning elevator buttons, sanitizer everywhere, pool bookings are 2 hours so you always get time at the pool, the lounge chairs are spaced out as well as seating in the restaurants.The staff were all so nice. We got a sweets tray upon welcome, early check in, late check out, extra pool bookings, free parking, breakfast for two, room upgrade. I recommend booking the bed and breakfast package - it's worth it!No complaints at all. Great job Hotel X and thank you!!",
      "rate": 5.0,
      "tripDate": " September 2020"
    },
    {
      "title": "Overhyped and overpriced",
      "text": "If you are considering a stay in a “luxury” hotel in Toronto avoid Hotel X. I stayed here with a few friends in their junior suite and had the most horrible experience. The service doesn’t match the exorbitant cost of the room. The taps in all the bathrooms were boiling hot leaving it impossible for us to wash our faces at night, when we called the front desk (after countless attempts someone finally answered) the resolution was to “let it run for 5 minutes”. For a place that seems to be “5-star” I would expect that all rooms have decent hot/cold water options. They never answered the phone in a timely manner when we had requests. We were also scheduled at the Guerlain Spa the next day and requested the room to be kept until our appointment was over so we could return and change, they refused to accommodate this request even though it was only until 1:30pm leaving them plenty of time to clean the room for the next check in (3:00pm). It would have been the least they could do given the mishap in the room to begin with. For a junior suite I was incredibly underwhelmed, the lights were confusing and dim in one of the bathrooms and overall there was nothing spectacular to justify the cost of staying here. Only positive remarks I have are for the view from the room and the beautiful spa. I’ve had much better customer service at significantly cheaper/ lower star hotels. Just don’t expect much besides the architecture and views from this place. Overhyped and overpriced.",
      "rate": 1.0,
      "tripDate": " September 2021"
    },
    {
      "title": "Mediocre rooms crap food",
      "text": "Here is an example of someone thinking that bigger, flashier, and over the top is better. Wrong. Aside from the front desk staff that were amazing this hotel is bereft of any atmosphere at all. Let me start with the food. It was consistently horrible. And I mean bordering on a joke. I was here attending a business meeting. All I can say is the offerings were bizarre and poor quality. Sandwiches that looked like they were bound for a grade 1 lunchbox. A hot breakfast that for some reason provided cold hard boiled eggs instead of hot eggs. Lighting in the room is weird. Turn off the main and you cannot turn on the bathroom light. I don’t get it. Petros82 food was merely adequate. Fish was overcooked. Octopus was tough. And the vegetable chips were drowning in grease. The waiter also spent the evening wiping his face with the palm of his hand and coughing into his palm rather than his arm. At $500 for four people the quality was far below what was expected. Maxx’s Kitchen was also sad. Stale pastry; cold dry eggs on the hot table. And French toast cut into tiny squares that were also cold. Terrible. Now I get to the Falcon Skybar on 27th floor. The service was the worst in the entire hotel. While tables waited endlessly for drinks and incorrect food orders, the staff stood around the bar surfing social media together on their phones. At one point I counted five staff standing there doing nothing but talking with each other. It seemed being a customer was an inconvenience to them. I will certainly not return on my own accord to this hotel.",
      "rate": 2.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Toronto family trip",
      "text": "The good:I have to say the rooms were impeccable, I travel with my family at least 2 times each year on vacations that require hotel stays, this is one of the few times the rooms, bathrooms and overall hotel were spotless and incredibly clean.The not so great:We understand that employees are supposed to push the hotel restaurants, but one evening there was heavy rain and we just wanted to order a pizza for dinner, we asked the front desk, and they basically had no suggestions for takeout, not even a handout. We were visiting for the first time to Canada, and we were given no assistance at all, we were told to try the hotel restaurant. The bad:1. We arrived after a long drive from Washington DC with 2 children, the bell hop was at the entrance when we pulled up to ask where the parking was. I asked if I needed to get a pass from the front desk, he said yes, so I decided to bring my luggage in at the same time. The bell hop brought a luggage cart and rolled my suitcases to the front desk as I checked in. He told me the cases would be there when I returned from parking. After parking, my wife and 2 children came up and he watched as we struggled to get the 2 cases and 2 smaller bags off the cart. He never offered to help, so we found the elevators and made our way to the 13th floor. 2. Very surprised that the hotel did not offer complimentary coffee, the first in all my years of travelling, they had an espresso machine in the room, but not coffee, so we had to spend $4 each morning for coffee.3. The website said the hotel offered complimentary shuttle to area locations/ downtown. The reason we booked this hotel away from the downtown area was to have less noise, but also for the shuttle service. The first day, we asked for a shuttle, and we were told they did not have one, so we had to spend $15 each day, each way to get downtown.4. The hotel front desk was nice, but no one did anything extra to warrant a supposed \"high end\" hotel, we were first time visitors to Toronto, and we hoped to get some direction, but there was no attempt to assist, no brochures or guidance for visitors to your beautiful city. When I booked through the hotel site, there were questions that led me to believe there was genuine interest in who we were and why we were visiting. We were asked how many children and ages, so they could make the stay of the children memorable, we were asked why we were visiting, I assumed there would be suggestions for our trip, things to do etc.  (Why ask if nothing was going to be done, the kids did not receive anything during our 5 days, and we were offered no suggestions about the city and what we could do to make our trip a vacation to remember)5. On our 3rd night, we were sleeping when housekeeping opened our room door, unannounced at 8am, she apologized (wrong room, maybe). But on our final morning, housekeeping knocked at 10am and asked, \"you are leaving today, right?\" when we said yes, she asked \"do you know when you will be leaving?\"I told her we would be leaving before checkout time of 11am, I have never felt so rushed to vacate the room in all my hotel visits. It was very strange.",
      "rate": 3.0,
      "tripDate": " August 2022"
    },
    {
      "title": "A dream hotel",
      "text": "Hotel X is a dreamy, well designed hotel with excellent amenities. I fell in love with the design and decor of the public spaces of the hotel. My room was large, well appointed and had many great features: robes & slippers, Nespresso machine, automatic black out blind, good lighting, ample plugs and USB ports, an ultra comfortable bed and a nice sunset view. The 24/7 fitness centre can’t be beat. I love that I was able to sign up for a hot yoga class too (additional charge).I liked the lake view. I didn’t try the restaurants but liked the Nespresso cafe and appreciated the convenience of the attached Starbucks. I stayed at this hotel for work while attending a conference at the beanfield centre so the location was unbeatable. I would definitely stay in this hotel again, especially if I don’t have a need to be right downtown. It’s worth nothing it’s a close walk to the island airport (and they have a free shuttle) for added convenience.",
      "rate": 5.0,
      "tripDate": " March 2020"
    },
    {
      "title": "BEST HOTEL IN THE CITY - STAYCATION DREAMS",
      "text": "My fiancee and I booked Hotel X as soon as lockdown was being lifted and it was the best decision we could have made. As someone who travels to countless of resorts for business - Hotel X truly reminded me of a destination resort. It was such an amazing escape from the day to day. The food, service and amenities are incomparable to other hotels in the city. Yuna & Matt went out of their way to make sure our stay was nothing less than perfect. We booked the pool with ease and had a great time at the rooftop pool. We had dinner at The Grill (you have to try to the flatbread!). It was such a great way to feel some normalcy during the pandemic and Hotel X made sure we felt safe and everything was always cleaned and sanitized. Our room had an incredible view and the comfiest bed. We can't wait to return next month -this is definitely now our go to staycation spot!",
      "rate": 5.0,
      "tripDate": " June 2021"
    },
    {
      "title": "Amazing",
      "text": "I have enjoyed this hotel three times in the last 5 months.  Each and every time it was exceptional.  Every time I have business in Toronto I will be staying here. Special thank you to the kindness and courtesy of Helen and the entire front desk team - you made me feel at home and that this, was my hotel.  Your hospitality was exceptional and I will be returning.  Helen, you are the best loyalty program going. Enjoyed using the swimming pool even in the middle of winter. The views are exceptional and your skybar was awesome. Breakfast was excellent. Note:Breakfast was delayed less than 5 minutes due to a busy room service schedule, so they allowed us to enjoy free Continental buffet until our breakfast was prepared.  The smoked salmon was exquisite.  All staff were exceptionally courteous and helpful. After 35 years of staying in hotels in Toronto for business, this is the best hotel I've ever stayed at any price and the first review I've ever written.  Thank you again.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Best Hotel Stay Ever........",
      "text": "This review is a little late in coming, but as they say, better late than never.... Hotel X... where do I start. Grandeur in size, exuberant in style and excellence in customer service.   My husband and I were there for our anniversary in December of 2019.   We loved the facility, there is so much to do.   It was everything we wanted and more for our anniversary.  A special thanks  to Director of Sales, Saira.  Her passion shines through, each time she talks about what the hotel has to offer.  If it wasn't for her we would not have enjoyed the hotel as much as we did.  Saira, is passionate about this facility and presents this to clients with great pride.  This library hotel is equipped with books everywhere, borrow a book from anywhere  in the hotel, take it to your room or the pool side and  enjoy it.  The hotel has a theatre, an art gallery, an all season outdoor pool, state of the art tennis court and gym...  The resturants and the VIP lounge offers great good selections. If you are visiting as a family, there is tons to do for the kids.  We loved our stay so much that we will be returning with our family soon. Once again thank you Saira for making our stay so memorable. Looking forward to coming back soon..",
      "rate": 5.0,
      "tripDate": " December 2019"
    },
    {
      "title": "Stay Awsy!",
      "text": "Our stay was on Aug 19th for my husbands birthday. Our room was ready at 3 pm for check in and was prepared with balloons a piece of cake and a bottle of Procecco as per organized!The room was clean and comfortable on the 25th floor with beautifully ful views.We enjoyed dinner on the 28th floor with gorgeous views of the city but the restaurant (Valerie) was really unimpressive and service could use some training. We returned to our room at 12 and next to our room was a very loud party with music and many people screaming! We called downstairs and was told they would take care of the noise! Party continued all night long and could not sleep we finally decided to check out at 5 am and find another hotel. Party included 50 to 60 people dancing and screaming all night long!Even after we were promised that the security would take care of this several times the party just continued. We definitely would not recommend this hotel!Terribly disappointing!!!!",
      "rate": 1.0,
      "tripDate": " August 2023"
    },
    {
      "title": "Gym facilities not completely available for hotel guests",
      "text": "I basically chose this hotel at such an off-centre location because it had a full gym with fitness centre, yoga classes, steam room and even tennis courts! However, surprise, surprise, steam room is only accessible to gym members. And, not surprisingly, yoga classes cost 25$ each and 47$ for the tennis courts. In the end, I simply used the fitness centre without being able to relax after my activities in the steam room. There are also steam rooms at the adjacent Guerlain spa but at the hefty price of 280$ for a 90-minute massage that is not even done by a regular massage therapist, so they won’t be giving receipts. Won’t be coming back. It is just not worthwhile.",
      "rate": 3.0,
      "tripDate": " October 2023"
    },
    {
      "title": "Amazing Hotel",
      "text": "Absolutely fantastic hotel that, although pricey, provides an overall experience that justifies the extra expense.  This hotel has the most spectactlar athletic facilities we have ever seen in a hotel and the rooftop pool is wonderful (thoughfully designed with a partition that allows both indoor and outdoor use during winter).  Breakfast (not included in the room rate) at Roses Cafe was very good and reasonably priced for the quality.  The nearest streetcar station (509 & 511) is a 5 minute walk and the location is great for events at the Coca-Cola Coliseum and Convention Centre.  Staff were responsive and helpful.  We will definitely stay here again when back in Toronto.",
      "rate": 5.0,
      "tripDate": " December 2023"
    },
    {
      "title": "Not very friendly staff",
      "text": "I had made a request to film a VERY SMALL live performance scene for an independent artist from Toronto on top of the roof of this hotel and submitted a request. The woman who called me to speak about the event was absolutely no help at all and was extremely rude. When I told her my budget ($500 - 5 people max - 2-3 hours without food or anything) she pretty much laughed at me. I will for sure not be recommending this event space to anyone. Fix your customer service and teach your staff how to speak to people with respect and not make them feel bad. I’m Very disappointed. I normally do not even write reviews but the woman who called me was so rude I felt like I had to.",
      "rate": 1.0,
      "tripDate": " July 2021"
    },
    {
      "title": "Bed sheets not included.",
      "text": "This Motel does not include event a fitted sheet on your bed... Hope you don't toss and turn and wake up with your face on that stained mattress protector.Guess they spent to much on the fancy roof top pool to afford proper sheets.Gross.",
      "rate": 2.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Amazing Girls Weekend at HOTEL X!!",
      "text": "We had the most incredible girls weekend at Hotel X!  From the moment we checked in, we felt like royalty.  We stayed in the a corner suite with the most amazing views from all directions.  The living room style set up was perfect for lounging, relaxing and having a great catch up with friends.Our room had an incredible bathroom with a large soaker tub.  The water pressure in the stand up shower was incredible (always a bonus).  Just off of the washroom was a beautiful little vanity complete with cosmetic mirror and lights.The concierge Stephen was AMAZING and so helpful in helping us select our restaurant for the evening.  As we were celebrating birthdays he also arranged for a beautiful surprise bottle of Rose to be sent up to our room.After a night on the town, we returned to our room and had the most incredible sleep!  Housekeeping had set up our pull out bed and the turndown service was lovely.  I have to say that the beds and bedding at Hotel X are top notch.On Saturday morning we visited 10XTO, the beautiful luxury athletic club attached to the Hotel.  My girlfriend and I went to a Pilates reformer class with Joanna.  She was an amazing instructor and delivered an awesome class.Following our workout, we went to the Sky Bar for Lunch and took in the last moments of the breathtaking view.  We ordered one of each the Asian inspired appetizers (all delicious).If you are looking for a 5 star experience for your next girls get away, Hotel X is the place to be.  We will absolutely be back!!",
      "rate": 5.0,
      "tripDate": " October 2021"
    },
    {
      "title": "Beautiful Hotel ",
      "text": "We had the best time :) The hotel and amenities are amazing. Everyone who works at the hotel is friendly and professional. Two random things: the shower has tremendous water pressure!!! and the ventilation system in the room is completely silent, for those who hate that type of noise. We would definitely stay again.",
      "rate": 5.0,
      "tripDate": " June 2023"
    },
    {
      "title": "Fabulous Stay at Hotel X",
      "text": "We had the greatest experience at Hotel X for one night Sept 1st. We stayed in room 1103 (corner suite) was beautiful. The room delivers amazing views of Lake Ontario, Porter Airport, Yacht club, Ontario place and the CNE.  We were lucky to enjoy the jets practicing for the air show & had a great night sleep.  With the window shut it was not noisy at all with the exhibition happening.The roof top pool views were just as beautiful while enjoying a few drinks.  We had lunch at Roses on the 2nd floor. I have shellfish & egg allergies so brioche buns are not good for me, the server was quick to assure me there would be no issues at all. I enjoyed a tasty burger on grilled sourdough rye, the staff where extremely accommodating and very friendly.   I will surely stay again.",
      "rate": 5.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Wonderful Stay at Hotel X- Best Staff!",
      "text": "My boyfriend and I stayed at Hotel X at the end of August for a few nights for a fun getaway.  We live in downtown Toronto...but instead of heading out of the city we decided to stay here for a different experience and this place was exactly what we hoped it would be!  Upon check-in we were greeted by the loveliest staff members who truly went above and beyond to ensure we had the perfect room.  They also helped us secure an early check-in (which is never guaranteed) as we were going to the spa first thing that morning and we were so grateful!  After the spa we visited the rooftop pool which was FABULOUS!!  At first we were disappointed to learn that you had to book certain times to be there but after we got there we really appreciated it because it keeps the pool less crowded and much more relaxing. The pool is just beautiful and was definitely one of our favourite parts of the stay! We also must talk abut Roses Cocina!!  The food here was next level and so unexpected as we haven't heard of the restaurant before staying there!  Everything we tried on the menu was delicious for brunch, lunch and dinner! I personally ate the Huevos Rancheros every day and I still talk about how great it was!  Roses is definitely a place we will be back to enjoy dinner again even if we aren't at the hotel!The movie theatre was a very fun extra to the property and we also enjoyed how close Hotel X was to The Ex and also Budweiser Stage. If you are seeing a concert there it is a GREAT idea to stay at the hotel to enhance your experience for sure!Lastly, we must talk about the service!  I had read some reviews before booking that were mixed but I am delighted to tell you that our experience was absolutely wonderful with all the staff we came in contact with!  Sebastien at the front desk, and both Concierges we spoke with before we arrived were extremely helpful!  Special mention to Jacob Felts as he truly went above and beyond for us to make sure our stay was excellent.  He checked in with us each day and offered his kind assistance wherever he could and made sure we were always happy, he even went way above our expectations and helped us have dinner at Roses Cocina our last night even though it was fully booked!  He really understands impeccable service and he is an asset to the team there.  We will be back! Thank you all so much!",
      "rate": 5.0,
      "tripDate": " August 2022"
    },
    {
      "title": "A hidden Gem",
      "text": "Booked the hotel for its location close to where my son is living in Toronto and we were delighted with the location, room and service. Convenient for the tranlines running along the front and in the Exhibition Area we stayed for 3 nights and then after a trip to Niagara Falls stayed another night before returning to UK. On both occasions our room was immaculate (a twin Queen bed room). It was spacious with a great shower/bath and room for a couple to spread out their wash things - so often no shelves or space. All of the facilities you would hope for were in the room (safe, iron, hair dryer etc) The views from the room were fantastic, overlooking the Lake and the airport (but with no noise). The Roses Restaurant was convenient for breakfast and dinner, and we were very well looked after by the staff including when we brought in my grandson (5 months old) who was warmly welcomed. Cafe X is great for a quick breakfast coffee and Croison while Valeries will meet the needs of the young at heart on the 28th floor adjacent to the rooftop pool. Overall, a very enjoyable experience that we will certainly book again when next in Toronto.",
      "rate": 5.0,
      "tripDate": " October 2022"
    },
    {
      "title": "Fantastic stay, celebrating christmas and birthday",
      "text": "We have travelled al around the world and we have visited many hotels, but this hotel exceeds all expectations! We are spoiled now for the rest of our lives! On my 50th birthday celebration the hotel surprised me  with a cheesecake at breakfast and champagne and chocolate strawberries when we came back in the hotel. Also a free dessert with candle in Maxx kitchen. Then on christmasday we were served a tray with christmas cookies. We loved the swimming pool, with warm water and swimming outside on the rooftop, overlooking Toronto. We loved our stay so much that we decided to cancel our other hotel that we had booked for the end of our vacation and booked again in the same room. When we came back we had a warm welcome in the lobby, thanx to Lawrence. In the room was a card and a fruitbasket. To top it all we got complimentary tickets to the aurora winterfestival. We booked the club room, and had lovely breakfast and wine and dine each day. The staff in the clubroom was very nice, especially Jack, loved talking with you. Thanx hotel X for a wonderfull stay!",
      "rate": 5.0,
      "tripDate": " December 2019"
    },
    {
      "title": "This hotel is not worthy of 5 stars at all.",
      "text": "If you want a firm mattress, you must request it.  There is no guarantee you will get one unless you request one.   The wifi is not secure.  The roof top restaurant was chaotic.  The floor in the other restaurant was filthy.  Some staff are excellent, very friendly and do their best to serve you, and accommodate you.  Service can be very poor though.   I do not think this hotel is worthy of 5 stars.  It does not matter if you made reservations months in advance at Valerie, you still may not get a table.  For 5 stars the windows should be 3 pane.  Sure it’s in a very noisy area, but more could have been done for sound proofing.  It is a very busy hotel, too much going on.  Operating the cooling system in the rooms is challenging.  The water pressure in the shower is fantastic.  Adjusting the water temperature in the wash basins is also challenging.  Take care not to burn yourself.   The gym is fantastic.   I didn’t use the spa.  I also didn’t order room service.  The worst was my first night dealing with the mattress, having to move rooms, and then being offered only 15% off for my first night.   Then I was told it was my fault because I did not request a firm mattress.  Unfortunately, I won’t be staying there again which is disappointing because some of the staff are excellent and depending on what I am doing in Toronto the location is perfect.  The location is great if you want easy access to Etobicoke, for example.   The food can also be quite good.",
      "rate": 2.0,
      "tripDate": " May 2023"
    },
    {
      "title": "Lovely Luxury Weekend",
      "text": "We had originally booked a room here for our wedding weekend in 2020. After postponing and eventually cancelling the big wedding, we weren't able to get a refund on the room so we used the excuse for a mini honeymoon. The service was excellent, all staff very friendly and responsive. The one bedroom suite was beautiful, with views of both the water and the city skyline. Booking reservations at the pool was efficient, as was reserving a table at the Falcon Sky bar.  We had drinks there on Friday night, great atmosphere, great DJ, only complaint was no drink menu to see a list of cocktails or have any idea of pricing. For a suite, I thought the bar area could have been a bit better equipped; the mini fridge is extremely small, not many glasses or extra utensils/wine tools for entertaining. Lighting in the room was excellent, always appreciate dimmer switches! We tried to book the car service that drops guests off within a 5km radius of the hotel, however  it's not running due to Covid...this seemed a little strange as taxis/Ubers are all operating with easy protocols in place. The rooftop pool is really nice, great views and limited capacity which means you can't stay for more than two hours but it doesn't get crowded which we appreciated. Only minor complaint would be that extended checkout is only 30 minutes, which doesn't make much of a difference. Overall we had a great stay, very comfortable, clean and relaxing environment.",
      "rate": 4.0,
      "tripDate": " August 2021"
    },
    {
      "title": "An amazing stay at Hotel X",
      "text": "We stayed 5 nights in December visiting fromVancouver and we had such a great experience from the time we checked in. The staff were all very friendly and helpful especially Priyan he went over and beyond to ensure we had the right room and even showed us a few upgrade options. The hotel is very clean and the rooms are especially clean and well laid out. Housekeeping did a very good job with daily water replenishment and the Nespresso machine was a great bonus. The powered window coverings worked very well and having L’Occitane bath products just confirms that this hotel stay is going to be good. The heat thermostat worked well and the washroom fan was so quiet you could not tell it was on! We used the theatre one evening and with our kids we had popcorn and again the service was amazing. The rooftop pool even in December was nice and warm.Thank you for making our stay a real home from home experience and we had such an excellent time in Toronto and Hotel X exceeded our expectations.",
      "rate": 5.0,
      "tripDate": " December 2022"
    },
    {
      "title": "High expectations, disappointing experience",
      "text": "The hotel is itself is relatively nice, but the staff and business are not top tier. For the price, it’s not worth, unless the proximity to the nearby facilities are of utmost importance.We were unfortunately delayed in our travels, the hotel was completely inflexible in pushing back our reservation by a day. So had to pay a full day where we weren’t present. The checkin process took about 20 minutes even without anyone in front of us. The staff seemed more happy to type away at their computers rather than welcome guests. While staying, and even before, the hotel is almost completely unavailable via phone. Both via the publicly available numbers, and the in room phone. Calling every number available on the in room phone went unanswered. The room service has a built in 18% tip, but they hand you a bill with an empty gratuity line, expecting additional tip. Food is average or less depending on dish. I would be more than happy if this experience was offered at a 3 or maybe 4 star hotel at a lower cost.But for these prices, it was disappointing.",
      "rate": 2.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Superficial hotel",
      "text": "This hotel is nice to look at, but unfortunately for me the service and actual comfort is lacking. Very superficial type of place. For the price you pay, you should expect world class customer service; this doesn’t exist. We had a loud neighbour the first night partying until 4am. Made several calls to the front desk and not a single one was answered. Had no choice but to just stay awake and listen to the party all night. Beds are also extremely stiff and uncomfortable. Feel like cheap box springs. Rooms controls are confusing, specifically the light switches. Need a PHD to figure out how to turn the lights on. Cafe opened late every morning so wasn’t able to get anything besides a $50 room service breakfast every day. Only nice thing was the washrooms/shower. They did a great job with that.",
      "rate": 2.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Worst customer service ever!",
      "text": "We arrived at the hotel and it is beautiful the view is very nice! The problems begin with the fact that they are advertised as a luxury hotel while the wait staff is beyond stuck up! When you are paying 600$ a night for a room you would except to get some level of care from the staff! We tipped at least 20 percent for everything! There is no coffee in the rooms if you want coffee you have to pay 10.50 for a pot and of course tip room service. There is no ice machines if you want ice you have to call room service and wait for them to bring it to you in a tiny bucket and also tip of course. A wrap with deli lunch meat turkey and fries was 40$ from room service! The indoor outdoor pool was not warm enough and the inside part was super small there was also no hot tub. Overall it was a very disappointing experience.",
      "rate": 1.0,
      "tripDate": " January 2023"
    },
    {
      "title": "Conference at Hotel X",
      "text": "Attended a work related conference at Hotel X.  Room was spacious, well appointed with amenities, very clean and had two very comfortable queen beds. My adult also travelled with me to the hotel, and when asked they were more than accommodating with a later check out for him and they also have a excellent departure lounge which made his wait for me to finish at 5:00 pm much more pleasent.  The hotel is very accessible by car and you have the choice of either valet or self parking which is not always available at a hotel of this level in Toronto.  Overall I highly recommend Hotel X and would definitely choose to stay here on my next trip to Toronto.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Most disappointing customer service",
      "text": "We sent an employee to a conference in November 2022, and booked her at the Hotel X through Expedia. Called to put a credit card on file for incidentals the morning of the stay, and was told we needed to put a credit card on file a minimum of 5 days before the stay, or we couldn't add it. What? Nowhere in the reservation did it say that a credit card for incidentals could not be put in via the phone within 5 days of the stay. I had a corporate card, they refused. I had a colleague going to the conference as well, and asked if we could put her card on, and then she'd come by to confirm it after she had arrived in Toronto. Nope, also not ok. Kept harping on their policy, and didn't seem to believe our staff member may not be able to put a $750 hold on their personal Visa or Debit. Because they refused to try and work with us, we had a staff member sit for hours in a foreign city waiting for someone else to show the same Visa that we would've given them over the phone.Save your money (it isn't a cheap place!) and go somewhere with a shred of customer service. I've stayed in hostels that were more accommodating!",
      "rate": 1.0,
      "tripDate": " November 2022"
    }
  ]
}