{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Howard Johnson by Wyndham Toronto Downtown West",
    "url": "/Hotel_Review-g155019-d188210-Reviews-Howard_Johnson_by_Wyndham_Toronto_Downtown_West-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "2.0",
      "reviewCount": 443
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "14 Roncesvalles Ave King St West and Queensway",
      "addressLocality": "Toronto",
      "postalCode": "M6R 2K3",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/21/9f/ac/f4/welcome-to-the-howard.jpg?w=500&h=-1&s=1"
  },
  "description": null,
  "featues": [
    "Paid private parking nearby",
    "Free High Speed Internet (WiFi)",
    "Wifi",
    "Free breakfast",
    "Newspaper",
    "24-hour front desk",
    "Express check-in / check-out",
    "Air conditioning",
    "Flatscreen TV",
    "Non-smoking rooms"
  ],
  "reviews": [
    {
      "title": "Terrible! Shame on you Howard Johnson!",
      "text": "This is a terrible hotel. Not only is the hotel a dump, the location is awful.  Located at the corner of King and Queen streets in Toronto, it is directly beside the TTC Streetcar turnaround. Noisy screeching sounds made it impossible to sleep. The room itself was a health hazard - soiled towels and stained bedspread - I'm not sure the linens were even washed! I found a Bic lighter in between the sheets!  The bathtub had peeling enamel and rusty fittings; the tub faucet was lose and therefor difficult to adjust the water temperature; there was hair on the bathtub surround; window in the bathroom had no lock and had been left open. The wall paper was ripped, the door to the bathroom had punch holes;...I could go on and on. It was a disgrace! Oh, and no parking, which was never identified on the website. Shame on you Howard Johnson and Wyndham Hotels!! Someone from your corporate office needs to go and inspect this hotel as soon as possible. I will never stay at another Howard Johnson Hotel!  I can't believe they had to nerve to charge money to stay there.  The franchisee is clearly squeezing every penny out of this tired and sad building. Stay away! I stayed the night only because I arrived in the evening and had a funeral to attend early the next morning.",
      "rate": 1.0,
      "tripDate": " February 2020"
    },
    {
      "title": "We left after ten minutes and took the loss...",
      "text": "We stayed at this hotel because we were in Toronto at a concert. We booked two rooms one for ourselves and one for our teenage children. Sure we knew it was going to be cheap, but we were hoping it was going to be cheerful too! (It happens!) The first clue that we might not enjoy our stay was when we asked a guy at garage for directions. His exact words were, \"Whoa, rough neighbourhood...\" and this was coming from a guy who looked like he could handle himself in ANY neighbourhood. When we arrived after driving for 7 hours (yes we live in the middle of no-where) we were told our rooms were not ready. So we hung around the very friendly front desk staff and waited. Finally we were told we could go up. Up we went...and low and behold we couldn't believe our eyes. (Maneuvering ourselves and our luggage down the hallway filled with bundles of used bedclothes was pretty creepy.) Our room was beaten up (small holes in the walls), abused and stained. Clean? I don't know! I couldn't tell! Was it dirt or a stain? It was incredible! I'm not a neat freak, you can ask my collection of very happy dust bunnies...they'll tell you! But this was freaky. I felt like I was going to be sleeping in crime scene, or perhaps that I had been teleported to an episode of Starsky and Hutch and at any moment Huggy Bear was going to jump out and give us a tour. I was mortified and immediately went to look at the kids room. It wasn't any better, however, my morbid teens thought it was funny that there was what looked like to be bullet holes in the walls and more peculiar stains on the carpet to which I won't even go into. (They weren't bullet holes...just holes...and very imaginative kids.)I went back to my room and opened the phone book and  booked us into a different hotel. We went down stairs and because we had pre-paid for the hotel rooms we were not able to be reimbursed. Such is life. You win some, you lose some. If you've read any of my other reviews you will know that I give good and fair reviews. But honestly, the only good thing I can say about this place was that the staff were lovely and genuinely concerned that we were leaving. We were very polite to the staff and not insulting...it's not their fault...they're just working there, they don't own the place. Bottom line: If you're broke, young and used to youth hostels and you need to spend a few nights in Toronto - go ahead, I'm sure it's safe enough. The location is pretty good.",
      "rate": 1.0,
      "tripDate": " October 2011"
    },
    {
      "title": "Sage Advice from Distress Traveller-- Aviod Lakeshore HOJO",
      "text": "Dear Sir//Mam,Please post this on your website to help other Travellers.HOJO at 14 Roncesvalles Ave Toronto, ON M6R 2K3 This is a Really Terrible place to live. Please watch out for the following.Rude hotel staff, extremely dirty carpet (check carpet color INSIDE the ROOM versus OUTSIDE the room). Outside the room the carpet is clean, but inside the room the carpet is stained with black shoe and feces marks (never washed!!!).The comforter and the sheet underneath had the stains when I asked for the new comforter, i was given sheets in exchange. The size of their pillow is the size of the Diameter of your Head!!! That’s it. There is a stain going from the side of the mattress all the way to the edge of the bed all the way to the carpet. Patches of these stains were on the carpet.DO NOT trust the size of the rooms you see in a picture or photo. The ROOMS are Extremely TINY!!!Online advertisement will talk about in room safe. There is NO SAFE.Online advertisement will describe clean shower. I found pubic hair on the hair drier!!. When I brought to the attention of the staff, they did NOTHING.Area where the hotel is located is very dangerous. Please be careful with you possessions.There was NO fitness center. NO Parking facility, NO SAFETY DEPOSITE BOX, No CYCLING!!!There is CONTINOUS LOUD NOISE from the Street Car (similar to light rail/Tram) ALL DAY and NIGHT.It is really a terrible hotel please STAY AWAY because for a $10.00 difference they will rip you off saying \"WE DID NOT PUT THE ADVERTISEMENT, the websites did. Complaint to the website not to us\"SincerelyDistressed Traveler who lived at HOJO 14 Roncesvalles Ave Toronto, ON M6R 2K3 and became sick upon reaching home.",
      "rate": 1.0,
      "tripDate": " May 2011"
    },
    {
      "title": "It's what's on the inside that counts...",
      "text": "Looking at a street view of this property on Google didn't leave a great impression... seeing the same view upon arrival did nothing to quell my apprehensions.However, the front desk staff was great and the check in experience went well and I was off to a guarded trek to the room.I must say that I was PLEASANTLY surprised! The room was remodeled and quite modern. The bed was comfy and the towels smelled clean with a hint of bleach.From a convenience standpoint, public transit is literally right outside the front door and there are fast and sit down food options in walking distance.Hotel offers a limited breakfast but there is a McDonalds right next door that is 24/7Wi-Fi was slow and dodgy.",
      "rate": 4.0,
      "tripDate": " March 2020"
    },
    {
      "title": "HORRIBLE PLACE!!!!",
      "text": "We got here on the 14th of march 2011 and we must say the hotel didn't actually look that shabby from the outside, even though the neighborhood is a little Ghettolike!Anyways, the receptionist was unfriendly and actually only paid attention once and that was when it came to pay the 50 cad deposit. The room was located at the 3rd floor and since there was no elevator we had to carry our 3 big suitcases all the way up without any kind of help offered whatsoever. We were yelled and insulted at by a drunk man who came down the stairs right by the reception desk and nobody even thought of interfering . Once we got into the room, we couldn't believe our eyes. The carpet along the stairs all the way towards the room was already the most disgusting thing we've ever seen but the one in the room topped it. There were stains with the size of a spaghetti bowl, mold stains on the bathroom curtain, on the pillow on the sheets and on the wall. It was announced as a double but it was too small even for a single. We went downstairs to complain but the manager wasn't there so there was nothing she could do. On the next morning we tried to have breakfast but since there was nothing but a waffle maker, we skipped that. Unfortunately the manager wasn't there again so we left to get a new place. Once we found one we took our stuff and left. The room hasn't been cleaned in the morning either. We called the manger the next morning, who turned out to be a very rude, unreasonable and uneducated person. He wouldn't let me finish one sentence and referred to his policy there is no way to get a refund about 5 times during that conversation. All in all THIS HOTEL IS A SCAM!!! and we can only highly recommend you not to go there, not even for a dollar a day!!!",
      "rate": 1.0,
      "tripDate": " March 2011"
    },
    {
      "title": "Never Again...",
      "text": "The staff in this hotel knows that if you go inside, you won't stay. This is the reason they offer 30% off in 3 days stay. Very atractive for people don't know this horrible place. After you arrive and see all around or go to undescriptibles room, you will never can cancel and have your money back. No choice....stay in there frustaded or gift them your money just for nothing. I will never come back and I will never recommend this hotel. When I see that appear somebody telling something diferent or saying that this is a very good place, even a good place, I know for sure that is somebody instructed for them to do it.",
      "rate": 1.0,
      "tripDate": " September 2010"
    },
    {
      "title": "Rude front desk staff!",
      "text": "Stayed at this hotel because we wanted an inexpensive hotel for 1 night stay in Toronto in this specific area. This was the only hotel in the area. The room was fine. Small, but fairly clean. What I would expect from a 2 star hotel for less than $100. My problem was with the front desk staff. I arrived to a man listening to his headphones. No smile. Rude. Then the next morning we were just double checking that we didn't forget anything when the room phone rang at 11:03 am.  I answered it and was told in an extremely rude voice that check out was at 11. I explained we were just on our way out. I just couldn't believe it! Never in all my years of staying in hotels have I ever received a call in my room for being 3 minutes late on a check out. Left the worst taste in my mouth. Will never stay here again. Ever.",
      "rate": 1.0,
      "tripDate": " November 2015"
    },
    {
      "title": "Inmates at San Quentin have cleaner cells.",
      "text": "Stayed here for a couple of nights because of the ok location and what we thought was a resonable price. Thinking about it now though, this place may be used on next seasons I'm a Celebrity Get me out of here! The 'maid' couldn't even be bothered hoovering the stairs, I don't actually think they own a hoover. Our room stunk of smoke so badly that we could still smell it on our clothes a week or so afterwards. The room was disgustingly dirty, I don't think the bathroom had been mopped this year. When you had a shower you had to dry your feet throughly before stepping out otherwise they would be dirty from the floor. I think the mop issue is the same as the hoover, they don't own one. There were clumps off hair in the plug and long black hairs all over the bathroom (not ours!) There were stubbed out cigarettes still on the lamp and ash on the ac unit. Our room was situated at the front of the hotel, this seems ok. But the rail cars run 24/7... right outside the hotel! We did see the maid on our second day so she did exist, she started cleaning the tables in the dining area while we were eating our breakfast... with BLEACH!!! We also got attacked by a bug on our first night, David Attenborough would have struggled identifying the sucker but it was just another tick on the, why are we here?, chart. There was also holes in the wall, a tear in the actual mattress and stains all over, lovely.A positive was the guy behind reception who worked nights was nice and helpful. The others could barely comprehend what we were staying. Do yourself a favour, don't put yourself through this place.",
      "rate": 1.0,
      "tripDate": " September 2015"
    },
    {
      "title": "Crap",
      "text": "Dirty, noisy, outdated. The bathroom was covered in long red hairs (mine is black). Pubic hairs covering toilet and floor. Dirty sheets, dusty.",
      "rate": 1.0,
      "tripDate": " August 2015"
    },
    {
      "title": "Do not stay here!",
      "text": "This hotel was a huge disappointment.  Even though based on the price and other ratings, I wasn't prepared for a hotel that was so unresponsive to concerns regarding ants int he room, dirty floors and smoking allowed.  It is old, dirty the breakfast room looks like it is in a storage room the quality of offerings was very poor.  When we commented way we were checking out, the person at the desk showed nothing but uncaring disinterest.  Our goal in staying there was to be close to the hospital, but couldn't do it and had to check out after one day.  We were' offered any refund,s o we forfeited our prepaid fees.",
      "rate": 1.0,
      "tripDate": " February 2015"
    },
    {
      "title": "Hotel worth staying",
      "text": "First of all, rough looking and shady neighborhood. However, the room, shower, tv and bed are ok. Internet speed above 10MB. Queen St.. is a short walk from the hotel (one block), take the street car and go somewhere else to eat and drink. There is a public parking lot two blocks from the hotel for $4.",
      "rate": 3.0,
      "tripDate": " December 2012"
    },
    {
      "title": "Good value at HoHo Toronto Lakeshore",
      "text": "Great value; absolutely NO horror stories. Renovations are happening, but they didn't bother me. This is not a luxury hotel, so don't expect that. But it was clean, inexpensive for Toronto, and room, bed, washroom, and Internet were fine (although room decor was a little outdated). The included breakfast was basic, but perfectly adequate for me. Good location on a great, fun street. Super access to St. Joe's Hospital.Off-site parking (several blocks away) is a nuisance (but reasonable directions and okay parking garage); baggage drop off and pickup was awkward. People with mobility issues might have a problem and, therefore, people should be warned what to expect. There was a quiet, newish heater/air conditioner unit, but given the hotel's location right beside Gardiner and TTC streetcar yard, it couldn't help but be a bit noisy in the room. Hallway and other rooms were very quiet.",
      "rate": 3.0,
      "tripDate": " November 2012"
    },
    {
      "title": "Good location and convenient for downtown",
      "text": "The Howard Johnson (HoJo) is a tad run down, and the hotel safes in each room are still not working, which is slightly concerning if you have passports, money and valuables you want keeping safe.There is a free breakfast (good luck getting the somewhat incontinent waffle-maker to work !), but the addition of say boiled eggs and a basket of fruit to the continental breakfast on offer would make it more nutritious for a small financial outlay  IMO.HoJo is at the bottom of Roncesvalles Ave (roncey) in the High Park area, close to the lakeshore, and the excellent High Park and lake (Grenadier Pond), and well served by trams to the city (Queen, King) and the Dundas St subway station. There is a tram depot at the back which does make a bit of noise especially in the early morning but it's not that intrusive.High Park itself is a very pleasant living and shopping area which was formerly quite Polish, and the remnants of this is to be seen in several shops and restaurants. Cross roncey from HoJo and you get to Queen street heading  into the city. This area is called Parkdale and is grubbier and cheaper than roncey but quite interesting. A ten minute walk gets you to a Salvation Army thrift store which is good for clothes, books and bric-a-brac. A few minutes further on there's Parkdale library which lets you use their internet even if you are a visitor, and to boot is open on sundays for part of the year !Provided you don't expect to get a 4 star hotel for a 2 star price I would say HoJo on roncey is good value for money, especially if you book ahead or stay for a few days.However next time I'm in Toronto I'll be tempted to 'bid' for hotel rooms in the Downtown West area (which includes roncey) on the priceline site.",
      "rate": 3.0,
      "tripDate": " November 2012"
    },
    {
      "title": "How does health and Safety allow this hotel to stay opened?",
      "text": "Worst hotel experience of my life. I couldn't even stay in the room, the smell was awful, the streets were cleaner than this room, there was even fly's all over the room and bathroom. Don't take a risk with this one like we did. The other reviewers are not hard to please, it really is that bad! \"Five minutes from all places that matter in the city of Toronto\" my backside. When we asked the cab driver to take us from downtown to the hotel he laughed and asked why we booked that place. He said we could have got a much nicer place in downtown for the same price.When we arrived, we were told we were upgraded to 2 bed's as they didn't have a non-smoking king room left like we had booked. But it was still a non smoking room. Seemed ok so we agreed. We got to the room and after gagging at the smell, I opened the curtains to the dirty scummy window and it just made everything worse. If this was an upgrade, what was the other room like?! The bathroom was rotten, pubic hairs all over the floor and the shower curtain was stained. The carpet in the room was patchy and there was blood splatters on the wall paper and lots of other stains. I spent the entire stay (about 15 mins) swatting flies away!We checked the beds before making our final decision to stay/go... and the base of the bed has stains all over it, the bedclothes were stained, and the gold duvets had wet patches on it. There was pubic hairs on the bed, long dark hairs and long blonde hairs. The 2 beds were similar. We went to reception and asked if we were put into the wrong room as this didn't seem to be cleaned since its last occupants and the arguing started.I was told it wasn't a luxury hotel and I was expecting too much (I thought a clean bed was the norm in hotels regardless of rating??).  He told me this was clean and the cleaner had serviced the room that morning. I asked him to come to the room and have a look, when I pointed out the hairs on the beds, he swept them to the already dirty carpet and said there was nothing wrong with the bed and as they were a budget hotel, they couldn't afford to have high quality bed linen and towels. All I expected was something clean. He was extremely unhelpful and argumentative. He said they didn't have another room for us that night as they were all occupied. I asked for a refund and he said this was not possible. We were booked for 3 nights and this wasn't an option to stay here. He said we could talk to his manager the next day but there was nothing he could do. I pointed out that there were wet stains on the bedclothes and he lifted them saying he would send them to laundry (eh... was this not done anyway?!) After deciding we couldn't stay in that room, we took our bags back to reception and asked for alternative arrangements to be made, which was refused. It was 7pm and all we could from get was that we needed to speak to the manager the next day. The guy then took us to a room to prove that the hotel rooms were cleaned.... we still weren't impressed by this, although a bit better.... but we couldn't have that room as someone else had already booked it. Strangest and rudest experience we have ever had with any hotel in North America, India, Africa or Europe. Needless to say, for an extra $10 a night, we got a lovely 4* in downtown. Howard Johnston kept 1 full nights cost and refunded the other 2 nights. The manager was still extremely rude and argumentative.",
      "rate": 1.0,
      "tripDate": " October 2011"
    },
    {
      "title": "STAY AWAY AT ALL COST.....",
      "text": "Truly the worst hotel experience of my life.. and I travel quite a bit.My friends and I booked this hotel for 5 nights (what a BAAAD choice).   Located in the ghetto of Toronto.Whether you book last minute or in advance, it is non-refundable or exchangeable.. not surprising because once you get there you will want to leave.The bed sheets had stains (big ones) and the bath had hair all around.  ALL the rooms smelt of smoke, even the non smoking ones.  Everything about this hotel is filthy and false, there is a big sign that says breakfast is between 0730-1100 and when we came down after a sleepless night due to someone breaking into the room at 0230.  And the noise coming from the bus station located directly behind the hotel.  The manager told us breakfast finishes at 10:00. We complained to the manager about the state of the room and he said \"this is a non-refundable room, may be try and find another hotel\" and that is what we did.  The manager is very arrogant and unhelpful.   After only one night here we checked out and booked into Novotel on the other side of town.",
      "rate": 1.0,
      "tripDate": " May 2011"
    },
    {
      "title": "the worst ever !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
      "text": "i have not seen a front desk staff like that,,he was so terrible,,the rudest ever he didn't even let me talk yelling at me on the phone there is noway to talk with him on the phone.i was trying to explain him something he didn't want to listen and put me hold 3 4 times.who ever reads this comment if you want to have nice vacation DO NOT STAY  THIS HOWARD JOHNSON!!!!!!!! i also know his name but im not giving his name here. i will never ever recommend that howard johnson to anybody and i will always complain about it!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
      "rate": 1.0,
      "tripDate": " February 2011"
    },
    {
      "title": "good location in toronto",
      "text": "Don't believe what you read!! Very good value, not the cleanest, great breakfast, street car stops right in front of Hotel. There is a Mcdonalds next door and convience store across the street. I would recommend staying here for the price not bad at all!",
      "rate": 3.0,
      "tripDate": " February 2011"
    },
    {
      "title": "Very poor hotel",
      "text": "My father had stayed at a tourist home 2 blocks from here every year for years.  I wished to stay somewhere with a few amenities instead.  Oh boy, where to begin.The neighborhood isn't the best, but it's not the ghetto either.  Behind the hotel is a streetcar parking area.  We stayed three nights, and I only heard the streetcars one morning (I think because that was the only weekday morning of the trip).  The room is extremely small.  The room had two double beds, one for me and one for my father.  The distance from the foot of the bed to the wall was less than a foot.  The person who slept in the bed further from the door had to really squeeze through.  The hotel has three stores.   There is no elevator.  Once you get to the top of the stairs, you need the room key to just get onto your floor.  The walls are very thin, so when you're in the hallway you can hear the other people on your floor.The hotel parking is an underground garage in an apartment building two blocks away and costs $12 per night.  There is a surface lot half the distance and the sign says they were charging half the price.  Good luck unloading your car, since there is no where to legally park long enough to run in and register and get the keys to your room and the key to the garage.I have stayed at many Howard Johnson's so I wasn't expecting a lot.  But I was expecting more than was offered.  Next year when we go to Toronto, we won't be staying here.",
      "rate": 2.0,
      "tripDate": " September 2010"
    },
    {
      "title": "THIS IS NO LONGER A HOTEL",
      "text": "We were looking for a place just for a short stop. Would have spent less than ten hours total there. Wyndham website allowed for bookings and the “images” presented an acceptable hotel. When we arrived it was a different story. Construction all around. My wife went in to ask about parking. Well, tried to go in. It was locked. Someone came to the door and told her IT HAS NOT BEEN A HOTEL FOR QUITE SOME TIME. It is a shelter for homeless people. We called Wyndham customer service and cancelled. The service rep still saw it as a hotel in the system with options to make reservations. Simple unbelieveable",
      "rate": 1.0,
      "tripDate": " August 2020"
    },
    {
      "title": "Avoid",
      "text": "One is the lowest score possible on this scoring scale.Not sure why this should be a hotel in the first place.Very old building, kept in shabby condition. Window air conditioners. In breakfast area, window room conditioner which has towels tucked below it (to address the water drip?). Parking is disaster.People,  who do not match anything close to guests/tourists are roaming around the hotel and even inside it. I think 2nd and 4rd floors are used as something else (longer term rentals may be?) There is no cleanliness in rooms and common areas.This place is scary.It has left so bad taste on us, that we want to avoid booking with that chain.",
      "rate": 1.0,
      "tripDate": " August 2019"
    },
    {
      "title": "Don't Bother",
      "text": "I stayed here for one night with a couple of friends. We only needed a room for sleeping (weren't going to be spending much time at the hotel) so we figured this room would suffice. Wrong. The staff is basically non existent, our lights didn't work (nor did they care to fix it) and the beds were dirty. We didn't complain too much, as we spent minimal time actually at the hotel. However, I do not advise anyone book this hotel if staying for more than one night.",
      "rate": 2.0,
      "tripDate": " September 2013"
    },
    {
      "title": "Good value for money",
      "text": "the hotel provided excellent access to nearby hospital (St. Joe's) and was right on the streetcar line to Queen Street west shops and restuarants.  we originally had a floor on the 2nd floor which was way too tight, but the concierge moved us to the main floor and the room was adequate for our purposes. We'd stay there again.",
      "rate": 3.0,
      "tripDate": " October 2012"
    },
    {
      "title": "Stay away at all costs, not worth the money",
      "text": "Truly the worst hotel experience of my life.. and I travel quite a bit.If you book in advance, it is non-refundable or exchangeable.. not surprising because once you get there you will want to leave.Located in the ghetto of Toronto, I had 2 seperate groups of people outside my room threatening to kill each other in the middle of the day. Very, very noisy with the streetcar station being located directly behind it. NO parking at hotel. Closest parking is two blocks away and the hotel still charges you $12 per day for it. Room was not cleaned properly. There was hair in the tub and the bed. There was also a wet rag in the drawer of the night table. Terrible customer service, I waited 65 minutes to check out of my room because they had 1 staff member working who was very slow. Finally (this may just be coincidence), I developed a lung infection while in Toronto. It wouldn't really surprise me if it was because of this hotel. Should be called the Hobo, not the Hojo.I have never written a hotel review before, but felt this one necessary because it is that bad.",
      "rate": 1.0,
      "tripDate": " April 2011"
    },
    {
      "title": "Horrible... just sad",
      "text": "The hotel is very, very old, smells like old, the room is so tiny i had to jump over my own luggage.  Rooms with fungus smell, wifi wasn’t working and air conditioning/heat were broken.   (-14c outside, not a good experience as you can imagine)Tried to change room but there wasn’t any available.Oh, don’t forget to have your workouts updated because there’s no elevator so be prepared to carry your 23kg bag over 2 or 3 floors.... :(Sad, horrible experience.",
      "rate": 1.0,
      "tripDate": " December 2019"
    },
    {
      "title": "Decent",
      "text": "We stayed here while in town for a show. Our room was very small but clean so we laughed it off (it was just a place to sleep afterall) 5$ parking 3 blocks away was a lil sketchy but cheap parking in TO. the fella behind the desk was very helpful and friendly. Short walk to all kinds of bars and restaurants.",
      "rate": 3.0,
      "tripDate": " April 2016"
    },
    {
      "title": "stop over",
      "text": "Stay here for 1 nite as I arrived a day earlier then I thought. Looking for a cheap place to crash after driving all day. It was $102 taxes and parking. You had to park 3 blocks away but it was underground and nothing was taken as I had a lot of stuff in the car. This was and old building and they gave me a smoking room even though I don't smoke so it smelled but it was clean and had a good T.V. For the money I would say it was worth it and it was interesting area and not to far to down town. It also had free wifi and a very basic breakfast.",
      "rate": 3.0,
      "tripDate": " August 2015"
    },
    {
      "title": "HEALTH AND SAFETY ALERT",
      "text": "If you value your health or life, I urge you not to stay here. We arrived at the hotel, checked in and immediately checked out. The front desk clerk did not even flinch when we told him it was unacceptable. To the hotels credit, they did give us a full credit and no cancellation fees (lucky for them or we would have raised an issue). There is no parking. You pay $12 to park 10 blocks away. The room was ridiculously small. I mean, my husband is 6'8\" so we anticipate that we will need to make exceptions here and there but my closet at home was bigger. It was just enough to fit a double bed and a bathroom. We were paying $144 for a room with bullet holes and cigarette burns all over the sheets. I'd like to know how this hotel has managed to avoid being shut down by health and safety. It's frightening. BEWARE!",
      "rate": 1.0,
      "tripDate": " July 2015"
    },
    {
      "title": "Very Poor Service and Quality",
      "text": "I attended this hotel for a wedding. Booked a room MONTHS in advance only to find that they decided to change the room type on me which could not accommodate my party. They place smelled like absolute filth, and there was no elevator. A terrible experience for my first time at a H.J. The only good thing was the friendliness of the staff and the blueberry waffles in the morning.",
      "rate": 2.0,
      "tripDate": " October 2013"
    },
    {
      "title": "Worst I've stayed at in years (bed bugs, prostitues, dirty & and smelly)",
      "text": "The hotel is dirty and smelly.  They wouldn't give us the option of a non smoking room.  There is barely enough room to walk in the rooms with two beds crammed into the corner of the room.  I found a bed bug in my bed as I was falling asleep.  I called the front desk and showed it to them.  Manager denied that it was in fact a bed bug.  We had no other options for accomodations, so we stayed another night.  That night there were people across the hall yelling and screaming and bumping into the walls all night and into the morning.  Called the front desk numerous times, but they did nothing about it.  I got very little sleep.  Several times I saw prostitues and johns coming in and out.  I would not expect this from a semi-respectable chain like HOJO.  The location is good, except that the streetcar railyard is adjacent to the hotel which is very loud 24/7.  Would not recommend to anyone.  Not even in a pinch.",
      "rate": 1.0,
      "tripDate": " September 2013"
    },
    {
      "title": "SO Bad! Call Girl, Druggie hotel!",
      "text": "You get what you pay for! There were hookers in the lobby, drugged out men in the entrance way! The smell knocks you over as so as you walk in the door, Very strong urine smell!Just about the worst hotel i have ever been too!",
      "rate": 1.0,
      "tripDate": " December 2012"
    }
  ]
}