{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Humber College Residence",
    "url": "/Hotel_Review-g155019-d3540744-Reviews-Humber_College_Residence-Toronto_Ontario.html",
    "priceRange": "$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "2.5",
      "reviewCount": 17
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "203 Humber College Blvd",
      "addressLocality": "Toronto",
      "postalCode": "M9W 6V3",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/03/50/c2/6b/humber-college-residence.jpg?w=500&h=-1&s=1"
  },
  "description": "Humber Conference Services offers a welcoming housing environment for groups of all sizes in the summer months. We have two convenient Toronto locations to choose from, one near the Toronto Pearson Airport and the other located in south Etobicoke, near Lake Ontario. Humber College is proud to offer hotel style accommodations from early May through mid-August. With over 1,020 beds in our Residence (max 1,334 guests) we are pleased to offer a choice in affordable accommodations. Choose from traditional dormitory rooms (North Campus only, newly renovated in summer 2009) or try our impressive suite-style units. A perfect setting for youth, corporate or sports groups looking to explore Toronto!",
  "featues": [
    "Free parking",
    "Free High Speed Internet (WiFi)",
    "Fitness Center with Gym / Workout Room",
    "Bar / lounge",
    "Children Activities (Kid / Family Friendly)",
    "Meeting rooms",
    "Non-smoking hotel",
    "Shared lounge / TV area",
    "Paid private parking on-site",
    "Parking",
    "Wifi",
    "Restaurant",
    "Vending machine",
    "ATM on site",
    "24-hour front desk",
    "Laundry service",
    "Air conditioning",
    "Kitchenette",
    "Complimentary toiletries",
    "Suites",
    "Family rooms"
  ],
  "reviews": [
    {
      "title": "Student dorms, a cheap alternative",
      "text": "I stayed with my husband and 3 kids.  We were looking for an affordable alternative to a hotel while visiting family in our home town.  We stayed in a 2-bedroom suite at Humber College's North campus.  We got more square footage than a hotel room plus a kitchenette (fridge, sink, microwave, table), allowing us to save on breakfasts.  The decor is glum - polished concrete floors and walls, dim ceiling light fixtures.  The North Toronto location is close to the airport and you will hear the planes if you keep your windows open.  The double beds are hard.  The three piece washroom is equipped with a small stand up shower.  Linens and towels are included.  Kitchenette doesn't have cutlery, plates, glasses.  There was daily light housekeeping and Internet if you come prepared with an Ethernet cable.  An affordable alternative for travellers during the summer months but you need to pack a few more items...dishes than a regular hotel.",
      "rate": 3.0,
      "tripDate": " August 2015"
    },
    {
      "title": "It's a Residence ... ",
      "text": "We have stayed here with our daughters synchro club on multiple occasions.  Its affordable, you can cook (no stove) meals, there's lots of room for the girls to run around (the gardens are beautiful) but, it's a College Residence - the beds are not really comfortable - the facilities minimal - if you're looking for luxury this is not your place.  However, if you're looking for affordability and reasonably convenient location then you should consider Humber Residence.",
      "rate": 3.0,
      "tripDate": " May 2017"
    },
    {
      "title": "Brutal",
      "text": "While it’s true that the price can’t be beat for a place with a locking door in the GTA, you may find that some of the other characteristics may have you pining for the luxuries of Motel 6. Consider that the gas alone will cost you an extra ten spot just to find it and there’s nothing you can’t get to without wheels. And I’m sure that Humber has the best of intentions but six hallways to get to room that measures 6’ x 10’ and has no wifi? The washroom is three hallways away. Enough said; spend the extra $20 or $30 and stay at the M6.",
      "rate": 1.0,
      "tripDate": " August 2016"
    },
    {
      "title": "Feel bad for the students who live here",
      "text": "See my tips for survival at the end of the review.The good:-\tIt’s on campus, right next to the Arboretum.-\tIt’s near the airport if you’re taking a taxi.-\tThe front desk staff were helpful and friendly.-\tThe room looked clean (but smelled mouldy).-\tInside the bathroom was clean.-\tThey provide towels and toiletries.The bad:-\tDuring the summer semester (May to Sept), the only food available on campus on the weekends is the Tim Horton’s at the far end of the E Building. Even the Starbuck’s is closed on the weekend in the summer. The cafeteria in the residence is also closed for the summer.-\tOutside of the room and bathroom, everything was filthy. There was crusty dried up stuff on the carpet right at the threshold to my room. It looked like dried cat vomit (…maybe student vomit?).-\tThe rooms with shared washrooms may not be on the same floor as the washroom for your gender. I was given a room near a men’s washroom, and the nearest women’s washroom was up a flight of filthy, cold stairs with full windows exposed to the outside world. When walking to and from the washroom in the night, everyone outside could see me in my jammies.-\tThey said there was a unisex washroom further down the hall, and a women’s washroom even further down the hall if I wanted to use a washroom on my own floor. The unisex washroom required a key card, and I was unable to access it. The women’s washroom “down the hall” was 2 buildings away down the hall, and had yellow hazard tape across the door.-\tThe door that you have to go through to get up and down the stairs to the washroom was filthy. The floor at the threshold had a thick blob of oily/sticky residue on the floor, with flakes of oatmeal stuck in it. The door itself had the oily/sticky goo actively running down it. There was no place to wash my hands after I had to touch that door to get back to my room.-\tThere is only 1 door into and out of the building, which is linear. It is a long walk (usually away from where I wanted to go) to get to and from the front door. Through a window I could see nice benches next to the forest behind the building, but none of the doors on that side of the building are active except in emergencies.Tips for survival: -\tStay at a hostel downtown and take the bus to campus if you need to be there-\tThere’s a Mac’s Milk (similar to 7-11 or Couche Tard) that’s open 24 hours on the northeast corner of Hwy 27 and Humber College Blvd. It’s in the strip mall with the Beauty Supply Warehouse on the corner. This is the only place around to get an early morning coffee on the weekend.-\tTake the HWY 27 Express bus (#191) toward Kipling station and get out after 2 stops at Queen’s Plate. The Woodbine Centre mall is here. There is a food court, a Hudson’s Bay, and a Dollarama.-\tIf you forgot shower slippers (which are absolutely mandatory, even just for the walk to the bathroom), you can buy flip flops for less than $5 at the Dollarama at Woodbine Centre.-\tThere is a Fortino’s grocery store with a deli hot counter, and a Mandarin restaurant at Queen’s Plate across the street from the Woodbine Centre-\tIf you take the 191 Express bus north toward Steeles, you can get out at Hwy 27 and Finch. There are a few sandwich shops and restaurants there. It is also close enough to walk here if you like.-\tSpend some time in the Arboretum, which is right next door to the residence. There are snapping turtles, painted turtles, otters, coyote, deer, hawks, owls, and other critters to be seen.",
      "rate": 1.0,
      "tripDate": " May 2017"
    },
    {
      "title": "Lake shore Campus $50 a night only because of location gross",
      "text": "First off don't mistake this from the other campus. This is a review of the Lakeshore Residence. Everything from, parking to the pillow.  No direction of where to park or enter. The front counter was like a college dorm Dom. Lots of young foreign students. Smells from about 30 unshowerd people. Ugg. The staff was slow and couldn't explain the parking. Parking is at the back of the building so take your belongings with you. The room, oh where to begin, concrete floor, concrete walls. Not even paint. Dirty, pieces of tape and sticky stuff I hope from students hanging things on the wall. The floors in common area and washroom, concrete and gross looking. Stained and particles on the floor. Dirty light switches, dirty and gross chairs. the pillows are flat and non existent.  1 pillow actually was filled with balls of foam, terrible. Plus side the bed sheets looked clean. But the bed was so flat and old I would have traded for dirty sheets and a comfy bed. We stayed at Seneca college the week before and were impressed with the staff, rooms , and amenities. Humber should be ashamed of themselves. This is a $50 a night property and only because of location.",
      "rate": 1.0,
      "tripDate": " July 2017"
    },
    {
      "title": "A prison cell is more comfortable ",
      "text": "The rooms literally look like prison cells. You get a single mattress with one pillow and thin blanket, and the mattress is hard, uncomfortable, and noisy. The check-in time is 4pm and check-out time is 10am. Upon check-in, we asked the staff if we could get a noon checkout. They (students) told us to wake up at 9am and come to the front desk (because there are no phones in the rooms) and ask the morning staff if it's possible to get a late checkout. There are no bathrooms in the rooms - there's a dirty communal bathroom for the entire floor at the end of the hall. You also cannot adjust the temperature in the room. In July it was extremely hot, and there was no way to cool down the room. The window would only open a slight crack. They list free wifi under \"amenities\", except there is no wifi. There's free wired internet, but you have to bring your own Ethernet cable, or purchase one from the front desk. If you have any device other than a laptop, you will not be able to get internet. Also, the parking isn't free, it's pay parking. This is a student residence. Stay far away from it!",
      "rate": 1.0,
      "tripDate": " July 2017"
    },
    {
      "title": "Alleged Human Rights Violations and Disrespect Highlighted in Humber College Residence Experience",
      "text": "In a shocking account, a black woman identified with a disability at Humber College has come forward to share her distressing experience living in the college's residence, alleging major disrespect, emotional turmoil, and a violation of her human rights.",
      "rate": 1.0,
      "tripDate": " August 2023"
    },
    {
      "title": "A Bureaucracy",
      "text": "I lived here throughout my undergrad and worked here during 2nd year, it was awful. The back office can really care less about the well-being of students and the student workers. Nora and Phil, the managers, only care about their partnership with Chartwells and their own reputation, the most useless bosses of all time. One time I feel down the staircase due to the staircase being painted. No signs were up to notify students of the paint work. I submitted an incident report and ran to complete my midterm. After my midterm, I spoke with front desk again because they wanted to see how I was doing, Nora came out and pretty much told me it was my fault for going down the staircase. She didn't ask me if I was okay or if I needed anything, rude.",
      "rate": 1.0,
      "tripDate": " December 2019"
    },
    {
      "title": "Great price no frills ",
      "text": "The price was really good especially if you think you get two rooms and a shower and an eating area with a normal fridge. There is pay parking on the street but they also have a parking lot. After 6 the parking on the street is free till 9 the next morning. No tv in the room. It’s has air conditioning and the beds are firm and comfortable. Room was made the next day. Free wifi. Will stay again",
      "rate": 5.0,
      "tripDate": " July 2019"
    },
    {
      "title": "Great place!",
      "text": "The staff was amazing.  Everyone was very helpful and friendly.  The staff at the front desk was very helpful with tips on things and places in the area. The security was very friendly and helpful as well. The rooms were clean and comfortable. I would recommend touring around the college and the bay behind the college.",
      "rate": 5.0,
      "tripDate": " July 2018"
    },
    {
      "title": "Clean, friendly and a great stay!!",
      "text": "rooms were very clean and a cleaner came in every day to change towels, make the bed etc kitchen was nice small and compact just no cutlery or plates id recommend to bring your own. bed and pillows in the bedrooms were very comfy and great air conditioning. Bathroom was spotless and the shower were very powerful. The campus was always open and there was a Tim hortons and a convinience store inside open all the time. Swimming pool, gym, washing facilities, kitchens all on site! People at reception were very friendly and always helpful! Great stay if your with a big group/family/friends and want cheap, good accomadation 30mins from Toronto centre! Highly recommended!",
      "rate": 5.0,
      "tripDate": " August 2016"
    }
  ]
}