{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Hyatt Regency Toronto",
    "url": "/Hotel_Review-g155019-d181946-Reviews-Hyatt_Regency_Toronto-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.0",
      "reviewCount": 4763
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "370 King Street West",
      "addressLocality": "Toronto",
      "postalCode": "M5V 1J9",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/19/8c/25/e1/king-bed-with-city-view.jpg?w=500&h=400&s=1"
  },
  "description": "Stay connected and productive when you travel to our downtown Toronto hotel. Our sophisticated accommodations were created specifically with the modern traveller in mind. Discover spectacular views of downtown or the CN Tower and enjoy wonderful amenities in our contemporary guestrooms and suites. All of our rooms feature our pillow-top Hyatt Grand Beds®, ergonomic workstations with complimentary Wi-Fi, 47\" LED TV with Staycast Technology. Enjoy breakfast, lunch or dinner in King Street Social Kitchen or relax in Mix Bistro Bar where you can enjoy refreshments and a light meal. Our onsite amenities also include a seasonal rooftop pool, and 24-hour Stayfit gym.",
  "featues": [
    "Paid public parking on-site",
    "Free internet",
    "Rooftop pool",
    "Bar / lounge",
    "Highchairs available",
    "Pets Allowed ( Dog / Pet Friendly )",
    "Taxi service",
    "Conference facilities",
    "Parking garage",
    "Wifi",
    "Restaurant",
    "Breakfast available",
    "Breakfast buffet",
    "Breakfast in the room",
    "Snack bar",
    "Banquet room",
    "Meeting rooms",
    "Spa",
    "Rooftop terrace",
    "24-hour security",
    "Baggage storage",
    "Concierge",
    "Currency exchange",
    "Gift shop",
    "Newspaper",
    "Non-smoking hotel",
    "ATM on site",
    "Doorperson",
    "First aid kit",
    "Umbrella",
    "24-hour check-in",
    "24-hour front desk",
    "Express check-in / check-out",
    "Dry cleaning",
    "Laundry service",
    "Shoeshine",
    "Blackout curtains",
    "Air conditioning",
    "Desk",
    "Housekeeping",
    "Interconnected rooms available",
    "Coffee / tea maker",
    "Flatscreen TV",
    "Walk-in shower",
    "Room service",
    "Safe",
    "Telephone",
    "Wardrobe / closet",
    "Bottled water",
    "Iron",
    "Laptop safe",
    "Private bathrooms",
    "Wake-up service / alarm clock",
    "Refrigerator",
    "Radio",
    "Bath / shower",
    "Complimentary toiletries",
    "Hair dryer",
    "City view",
    "Non-smoking rooms",
    "Suites"
  ],
  "reviews": [
    {
      "title": "The best customer service we've probably ever had!",
      "text": "My (now) husband and I stayed at the Hyatt Regency for our wedding weekend. It was recommended by the venue. We didn't know what to expect, but it was convenient and close, so we booked it. We could not have been more blown away by the incredible staff. They were friendly, responsive, and went above and beyond to make sure we had what we needed, big or small. We switched rooms after the wedding, and managed to lose our marriage licence in the shuffle (oops). Rob literally helped us dig through the garbage trying to find it - all with a smile and working to minimize our stress. We managed to find it and are incredibly grateful to Rob. The check-in process was also friendly and easy - Ray checked us in and remembered us both the rest of the week. Everyone here is super kind and helpful, and genuinely wants their guests to feel as though they're taken care of and having a good time. The hotel was clean, and we were pleasantly surprised by how big and comfortable our room was. We highly recommend the Hyatt Regency!",
      "rate": 5.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Location can't be beat - great service",
      "text": "i stumbled over the Hyatt in Toronto by accident due to a very bad airbnb experience. This was a repeat visit. I find the staff fantastic, dinner in the downstairs restaurant King Street Social was excellent (prix fix 3-course dinner for CDN$48). The rooms are comfortable and quiet. Better yet is the location on King Street - walking distance to everywhere - great choice of restaurants, cafes, organic food market (Spadina/King street), PATH, Union Station, cinemas and theatres. Fitness centre clean with a decent array of equipment that works. It can be great value depending on occupancy level. For instance this trip was first week of January and room rate was ~CDN$200 per night. In November it was ~CDN$350 per night.",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Decent downtown hotel",
      "text": "My wife and I stayed here last weekend. It’s a decent hotel right in the heart of downtown that makes it very easy to walk numerous places. If you are not able or cannot walk that much there is parking beneath the hotel that does include in and out privileges or there are taxis outside the front entrance most times. There is a seasonal pool that is closed during the winter along with a sauna in addition to the normal fitness area.There is a restaurant and a bar in the hotel. They are a little bit expensive compared to the numerous places around but they are not too bad and it would be possible to go there for a night in without breaking the bank.",
      "rate": 4.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Good but could be ALOT better",
      "text": "I booked over the phone and in reserving I had a suite for a lower price, but when I checked in they said they double booked and the only suite they had available was priced more. I could have said no, but am physically handicap and need more space for my things and I also stream an online podcast and needed the space so it was hard to go smaller. But felt like if it wasnt my mistake then why do I have to pay more for their mistake. But what bothered me the most was the oily hand prints I seen on the nice couch. I always bring lysol wipes in my car so I had to wipe it down cause I felt a bit unsafe with the pandemic and all.",
      "rate": 3.0,
      "tripDate": " September 2021"
    },
    {
      "title": "Good Downtown Hotel ",
      "text": "We spent a night here when we came to Toronto for a theatre event.  The Hyatt is conveniently located in the Theatre District and easy walking distance to the Princess of Wales and Royal Alex theatres along King Street.  Parking is underground and pricey at 32 bucks but once parked everything is close.  Our room was on the 14th floor with minimal view, whatever view there may have been blocked out by ever multiplying high rise condos.  The room was comfortable, more than adequate for an ‘overnighted’.  Very comfortable king bed and very quiet location, slept great!  The room design was ok but I didn’t like the bathroom pocket door, too easy to pinch your finger in the framework like I did :(.  Complementary coffee (Starbucks) is nice but more powder creamer please!We didn’t eat in any of the hotel restaurants other than coffee in Starbucks so can’t comment on thoseChecking in and out was seamless, all staff very courteous and friendly.  I would recommend this hotel for one or two night stay.",
      "rate": 4.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Okay, but don’t expect “Hyatt” quality",
      "text": "This hotel surprised me because, for the Hyatt brand, it felt outdated and a little sketchy.  The room ( 1 king bed) was a typical room but the decor was dated (90s?).     Although it was a non-smoking room, it did smell as if someone had smoked in there during a previous visit and that they were trying to hide the smell with cleaner (I have bad smoke allergies, so I am hyper sensitive to smells).The bathroom was teeny; when you sat on the toilet you had to lean to one side to avoid hitting the sink cabinet with your shoulders.  They tried to put a “peekaboo” window on the wall opposite the toilet, into the room (maybe in an attempt to update the washroom?), which meant there was not enough space to conveniently hang two towels.  They made up for it by putting a second towel hook under the shower curtain.The shower curtain itself was dirty, and I was not convinced the towels were that clean.  The facecloths had some brown marks that almost looked like someone cleaned their ears with them.  The larger towels were not bleached white, as would be expected at a hotel.There was also a power outage the second day we were there - which meant the smoke alarm started beeping (waking us up).  And then two announcements to tell us that the hotel was experiencing a power outage over the PA system, definitely got us up earlier than we were planning.Considering it was COVID, the staff were very friendly and accommodating.  And I loved that they gave us a comprehensive list of nearby restaurants since their food services were closed.",
      "rate": 3.0,
      "tripDate": " August 2021"
    },
    {
      "title": "Comfortable Hotel, Friendly Staff; Great Location",
      "text": "We came to see two Blue Jays games and this hotel is in a great location, just a few blocks from the ballpark and within walking distance of the Hockey Hall of Fame, restaurants, ice cream, and pharmacies. As most Hyatts are, this hotel is clean and well maintained, and the staff is friendly and helpful. The breakfast buffet in the hotel restaurant, while a bit pricey, offers a wide variety of tasty food. The only hiccup we encountered was that we initially could not get the safe to work in our room, and it took two phone calls to the front desk to get someone upstairs to look at it. Otherwise, the room was comfortable and included complimentary bottled water which was replaced each day. The fitness room, while small, was also clean and well-maintained.",
      "rate": 4.0,
      "tripDate": " July 2022"
    },
    {
      "title": "One Night Stay",
      "text": "Decided to stay at this hotel for the location and view for a birthday evening. Very quiet and welcoming with clean rooms. Met expectations! Personal preference for showers at hotels is glass walk in's, as the room I received had a standard curtain/tub shower so hopefully in the future they renovate that!",
      "rate": 5.0,
      "tripDate": " October 2020"
    },
    {
      "title": "Excellent Location in the Heart of Downtown Toronto",
      "text": "The Hyatt Regency Hotel Toronto enjoys an excellent location in the heart the downtown core coupled with exemplified superior servicing.  Overall, an enjoyable stay in a well appointed room with outstanding sleep quality accompanied by a staff that knows your name and who are willing to go above and beyond the call of duty.As a side note, there is no question that this establishment ensures the highest cleaning and hygiene standards and proactive care in these COVID-19 times. Decidedly worthy of a return engagement...",
      "rate": 4.0,
      "tripDate": " October 2020"
    },
    {
      "title": "I’d give you a Zero but since I can’t, you get a 1",
      "text": "In summary, the view is terrible; the bathroom smelt horrible, one of the waters provided were half drunken and we were racially profiled by security. Now seeing other reviews I realized racism is not new to this hotel and is a trend amongst their staff. I wish I had seen it before because I would have never booked here. The long story, My friends and I stayed here for one night. We arrived back into the hotel after a night out (around 2:30am-2:45am) and saw both hotel security guards standing by the elevators on the ground floor; they stared at us without saying anything and I could sense they’d find an issue with us. As we entered our room and the two women friends we came with wanted to change their clothing before we went to get food. The same security guards knocked on the door, we were there for all of 5 minutes and claimed to have gotten “multiple” noise complaints, stating he has “100 other things to take care of [in the hotel]”. Which followed by a threat to kick everyone out. We calmly apologized and explained that 3 people are registered on the room, and our 3 additional friends were leaving with us to get food then return til they sobered up, but wouldn’t be staying the night. The security guard didn’t care and insisted we’d have to register them with the front desk. This hotel doesn’t care about people getting home safely or drinking responsibly. If you want to pay $300+ for one night to get racially profiled and harassed by a man on steroids on a power trip this is the spot for you. I’d like to note that Kelsey at the front in the evening when I was checking in was absolutely lovely. In the morning the manager asked what happened and said he’d talk to them. However, this isn’t a first occurrence, especially with visible minorities. That being said, trust the reviews, wish I read them sooner.",
      "rate": 1.0,
      "tripDate": " March 2022"
    },
    {
      "title": "Renovation is required and amenities are misleading !",
      "text": "We arrived at 8pm after a long road trip, fou d a room that was absolutely not ready.  A very helpful reception employee changed the room immediately for us.  The room we received was okayish bit needs clearly some renovation.  Yet, we had to add an extra bed  for our little one bit the room was definitely a bit too small for that.  i then wanted to organise a laundry service on Saturday early PM and was told it was impossible before Monday close of business, while a paper in the room states the service is 7 days a week / same day service id your items are dropped early in the morning, what a rip off !",
      "rate": 3.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Above average, but nothing special",
      "text": "The first room we got had a leaky air conditioner and broken main door, so Allen at the front desk upgraded us to a room on a higher floor. The hotel itself definitely feels dated but clean, and noise isolation was relatively good. Location can't be beat as a tourist, with a 15 minute walk from CN Tower, Union Station, and Chinatown. While the rooms were standard, cleaning was always thorough. Overall, the service and location made the Hyatt worth staying at.",
      "rate": 4.0,
      "tripDate": " August 2021"
    },
    {
      "title": "Birthday gathering",
      "text": "The Deluxe Suite is excellent, roomy and beautifully designed. It had everything we needed. For a little bit more $ it was well worth the experience. The location is right in the heart of everything you need and easy walking distance to anything you need on King St. I highly recommend booking directly with the hotel (rather than Hotels.com as their service is great and the prices are better.",
      "rate": 5.0,
      "tripDate": " November 2021"
    },
    {
      "title": "Awesome",
      "text": "I loved it was very clean and the view was nice. The room was comfortable and very home like, mini kitchen was awesome if you decide to buy groceries and cook inside the room. The fan works very well specially if you put the heat on",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "great stay",
      "text": "Staying for 3 nights, room cleaned every day, beds are comfortable, the room for two double size beds was a bit small. Service was great, needed to change the coffee maker, it was done very quickly. Parking is inside underground 32$ as expected, the entrance though is tight for large cars, many places to park. Gym is good. The price was competitive for the area. I would definitely recommend.",
      "rate": 5.0,
      "tripDate": " March 2023"
    },
    {
      "title": "Hyatt Regency toronto",
      "text": "Exceptional service from beginning to. It's a large hotel but we were treated almost like family. When I mentioned that we were celebrating our anniversary the team truly went above and beyond to make our stay extra special. The breakfast buffet - while not inexpensive - is very well stocked with fresh hand-made foods. Definitely worth a try. Highly recommended!",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Great stay",
      "text": "I honestly do not have any negative comments to say or feedback as I found I have a good overall stay. I do  want to mention that parking was overpriced at $30/24 hours but I understand that this comparable to being in Toronto.  The room was clean, the staff were friendly. I also really liked  the texting feature where I could communicate with the check-in counter.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Okay hotel but there are better choices.",
      "text": "Our family stayed in a deluxe suite for 3 nights. It’s the perfect location if you are taking in one of the many theatres in Toronto.  The check-in was smooth and the front desk very courteous. The outdoor swimming pool was beautifully heated.  Parking was a bit difficult to find. We found however there were just too many issues with the room itself. The air conditioning was very very weak. Maintenance tried their best to fix it but wasn’t very successful. The internet was virtually non-existent  in the room and the room itself was very dimly lit. The toilet needs to be fixed as it continually runs at times. A simple hitting the handle again usually resolves the issue but it’s just another issue that needs to be addressed. The TV in both the bedroom and the main room is also very dimly lit...most likely has been set that way to save energy and money but quite difficult to watch TV when it’s that dark. The bathroom is also quite tiny. The door inside barely can close.  Is the hotel a good value for your money? Not really. We probably would not stay there again. The downtown Hilton and the Radisson Blu Harborfront are better 4 star hotels.",
      "rate": 3.0,
      "tripDate": " September 2021"
    },
    {
      "title": "Great hotel with a fantastic staff!",
      "text": "This gem of a hotel is located right in the heart of the entertainment district with easy access to the theaters and restaurants and nightlife. The staff is second to none! The manager  Amrit personally thanked us for our stay. The entire staff made us feel at home and like we were the most important people staying there. I highly recommend this hotel!",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Special occasion trip",
      "text": "Attentive service that met my needs. Friendly staff. Clean rooms. Close to all attractions. Room service was rapid and the person who delivered the cot which we needed for 4 adults stayed to assist us with other needs.",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Great location",
      "text": "I read some negative views about this hotel, but have to say my experience exceeded my expectations. The hotel is centrally located, less than a 15 minute walk from Union, Kensington Market and the Eaton Centre. And surrounded by restaurants, cafes and shops. Check in was easy (although the hotel was busy!) the front desk clerk took the time to answer all of my questions, and even managed to get me a room with a view upon request. The room was a good size, I saw many complaints about them being small but having stayed in many Toronto hotels, these rooms were among average in size. The bed was lavish and comfortable. The hotel did not have many offerings for food and drinks, but why would you want to stay in when you could explore what Toronto has to offer? The staff here were amazing, you could text a number for extra resources (water bottles, towels etc) and they would be delivered to your door within minutes! Parking was $32 a night, comparable to other lots and they let you stay until 4PM on checkout day.",
      "rate": 5.0,
      "tripDate": " October 2021"
    },
    {
      "title": "Great staff but room could have been a little cleaner.",
      "text": "The front desk staff was extremely helpful and brought me cutlery when I asked. They answered some questions I had and were very pleasant to deal with. My only gripe is the hotel had a couple of stains here and there that were easily cleaned but made me a little nervous because of COVID.",
      "rate": 4.0,
      "tripDate": " January 2021"
    },
    {
      "title": "Happy and satisfied stay at the Hyatt.",
      "text": "Very happy with our stay at the Hyatt. As it was my husband and I’s first time travelling to Toronto, we wanted a nice place to stay downtown so everything would be walking distance. The Hyatt was the perfect place for us, all the front desk staff and concierge were so helpful in answering our questions. House keeping also did a great job on freshening up our room daily and stocking everything we needed. The view from our room was to die for, it was beautiful day and night. The room could use some work on the carpets and toilet. Overall we had an amazing stay and we would definitely recommend the Hyatt.",
      "rate": 4.0,
      "tripDate": " November 2021"
    },
    {
      "title": "So bad",
      "text": "Staying here as I type this. Absolute disaster checking in. The guy doing it asked about 15 questions but talked so low I really struggled to hear him. We popped out to get some drinks and when we came back out cards wouldn't work on the door. Pop downstairs to get new ones, went back up and still didn't work. Tried again, still didn't work. Sent us with a security guy who had the key even though I said it was probably the battery in the lock. Security guy didn't open it. Currently sitting in my room as an engineer tries to change the battery with me and my partner awkwardly sitting in the room. This places sucks so hard its amazing. My workplace use it a bunch for out of town traveller's, will be suggesting they remove it from the list.",
      "rate": 1.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Hyatt Regency Toronto",
      "text": "Stay was excellent and rooms and halls were all nice and quiet. very peaceful to be in, staff was amazingly friendly and helpful with all needs. I would recommend to anyone traveling to Toronto as the hotel is in prime location to reach anywhere downtown either walking, transit or car, a commute of 15-35 mins.",
      "rate": 5.0,
      "tripDate": " December 2020"
    },
    {
      "title": "Other than the price, the stay was basically perfect... well during covid times.",
      "text": "Service was great for the time we spent thereCleanliness was above average I guess when dealing with hotels/motelsValue was undecided as I haven't stayed at any other hotel in DT Toronto, so take that as you will.Location was good, but that's because it was the only one close to the event location... so take that with a grain of salt. LOLSleep quality was as expects as if I was staying at home.Over all a good stay, but man, that price. How much I paid for a Jacuzzi room in Niagara Falls with parking.",
      "rate": 5.0,
      "tripDate": " May 2021"
    },
    {
      "title": "Nice hotel, great location.",
      "text": "We stayed here for two nights at the beginning of March. The hotel is located right downtown, so it’s convenient to most amenities, very close to the Rogers Centre. Underground parking is good and they do have spots for larger vehicles which was a great benefit for us. The room was extremely large with a separate bedroom which was good to stay up and watch TV without bothering anyone. The one thing I found odd, it had a fridge, coffee maker, sink… but no microwave. While we were there the restaurant was being renovated but they did offer breakfast, which was good and expensive like everything else in Toronto. The staff throughout were very friendly and made sure we were well taken care of.  I’d definitely stay here again if need be.",
      "rate": 4.0,
      "tripDate": " March 2022"
    },
    {
      "title": "Spend your budget somewhere else",
      "text": "Not many Hyatt hotels at a major city center get AAA/CAA diamond ratings below four like this one, after celebrating the New Year's Eve here I understood why.The Good:Service is satisfactory, at least after you reminding them. There was no option to choose the view/direction when booking the room on Hyatt website, so I added a message to ask for a high floor room facing the CN Tower so I can watch fireworks on my bed. I did get one facing CN Tower at 12th floor (they have 20 stories though), but that was after I asking for it again when checking in - they assigned me another room before that. The view was not bad, perfect view of the CN Tower, some obstacles to view the fireworks though, 20th floor would probably be much better.The Not So Good:As a Hyatt hotel, room is small and needs renovation, even considering its location. I lived at the Sheraton at walking distance, and Westin by the lakeside, their rooms were bigger and newer.Parking is overcharged. They share the lot with public parking and charge $32 for self-parking (no valet), while public parking at exactly the same place is $24 for 24 hours on my night (Friday night and New Year's Eve, hard to imagine any other night would be more expensive, if not cheaper), so they literally overcharge guests at least 33% for nothing.The Bad:Soundproofing is as terrible as, if not more terrible than, most motels. I'm all fine hearing people on the street yelling \"Happy New Year\" at 12am (my room's on 12th floor though), but hearing guests in other rooms talking and singing at 2am is not a very pleasant experience.Room cleanness is far below Hyatt standard. The space behind beds are visibly dirty, my kids are allergic to dust mite so we were concerned. All of us had itchy throat or coughing in the room, I even had runny nose by midnight, we almost suspected we caught COVID, but after taking Claritin we were all fine within a couple of hours. Btw I rarely have allergies, so the air conditioning system needs a deep clean too.In short, before they make a major renovation, you'd better spend the same budget at another major brand hotel in downtown Toronto.",
      "rate": 2.0,
      "tripDate": " December 2021"
    },
    {
      "title": "Hyatt regency toronto - personal getaway",
      "text": "Great value we had a large deluxe king suite with a beautiful CN tower view. Very spacious, comfortable beds to sleep in (one king and one large pull out couch) there were two TVs which we didn’t expect, with screen casting functions- one in the “living room” and one in the bedroom. Lots of space to have our meals in the living room area and a large bar fridge, mini sink and countertop, hot water kettle. The service was very responsive and excellent, kind staff, friendly. We felt safe given the pandemic the room was very clean and we had everything we needed delivered to the door promptly with masks.",
      "rate": 5.0,
      "tripDate": " December 2021"
    },
    {
      "title": "Good location everything else is okie doke! Read review for where to go for special occasions",
      "text": "We go to Toronto every couple months at least.  We started going years ago for our wedding anniversary.  We have stayed at a number of hotels near the entertainment district and this was our first time at the Hyatt.  1st I will say this is the first hotel who did nothing for our anniversary.  Like I said we've been going for years.  One hotel has sent up a bottle of champagne, one sent up a desert with happy anniversary written in chocolate, one has sent up a card with a fruit tray, one gave us free deserts in the restaurant, and so on.  We were told happy anniversary when we checked in so I guess that's something.Pros:  The location is amazing, Kings Street has a number of cute restaurants (our favorite was hey lucy's).  It's super close to Roger's center, Scotiabank, Ripleys, CN Tower, etc.  The bed is really comfortable and they have great space to put away clothes.Con's - The show is your basic tub with a curtain.  The tub is very slippery.  The lay out is a little strange getting to our rooms, we were back in a corner area that we had to go through many doorways to get to.  To get to our room we almost always had to wait in line to get to the elevator taking us upstairs.  Parking is a complete rip off.  The place you park is a private garage that charges $10.72 for a full day of parking but if you're staying at the hotel you have to get a parking pass were the hotel charges you $32 a day for parking.  The elevator area coming up from the parking garage smells like a dirty diaper but it does seem like a secure place for the car.  Room service was very quick but the food was so greasy that I couldn't eat more than 2 bites.  They do have black out curtains but they do not pass the window so expect a lot of light in the mornings.Overall I would stay here again because of the location and comfortable bed but if you're celebrating a birthday, anniversary, etc.. the Hilton is the best and Marriott branches near here aren't too far behind.",
      "rate": 3.0,
      "tripDate": " August 2022"
    }
  ]
}