{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "HydeWest - Iceboat Terrace Furnished Townhome",
    "url": "/Hotel_Review-g155019-d11668175-Reviews-HydeWest_Iceboat_Terrace_Furnished_Townhome-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.5",
      "reviewCount": 11
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "15 Iceboat Terr",
      "addressLocality": "Toronto",
      "postalCode": "M5V 4A5",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/1b/e8/bb/95/hydewest-iceboat-terrace.jpg?w=500&h=400&s=1"
  },
  "description": null,
  "featues": [
    "Paid private parking on-site",
    "Parking garage",
    "Free High Speed Internet (WiFi)",
    "Children Activities (Kid / Family Friendly)",
    "Airport transportation",
    "Private check-in / check-out",
    "Clothes dryer",
    "Self-serve laundry",
    "Wifi",
    "Car hire",
    "Taxi service",
    "Washing machine",
    "Blackout curtains",
    "Soundproof rooms",
    "Air conditioning",
    "Additional bathroom",
    "Coffee / tea maker",
    "Cable / satellite TV",
    "Extra long beds",
    "Walk-in shower",
    "Desk",
    "Dining area",
    "Housekeeping",
    "Private balcony",
    "Seating area",
    "Separate dining area",
    "Separate living room",
    "Sofa",
    "Telephone",
    "Wardrobe / closet",
    "Iron",
    "Private bathrooms",
    "Tile / marble floor",
    "Wake-up service / alarm clock",
    "Dishwasher",
    "Microwave",
    "Oven",
    "Refrigerator",
    "Stovetop",
    "Electric kettle",
    "Kitchenware",
    "Flatscreen TV",
    "iPod docking station",
    "Bath / shower",
    "Complimentary toiletries",
    "Hair dryer",
    "City view",
    "Landmark view",
    "Non-smoking rooms",
    "Suites"
  ],
  "reviews": [
    {
      "title": "FINALLY GOT MY VISA AND LANDED IN CANADA, FIRST STOP HYDEWEST",
      "text": "Guys i am so excited to write to you about my first time experience in canada, i have always been longing to visit canada but the embassy kept on denying me a visa till i met a consultant who helped me get a visa. when i landed, i visited hydewest hotel and i enjoyed its beautiful looks from the outdoor pool, club and many other exploitable areas. If you wanna come to canada contact whatsapp +19292696456",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Do NOT ruin your visit to Beautiful Toronto!",
      "text": "Great location near CN Tower and Rogers Stadium, etc. Great lake-view from 29th Floor.Although we reserved a 3-bedroom townhouse for family of  seven for a 2-night stay, two months in advance, confirmed by three phone-call messages that same week without response, arrived three hours early for a 4:00 pm check-in; the Booking.com Partner, Ankit Aggarwal, first said the keys were mixed up, then that he thought we canceled, and then informed us that he gave our apt. to a couple who arrived earlier. Offered us other accommodations in the adjoining Condo building and said we could wait in the temporary parking area (or our cars would be towed) while he would rush the cleaning staff. We waited over 2 hours and then he brought us to a 2-bedroom apartment and when we shared our dissatisfaction, he brought us a mattress for the living room floor. He told us he was only 15 minutes away, but we never saw him again. We should have left, but it was World Cup & Jays vs Yankee weekend. Rooms were sold out in downtown TO. The one and only TV didn’t work and one of our guests exchanged several texts with Ankit over a 3-hr. period with no solution. He had us leave the keys with the building security on Sunday because he was not on the premises.Just know that we should have left after parking our cars and bringing our luggage to this apartment because we would have been reimbursed any charges with our charge card company had we left and not stayed. Good to know! Ankit told our charge card representative that we left smiling, which would be hard to see when he was not present.He gave us 2-bdrm, floor mattress & pullout sofa for seven people. Probably against occupancy codes. No TV connection, UNresolved service and booking, soiled rugs, greasy oven, kitchen stocked with one ceramic mug and a mishmash of dishes, no dressers in the bedrooms, no ceiling fixture over the dining table. Was this someone's apartment while they were out of town or an apartment for sale? Don’t ruin a vacation!",
      "rate": 1.0,
      "tripDate": " September 2016"
    },
    {
      "title": "Great Location in Toronto ",
      "text": "Great location to get to local attractions. Walking distance to most places. Very nice huge unit with great patio. Directly across from a small park and very near a few good restaurants.   Anki was great on check in giving us some tips. We took the option to park the car and that was very convenient. Condo had plenty of space for our family of six.   There is a pool at the complex but it is inside and it’s a lap pool. Plenty to do in Toronto so we didn’t miss it. Will back again.",
      "rate": 5.0,
      "tripDate": " June 2018"
    },
    {
      "title": "Beautiful condo",
      "text": "Host was always quick to respond and even set up an early check-in for us after we had a long night of traveling. Location is perfect and the apartment and views are outstanding. Very comfortably slept 9 people and we would happily stay here again when we come back!",
      "rate": 5.0,
      "tripDate": " July 2018"
    },
    {
      "title": "Terrible place! Worse owners!!!! Crooks!",
      "text": "Do not stay with these crooks. Promises not kept. Over charges to credit card. Watch for hidden and not well communicated charges.Location is south west toronto- difficult to walk to downtown. Would not book this location again",
      "rate": 1.0,
      "tripDate": " March 2017"
    },
    {
      "title": "Unorganized, irresponsible, disrespectful",
      "text": "I booked a room at this property for 4 nights, 5 days. It was non refundable, so I couldn’t cancel once I read all the horrible reviews of this place. I called 8 times to make arrangements for my room key pick up, since there is no front desk, but kept getting their voicemail. I left 2 voicemails, but no one called me back. I sent the hotel two messages, telling them I was suppose to be checking into the hotel in a couple hours, and needed someone to tell me where to pick up my key; I got a notification telling me they had read my messages, but DID NOT reply, knowing I was suppose to check in that day. I called Expedia and let them know what was going on, so they tried calling the property about 3 times, they also got voicemail, so Expedia had to make new accommodations for me. I would never recommend this property to anyone. Terrible service.",
      "rate": 1.0,
      "tripDate": " September 2019"
    },
    {
      "title": "Great place",
      "text": "Spacious. In the heart of Toronto. Walking distance to King St, waterfront, CN Tower and much more.  Great home away from home.  The place has everything you need to spend a night in after exploring the city.  I’d come back.",
      "rate": 5.0,
      "tripDate": " June 2019"
    },
    {
      "title": "Best Townhouse and Location in Downtown ",
      "text": "Once again wonderful stay. Place is clean and nicely designed.  I got an early check-in which made is very convenient for us as we arrived early.  The location is central and walking distance to many Toronto hot spots.  Everything went very smoothly.",
      "rate": 5.0,
      "tripDate": " June 2019"
    },
    {
      "title": "Excellent stay again !!",
      "text": "We had an excellent stay here. The condo is located in a very convenient part of the city, walking distance to many local attractions. The condo unit was very clean, professional, and modern, complete with a great city view. The host had all amenities and utilities prepared, which made our stay very enjoyable and relaxed. I would recommend this location if looking to experience downtown Toronto.",
      "rate": 5.0,
      "tripDate": " February 2019"
    },
    {
      "title": "Détestable expérience - Terrible experience",
      "text": "It is stated that \"Guests are required to contact the property 1 hour before arrival, or when booking is confirmed, to arrange key collection and check in.\"We phoned the owner at 2:00 pm on July 25 to agree on the time for the keys collection. He then told us that we could only get the keys at 6:00 pm or 9:30 pm. We were then in Niagara Falls, we departed immediately, shortening our visit of the falls, to our dismay. Due to the traffic and accident, we arrived between 6:30 pm and 6:45 pm. There was no one waiting for us, and the keys had not even been delivered to the concierge when there was one. We contacted the owner who told us it was impossible for him to come before 9:30 pm. He knew with our reservation that we are traveling with children of 4, 10 and 14 years old. We had to eat outside while the purpose of renting an apartment was to avoid having to do it and our 4 year old had to start his night in the lobby of the building. We finally waited 2:30 before we could get the keys !!! This is unacceptable.We were obviously very unhappy. The owner we had on the phone told us it was our fault that we only had to be there at 6:00 pm, which he imposed. It is not written anywhere that the keys are only available at certain times imposed by the owner, again it is written in the description of Booking.com that: «Guests are required to contact the property 1 hour before arrival, or once the reservation is confirmed, to arrange key collection and check in.»",
      "rate": 1.0,
      "tripDate": " July 2017"
    }
  ]
}