{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Ice Condos I-II",
    "url": "/Hotel_Review-g155019-d17758361-Reviews-Ice_Condos_I_II-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.5",
      "reviewCount": 12
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "12-14 York St",
      "addressLocality": "Toronto",
      "postalCode": "M5J 0B1",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/19/4d/1a/54/simply-comfort-gorgeous.jpg?w=500&h=-1&s=1"
  },
  "description": "GLOBALSTAY. Gorgeous Downtown Apartment features air-conditioned guest accommodations in Toronto, an 11-minute walk from Toronto Symphony Orchestra, 1.4 km from Rogers Centre and a 20-minute walk from Scotiabank Arena. Complimentary WiFi is featured throughout the property and private parking is available on site. Each unit features a fully equipped kitchen with a dishwasher, a seating area with a sofa, a flat-screen TV, a washing machine, and a private bathroom with shower and a hairdryer. A microwave, a fridge and oven are also available, as well as an electric tea pot and a coffee machine. CN Tower is a 20-minute walk from the apartment, while Harbourfront Centre is 2.1 km away. The nearest airport is Billy Bishop Toronto City Airport, 2.3 km from GLOBALSTAY. Gorgeous Apartments in the Heart of Toronto",
  "featues": [
    "Paid public parking on-site",
    "Free High Speed Internet (WiFi)",
    "Pets Allowed ( Dog / Pet Friendly )",
    "Non-smoking hotel",
    "Express check-in / check-out",
    "Clothes dryer",
    "Self-serve laundry",
    "Washing machine",
    "Air conditioning",
    "Desk",
    "Dining area",
    "Private balcony",
    "Coffee / tea maker",
    "Cable / satellite TV",
    "Sofa bed",
    "Bath / shower",
    "Seating area",
    "Wardrobe / closet",
    "Bottled water",
    "Clothes rack",
    "Iron",
    "Private bathrooms",
    "Kitchenette",
    "Dishwasher",
    "Microwave",
    "Oven",
    "Refrigerator",
    "Stovetop",
    "Electric kettle",
    "Kitchenware",
    "Flatscreen TV",
    "Complimentary toiletries",
    "Hair dryer",
    "City view",
    "Landmark view",
    "Non-smoking rooms",
    "Suites",
    "Family rooms"
  ],
  "reviews": [
    {
      "title": "Hamilton-King St. Apartment",
      "text": "For a long weekend or longer stay this apartment would be very nice, more than adequate. Our stay was only one night. It was clean and well set up and central to get around the area. Parking in any bigger city can be troublesome and is a bit of a case here but there is overnight parking for $3.50-7.00 close by. Simply Comfort gets our thumbs up. We would definitely recommend booking through their site though. Booking.com was a horrible, tedious experience. We will never use Booking.com again !!!",
      "rate": 4.0,
      "tripDate": " July 2021"
    },
    {
      "title": "Good option and cost effective stay",
      "text": "We had a part of 5 stay here for 2 nights.  It is a cost effective option while in Toronto.  Rather than pay for 2 rooms in a hotel, we could fit all 5 people in our room.  Two large beds, two full bathrooms, a great view of the city, washer/dryer, friendly people.  Some small repairs needed, ie, shower rod, towel holder but overall, we had a good stay.  Place was also quiet.  We would stay here again.",
      "rate": 4.0,
      "tripDate": " July 2019"
    },
    {
      "title": "Awful registration process and creepy webcam (but very nice condo)",
      "text": "My wife and I stayed at the Ice Condos II (named “Waterfront York Suites” on Expedia) for two nights of a 6-day trip from Toronto to Kingston and back.  We paid $382 per night (including taxes and fees), via Expedia, booking nearly three months in advance.There are two elements to this review: the booking and check-in process (which was awful) and the property itself (which was very good).Despite booking through Expedia, the registration and check-in process was more similar to renting from an owner on a rental platform (and not in a good way).  The fine print on the Expedia reservation reads:“Prior to arrival, guests must complete online registration with the property via a secure link. Guests will be asked to provide the property with a copy of their government-issued photo ID before arrival”However, that description does not capture the process.  You must provide a full set of information on an on-line form.  In addition to providing a photo of your ID (e.g., driver’s license), you must also provide a selfie (taken live over their system) and you must provide a photo of your credit card.Then it gets worse.  On completion of this process, they tell you that you will receive check-in instructions six hours before check in (so, basically, at 11am on the day of arrival).  Usually with a condo rental, you can expect instructions a couple days in advance, in case there is a problem with communication, you have questions, to give you time to figure out logistics, etc.In addition, 2.5 months after completing the pre-check in registration process (and on the morning of arrival), I received a message telling me that I needed to complete the pre-check in process.  I replied that I had already done this.  They responded that they were “having an issue in our system” that prevented them from retrieving the information I had already provided, so I needed to do it again.In addition, despite having authorized a security deposit on my credit card, they were now asking for an electronic funds transfer from my bank.  This made me feel very suspicious.  I contacted them and asked why they couldn’t take the deposit from my credit card.  They responded that I could use my credit card, but they would need a statement from me authorizing them to do so.  I responded with an authorizing statement and also re-did the pre-check in registration process that I had already done almost three months ago.They then followed up with a message saying that in order to use my credit card for the security deposit, I would need to hand-write a 90 word authorizing statement using their prescribed language, sign and date it, then take a photo of the signed statement, including in the picture my ID and my credit card.No, I’m not making this up.I hand-wrote the authorizing statement and submitted it.  Two hours later, 2.5 hrs before check-in, I received check-in instructions.We presented ourselves at the lobby desk for check-in (even though the reservation confirmation says “There is no front desk at this property”).  On-site staff instructed me to scan a QR code to access a registration form to enter all my information again (despite having provided virtually identical information twice already).  On completion of this, we were finally allowed to go to our condo room.The condo building is in a perfect location, partway between Air Canada Arena (where the Maple Leafs Play) and the CN Tower (and down about half a block).  Our condo was on the 55th floor and had spectacular views that looked north and east.  The condo unit itself was relatively well-equipped with a full kitchen (oven, stove, microwave, dishwasher), although the dinnerware, cutlery and implements seemed a bit light/worn/mismatched.  For a building that spectacular, there were some areas of the hallways, flooring, etc. that were a bit banged up.  There were also a couple minor maintenance items I took care of and reported to the manager.Very oddly, we found a Blink HD security camera on the inside of the condo unit, mounted over the bathroom door.  It was very disconcerting.  I draped a small cloth over it, but it still made me feel uneasy.The condo unit wasn’t large and the layout seemed inefficient.  The entrance hallways was wide and mostly wasted space.  Meanwhile, the bedroom was very snug and the small livingroom area had one of the building’s main support pillars running through it.  There was a small flat screen TV on a stand on what was otherwise the coffee table.  The floor-to-ceiling windows and sliding doors were great for the view, but the bedroom had only some thin curtains for privacy, but they did nothing to block the light in the morning.The condo was pretty close to amazing.  The check-in process and the indoor web camera would make me think twice about booking here again.  My net rating of 3 is a composite of 4 for the property (which could have reached a 5 without the maintenance items and a few small changes) and 2 for the booking & check-in processes, communication and creepy web-cam.",
      "rate": 3.0,
      "tripDate": " June 2024"
    },
    {
      "title": "6 day break",
      "text": "The apartment was at 85 Queens Wharf. Apt 1701.The instructions were sent to us the day before we left, and were really easy to understand.Gaining entry into the building was easy as we did exactly as instructed.The apartment is modern and had washing machine and dryer. Hair dryers. Toothpaste and toothbrushes, cleaning products and tea and coffee supplies. Ironing facilities, kettle toaster and more... In fact lots more than we needed! We found the security to be really polite and helpful upon our arrival and during our stay.We had amazing views of the CN Tower and Lake Ontario.Upon arrival we noted the bath plug was not working. We contacted by WhatsApp and it was dealt with the next day.The building is close to Tim Hortons, bars, cafes and grills. The entertainment area and lake.I really cannot fault Simply Comfort Suites at all.  We had a fab stay and we will definitely use again in the future.",
      "rate": 5.0,
      "tripDate": " March 2020"
    },
    {
      "title": "terrible",
      "text": "I advise travelers not to book the Ice Condos. The location is great but they have no customer service whatsoever. I had a serious family emergency and needed to cancel or change my reservation. They have no agent on duty and I contacted hotels.com to see if they could help. They also couldn't get through to the property and after spending over half an hour in the chat with an agent, they still would not waive the fee or even allow me to change my check-in date. I lost over $300 because they lack compassion. Also, Airbnb guests are not allowed to use the facilities or any amenities. The building has had many issues including problems with the elevators and fire alarms. I strongly advise travelers not to choose this property unless you are  certain that your plans won't change! It costs as much as a decent hotel with amenities.",
      "rate": 1.0,
      "tripDate": " June 2024"
    },
    {
      "title": "Conveniently priced, modern apartments, excellent location by the lake and downtown",
      "text": "It was a week when the prices for hotels in Toronto were sky high, and we found this great option.  The apartments are very well appointed, simple but functional, clean and modern - well located, a mile or so from major attractions.  There aren't a lot of dining options within a block or two, but if you are willing to walk a little more or take an Uber, the full offering is not far. The building is modern and simple, most of the tenants are young singles or couples - there is no front desk - everything is done via whatsapp and worked very well.  Ou apartments were quiet and the customer service was very attentive.",
      "rate": 5.0,
      "tripDate": " October 2019"
    },
    {
      "title": "Quick trip to Toronto",
      "text": "Modern apartment in the heart of Toronto. Very comfortable stay in this accommodation. Everything supplied in the apartment from towels to toothpaste & toothbrushes, shaving cream & hair spray. tea and coffee. Spectacular view over the city from the 36th floor. Welcome folder to read is in the apartment & gives information on everything including the nearest supermarket which is literally across the street. Although I was given instructions on how to access the apartment I Had a slight problem getting into the building  as there was no reception at the time of my late arrival but security helped me. Other than that everything was great & I would highly recommend.",
      "rate": 5.0,
      "tripDate": " October 2019"
    },
    {
      "title": "Scamming",
      "text": "Be aware when booking through Town flats Canada.What they advertise is not what you get. You will be dealing with Andy or Sylvia who are awful at communicating and great at scamming you.Upon arrival at our accommodation, we discovered that the property did not represent what was advertised (a two private bedroom, and 2 washroom rental) is what we booked and paid for (a 1 private bedroom, 1 washroom unit) is what we were given and therefore our reservation was a result of fraudulent misrepresentation.Additionally, during my attempt to address this issue with the agent named Andy, and his associate Sylvia, both associated with Town Flats Canada, I experienced disrespectful and threatening behavior. Andy not only failed to provide assistance but also issued threats regarding my and my daughters personal information, making the situation highly alarming and potentially criminal.They are not professional, their accommodation is under equipped to accommodate 6-8 people. For instance 2 of each cutlery pieces, no cups or mugs, only flat plates no cereal bowls,  no cooking containers and not privacy. Shutter blinds have some drops missing so you are exposed to nearby apartments, the \"2nd bedroom\" was off the kitchen open plan which serves no privacy. TV channels not available, one bathroom with hand towels for bath sheets.This and more made our stay extremely disappointing and we had no choice but to bite the bullet over an extremely busy period to find alternative booking.",
      "rate": 1.0,
      "tripDate": " December 2023"
    },
    {
      "title": "Ask them for their policies before you pay",
      "text": "After I booked they requested all kinds of personal info including passport drivers license and then refused to refund. I did get to stay as I didnt have the documents they needed. Many other reviews state the same thing",
      "rate": 1.0,
      "tripDate": " September 2022"
    }
  ]
}