{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Inverness - High Park B & B",
    "url": "/Hotel_Review-g155019-d264261-Reviews-Inverness_High_Park_B_B-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.5",
      "reviewCount": 69
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "287 Humberside Ave",
      "addressLocality": "Toronto",
      "postalCode": "M6P 1L4",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-s/02/c0/28/6e/inverness-high-park-b.jpg?w=500&h=-1&s=1"
  },
  "description": null,
  "featues": [
    "Free parking",
    "Free High Speed Internet (WiFi)",
    "Wifi",
    "Free breakfast",
    "Non-smoking hotel",
    "Air conditioning",
    "Non-smoking rooms"
  ],
  "reviews": [
    {
      "title": "Terrific!",
      "text": "The location of the B&B is perfect.  It is situated in a beautiful neighborhood with a bus stop at the street corner.  The subway station is located only about 4 blocks south.  It's very walkable or take the bus.  Shops and eateries are easily accessible by foot.   Elizabeth, the owner, is charming, personable, considerate and accommodating.  Her  B&B is comfortable, quaint, peaceful and clean. The breakfasts are superb. If I'm ever able to get back to Toronto, I will stay with Elizabeth.",
      "rate": 5.0,
      "tripDate": " June 2015"
    },
    {
      "title": "It's all in the details but more importantly, it's all about connection",
      "text": "I've stayed at many different kinds of B&B's - from the cozy-rustic to the extravagant. This place is the perfect combination of both and that means comfort. Elizabeth is both caring and efficient with her service. She is neither pushy nor passive, a brilliant communicator, generous with her guests (there was a young lady newly immigrated from China and Elizabeth was very helpful and generous without being condescending). We had a wonderful conversation about books and films (she loves Jiro Dreams of Sushi!) as well as Scottish ancestry (ok so I'm a bit biased!) Many B&B owners work hard but Elizabeth works smart. Some of the little things which made my one night there memorable were:1. Oatmeal soap - incredible lather which worked as a body wash, shampoo, and shaving cream. I'm not kidding! The scent was pleasant and neutral...my dry skin was grateful. In fact, I'll be buying oatmeal soap from now on. Saves money on all those bottles! The ensuite bath was luxurious.2. Reverse osmosis water filtration - the water is delicious with a slight sweetness to it. Makes everything taste better including the French-press coffee and the food in general. Drinking water was conveniently located and I filled up my water bottle...made staying hydrated a pleasure. Don't usually drink that much water.3. Breakfast had the best of both worlds - perfect balance of sweet and savoury. The sesame seeds in the pancakes did not draw attention to themselves and the smoothie was bursting with flavour. I usually find smoothies too sweet but this one was refreshing. 4. The bed was not too soft nor too firm. I was so comfortable that the quality of sleep made up for the quantity (stayed out a bit late!) Tastefully decorated room that avoided knick-knacky overload you see in so many B&B's. Hands down the best B&B I've ever stayed at. Worth every penny!",
      "rate": 5.0,
      "tripDate": " January 2014"
    },
    {
      "title": "Quaint and homey ",
      "text": "The house is a gorgeous 1920s era house that is beautifully maintained by Elizabeth. The rooms are complemented with antique furniture and the staircase and breakfast area is complimented with beautiful paintings. It's a two block walk to the nearest metro station (about a 7 min walk) in a beautiful neighborhood...",
      "rate": 5.0,
      "tripDate": " September 2016"
    },
    {
      "title": "Somewhat quirky",
      "text": "As an older and traveled couple, we expect various individual differences between lodgings, and it is nice to know approximately what one is in for upon selecting a B & B. Knowing some of these differences in advance helps one select to suit one's preferences. Here, somewhat unanticipated and undesired were the following: (1) the location places you in a district where, on weekends, there was inconsiderate street and house-party noise till after 1 AM; (2) the absence of air conditioning means, on warm nights, one must leave the windows open and hope for the best; (3) the steep ascent of 2 dozen stairs with luggage is trouble for some, despite the best efforts of the hostess to help (4) the room had a large non enclosed jacuzzi tub (no shower) occupying quite a bit of space, but there was no comfy chair, and the TV was perched out of view on a high closet, the net result being that this was not a room to relax in, even in the room temperature were livable, the lighting adequate, and the odd color and design choices changed; (5) the en suite bathroom was a curious small space, with virtually no headroom, and lacked a shower; (6) the only public space was the dining room, which is not particularly set up to relax, read, talk with other guests, etc. We credit the owner for the effort and commitment required to run her B & B. Each structure has its own pluses and minuses. The breakfasts were imaginative and healthy (though calorie-petite); cleanliness good; other guests companionable; the owner pleasant, and the location was relatively close to High Park and 2 subway stops (though far enough to not be walkable for us). There is a bus stop on the corner if you have the patience. One can park in the driveway (2 spaces) or in an adjacent school lot, but not on the street at night.Fortunately, Toronto has a lot to offer and we loved the area for a full 3 days. In summary, we found this an average B & B, with some individual surprise quirks which made it somewhat uncomfortable and not restful. It would be nice if other reviewers provided incisive fact-based critiques rather than using Trip Advisor to flatter and ingratiate the owner -- that's what the guestbook is for. It doesn't help the next guest determine if it's suitable for them specifically.  By the same token, we would not want to pointedly put the owner on the defensive ... her B & B is exactly what it is, and it's going to suit some guests more than others... why not just tell us what we're in for during the booking process?",
      "rate": 3.0,
      "tripDate": " August 2014"
    },
    {
      "title": "Were we just unlucky?",
      "text": "This is a delightful period house, set in a classy area of Toronto. However, the alarm bells began to ring as soon as we arrived. In spite of reconfirming our booking and arrival time only a few days before, our arrival seemed to surprise the owner.We had booked this B&B based on the many good reviews we had read. Our daughter’s room was fine but half our double room was taken up by a wooden shed! We were initially excited, thinking that we had a sauna but closer investigation revealed a junk store, containing all sorts of bits and pieces in various states of repair. There was a further surprise for us behind the door of the room: another junk store containing a broken light fitment. Our ‘wardrobe’ turned out to contain a washing machine and tubs of washing powder and… more junk!The room itself, including the bedclothes, was by no means the cleanest we had ever stayed in. Just to complicate matters, we were awoken at 5am on the first morning by a near neighbour shouting expletives. This was, of course, beyond the owner’s control but did disturb our much-needed sleep. The famous breakfasts are fine… if you like what’s served up. If you don’t, you go hungry. There is no menu, choice or consultation about what’s on offer, it just arrives – take it or leave it. On our first day, it was French toast. Our daughter didn’t like that, so that was her chance of a breakfast out of the window. She also doesn’t drink tea or coffee but no alternative was offered. On the second day, it was the much-vaunted porridge. I thought that it was delicious but the reaction of other guests at the shared dining table was mixed – and, again, no alternative offered: eat it or go without. It was also very interesting that, at a B&B that advertises itself as being sensitive to allergies (take your shoes off before you go in) and run by a nutritionist, the porridge was served in a nut sauce, with no effort to check on whether guests had a nut allergy.One final thing to be aware of: the bathroom on the first landing has clear glass in both the windows and no curtains or blinds. Ideal for exhibitionists and voyeurs! The light switch in that room also has no cover and the metal parts are exposed, next to the sink.As we were only staying for two nights and were spending our days with nearby relatives, we decided to keep calm and carry on. However, if we had been booked in for a longer, we would have had to leave and seek an alternative.Other guests appear to have had amazing rooms, so perhaps we were just unlucky…",
      "rate": 2.0,
      "tripDate": " August 2012"
    },
    {
      "title": "Very Pleasant Stay",
      "text": "I recently had the pleasure of spending three nights at this very nice B&B located in Toronto's High Park North District.  I recommend it as a great option if you're looking for somewhere to stay in this part of Toronto and you enjoy the Bed & Breakfast style of accommodation.First and foremost, this Inn is impeccably clean and well kept.   I was impressed by the fastidiousness of Elizabeth, the innkeeper, in this regard.  Even the most picky of guests should have no concerns along these lines. The Inn itself is small, consisting of four rooms, one on the main floor and three on the second.  The two smaller rooms on the second floor (one has a Queen and the other two twin beds, I occupied one of these, the Queen) share a bathroom.  The remaining two rooms have their own.  Sharing the bathroom was not a problem for me, insofar as I always found it open when I needed it.  My room was not overly fancy, but functional.  The bed was comfortable.  The WiFi signal was strong and easily accessed.Breakfasts are something of a highlight, remarkable for the fact that all three were both healthy and ridiculously tasty.  They were accompanied by both a fruit smoothie and French Press coffee.  Elizabeth is always ready to offer advice and assistance if required and is happy to sit and chat at breakfast and throughout the day, while not being intrusive.Parking was important for me and free parking is provided, though you should be prepared to do a little shuffling if other guests have cars as the driveway has room for only two.  Street parking is plentiful, but only permitted between the hours of 7:00 a.m.  and midnight.  Worst case scenario, you can park overnight in a nearby school lot, but must be out by 8:30 a.m. on school days.The neighborhood is quiet and picturesque.  The nearest Metro station is High Park, which is about a 10 minute walk from the B&B.  It's 11 stops from High Park Station to Bloor-Yonge where you can change lines to head down into the heart of downtown.  If you don't want to go downtown, there's plenty of good restaurants and pubs nearby within walking distance.Overall, I enjoyed my stay and hope to be able to do so again.",
      "rate": 5.0,
      "tripDate": " April 2016"
    },
    {
      "title": "An OasIs in Toronto",
      "text": "Staying at this quaint B&B for a week was an absolute treat! Surrounded by warmth, comfort and peace, it provided a much needed sanctuary in an otherwise hectic week. Most importantly was a very accommodating, kind and lovely host! Definitely will return.",
      "rate": 5.0,
      "tripDate": " March 2015"
    },
    {
      "title": "A Very Enjoyable Stay",
      "text": "I stayed at the Inverness B&B during the first week of August, 2013.  I had a very enjoyable stay!  The breakfasts are wonderful and I really enjoyed the lively chat at the breakfast table each morning.  I was travelling alone and visiting friends in the area, so it made a real change from staying in a hotel on my own.  Elizabeth is a great host, very welcoming and with a great local knowledge.  The B&B itself is very well situated, in a quiet street, but only 10 mins walk from High Park Subway station with regular trains into Toronto.  Also Bloor West Village, with good shops, cafes and restaurants is only about 15 mins walk away.  If I visit Toronto again I will definitely be staying at the Inverness B&B!",
      "rate": 5.0,
      "tripDate": " August 2013"
    },
    {
      "title": "The most comfortable, hospitable bed & breakfast I have ever stayed at.",
      "text": "Elizabeth was a fabulous host!! She suggested a great Thai restaurant \"Silk\" in the area...the best Thai food I've ever had.  She was so courteous and made my children feel very comfortable.  She allowed me to use her kitchen to prepare sandwiches for our long trek back to Vermont.  The breakfast was organic, nutritious, and healthy.  Her dogs were a great treat for my children.  I would have no hesitation to recommend these accommodations to friends or family!  Elizabeth thought every aspect to make our stay positively memorable.",
      "rate": 5.0,
      "tripDate": " July 2013"
    },
    {
      "title": "Warm, Friendly and a Great Location",
      "text": "After losing the room I'd wanted at another B&B due to waiting too long to decide, I asked for a reccomendation of other accomidations. I was given a reccomendation to call Elizabeth, the proprietress of the Inverness High Park B&B. She's amazingly friendly, and not only had an availibility for me, but even modified her rate for me due to the situation. The house is hardwood interior, built in the 1920's. Some of the wood has been replaced for the purposes of restoration or rennovation (the bathroom on the Master Ensuite). This is not a chintzy or cheesey decor B&B, but rather is classy and feels like home. The house has a keypad entry, so there's no key to forget in the room or lose, which I particularly liked. Parking for at least two cars is available in a private driveway, though street parking is copious as well. The house is 2 blocks down from the High Park TTC Subway station on the Green Line, and a Family (also useable by two adults w/no children) Pass for weekends and holidays is 24 hours for $8.50CAD, not too shabby.Breakfast in the mornings is served around 8:30, and is annouced by a very nicely pitched gong- not too loud or obnoxious at all, if I were still aslumber I'd most likely not rouse by the gong alone. The breakfast fare is all vegetarian, and can be vegan if required (Elizabeth is a nutritionist by profession, and often does vegan breakfasts as standard fare as well). There are two small dogs who live on the premises, however I rarely saw them during my stay. They generally stay in Elizabeth's rooms or the kitchen, and are quite well mannered. My only two issues, if I can even call them that, were minor. They prefer you remove your shoes and leave them at the entry, which helps maintain the hardwoods as well as keeps things quieter. The stairs being hardwood they were a bit slippery, though that's partially my fault for not taking advantage of the slippers available for my use within the house. Other than that, the stay was lovely.Two notes worth remembering for me are that the juice at breakfast contains bananas. I'm not allergic, I just don't like them, and forgot to ask if there were bananas in the juice/smoothie. Also, the Master Ensuite's 2 person in-room tub's toggle from tub to shower wand tends to whistle a bit with the hot water, switching it to the shower setting didn't seem to effect the time it took the bath to fill, and solved the whistling.I'm definitely keeping Elizabeth in mind for my next trip to Toronto, and am suggesting her to friends and family. I had a lovely stay.",
      "rate": 4.0,
      "tripDate": " November 2006"
    },
    {
      "title": "Ajr",
      "text": "Elizabeth was the proprietor, cleaner, valet, cook and Consigere.Room was impeccably clean with no smells.  Rate was 30 percent of the rate of the Marriott airport, and the room was smaller but cleaner, clean is more important.I feel very comfortable at the Inverness, that along with cleanliness and a great price make for a ,”Mitzvah.”",
      "rate": 5.0,
      "tripDate": " May 2018"
    },
    {
      "title": "FRIENDLY, GRACIOUS HOST",
      "text": "We stayed with Elizabeth for two nights in Sept 2017. Elizabeth is a friendly, gracious and helpful host. It was a pleasure and privilege staying in her home. Her location in the Junction District of historic Toronto is great.We felt completely safe walking to nearby resturants on Dundas, and throughout the walking trails in nearby High Park. We feel that we couldn't have been blessed with a better place to stay. Thank you Elizabeth.",
      "rate": 5.0,
      "tripDate": " September 2017"
    },
    {
      "title": "Beautiful house, charming decor, pleasant owner, delicious breakfast",
      "text": "My wife and I stayed in the downstairs room with private bath for two nights. We felt very comfortable. The owner, Elizabeth, gave us a thorough orientation upon arrival and showed us how to reach her if needed. She was available but never intrusive. We appreciated having privacy. We also liked the parking space in the driveway. We really enjoyed the breakfasts and the French press coffee. Shoes are to be removed upon entry. We find this to be much more common in Canada than in the States. A pair of slippers was provided until we were able to unpack our own. A small refrigerator was available just outside our room.Be sure to provide a fairly accurate estimated time of arrival...this had been requested in an email, so we assumed it was important. Overall, a comfortable, homey, quirky (in a good sense) B&B. We will plan on returning.",
      "rate": 5.0,
      "tripDate": " June 2017"
    },
    {
      "title": "Early 1920's house",
      "text": "This B&B is an early 1920's house that is beautifully maintained and decorated with wonderful antiques.  Elizabeth is our host and is a very friendly, welcoming and gracious woman.  Breakfast was french toast with fresh fruit and maple syrup... delicious!  A very comfortable place to stay near High Park in Toronto.",
      "rate": 5.0,
      "tripDate": " May 2017"
    },
    {
      "title": "A Fine B&B",
      "text": "This is a great B&B in the High Park North area of Toronto. Location wise it is 10 minutes walk from the subway and the park in one direction and 10 minutes walk to the Junction area in the other direction which has a good selection of restaurants and other amenities. Very nice area which feels very safe and which is also very handy for the airport. The B&B itself is tastefully decorated with good facilities and a comfy bed. Elizabeth is a great hostess and provides a small but very tasty breakfast at the communal dining table which is a great way of meeting the other guests. Recommended.",
      "rate": 5.0,
      "tripDate": " August 2016"
    },
    {
      "title": "Home Away from Home",
      "text": "My niece and I stayed here and immediately felt right at home with Elizabeth and with the historic house and lovely neighbourhood. She went out of her way to accomodate our needs. Breakfast was amazing, and we enjoyed chatting with the other guests over the delicious pancakes. Hope to stay here again soon!",
      "rate": 5.0,
      "tripDate": " August 2016"
    },
    {
      "title": "Relaxing, plus wonderful location",
      "text": "We spent 3 days with Elizabeth in the middle of August and enjoyed our stay immensely.  We were only a 10 minute walk or a 2 minute bus ride from the subway, and a 10 minute walk from High Park.  There was a wide choice of restaurants within a 5 block radius for lunch and supper.  Elizabeth's breakfasts were healthy and delicious and we had some great conversations after breakfast.  Elizabeth always had great tips about all of the different museums and places to visit in Toronto.  My daughter and I highly recommend it.",
      "rate": 5.0,
      "tripDate": " August 2016"
    },
    {
      "title": "Perfect",
      "text": "Myself and my husband stayed with Elizabeth for a few days and our experience was delightful. Our accommodation was very clean and comfortable and the pancakes were amazing. Thank you Elizabeth for making us feel at home.",
      "rate": 4.0,
      "tripDate": " June 2016"
    },
    {
      "title": "Perfect Valentine's Day weekend!",
      "text": "We stayed in the deluxe queen room, which was romantic, spacious, and had a large hot tub. The breakfast was healthy and delicious, and Elizabeth was a lovely host. We stayed on a pretty cold weekend but were still able to walk to the subway stop and get around easily. Would definitely stay there again!",
      "rate": 5.0,
      "tripDate": " February 2016"
    },
    {
      "title": "A delightful experience",
      "text": "I stayed at this B&B for a few of days and my experience was delightful. My accommodations were very clean , comfortable and very peaceful . The breakfast varied every day and was absolutely delicious as well as healthy. The hostess was very welcoming and also very informative about things to do and places to go. She went out of her way to be helpful in every way. I would definitely stay there again .",
      "rate": 5.0,
      "tripDate": " January 2016"
    },
    {
      "title": "Very nice stay",
      "text": "We stayed in the B&B last weekend. It was our 2nd time to stay there as our anniversary getaway. As last time, Elizabeth was a great host. I actually forgot to bring my tickets to a boat tour. She was very nice to let me use her computer to print out my tickets. Great room and very delicious breakfast too!",
      "rate": 5.0,
      "tripDate": " July 2013"
    },
    {
      "title": "Consistently Wonderful",
      "text": "I have stayed 4 times over the past 7 years with Elisabeth. The rooms are always ready, clean and well appointed. Her breakfasts are always fresh and totally organic. My last stay was 6 nights and the menu rotated between the \"porage\" to pancakes and french toast. French press coffee and the morning paper are always a given.Beware though that when you are gone the \"Teddy Bears\" in each room seam to get into mischief. At least mine did. If they weren't in the sauna they were listening to my MP3 player.She is located in a great neighborhood a 10 minute walk to the Bloor subway and \"the Junction\" on Dundas with eating/drinking choices too numerous to mention.You really wouldn't need a car.",
      "rate": 5.0,
      "tripDate": " July 2013"
    },
    {
      "title": "A wonderful experience",
      "text": "I stayed at this B&B for three weeks. There is a friendly atmosphere, and the breakfasts in the morning are nice, healthy and special - plus there were lots of interesting people to meet and talk to! The hostess is very welcoming and personal in the interaction. The B&B is located in a quiet neighborhood with dining facilities in the immediate vicinity, while the center can easily be reached by public transport.",
      "rate": 5.0,
      "tripDate": " June 2013"
    },
    {
      "title": "Home Away from Home",
      "text": "A relaxing room in a charming house on a quiet street in Toronto . . . that's what we found when my sister and I arrived at the Inverness B&B.  Elizabeth was so friendly and welcoming that she truly did make the B&B seem like our 'home away from home' for the week we were there.  Our room, like the rest of the house, was very clean and spacious.  There was a huge closet for hanging our clothes, storing our suitcases, etc.  There was always a good supply of fresh towels for us to use.  The air conditioning was a welcome bonus in the 40c heat that hit Toronto for a few days!  Elizabeth went out of her way to accommodate our special breakfast requests. Don't pass up the juice she blends - it's scrumptious.  Thanks, Elizabeth . . . when we return to Toronto, we'll be back at your B&B!!    Lauren and Gail",
      "rate": 5.0,
      "tripDate": " July 2013"
    },
    {
      "title": "Elizabeth and \"the boys\"",
      "text": "A lovely location in a leafy area of the city, cool and comfortable in 40 degree Toronto heat!  If you can't face breakfast, Elizabeth's unique offerings may change your mind: fresh orange juice, good hot coffee, and original recipes.  And good company from all over the world.  We will certainly stay here again.",
      "rate": 5.0,
      "tripDate": " June 2013"
    },
    {
      "title": "Nice, cosy house",
      "text": "I love this B&B. It is close to the subway station, just 5 minutes walk. The landlord is so friendly. I loved fresh juice that she made for me every morning.",
      "rate": 5.0,
      "tripDate": " February 2013"
    },
    {
      "title": "Summer Holiday In Toronto",
      "text": "This fantastic B&B is perfect for travellers who want to visit Toronto. It maybe out of the city its self but has excellent travel routes by bus or subway. It also has one of the biggest parks, High Park, on its doorstep perfect for the summer walks when wanting a break from the city or just take in the views of the park and eat at the restaurant which does great food. The B&B is a warm friendly place, making you feel as if your still at home complete with your own teddy bear, which is a really nice theme of the the B&B. The different breakfasts each morning are lovely and the OJ will make you ask for more! The breakfast sets you up for the day, which is great when your busy visiting this great city. The rooms are clean, plenty of space and very comfortable. Elizabeth, the owner, has great knowledge of the city, especially about the CN Tower - just ask about the restaurant deal! Bloor West Village and The Junction are also on your doorstep which have many shops and fantastic restaurants.Thank You for making my trip so enjoyable and I will look forward to my next stay!",
      "rate": 5.0,
      "tripDate": " August 2012"
    },
    {
      "title": "An oasis of calm",
      "text": "Clean, comfortable, and very convenient. Walking distance from the Subway and High Park. Off-street parking. Breakfast served at your convenience, and contrary to other reviews below, there is plenty of choice if you don't like the breakfast dish of the day. All I had to do was ask politely and she made a new dish right away. :)The owner is friendly and professional. We had to make last minute bookings (the day before travel) and although the B&B was officially closed for the season she re-opened just for us. As far as I can tell this is the only decent place to stay in the west of Toronto.",
      "rate": 5.0,
      "tripDate": " December 2012"
    },
    {
      "title": "So quiet you can hear the grandfather clock ticking.",
      "text": "This was my first stay at a B&B.  The hostess, Elizabeth, greeted me, and we got along just fine.  First day's breakfast was homemade french toast with sliced banana and strawberry, and coffee served in a press, which was yummy and first-class. Day 2 I was served the best glass of fresh-squeezed OJ I've ever had, and a delightful bowl of organic oatmeal with all kinds of nuts & seeds on top, and yes, a coffee press.  The bed was fine, just not as comfy as my own Tempur-pedic.  The room was spotless, with a couple of teddy bears watching over.  The 20\" (?) TV monitor is on top of the armoire, which made it difficult to hear without turning it up too loud (the place was so quiet). The residential neighborhood was just what I was looking for: to be walking distance to the Roncesvalles/Dundas West area.  I had two wonderful walks around the neighborhood and nearby park.   Off street parking was a real bonus!   Fridge available, which I didn't need, and plenty of tea available (self-serve).I definitely will go back and maybe even bring my wife.  A very good value, really, and I look forward to staying there again when I'm in town on business. One thing I would have loved was a desk or someplace to sit & work in my room. If you have a car, and don't need to be right downtown, and/or can walk 10 minutes to the bus/streetcar, this would be a good option for a traveler on his/her own.  Nice place, Elizabeth!  Thank you.  See you again in 2013.",
      "rate": 5.0,
      "tripDate": " December 2012"
    },
    {
      "title": "The BEST home away from home!",
      "text": "This was my first stay at this B&B and absolutely won't be my last! The location is perfect! Right between 2 fabulous neighborhoods called Bloor West Village and The Junction. I was able to walk everywhere and if I needed public transportation, the subway was also just a short walk around the corner! Elizabeth (the owner) made the most delicious, and healthy breakfasts I have ever had! Always serving with a smile and incredible information about nutrition and digestion. The home is filled with beautiful artifacts that had such interesting stories to go along with them. Very peaceful, clean and filled with extraordinary guests from around the world! I can hardly wait to return! Thank you Elizabeth for making my stay in Toronto so memorable!!",
      "rate": 5.0,
      "tripDate": " November 2012"
    },
    {
      "title": "Not worth it...",
      "text": "I am not sure why others give this place such high scores. I will only give it 2/5. This is not a 3 star hotel caliber at all as it suggests. Here is why:1. room is small. For shower, you have to step into this tiny bath tub and make sure you don't lose your balance. 2. No common area for relaxing, doing work, no TV, no fridge. 3. You cannot control the room temperature. I could not sleep one night because of the hot temperature. I had to ask next morning for air conditioning. 4. We were asked to leave before 9am because the owner had to show the house to realtor. Unheard of. 5. I don't feel any hospitality. Our kids got yelled at by the owner just for making a bit sound on the stairs in the middle of the day. Very rude!Avoid at all costs! I could give it 1/5. It gets that one extra point because of its location.",
      "rate": 2.0,
      "tripDate": " July 2019"
    },
    {
      "title": "Great BB!",
      "text": "What a great place...peaceful, quiet, clean, with nice comfy beds. Healthy breakfasts and a cute little dog that resides here made my stay even better!  And whenever I stay, I seem to meet the nicest people from right around the world. It's why I love the place too! In the funky west end of Toronto, it's got the huge High Park almost next door. Great for nature lovers! I've been coming here for 5 years and it's the only place I'd stay while in Toronto :)",
      "rate": 5.0,
      "tripDate": " January 2016"
    },
    {
      "title": "Relaxing Stay at Inverness - High Park B&B",
      "text": "We enjoyed our 2 nights stay at Inverness. Our hostess Elizabeth provided us with a clean place to relax. She made a great breakfast and made great suggestions about Toronto, the Metro and the bus. Very good all the way around! thanks, Frank & Diane. Erie PA.",
      "rate": 4.0,
      "tripDate": " April 2014"
    },
    {
      "title": "Warm and friendly",
      "text": "Stayed for 2 nights in transit through Toronto. Elisabeth is a thoughtful and caring hostess. We had to leave very early on our last day and even found that the snow had been cleared from the car! Thoroughly recommend.",
      "rate": 5.0,
      "tripDate": " January 2014"
    },
    {
      "title": "Value and comfort",
      "text": "Very clean and acommodative B&B in a nice neighborhood. Free off street parking and Wi-Fi. Coffee was individually brewed in a French Press maker. Breakfast was a vegan's delight. The hostess was the best part. Be sure and get her opinion on whatever it is you are planning to do, where to eat, etc. As yanks, we felt very welcome here on a short stay.",
      "rate": 4.0,
      "tripDate": " November 2013"
    },
    {
      "title": "Cosy and friendly",
      "text": "A cosy and friendly B&B in a nice area. The owner was ever so helpful her breakfast fantastic! Just a short walking distance from both High Park Station and from Dundas street with its small and interesting shops and cafés. Couldn't have wished for a better start on my visit to Toronto.",
      "rate": 5.0,
      "tripDate": " October 2013"
    },
    {
      "title": "girls get a way",
      "text": "Twice a year my friend and I stay with Elizabeth when Alfie Zappacosta comes to town. We've stayed with her for approximately 6 years now and we wouldn't stay anywhere else. She welcomes us in to her home with open arms and we thoroughly enjoying chatting and getting caught up. The home is comfortable and clean and we always look forward to the delicious breakfast she prepares and serves us. Thanks Elizabeth",
      "rate": 5.0,
      "tripDate": " August 2013"
    },
    {
      "title": "Perfect location, lovely stay",
      "text": "Visiting relatives close by and a friend downtown - where to stay ?  This spot hit the spot !  Elizabeth was a perfect host. Nothing was too much trouble. The breakfast was scrumptious and beautifully prepared. Coffee excellent. The conversation with the guests at breakfast made us want to forget our plans for the day. Parking greatly appreciated. We were treated to a peek at the breathtaking Bonsai trees on the balcony. This B&B shows a maturity having been in business for eighteen years and it is very well run. Should the circumstances arise again we would have no hesitation to book a room.",
      "rate": 5.0,
      "tripDate": " August 2013"
    },
    {
      "title": "A Real Home Away....",
      "text": "I had a fantastic stay here.....a wonderful host, serene neighbourhood, lovely healthy breakfast, clean comfortable roomand the beautiful garden outside.On trips, I normally would stay in a regular hotel. For some reasons, this was my first adventure with a B & B. I'd say I got much more wholesome value than I expected.I will surely return here.",
      "rate": 4.0,
      "tripDate": " July 2013"
    },
    {
      "title": "Great B & B in Toronto, Ontario",
      "text": "We stayed at Inverness B&B for a wedding recently, and I have stayed there on a number of occasions when in Toronto to attend courses.  Elizabeth is very gracious, accommodating and helpful, and the rooms are always well cared for, with lovely ambience.   A friendly place in a nice area of the city - we definitely recommend it!J. Alexander & G. Howard",
      "rate": 5.0,
      "tripDate": " July 2013"
    }
  ]
}