{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Isabella Hotel and Suites",
    "url": "/Hotel_Review-g155019-d498809-Reviews-Isabella_Hotel_and_Suites-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.0",
      "reviewCount": 400
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "556 Sherbourne St",
      "addressLocality": "Toronto",
      "postalCode": "M4X 1L3",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0b/0f/60/ca/isabella-hotel-and-suites.jpg?w=500&h=-1&s=1"
  },
  "description": null,
  "featues": [
    "Paid private parking nearby",
    "Free High Speed Internet (WiFi)",
    "Free breakfast",
    "Pets Allowed ( Dog / Pet Friendly )",
    "Non-smoking hotel",
    "Outdoor furniture",
    "24-hour front desk",
    "Laundry service",
    "Parking",
    "Wifi",
    "Shared lounge / TV area",
    "ATM on site",
    "Air conditioning",
    "Housekeeping",
    "Flatscreen TV",
    "Non-smoking rooms",
    "Family rooms"
  ],
  "reviews": [
    {
      "title": "It's Alright. . .",
      "text": "I stayed one night with my b/f here b/c we needed a cheaper place and this hotel looked nice from the pictures and people seemed to have given it good reviews.We stayed in a standard room.  It was pretty small.  I think it's fine if you're 1-2 person or staying there just for a night or 2.  If you're staying there for a week for an actual vacation, I think you'd need a larger room.  In the picture they advertise, they show a bed and tv.  That's pretty much the whole room.  The only other thing included in the main area was a chair and an end table. The staff there were friendly and quickly solved our problems/concerns.  The only thing is, I thought our problems/concerns were so basic that I found it odd that they overlooked it.  At first our tv didn't have a remote control.  I wasn't sure if we were supposed to have one or not so we called the front desk and someone came in a few minutes to give us one.  It turned out that this control also didn't work, so we called them again and they sent us another one that did work.  As we were going to bed and pulled off the covers there was a cigarette burn hole in one of our sheets.  It was very late, maybe 12:30am or so.  My b/f wasn't concerned about it, but I was.  I don't think there should be a hole like that in our sheets.  The front desk said that there are no maids at this time but if we want someone could come down and get an extra sheet and we could replace it ourselves.   So that's what we did.  The guy at the front desk was very apologetic though. It was kinda a hassle, but I thought it was disgusting in to have that cigarette burn hole there in the first place so better to change it myself than sleep on that.  These weren't HUGE problems, but I don't think they should've happened.The area itself around the hotel isn't that great.  But it is a 5mins. walk to a subway station, so that is handy.What I didn't like was that on the website they advertise a standard room for $79.  I thought that was how much it would cost.  At checkout, the cost was $99.  I told them I thought it was $79 and they said that's only during the winter, during the summer all the prices are raised.  That's very sneaky b/c they don't say that anywhere.  I think they should definitely emphasize that b/c I certainly went there thinking it was only $79/night.  If I had know it was almost $100 for a night, I would've just gone to a better hotel that cost $100/night or went to a different hotel for a lower price.",
      "rate": 2.0,
      "tripDate": " August 2005"
    },
    {
      "title": "Not a bad place for one night",
      "text": "Trying to find a hotel to stay in for under $100 CAD in downtown Toronto is quite challenging, let alone trying to find any place to stay during the film festival.  I wanted a place to stay that was clean and safe and near public transit.The hotel is really close to the subway, maybe a 2 minute walk, and it  doesn't run under the hotel, so you're not disturbed by trains running all night long.The lobby was very fancy but the staff could have been a bit more professional.  When we checked in, the front desk person was in an arguement with his \"roommate\" on the phone, and he was loudly complaining to us about the cleaning staff not letting him know which rooms were ready.  After being up since the crack of dawn and travelling half way across the country, I did not need want to be kept waiting by this guy nor have to hear his complaining.Once we finally got into our room we found it was really small and could us a fresh coat of paint and new carpet.  The sheets were clean, I didn't see any bugs and the tv worked.  The bathroom was small, but really clean and could have used some face clothes.  I would probably use this hotel again the next time I visit Toronto, but I would definitely get a bigger room (like one of the suites instead of the standard room).",
      "rate": 3.0,
      "tripDate": " August 2005"
    },
    {
      "title": "Not a bad little place",
      "text": "This is an adequate hotel with LITTLE rooms at a nice price.  Like some other reviewers we also had the issue of different price charged to that advertised to their website.  We found the room to be spotless including the bathroom but very small, not ideal for a couple but fine as we were there for only a couple of days.  The area the hotel is in is not great (as advised by a friend who is a cop in Toronto) but fine as long as you don't spend too much time across the street near the flats.  Parking is an issue at this spot but you are close enough to walk into downtown Toronto although it is a decent walk.We found the staff friendly although not the most professional and on one morning they had run out of breakfast which was included in our rate.  The hotel has a nice little beer garden out the front but it wasn't warm enough for us to enjoy it.  If you have the money then stay somewhere else, if not then this hotel is ok for a few days.",
      "rate": 3.0,
      "tripDate": " May 2005"
    },
    {
      "title": "Extremely Bad Choice - Save Yourself The Grief",
      "text": "I've never stayed at such a dirty and bug infested place before.  Yes I admit the price was eyecatching, but I found out too late that it was a high price to pay in return.  When I first saw a big flat brown spot on my shirt I thought it was a stain or fuzz, it was only when I tried to use my hand to remove it that I realized it was a bug.  Totally freaked me out.I had to see two doctors plus a dermatologist because yes - the condition of my arms and legs were that bad - I had massive huge red swollen bumps and rashes with a hole in the middle of each bump - and I had several - imagine how digusting that looked.  The doctor pretty much deducted that it was insects/bug bits and the worst part is that the scars and wounds could take up to a year to heal!  This whole experience has caused me a lot of pain and suffering.  Ultimately it is your decision, but you should really think twice before staying in a place like this.",
      "rate": 1.0,
      "tripDate": " September 2005"
    },
    {
      "title": "BEDBUGS- MILLIONS OF THEM!",
      "text": "I had booked my stay at Isabella Hotel well in advance... it was supposed to be a two night stay in toronto with my sister and father.  The first night we were accosted by bedbugs, we were bitten and discovered one in the bed in the wee hours of the morning-- 5am to be exact.  When this was mentioned in to the receptionist, they moved us to a larger, bed-bug free room immediately.  Except it wasnt bedbug free!! I couldnt sleep thinking about them and stayed up most of the night CATCHING THEM-- i caught 8 of different sizes, but was still bitten when i would accidentally nod off.  I presented all 8 samples the next morning and checked out, never to return again.  To be fair, the hotel did not charge us for our stay, but my sister's bites were horrible and so were mine.  It really ruined our Toronto experience.",
      "rate": 2.0,
      "tripDate": " May 2012"
    },
    {
      "title": "Never book this Hotel",
      "text": "It is all faked. Don`t book the Hotel. It is dirty, the bed towels are used and not cleand. They trheat you like you are not welcome on the front desk and are not helpfull. they are arrogant and not willingfule to help. The whole hotel does not deserve the name as a hotel. Never book it. Trust me.",
      "rate": 1.0,
      "tripDate": " February 2012"
    },
    {
      "title": "Good value in Toronto",
      "text": "Stayed at the Isabella for a business/pleasure visit to Toronto early June. Good location-easily accessible to transportation to attractions.  Had some problems with checkin-was twice put into occupied rooms. Straightened out on third try. Was told staff member handling checkin was new. Also had elevator and airconditioning problems during my stay. Elevator was fixed the first day, airconditioning was not which was a problem since there was a heatwave that week. Staff was apologetic and dealings with them were always pleasant.   Nice area and good value for the money.",
      "rate": 2.0,
      "tripDate": null
    },
    {
      "title": "Wasn't worth the price",
      "text": "The Isabella hotel is decent, there is nothing special about the hotel that would make me visit again. My boyfriend and I came to Toronto for New Year's, we wanted something nice but with out spending a ton of money. Pros about this hotel is that it is pretty clean and it is decently located in the city, about a 10 minute drive from the CN Tower and some other attractions. Some of the cons about the hotel is the breakfast was pretty weak, I've stayed at hostels cheaper than this and they had a much better selection. The breakfast consists of cold cereal, muffins, coffee, tea and toast. The first room that we stayed in was VERY small and the bathroom was ridiculously small, due to the door not working we were \"upgraded\" to a room on the 3rd floor  which was bigger and more comfortable. If they aren't busy I would suggest asking to see if they have any bigger rooms. The service was mediocre, we asked for towels because our upgraded room had zero when we first got in and we were told they were doing the laundry. We also called and asked for clean cups after the room was supposedly \"cleaned\" and we never got them,  the service could have been better There is a parking lot for $15 a day across the street. It was an okay experience for the price I think there could be little better. Check in is at 3, I would not recommend getting there any earlier. We called before we arrived to say we would be early and if we could get an early check in and they did say it was hard to tell because it all depends on when people check out and the rooms get cleaned. Well we got in at 12 and nothing was done to get us a room earlier than 3. There was about 5 other people that also got in between 1 and 2 and no one was able to check in early.",
      "rate": 2.0,
      "tripDate": " January 2015"
    },
    {
      "title": "If I could give it a zero rating I would",
      "text": "Absolutely nothing positive to say about this place. Dont be fooled by the photos. Its dirty, dilapidated and nothing works. Took us three attempts to find a half decent room. First one -supposedly a double - not suitable for one person let alone two. Second room heat stuck on - 30.5 degrees. Third room adequate.  Sheets too small for bed so kept slipping off the corners. Bathroom tiny, shower spray goes everywhere except over your body. Curtains too small for windows and hanging off rails. T.V. remotes not working. Room service a joke. Asked for room to be made up twice. This consisted of the quilt being thrown over the undersheets and mattress protector  that had slipped off at the corners. There's a similarly priced place a few doors down that we stayed at in the past which is luxurious. Gutted I opted for this disgusting place.",
      "rate": 1.0,
      "tripDate": " February 2018"
    },
    {
      "title": "Terrified from reviews... Pleasantly Surprised!",
      "text": "Ok to start off, I was TERRIFIED by all the reviews I read. We booked this hotel on hotwire and were not told which hotel until after we paid.  When I read the reviews I didn't hear ANYTHING good. When we got here I was really surprised. It was clean and organized.  The staff was friendly.  The hotel is in a fairly decent neighbourhood. 10 minute walk to Yonge street. For the price we paid it was definitely a good stay.",
      "rate": 4.0,
      "tripDate": " July 2014"
    },
    {
      "title": "A word of warning",
      "text": "We found the hotel on groupon and were excited to stay in a rustic hotel in downtown Toronto. We were also looking for a budget friendly hotel such as an equivalent to a Red Roof as our trip was budget friendly. Unfortunately the hotel was less than satisfactory. The first night we woke up to a flood coming from a leak in the ceiling of our hotel bathroom. They upgraded us to a larger room which was nicer, considering the room we stayed in the first night was very tiny. There was barely enough room for a full sized bed and a stand up shower. There was a small chair holding a coffee maker.  What bothered me the most was both rooms were dirty. Brown stains on the towels, stains on pillow cases, and stains on bedding, and hair. I asked the nice girl at the front desk for clean towels but she informed me they did not have any because the washers broke and housekeeping had to take the laundry somewhere else to clean. I understand these situations happen, just wish our towels we did have were clean.  Also the hotel holds 100 dollars at checkin for incidentals which I didn't really understand because I have worked in the hotel business for 9 years and I have yet to see a hotel of that quality hold such an amount. Breakfast was basic but nice considering the quality of the hotel.Staff was friendly. The young lady especially the most informative when asking questions about local activities.",
      "rate": 2.0,
      "tripDate": " April 2014"
    },
    {
      "title": "I think the negative reviewers are pansies...",
      "text": "Honestly? I was terrified to stay here from all the negative reviews. But, it was NYE, and we NEEDED somewhere to stay.I don't think the people that gave bad reviews have ever been out of the country, let alone stayed in anything less than a 4 star hotel. I found there to be absolutely nothing wrong with our stay.Like I said, NYE, so cold. Our room did have a space heater...guess what? We were fine. Yes, it has a space heater. You know why? Because the building is old and heating standards were different then. The space heater was fine, and the blankets we had were definitely enough to stay warm through the night.We had no problems with the front desk, in fact she helped us out when we got there. I booked a queen bed online, thinking that was all they had available. We get there and she said she has a room with two double beds if we prefer -- excellent! Our own beds! She was very thoughtful and accomodating. We both enjoyed our space that night haha. The elevator is small, but if you can manage the stairs, go for it, they're not that bad. The room was clean, the linens were clean, the bathroom was clean...clean people. CLEAN. I've worked in the hotel industry, trust me, this was clean. And considering the price you pay for the location, the cleanliness and the great service, this is a real steal. There are some serious poop-holes in Toronto you could stay in for less money, and I think this is on the low end of price for some of the stuffier folks, hence the bad reviews. Maybe I got lucky? Maybe it really isn't as bad as some say? Give it a shot, I know I will again.",
      "rate": 4.0,
      "tripDate": " December 2013"
    },
    {
      "title": "Beautiful, Perfect.",
      "text": "This hotel was almost perfect.  Not only is is GORGEOUS on the outside, but it's clean and friendly on the inside.  The staff were incredibly personable and helpful.  I enjoyed my stay here so much that I actually gave the telephone number and address of the hotel to some people I met on the greyhound who say they visit Toronto frequently.My only complaint is about the bathrooms in the basic rooms.  They are so small that a person has to squeeze into the space between the sink and the shower in order to shut the door.  Not ideal, but still workable.",
      "rate": 5.0,
      "tripDate": " August 2006"
    },
    {
      "title": "terrible. Avoid this place if you can. the photos shown are a total lie.",
      "text": "The whole hotel is dirty. i saw a foot long rat on the reception area on my first day there, the carpet is full of mold which makes it hard to breath, the AC on the rooms (because there is non on the common areas) is extremely old and you won't be able to sleep due to the loud sound.The neighborhood is bad and after 6 pm is not recommended to go out.I called to get a refund and the hotel manager ignored my complaints even though I complaint to every single employee during my 3 days of stay.Do yourself a service and avoid this place.",
      "rate": 1.0,
      "tripDate": " July 2018"
    },
    {
      "title": "Worst experience ever in a Hotel.",
      "text": "We shouldn't call this a hotel. To start the worst 2 days of our trip: the room they gave us was so small I couldn't fit in, not to mention the bathroom: in order to sit on the toilet I had to fit my legs under the sink (I am a small and thin person. Can't imagine a big guy there). Secondly, dirty dirty room. Killed a bug on the wall. I Asked them to move me. They got me a dirtier room, toilet clogged, carpet stink so bad! And the worst part: central heating was not working!! What kind of dump is it? Public health should lock it up. To end our stay, my husband had an asthma crisis in the middle of the night and we had to go to the hospital. (I can't say enough how dirty and dusty it was)Thanks for ruining our stay and the important meeting we had the other day.",
      "rate": 1.0,
      "tripDate": " November 2016"
    },
    {
      "title": "Decent For a Few Nights",
      "text": "If you're not concerned with fancy amenities and 5 star restaurants, the Isabella is a decent place to stay. Although it's not smack dab in the middle of the action (a few subway stops away), it's a quiet residential neighborhood with the Sherbourne station about a block away. I was here on a solo trip, I'm a female, and I felt safe staying here. The staff was friendly. I really appreciated that they held my luggage after check out (I had a late flight), when I came back for my bags they offered me a vacant room to freshen up and change. No issues with wifi, the queen bed was comfortable, the shower was LARGE with awesome water pressure that you rarely find in hotels! The elevator was kind of sketchy, very small, very slow. There was also a pipe coming from the ceiling that bent back into the wall, and it made A LOT of noise. It sounded like gushing water 24/7. Not really sure what the deal was with that, but it didn't bug me enough to make a stink about it. Honestly, I was rarely in the room because I was out exploring the city. You get what you pay for and I wasn't looking to spend much. A pleasant stay in a bare bones room.",
      "rate": 4.0,
      "tripDate": " September 2014"
    },
    {
      "title": "You get what you pay for!",
      "text": "If you're not concerned about space and if you're not the type to unpack upon arrival, you'll be just fine!  We arrived later in the evening and were received very warmly.  Our room was small but we knew that when we booked!  If you're someone who requires a tub, this is not the place for you!  If you're high maintenance, this is not the place for you either!  However, if you want a convenient (subway and great breakfast place nearby), clean and friendly spot, this is an ideal little hotel.  There were issues with our shower in our first room and we were moved immediately.  It was tight quarters (we stayed for 3 nights) but a late checkout (12pm), a little pub downstairs and a continental breakfast made up for it.  We paid $65/night for a double room and we get a decent bang for our buck!",
      "rate": 3.0,
      "tripDate": " March 2015"
    },
    {
      "title": "Vacation ",
      "text": "First time in Canada and everything was so nice!! The hotel is really good! I loved the friendly staff there!  Downstairs is a great bar restaurant where you can relax! The Internet is little slow but it's ok for free internet! Also my room was really clean and that's why I like this hotel!",
      "rate": 5.0,
      "tripDate": " February 2015"
    },
    {
      "title": "Perfect Place to Break the Chain Hotel Habit!",
      "text": "I loved this property.Had originally booked because my chains of preference were sold out or too high in price for the Saturday I was staying and I will come back to this hotel whether the others have availability or not.I was travelling solo on a half-pleasure, half-business basis and have no complaints.My room was adorable and had a great layout. It had more than enough floor and desk space. The windows were nice and large. The beds were comfortable (I slept like a baby). The free wifi worked just great. The staff were super friendly and built great rapport with me. There's a restaurant with a beautiful patio attached I really want to try next time.Thanks for the great stay!",
      "rate": 5.0,
      "tripDate": " August 2013"
    },
    {
      "title": "Oh my, bad neighborhood, bad everything else",
      "text": "This place is a dump. It is not worth staying here for the price. The rooms are filthy. The water in the entire hotel wasn't working. The \"suites\" are plain old hotel rooms. This is in a bad neighborhood, with bums hanging around outdoors. Do you really want to risk this? How anyone could call this \"nice\" at any price must be used to sleeping in a dirt floor hovel.And BTW, they were actually quite nice at the front desk.",
      "rate": 1.0,
      "tripDate": " March 2012"
    },
    {
      "title": "Don't bother unless you like sharing with rodents!",
      "text": "We booked a three night stay through hotwire for $70/night and even though we got a bargain price I still wouldn't stay here again! It was supposed to be in a \"downtown\" location, when in actual fact it was at least a 30 minute walk to Dundas & Yonge. It is however close to the subway, so you can get around that way. There were no parking places left when we arrived, so we had to park just down the road at a public carpark for $12/24 hrs with a $20 deposit, which we later found out is $3 cheaper than the hotel charges anyway. The lobby and bar area were clean and inviting, which is more than can be said for the guy on the desk when we checked in. The lift is small and broke down several times, so we were forced to endure the horrible \"cooked oil\"  smell coming from the basement restaurant that lingers permanently on the stairs.  The room was small and dark. The walls and carpet were stained and someone had punched a hole in the wall. On the upside at least the bed sheets were clean and bed bug free as far as we were aware. Wired internet connection in the room, but we found that we also picked up the lobby wireless connection, though this was very unreliable (even when sat in the lobby itself). The bathroom was tiny. The door almost touched the sink when it was open so in order to use any of the facilities you had to go in and then close the door behind you, which was awkward and would have been impossible for a larger person. Breakfast was minimal - choice of cereals, toast, muffins & fresh fruit with orange juice & coffee. Then the icing on the cake, we came back late one afternoon to get ready to go out for the evening, to find a mouse in our room! We complained to a female receptionist who was very apologetic, but not surprised (so obviously this was not a one off), they offered to compensate us a night and said they would send someone up to \"chase the mouse out\". No offer to change rooms and in the end no one came up while we were there, but as it happened the mouse ran out of his own accord - he obviously didn't want to spend another night in the room either!!!So while it's cheap the Isabella is far from cheerful and if you can afford to pay a little extra I'd find a hotel either in Chinatown or closer to the Dundas & Yonge area with free parking, because what extra you spend on the hotel you'll save on parking and subway fares etc.",
      "rate": 1.0,
      "tripDate": " October 2011"
    },
    {
      "title": "Not what I was expecting",
      "text": "This hotel, by walking into the rooms, had a lovely jailhouse decor without the bars.  The room didn't look at all like the pictures in the advertisement.  I felt dirty just being in there.  Definitely not worth the $150+ a night.  The only thing good was the location.  The staff of the hotel couldn't seem to get my reservation straight either.  Initially, I had booked a room for the night of Dec 31st only but then decided to add two days to include the 29th and 30th.  When I didn't get a confirmation for my second booking I contacted the hotel only to find out that they had booked me in for the nights of the 29th and 31st so I now had two nights booked for the 31st.  Not cool.  I had them cancel the second booking on the 31st and book a room for me for the 30th,  When I got to the hotel late at night on the 29th the hotel staff still had no record of a booking for me for the 30th or 31st.  Very disorganized, in my opinion.  I checked out the next morning and booked at a downtown hotel.  Won't stay here again.",
      "rate": 2.0,
      "tripDate": " December 2017"
    },
    {
      "title": "Subpar Stay, Sweet Staff ",
      "text": "Pretty $#!++¥...I'm definitely used to 'other' hotels. I'll just bullet point the issues that occurred:* No air in my room yet somehow there was air conditioning in the hallway...* Restrooms on first floor were out of service the entire time I was there (more than a few days)* No parking when I requested it a day ahead of time* Saw a squirrel eat off of an empty plate on the patio. Can we say rabies plates?* Hair continuously in bathroom after housekeeper cleaned * Hair & stains on towels * Bedding with ink stain* Bugs on wall near non-working air conditioning control* Nasty, crusty stains on chair in room* Bed sheets were low-grade & itchy* Bedding wasn't changed for 2 days, even after requesting numerous time for it to be changed* Room didn't have a safe. That's standard in hotel rooms. First one I've encountered without one.I do believe I've entered 2 star territory & that is not my scene. Definitely got lied to by booking.com...Only thing that was okay? The breakfast, but that was suspect too when I saw one of the staff putting bread & muffins away without gloves. They were just at the front desk handling office supplies. I didn't see hand washing occur inbetween. I was appalled & grossed out. Thank god it was only a place to rest my head & I was out all the time. Ugh...Saving grace? The nice staff. That's about it.",
      "rate": 2.0,
      "tripDate": " May 2014"
    },
    {
      "title": "Low class accommodation in bad end of city",
      "text": "Stayed here for 2 nights after b & b that I was booked at was oversold. I was told by b& b that I would be placed in different hotel but ended up at Isabella. What a major disappointment! Room was as wide as a double bed and tiny nightstand. One tiny window half obstructed by a/c unit. Had to stand on bed to look out window. Bed was hard as a rock with two well worn pillows. The bathroom was so tiny that to get in I had to stand with my back to the sink after entering and open the door past my toes in order to move toward the toilet. A person of size would never get into the bathroom . Relatively clean. Would never ever ever stay here again. Very pleasant desk staff . I am totally surprised by the room photos they show on their site. Stay away unless you want a hostel and not a hotel",
      "rate": 2.0,
      "tripDate": " March 2012"
    },
    {
      "title": "Cheapest in downtown Toronto",
      "text": "We stayed at this hotel because it was the cheapest available within walking distance of downtown Toronto.It was OK for a night, but I am glad it wasn't any longer. The rooms are really dated and tired. The electric wire for the extractor ran along the top of out headboard. The room was over the downstairs cafe, and really smelled of food.On the plus side - the reception area is nice, and we sat outside in the evening for a drink. The free breakfast was OK, a nice thing for a Hotel to offer",
      "rate": 3.0,
      "tripDate": " October 2011"
    },
    {
      "title": "Perfect for travelling students",
      "text": "This hotel was a bargain for travelling students trying to save money, especially in finding a hotel in downtown toronto.  The location seemed fairly safe, however it was a couple of streets from the Gay capital of canada street and a couple of streets away from some former prostitutition street - so if you're homophobic or overly worried/anxious/paranoid type, it might not be the place for you.  The room is very small but we were there to see the city, not to stare at a tv. The staff were friendly and helpful as best as they could. Breakfast is sub par (stale'sh tasting cereal, some muffins, and some red juice, which i'm not sure yet what it was), but hey it was free. Tthe washroom is very clean, i was impressed. The bed sheets seemed clean, the pillow case seemed clean too despite some random spots if you were to examine it very closely.  The main thick blanket however had this weird red'sh/brownsh stain on it, so we just ignored that and put the blanket on the ground and just put up the heating for the night.  Overall it was a bargain, it was clean enough for sleeping over night, but I would mainly suggest this hotel for travelling students.",
      "rate": 3.0,
      "tripDate": " May 2006"
    },
    {
      "title": "Nice and cozy",
      "text": "Not only is the hotel convienetly located and priced accordingly, the service was impecable. I have stayed their twice and both times the room was extremly clean, room service was prompt (extra blanket) and the bar/patio was enjoyable.Overall a great place to stay.",
      "rate": 4.0,
      "tripDate": null
    },
    {
      "title": "business traveller",
      "text": "i would like to say that this hotel has been a god sent for me. i am in the city alot with the starting up of a new business. For the price it has accommadated my needs beyond most other hotels in the area. The staff has been nothing but friendly to me and having stayed there as often as i have they are a big part of my returning. They have provided above and beyond what you would get with a major chain, guided me both with my business and personal stay. Places to eat, how to go to get to where i need to be.The rooms are small but suit my needs well. I personally have never seen a single bug and have now stayed there over 40 times. It is so nice to go into the hotel where they know my name and care about my comfort.",
      "rate": 5.0,
      "tripDate": " October 2005"
    },
    {
      "title": "So many wrongs and only 1 right!",
      "text": "We are currently staying here and as the saying goes \"you get what you pay for\". Toronto is expensive so we were looking at a cheaper option (still expensive compared to other places in Canada) so chose this hotel.It's located quite a distance from downtown and in a not so friendly area. It may be safe but from what we saw walking from the hotel towards Lake Ontario it was ferralville!As for the hotel, housekeeping is pretty much nonexistent. Previous guest's hair all on the floor in the bathroom, mould on/in the shower. There were days when our room wasn't even made up just fresh towels dumped in the bathroom without clearing away the used ones.  Coffee supplies were literally thrown from the door to 'hopefully' land on the bar fridge.Ironically supplied with a bedside light but no PowerPoint to plug it into - so looks good but doesn't work!Very small rooms with a pokie window that has the extremely noisy A/C sticking out of. Slow/nonexistent Internet. Photos attached are AFTER housekeeping have done the room \"apparently\".On the plus side, John who works at Reception was awesome and so friendly and helpful. He was the one who made our stay enjoyable.",
      "rate": 2.0,
      "tripDate": " August 2016"
    },
    {
      "title": "Dirty room, sheets and towels",
      "text": "Dirty room, sheets and towelsThe room had dirty sheets and towels, with stains on.  The carpet had a thick layer of dust at the edges and there was food debris behind the bed.  There was chewing gum stuck to the bedside table.  The shower had black and pink mould in it.  I have never seen anything like it in a hotel (photos uploaded).  The air conditioning did not work (even though it said \"on\") and assuming it is not faulty, perhaps it might be switched off centrally.  The restrooms off the lobby are locked and you have to ask for the key from reception, like in a downtown fast food restaurant or a gas station.  Inside one stall is marked \"out of order\" because it is used as a storage area for housekeeping and maintenance supplies.  The elevator makes a rickety sound and has a light bulb hanging down by a wire from the socket, that made me wonder if it was safe to be in it.On arriving one and a half hours before the 3pm check in time the receptionist said you are too early to check in.  She stated that it is hotel policy that any early check in would incur an extra charge.  There is also a sign on the counter saying any check out after 12pm will be charged for.The included breakfast consisted of cereal, bread, muffins, coffee and orange juice and is eaten in the lobby area. Location wise the hotel is in a primarily residential area.  It is quite far north east of the downtown attractions and the shoreline and you need to use transport unless you like very long walks.I would not recommend this hotel.  The customer service was weak but the dirty sheets and towels were disgusting.",
      "rate": 1.0,
      "tripDate": " October 2015"
    }
  ]
}