{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Jarvis House Bed And Breakfast Inn Downtown Toronto",
    "url": "/Hotel_Review-g155019-d186705-Reviews-Jarvis_House_Bed_And_Breakfast_Inn_Downtown_Toronto-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.0",
      "reviewCount": 63
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "344 Jarvis St",
      "addressLocality": "Toronto",
      "postalCode": "M4Y 2G6",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/01/cf/27/dc/room10.jpg?w=500&h=400&s=1"
  },
  "description": "Jarvis House is one of the most popular B&Bs that offer affordable, comfortable, and immaculately clean accommodation in the heart of Toronto’s business, tourist and entertainment district. All private bathrooms, air-conditioning, color cable TV, free wireless Internet access, and ample on-site parking. Steps to streetcars, subway, and airport transit; an easy walk to dining, shopping, theatres and many major city attractions.",
  "featues": [
    "Parking",
    "Free High Speed Internet (WiFi)",
    "Wifi",
    "Free breakfast",
    "Non-smoking hotel",
    "Air conditioning",
    "Refrigerator",
    "Non-smoking rooms"
  ],
  "reviews": [
    {
      "title": "wouldn't stay here again",
      "text": "We came for one night in Toronto and wanted to be close to downtown attractions.  I selected the Jarvis house over the Internet as it looked funky and boasted the place was immaculate. It is an old row house which is which is capable of being something really amazing.  There is character and interesting alcoves galore.  However, it is dirty and run down and things are broken.  It is most certainly is NOT \"immaculately maintained accommodations\".  It is not completely disgusting but for the price I expected a much nicer place.I would not stay here again, and do not recommend it.",
      "rate": 2.0,
      "tripDate": " October 2011"
    },
    {
      "title": "the landlady made our trip became bad!",
      "text": "we stayed in room 10. The room was very cold. NO HEAT!!! The electricity wires were bad. The electricity were always shut down when we used the TV and dryer at the same time. When we asked the landlady to put back the electricity, she bacame very bad-temper. Her attitute was rude. Their room had the problems but she just blamed us. Ridiculos!",
      "rate": 2.0,
      "tripDate": " December 2012"
    },
    {
      "title": "Very, very friendly, confident, good price-to-value relationship, ...",
      "text": "We (Juliane and Rolf) stayed here for 4 nights.We enjoyed our stay  - especially because of Erika - the \"hostmum\". She is such a kind person, communcative, helpful, einfach klasse.And you can get an unbroken boiled egg, because there is an egg-piercer (Eierpiekser),you know!?Why not 5 stars? As is for all surroundings downtime: it is not really quiet - but you can't have both things (quiet nature and an only ten minutes walk to the central city).We can recommend Erikas hostage.Thank you very much for the unforgetable stay - Erika.Next time Toronto, we will live at yours.JR",
      "rate": 4.0,
      "tripDate": " May 2011"
    },
    {
      "title": "This Place is a RipOff!",
      "text": "Me and my brother stayed here in July. It was overpriced, rundown, and a very small room. $311.00 CD for two nights. It sucked. There are much better Band Bs for a cheaper price in Toronto. Do not stay here!!",
      "rate": 1.0,
      "tripDate": " July 2011"
    },
    {
      "title": "Rip-Off",
      "text": "Pictures posted on the web site are very misleading, the place is a slum.  Exterior and interior is run down, and dirty.  The Owner over billed me, by 2 nights, had to cancell my visa in fear of other charges. Had to look elsewhere, bad surroundings, did not feel safe.Not happy.",
      "rate": 1.0,
      "tripDate": " September 2012"
    },
    {
      "title": "Disappointed with Jarvis House Bed and Breakfast",
      "text": "This property has potential and great location!The pictures of Jarvis House are deceiving sorry to say. I would not stay or recommend this Bed and Breakfast. Note: good idea to check out Trip Advisor as this place needs a good clean, lots of paint and new flooring. When a host mentions they are not familiar with the location of Massey Hall you should question this. Also, when she is in a hurry to be paid before you see the room the red flags should be a warning!!!!!",
      "rate": 1.0,
      "tripDate": " November 2011"
    },
    {
      "title": "Everyone LOVES to be Ripped Off",
      "text": "If you're a little person or a fan of getting ripped off, then this is the European-style hostel for you. Upon arrival, I was informed that the room with a normal human-sized bed I booked wasn't available, but my girlfriend and I were expected to climb 4 flights of stairs to a cramped, former attic-space room with furnishings from the Late-Garage Sale Leftovers Era with 2 tiny twin beds. Being a tall, broad man, I informed the innkeeper that we would not be staying one night in the establishment, since no reasonable accomidation was offered. The slumlord seemed to understand that I couldn't spend my short stay in a tiny room with tiny beds, so I thought our business was done.I discovered the next day that my credit card had been charged the full 3 night rental rate. I returned to Jarvis to confront the innkeeper, where I was informed that the charges would not be reversed, but the room had been rented out in our absence. So, not only did the odd woman get my money, but she suckered someone else into the same trap and received their money, too. If it was about lost revenue, I would have received 2 nights' worth of a refund. It's about ripping people off. DO NOT FALL VICTIM TO THIS SCAM.Booking.com and Priceline seem to think that it's my fault that I can't fit into a twin bed or that I didn't conduct their due diligence prior to my trip and have failed to take action on my behalf. I was offered a credit towards future visits, but, after this, I may never go back to Toronto, much less step foot in this place.",
      "rate": 1.0,
      "tripDate": " August 2011"
    },
    {
      "title": "Skip this B&B",
      "text": "We arrived at the Jarvis House hoping for a nice, relaxing place to stay. We were extremely dissapointed. The house needs new carpet  and a paint job very badly. The TV in our room was tiny and from the 90's. Our shower was so small it was difficult to even move around. I traveled with my parents to Toronto. The Jarvis House said they would be able to accomdoate three people with a sleeper sofa. However, they didn't even provide sheets for the sofa. We had to hunt through a closet to fetch a pillow and comforter. Who knows when the comforter or couch had been cleaned. All we were served for breakfast was eggs, bacon, and toast. This was well below my expectations for a B&B. We were supposed to stay here two nights, but ended up only staying one night.If you're looking for your classic B&B with helpful hosts, who share their home with you, this isn't it. This had much more of a business/hotel atmosphere. I would highly recommend paying more money for a nicer place, because the Jarvis House is well below par. This B&B should definitely be skipped!",
      "rate": 1.0,
      "tripDate": " July 2012"
    },
    {
      "title": "False advertising!",
      "text": "After driving from Chicago, Illinois, we arrived at the Jarvis House in Toronto.  Upon arrival, we observed a home that was in need of much attention.  Yes this is an old house, but as an investment property, one must invest money back into the property to maintain and upgrade it.  This has not been done!  The minimum has been invested into this B&B!  Per the website (http://www.jarvishouse.com/)  they advertise their B&B as \"immaculate housekeeping\" and an \"immaculately maintained accommodations.\"  This couldn't be further from the truth!  I cannot see how other reviewers can recommend this or give it good reviews!!!  We reserved a \"GOLD STAY\" room, the most expensive room.  We arrived early and decided to leave our luggage in the room and explore the city.  As we entered room #11, the bedding was not on the the bed due to the staff preparing the room.  We observed very large stains on the mattress and the pillows were stained as well.  The host said she could remove these stains for us, but this begs the question...why haven't they been removed prior to our complaint!!!  Disgusting!  Please do not stay here unless dirty accommodations are what you're accustomed too!  The photos do not show what is at the heart of this B&B and after our complaint, the Youtube video link on their website has been taken down.  Curious to say the least, but you have been warned!",
      "rate": 1.0,
      "tripDate": " September 2011"
    },
    {
      "title": "Jarvis house is very much overrated",
      "text": "If one stays on the 3rd floor  with no elevator and 2 rather heavy suiutcases plus handluggage that is hard, hard workThe room's furniture  is  very much outdated. The bathroom is very, very small  with a shower that does not work properly and the placement of the toilet is such that I as a man had to sit askew otherwise the door wouldnot close .the breakfast is served in the basement so 3 sets of stairs down and again 3 up.our room was on the Jarvis street an important thruway to get  downtown,  also  busy at NIGHT coupled with  a noisy airconditioner does not make you sleep undisturbed.Last but not least the WiFi connection did work so in order to use my IPad I had to go down to the basement and after use go up again",
      "rate": 1.0,
      "tripDate": " September 2012"
    },
    {
      "title": "Decent place to stay on a budget",
      "text": "This is a decent place to stay if you're on a budget. The house is a bit dingy, but not dirty. Breakfast was decent. If you're someone who only cares about simple, clean accommodations because you're going to be out and about all day -- and you're on a budget -- then I would definitely recommend this place. Location is good too. Public transit system in Toronto is really great, so you can get around anywhere no matter where you were staying. If you're looking for luxury, modern accommodations, you're going to have to fork up a bit more for that. Others on this site who are complaining about the place need to face the facts that it costs A LOT to maintain a high-end, modern upkeep of an old house in one of the most expensive cities in the world. They probably are hipsters who have never been in a third-world country and are used to the Hilton that mommy and daddy paid for, and have a false idea that all places are as such. The house is  old, but it is clean. If you can appreciate that, then you will be fine.",
      "rate": 3.0,
      "tripDate": " August 2011"
    },
    {
      "title": "LOCATION, LOCATION, LOCATION",
      "text": "Yes, as you may have surmised the Downtown location is excellent.   So many inexpensive restaurants to choose from.  Within walking distance to Massey Hall, Eaton Center, CN Tower, Chinatown, Yonge Street, etc. and about one block from the subway.  A $10.00 subway day pass is good for 2 adults.Reason for get-a-way:  To attend The Taste of the Danforth which is the annual Greek Festival.   You must go!   The food was fabulous and each item cost between $3.00 - $5.00, so no excuse not to try everything.The Victorian B & B is 140 years young.  The room itself was very clean and quiet.  Wi-Fi worked well..  You can reserve parking for $10.00 / day.Tip:  Bring your own hairdryer, shampoo, conditioner and lotion.  The Hostess, Erika is very hospitable and more than willing to please any request you may have.  The morning breakfasts were more than adequate and allowed us to chat with people from England, Germany, Mexico, China, Montreal and North Carolina.  My husband left his wallet behind and Erika promptly returned same without hesitation.",
      "rate": 4.0,
      "tripDate": " August 2011"
    },
    {
      "title": "Caution!",
      "text": "We spent four nights at Jarvis House on a recent summer getaway to Toronto.  The good:  Excellent location and unbeatable price (about $115 US per night, including parking, for a room with king bed and adjoining bathroom).  If you're okay climbing two steep, narrow stairways, Room 9 on the third floor was exceptionally quiet as it faces the back and does not share common walls with other guest rooms.  Now the bad:  This is NOT a hotel.  The only staff we ever saw was an inept young man sent over to let us in on a Saturday afternoon.  No maid service, of course, but a handwritten sign pinned to the bedsheet that serves as a door to the basement linen closet admonishes guests NOT to take extra bedding or towels.  It's also NOT a B&B.  Although some other commenters praised the morning coffee, there was no food service offered.  Your first vision upon entering is a filthy, stained carpet on the stairs.  Bring your own soap and shampoo.  The cheap plastic venetian blinds did little to keep out the morning sunshine.  The king bed was lumpy.  Wireless internet was sporadic.  So, if you're not too picky about accommodations, shopping for a bargain in central Toronto, and not planning to spend much time in your room, Jarvis House might be ideal, but we won't stay there again.",
      "rate": 2.0,
      "tripDate": " July 2016"
    },
    {
      "title": "Don't stay here...",
      "text": "Stayed for almost a week... Dec 2013... Wifi reception intermittent, decor dated, freezing cold, breakfast hours inconvenient (like after we left every day) I will not be back... ever.... Convenient location, but that's about the only positive..",
      "rate": 2.0,
      "tripDate": " May 2014"
    },
    {
      "title": "Very friendly and very accommodation",
      "text": "It was my first stay in this B&B lodging. All I expected was a place to sleep, near to all sights of interests and public transportation convenient (bus, streetcar and subway) The hostess received me with a warm welcome and facilitated me the informations I needed. The breakfast was good and just enough to get through the next meal.",
      "rate": 4.0,
      "tripDate": " July 2014"
    },
    {
      "title": "Worst experience on our trip (northeastern U.S. and eastern Canada)",
      "text": "Bad beds, Bathroom for very small people, Establishment skinny, WiFi does work only at the breakfast room in the basement, Breakfast very poor.Way over priced (here was cut back on everything).Actually nothing was good; everything was far below our expectation based on the description on the website 'booking.com'. This was by far our worst experience on our tour of the northeastern U.S. and eastern Canada. Fortunately, we usually had quite good experiences in the price range $ 80-130, but don't trust a establishment if it is offered only on booking.com!",
      "rate": 1.0,
      "tripDate": " May 2014"
    },
    {
      "title": "will not go back",
      "text": "it was an excellent location for our purposes but unfortunately, i would rather pay 10 bucks for a cab rather than stay at this place againdingyoldmaintenance issuesthe room was clean but i can't say that about the common areas. we did not have breakfast so can't comment on that. incredibly poor windows. literally thought the windows were open with the amount of noise coming in from outside. some sort of bar next door and we could hear people talking, never mind the rest of the noise. i was tired so it didn't keep  me up too muchthe bed looked uncomfortable but slept just fine so that was okaybathroom had plenty of hot water in shower but old shower head and poor spray. i did like the tall window, (we were in \"gold\" room on third floor)just so-so and parking was great. but i can't recommend the place.",
      "rate": 3.0,
      "tripDate": " November 2013"
    },
    {
      "title": "the good and the bad",
      "text": "price is right and location is central, the owner is Chinese but speaks Japanese and attracts similar clientele. Carpet is faded and stained but the room is clean. Breakfast not bad in the basement every morning. WILL charge you if you overstay an hour",
      "rate": 3.0,
      "tripDate": " September 2013"
    },
    {
      "title": "A bit of timelessness.",
      "text": "Genuine hospitality, a spotless comfortable room with well appointed ensuite, downtown overnight parking for an unheard-of price... I'll be back. The fact that a bit of patience was required for the hot water to climb its way to the third floor of this wonderful old house only added to the charm! Jarvis House added a very nice change of pace to the downtown experience. Thank you Erika.",
      "rate": 5.0,
      "tripDate": " June 2013"
    },
    {
      "title": "Worth the stay to save some $$ in Toronto",
      "text": "We stayed this past fall in room 3 I believe (larger room on main floor).  Rooms are extremely basic and the showers definitely aren't meant for an above average sized person (teeny tiny stalls!), but for the location, you can't beat the price. We were able to walk absolutely everywhere from here and saved tons on cabs. It's on a fairly busy street with neighbors who like to party late (annoying but she's working on the issue), so if you're looking for peace and quiet, this may not be your place. Great breakfast every day and met some cool world travelers while there!",
      "rate": 4.0,
      "tripDate": " September 2012"
    },
    {
      "title": "More of a Hostel than a B&B",
      "text": "We were very disappointed in the Jarvis House. I have stayed at many B&Bs that were 'old and quaint', this one is just old and run down. The rooms were decently clean but very musty and dingy feeling. Room 11 on the top floor had one window that was so small and the bottom half of it has an old dilapidated a/c in it. I'm sure we could not have gotten out in an emergencyThere was a dirty towel on the floor in the main entry for wiping feet that was never removed or changed while we were there. There were not bathroom toiletries aside from a tiny bar of soap and very small bath towels. The location was good and there was wifi in the rooms but the tvs were about 30 years old and so tiny it was difficult to see them from across the room. They mention in the review that even though it is on a busy street the rome are airtight and very quiet....NOT AT ALL!! Road noise in most of the night in the room at the front of the house and also very noisy in the from at the back of the house.  We did not stay for breakfast as the \"dining room\" was just as dingy. WE saw the lady that runs the house on arrival but then not again, even at check out.    All in all....false advertising really!!",
      "rate": 2.0,
      "tripDate": " October 2014"
    },
    {
      "title": "Bed and barf",
      "text": "Stayed here for five days..  Luckily only spent a small amount of time in the room...  The first night noticed that the room on the third floor was EXTREMELY cold!!  The manager never even turned the heat on..  Had to give us a portable heater to plug in....  Which of course was unsafe to leave turned on while gone all day..  The air conditioner was still in the window and left a draft in the room...  The water took forever to heat up..  At least five minutes or more..  The decor was extremely dated as well..  Don't think it's been upgraded since 1965...  Because we were on the third floor, we had to haul our luggage up three flights of stairs, which was very inconvenient, not to mention tiring... There was no lighting in the staircase and it made it difficult to navigate around.. We were told that our towels and sheets would be changed on the third day..  We did receive new towels however it was on the second day and she came in the room without making us aware..  The towels were as hard as rock by the way, as well as ripped and stained...  Breakfast is served from 8 to 10 and we were not accommodated because we had to leave by 7 every morning...  The wifi sucked large!!!!  The higher up you went the worse it was...  Don't count in it...  The small tv in the room had a remote that wouldn't work...  The bathroom had mold growing  on it as well...  Garbage not changed... Had a ring sitting on the desk and went missing the next day..  The location was the ONLY positive thing about the whole thing..,  would never recommend it to anyone...",
      "rate": 1.0,
      "tripDate": " December 2013"
    },
    {
      "title": "For what it is, it's very good",
      "text": "We wanted to rectify some of the negative comments written on here regarding the owner of Jarvis House. Our experience was nothing but positive, but having said that, we went there expecting nothing but were pleasantly surprised. Erica was friendly, helpful, and never stopped smiling. We stayed in room 3 on the very top floor. It was a steep climb but we didn't mind. The room was clean, bed was comfortable enough, street wasn't too noisy, the brekky was fine (bacon!), and the location is prime. All in all, we would recommend Jarvis House for a few nights. After all, you're only sleeping there, right? Suck it up, buttercup!",
      "rate": 4.0,
      "tripDate": " July 2013"
    },
    {
      "title": "Enjoyed Our Stay",
      "text": "We had the privilege to stay at Jarvis house in early June 2011.  Erika was very friendly to work with and was very accommodating with our requests.  The lodging was much more economical than the hotels in the area and the breakfast was delicious.  It's not the Ritz Carlton, but you get good value for your money, considering the pricing of lodging in downtown Toronto.  I'd recommend this place to anyone looking for affordable accommodations.",
      "rate": 4.0,
      "tripDate": " June 2011"
    },
    {
      "title": "We enjoyed our stay",
      "text": "We enjoyed our stay at Jarvis House bed and breakfast. The new owners are very helpful, and they have a good choice of comfortable rooms with private bathrooms and the place is clean and quiet. It's right downtown and just two blocks from Young street, and if you have a car they have lots of private parking spaces available.",
      "rate": 4.0,
      "tripDate": " May 2011"
    },
    {
      "title": "If it sounds too good to be true...",
      "text": "One of my worst experience ever.  The owner should have the permit revoked.  Don't believe the glowing descriptions on the website nor the pictures you see on line.  Place looks dilapidated from the outside, not welcoming at all.  Our taxi driver did not know where the place was and sort of frowned when he let us out..looking at the facade is a big turn off.  As we were about to walk up the steps a guy walked open the door and started to shake a dusty door mat.  \"Is this the welcoming mat?\"  I thought.  He nonchalantly let us in (I don't think he was a guest, but a tenant, no shirt, unkempt, and peering through his door his room appeared more like an apartment than a b&b room) and said, \"She'll be with you\".  A young Oriental woman, rather timid and obviously without any hospitality experience directed us to leave the luggage and descend a flight of stairs to the ground floor where we gave our credit card and transacted business.  A bill had been drawn that included a charge for parking.  Since we did not have a car, she corrected the information after calling someone and communicating in Mandarin (third red flag, by then we should have just walked out).  The business was transacted in the breakfast room, devoid of charm, with boxes of Cheerios and Cornflakes stacked on a shelf, along with a coffee pot and a toast.  I asked what breakfast consisted of and she said, \"egg, cereal, jam, butter, toast (only two choices:  wheat and white bread)\".  Up to Room 7..no soap or shampoo, a couple of card boards next to the malfunctioning AC to deflect the light from the lamp outside, a creaky bed, a carpet that smelled musty, lack of storage (only a night table with three very small drawers), a closet with only four hangers and a hide away bed which limited the available space for storage..no phone and a tiny bathroom with small shower.  I was disgusted and immediately started to make arrangements to check out..not an easy task on a Sunday evening, particularly during PRIDE week celebration (had I known about this, I would have cancelled which explains why I had a difficult time making reservations back in January).  When taking a shower, I could hardly turn in the stall and had to be careful about hitting my head in the shower caddy.  Slept poorly that night since the moldy smell in the air flared up my allergies.  Next AM during breakfast, the owner asked me how I had spent the night.  I told her about my allergies and she offered to give me another room until Thursday, then back Room 7.  The options were a room in the first floor, with a king size bed (what we originally requested, not the double bed in room 7) or a room on the third floor, long climb of stairs.  Either way, we had to vacate Thursday and move back to room 7..not an option.  Fortunately, I had made arrangements to move to a hotel nearby, forfeiting the remainder of my payment, but it was worth it...I would have been miserable.  Yes, she tried to accommodate me, but she should have been more forthcoming in her description and pictures.  I did not feel safe in the place.  Besides the individual we saw dusting the mat, there was another couple we briefly met for breakfast,  and that was it.   In retrospect,  I should have asked for a refund based on the false advertisement , but I was disgusted..the reservation was cleared about cancellation, but I know that everything is negotiable.  Caveat emptor...wish I had read the reviews on TripAdvisor...live and learn, a rather expensive lesson.  I have stayed in bed and breakfasts before and overall had pleasant experiences, but this is the pits..the only thing worse is a room I rented in Oaxaca for three nights back in 1984, when I was thirty years younger. STAY AWAY FROM THE JARVIS INN!",
      "rate": 1.0,
      "tripDate": " June 2014"
    },
    {
      "title": "The devil's in the details",
      "text": "This victorian B&B needs a lot of TLC to bring the aura of age and neglect back to stately faded beauty and stepping through the front door immediately makes a lie of Jarvis House's immaculately maintained claim.  Climbing the winding staircase to the first floor the first thing you notice are the dirty scuffed walls in dire need of a fresh coat of paint, the second is the worn and stained carpet underfoot. The bedroom itself, while well furnished had issues of its own.  We stayed in a \"gold\" room, more specifically number 9 on the top floor at the back of the house and while the website touts that their windows are airtight thus noiseproof and Erika told us herself it was a quiet room we've found this to be anything but true.   Yes, there wasn't a sound to be heard from the rest of the house however no one told us about the next door neighbors who like to party on their upstairs patio. Loud voices and music kept us awake til 2-3 a.m on both friday and saturday night...in November.The bathroom has no counter space - though there is a shelf along the far wall in the the tub/shower.  The cold faucet needs fixing as there is no set stopping point to stop the flow of water.  Go too far back and it starts up again.   Also, none of the \"romantic lighting\" fixtures and outlets on the wall behind the bed work.  You'll have to find another place to plug in the alarm clock, any other gadgets or find reading light. While the room was spotless and the carpet and paint fresher here than in the common areas the horizontal blinds on the windows with their crooked or broken slats and a mechanism that won't lower them all the way down need replacing. Tucking away a second roll of toilet paper somewhere wouldn't be remiss either.  We ran out on the morning of our departure.   Thankfully we'd brought our own kleenex (a must since there's not a box to be found in the room either)  On the upside, the kind sized bed was extremely comfortable even if not the four poster bed of my dreams seen in the picture on their website.Breakfast has taken a hit since the last two times I've been here. I remember bacon and pancakes offered with the eggs in the little dining room tucked away downstairs, along with the make yourself toast and cereal.  This time around all we were offered were fruit and eggs.Though our host Erika was warm and welcoming and nothing beats the central location in the heart of downtown, a subway station two blocks away or the charm of Cabbagetown with all of its shops and restaurants, the next time we visit T.O we'll have to seriously question if all the other irritations make it a worthy trade-off, good price or not.",
      "rate": 3.0,
      "tripDate": " November 2013"
    },
    {
      "title": "A lovely stay",
      "text": "I was very happy indeed to stay at the Jarvis House, where I was welcomed warmly by Erika. My room was handsome and comfortable, and I enjoyed exploring the rich and colourful neighbourhood in which the house is located. The breakfast was simple and tasty, and Erika happily accommodated my dietary needs. I recommend the Jarvis House very highly.",
      "rate": 4.0,
      "tripDate": " December 2012"
    },
    {
      "title": "Very disappointed!",
      "text": "It is hard for me to review this B&B as my husband 'didn't mind it', while I was very unhappy with my choice to stay at Jarvis House. The photos of the outside of the building are very misleading-the building glows in sunlight ,whereas in reality it is grey and drab. I had booked a certain room only to arrive and be given another room. While this room was at the back and quiet you had to walk through the bathroom to reach the very cramped bedrooom.The pillows were like rocks so I had no sleep in this 'quiet' room.We were charged $10.00 more than the rate quoted and were told that the extra fee was for parking.It would have been helpful to have had this knowledge beforehand so we would have been prepared NOT surprised by the charge. The down stairs dining area is accessed through the 'laundry' where you need to be careful not to trip over the mounds of waiting washing. Was there a plus at all? Well it is within walking distance of the shops and Downtown restaurants.",
      "rate": 2.0,
      "tripDate": " October 2012"
    },
    {
      "title": "A budget accommodation that is a mixed bag -- you get what you pay for",
      "text": "I have very mixed feelings about this place. We had a great deal of difficulty lining up budget accommodations in the placed featured in guide books (I had not understood before I arrived that what we celebrate as Columbus Day in the US is the Canadian Thanksgiving), so I took a chance on this place despite the unpleasant one-star review above.  My bottom line reaction is that this is a budget accommodation and, for a budget accommodation, it is OK although not great.  You have to know what you are getting into.Physically, this place is a bit faded. Narrow unpleasant corridors, unpainted sections on some walls, cracks in the sink.  The rooms vary greatly in size — we were told that the room we had reserved was small, and when we looked it was, but we were offered a much larger room and we took it. Our room itself was fine, the bed was comfortable, although the bathroom was poorly stocked with no shampoo (I always travel with some, just in case) and the bar of soap was minuscule.  The hotel’s web site site advertised that even the front rooms facing Jarvis Street are noise-free because of the way the windows are made – this was decidedly not the case, but the weekend noise at least did not bother us. Closing the bathroom window  helped on the noise frontThe room comes with a full breakfast, served in somewhat cramped room in the lower level – the host makes eggs in the manner of a guest’s choice, along with some fresh fruit and two strips of bacon.  There are also two kinds of bread that can be toasted, and cold cereal with milk.  Breakfast was a mixed bag like everything else – if you use the toaster and the machine for heating water of tea at the same time, a fuse blows.  And on the second day of our stay the hotel ran out of milk (only half way through the breakfast period) and although our host said she could go out to get more milk it sounded as if it would take sometime, so we passed.  The computer provided for guests prints out in the host’s sitting area, and in any event the computer was unusable because the shelf that holds the keyboard and mouse was stuck inside the table; and the computer was so old that there was, apparently, no bus port of the front end.  But showing the other side of this place, the host then took the thumb drive onto which I had downloaded the PDF of my boarding pass the night before and went to her own home nearby to print it out.",
      "rate": 3.0,
      "tripDate": " October 2012"
    }
  ]
}