{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "JJ Furnished Apartments & Private Suites Toronto",
    "url": "/Hotel_Review-g155019-d2046338-Reviews-JJ_Furnished_Apartments_Private_Suites_Toronto-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.5",
      "reviewCount": 14
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "80 John St",
      "addressLocality": "Toronto",
      "postalCode": "M5V 3X4",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/05/20/82/1c/jj-furnished-rentals.jpg?w=500&h=-1&s=1"
  },
  "description": "PROPERTY DETAILS: Less than 5 minutes’ walk from the CN Tower and Metro Toronto Convention Centre, JJ Toronto Suites Canada features a rooftop fitness centre, hot tub and sauna. This elegant condo offers a huge private terrace. The modern two-bedroom + Study, include a fully equipped kitchen. We have a desktop computer/monitor, with personal fax/printer/copier flat-screen TV, Blu-ray player and free Wi-Fi. This apartment has 2 bathrooms and laundry facilities. Guests at JJ Toronto Suites, Canada can enjoy free fine dining for two and free basic groceries upon request. They can also use the rooftop barbecue facilities. The Princess of Wales Theatre is across the road and Rogers Centre & CBC Tour Experience are within the same block walk from this conveniently located apartment. The Art Gallery of Ontario is 10 minutes walk away. Dedicated Parking is free on site. PROPERTY FEATURES: Approx 1200 sq ft of living space with 5 Star luxury offering State of the Art Rooftop Amenities on the 10th & 11th floor. With In Suite Business Desk & 24 Hr Security/Concierge, Whirlpool & Sauna Bath, Billiards Room/Pool Table/Game Room- Bar on 10th floor, Butler Service & Private Chef is also available on request, Catering Available on request, Storage locker Included, Swimming Pool, Waterfall from roof to Ceiling, His & Hers Saunas. FESTIVAL TOWER Rising 41 floors above Festival Tower's Bell Light Box International Film Festival five-story podium at King and John in the heart of Toronto's Entertainment District. The Festival Tower Condos are unrivaled in the Toronto Condo market and is destined to be downtown's hottest, hippest address.",
  "featues": [
    "Free parking",
    "Free High Speed Internet (WiFi)",
    "Pool",
    "Fitness Center with Gym / Workout Room",
    "Bar / lounge",
    "Beach",
    "Children Activities (Kid / Family Friendly)",
    "Pets Allowed ( Dog / Pet Friendly )",
    "Wifi",
    "Hot tub",
    "Restaurant",
    "Business Center with Internet Access",
    "Spa",
    "Concierge",
    "Executive lounge access",
    "Non-smoking hotel",
    "Clothes dryer",
    "Dry cleaning",
    "Self-serve laundry",
    "Washing machine",
    "Soundproof rooms",
    "Bathrobes",
    "Air conditioning",
    "Desk",
    "Room service",
    "Kitchenette",
    "iPod docking station",
    "Whirlpool bathtub",
    "Safe",
    "Seating area",
    "Telephone",
    "Iron",
    "Wake-up service / alarm clock",
    "Dishwasher",
    "Microwave",
    "Minibar",
    "Refrigerator",
    "Kitchenware",
    "Complimentary toiletries",
    "Hair dryer",
    "Non-smoking rooms",
    "Suites",
    "Family rooms"
  ],
  "reviews": [
    {
      "title": "Great Spor",
      "text": "I stayed here for 4 nights whilst attending a trade show in town. Very comfortable place for sure, extremely good location for what I needed and good value for money also. I would recommend this place to anyone.",
      "rate": 4.0,
      "tripDate": " May 2019"
    },
    {
      "title": "Toronto!",
      "text": "Decided to go for a rental due to the facilities (kitchen - 2 full baths - wi-fi - office area - tv in each room) when travelling with teenagers. Proximity to Rogers Center ammenities and attractions. Apartment facilities made us feel right at home. Thanks!",
      "rate": 4.0,
      "tripDate": " June 2015"
    },
    {
      "title": "Worst experience in 26 years!!!!",
      "text": "I want to say that for the most part, our communication with Kathy, Peter, and Jerry was cordial, but the place was not anywhere ready to be occupied!!!!!My family and I (4 people) were met by Peter and Jerry. We went to room 607. WARNING: DO NOT STAY HERE!!! It seemed ok when we walked in, but it felt a little dated for what we were paying.The first night, I called Kathy to let her know that there was no extra toilet paper outside of 1 roll in each bathroom. There was no kleenex. There was shampoo for 1 shower, not 2. There was body wash for 1 bathrrom, not 2. She said, \"someone will bring some by tomorrow. \" Someone did the next day. That should have been a warning!!!The master bedroom had no clock. The bathroom sink in the master had a toothpaste cap in the drain, (see picture).The kitchen and most of the apartment had a very inexpensive dated tile. In the kitchen, the flooring was cracked. (See picture) There was no garbage disposal or ice maker. Instead, there were ancient plastic ice trays you had to fill with water. The sofa looked like a nice leather sofa, but it had some lumps and was extremely uncomfortable to sit on. Some of the furniture was scratched or nicked (see picture). The pillows were flat and horrible to sleep on. The sheets were mismatched!!!!We were gone most of the next day. That evening, we tried to watch tv. Peter had given me verbal instructions when we had arrived for the workings of it, but there were 3 remotes, and he was not specific about their use. I CALLED AGAIN to get directions. I had to figure it out later. Then the dvd player did not work. My daughter took a look, and there was no cable connecting the tv to the dvd player. So I CALLED AGAIN and AGAIN. Finally, my daughter located the cable in the closet!! Why were they not connected? They had no clue the cables were in the closet. So we figured it out ourselves.The next morning, I tried to turn the lights on and they did not work. So I CALLED AGAIN. (ALL OF THESE CALLS ARE EXPENSIVE AS THEY WERE ASSESSED ROAMING CHARGES ON MY CELL PHONE). Kathy thought it was the circuit breaker, but as it turned out, there was a central control switch near the front door that no one told me about. A couple of days later, I figured we had better check to make sure the computer worked and printed, as we would need boarding passes the next day. Well, you guessed it. It could not connect to the internet. So I CALLED AGAIN. Jerry said he would over in an hour to fix it. He tried, but failed. He said he would have his tech guy out the next morning to fix the problem. Shortly after he left, we lost our wifi!!! I CALLED AGAIN. Kathy said that Jerry had just left to go out n of town!!! She said she would try to reach him and would call me back. She did not call, so I CALLED AGAIN. Kathy said, \"our tech guy will be by in the morning.\" Yet she did not apologize for not calling.The tech guy came at about 11:30, and he was great. He not only got the computer working and the printer printing, but he fixed the tvs in the bedrooms, as they needed different connections!!!! That was not even his job!!! It turned out that there was an UNMARKED switch for the wifi. We must have turned it off accidentally, trying to see what switch did what. Why is there even a switch for the wifi? All in all, I had called over a dozen times!!!!We have taken between 4 and 6 vacations every year for the last 26 years. Nothing has ever approached this fiasco!!  It was evident that it was a purely amateurish approach compounded by a complete lack of awareness of customer needs.",
      "rate": 1.0,
      "tripDate": " June 2016"
    },
    {
      "title": "Exceptional",
      "text": "Kathy met me at the entrance of the building at 80 John St in the heart of the entertainment district. She was perplexed by our need to keep our road bikes in the apartment, not locked to the bike racks in the bowels of the public section of the garage below ground.At first she resisted thinking these are just bicycles, not $10,000 titanium road bikes that travel the world with us. Once I explained that in less than a few hours the bike frames would remain locked to the racks, but the expensive components would be long gone. Instead of the the usual \"there's is really nothing we can do\", she was quite the opposite. She said, let's put them back in the car and take them up in the garage elevator.The 2br apartment was on the 38th floor with a breathtaking view of CN Tower and the lakefront. The amenities were all top of line, Miele appliances and waterfall showers. A huge and glorious outdoor space with seating for 12 overlooking the spectacular scenery.I would highly recommend them as a hotel alternative, particularly for 2 couples or a family of 4-6. It's pricey, but when you consider the hotel equivalent, it is a bargain.Thanks to the JJS family. We shall return.Daniel MooreJune 22, 2015",
      "rate": 5.0,
      "tripDate": " June 2015"
    },
    {
      "title": "Great stay in a lovely apartment",
      "text": "We stayed in Toronto for 6 nights in the suite located in the DNA building on King Street.  As stated in the description, all the amenities were included.  Kathy was the perfect host and made sure that everything was restocked if something was missing.  The apartment was clean, the WiFi fast and stable and parking was included.  A dinner for two at Dhaba was included and it was probably one of the best Indian meals we have ever had.  A late checkout was requested and catered for.  To be honest we could not ask for anything more.  We would definitely stay here again.",
      "rate": 5.0,
      "tripDate": " December 2013"
    },
    {
      "title": "Cancelled By The Owners at the 11th Hour - Buyers Beware!",
      "text": "We booked JJ Furnished Apartments and Suites through Booking.com and were subsequently contacted by one of their representatives, a lady called Kathy, one of the JJ Team, to confirm our stay and finalise arrangements. We had booked months in advance to guarantee this particular accommodation. Then at the 11th hour we got an e-mail from Kathy and the JJ Team saying we could no longer have the apartment we had booked. The reason, she said was that the furnished suite that we had booked was no longer available for booking as per new building condo by-laws regulations that had been set forth by the building's management board and team this year with immediate effect.When I contacted Booking.com they told me that they had not been informed of this cancellation by JJ Furnished Apartments and Suites and my booking was still showing as confirmed on their system.My feeling is that no owner is going to leave expensive apartments empty and losing revenue in a big city like Toronto. I suspect that they just got a better offer outside of Booking.com.Anyway, Buyers Beware! If you book with JJ Furnished Apartments & Private Luxury Suites, Toronto (JJ Sembhi & Family), they might just let you down, too!Footnote: I am shocked that the JJ Team would tell such barefaced lies. It’s a shame that there are companies in this day and age that think they can treat their customers like this and get away with it. With hindsight, I think we had a lucky escape. Booking dates: Friday, July 29th 2016 to Friday, 5th August 2016. Booking Confirmation Number: 326.261.915.",
      "rate": 1.0,
      "tripDate": " July 2016"
    },
    {
      "title": "Terrible",
      "text": "Owner was aggressive and offensive - yelling on the phone when I was concerned about checking into the room early (after I had emailed and called). It got to the point where I felt very uncomfortable. As another heads up, the cancellation policy is pretty strict (which is their right - I should have read the fine print more closely), but this made it impossible for me to book another accommodation after being made to feel so unwelcome. I travel quite a bit for business and try to give people the benefit of the doubt. This experience was pretty bad.",
      "rate": 1.0,
      "tripDate": " May 2017"
    },
    {
      "title": "TERRIBLE - not a hotel ",
      "text": "This is not a hotel and the customer service is awful. The head \"owner\" was offensive and aggressive on the phone. As a woman traveling alone on business, he made me feel very uncomfortable on the phone with his tone and his words. Never write reviews but felt this was a bit crazy so wanted to warn others.",
      "rate": 1.0,
      "tripDate": " May 2017"
    },
    {
      "title": "Best choice to stay in Toronto for family or group friends",
      "text": "We stayed in this apartment for 5 nights 6 days in last October. We feel like at home for the whole stays.  The location is perfect which is in the heart of city. From the balcony, we can see the CN Tower is in front of us. There are many groceries stores near by, with the kitchen facilities in apartment, we cooked a great foods and so happy to enjoy the city at night from the room. Our children are more than happy with the pool in building, the TV channels and also the iMac ;-))) The most impressive to us is Kathy. She gave us a warm welcome and brief us very detail on the house rule, specially, she came to the children and ask them to take care of the fragile stuff in the apartment. They took her words. She assists us anytime we need help. The whole group is very very happy with time here. From now on, anytime we travel to Toronto, we stay with this service. We love you, Kathy.",
      "rate": 5.0,
      "tripDate": " October 2014"
    },
    {
      "title": "Home away from home",
      "text": "We were coming to the GTA area to visit family and friends. We decided to spend a few days in the city and found this unit thru Booking.comSoacious one bedroom with laundry facilities right on the King Street car line. Easy walking distance to the theatre district or subway. Loads of great restaurants in easy distance, plus a full market across the streetComplimentary parking if like us you have a rental carKathy was our host, met us promptly at the agreed upon time and gave us an overview of how everything worked and mobile number to reach her if needed. Really lovely serviceWe didn’t use any of the facilities like the gym or roof top terrace but hope to come back another timeReasonable pricing for what you receive",
      "rate": 5.0,
      "tripDate": " October 2018"
    },
    {
      "title": "first class",
      "text": "beautiful apartment twenty minutes walk from CN tower.well situated near Queen st west streetcar  on mainstreet yet not noisy in evening, lovely supermarket across the street will certainly stay again.",
      "rate": 5.0,
      "tripDate": " May 2018"
    },
    {
      "title": "Stay away",
      "text": "This is the worst place I stayed on my 3 week through Canada.Let us start with the good points: location is very good: with the tram stopping right at the door, you are minutes away from the restaurant row and from downtown Toronto.The WiFI is very good.All the rest is poor.First of all : the  apartment is located in a residential building, so no facilities and no assistance. It is actually a duplex, so you have to climb a flight of stairs to get to the bedroom and bathroom. With a few suitcases as a senior not easy. It is certainly not accessible for people with reduced mobility.The bed was not a King bed, although the publicity leads to believe it is.The pull out sofa for the third person is not a pull out, you are just sleeping on the sofa!When we tried to \" make up\" the sofa we couldn't find linen. We found however wet linen , with even  t shirts, in the kitchen closet where the linen was supposed to be!!!I phoned, had to wait one hour to get it fixed, and the responsible was very rude!It is supposed to be a Executive Suite, Luxury; Reality is that the furniture is degraded, the living area very small.For the amount of money they charge this is really bad.  Since they make you pay in advance, you are stuck once you arrive.",
      "rate": 1.0,
      "tripDate": " July 2017"
    },
    {
      "title": "Stayed 3 Months in JJ One Bed Room Apartment Excellent Service, and Very Friendly",
      "text": "My wife and I stayed 3 months in JJ One Bed Room Apartment Excellent Service, Very Friendly, Location is Great, Fast Wifi, Fully Equipped Kitchen, close to supermarket, Starbucks downstairs, Tim Hortons on the other side, Commitment and Flexibility from day one. Simple we felt we are home.",
      "rate": 5.0,
      "tripDate": " April 2017"
    }
  ]
}