{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Kaisar Guest House",
    "url": "/Hotel_Review-g155019-d2075005-Reviews-Kaisar_Guest_House-Toronto_Ontario.html",
    "priceRange": "$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.0",
      "reviewCount": 41
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "372A College St",
      "addressLocality": "Toronto",
      "postalCode": "M5T 2N9",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/1a/b5/ee/d2/caption.jpg?w=500&h=400&s=1"
  },
  "description": "See why so many travelers make Kaisar Guest House their guest house of choice when visiting Toronto. Providing an ideal mix of value, comfort and convenience, it offers a budget friendly setting with an array of amenities designed for travelers like you. Close to some of Toronto's most popular landmarks, such as Rogers Centre (1.3 mi) and CN Tower (1.4 mi), Kaisar Guest House is a great destination for tourists. The guest house features baggage storage, and you can stay connected during your stay as Kaisar Guest House offers guests free wifi. For guests with a vehicle, there is paid public parking available nearby. When you’re feeling hungry, be sure to check out Harbour Sixty Steakhouse, Kost, and Rodney's Oyster House, which are some seafood restaurants that are popular with locals and out-of-towners alike. If you’re looking for things to do, you can check out Graffiti Alley (0.7 mi), Kensington Market and Spadina Avenue (0.2 mi), or The AGO, Art Gallery of Ontario (0.7 mi), which are popular attractions amongst tourists, and they are all within walking distance. At Kaisar Guest House, your comfort and satisfaction come first, and they look forward to welcoming you to Toronto.",
  "featues": [
    "Paid public parking nearby",
    "Street parking",
    "Free High Speed Internet (WiFi)",
    "Baggage storage",
    "Non-smoking hotel",
    "Private check-in / check-out",
    "Laundry service",
    "Self-serve laundry",
    "Wifi",
    "Shared bathroom",
    "Shared kitchen",
    "First aid kit",
    "Air conditioning",
    "Desk",
    "Dining area",
    "Iron",
    "Wake-up service / alarm clock",
    "Kitchenette",
    "Walk-in shower",
    "Hair dryer",
    "Non-smoking rooms"
  ],
  "reviews": [
    {
      "title": "Clean host, parking spot, safe but don't take room 10 ever, you won't get any sleep.",
      "text": "You won't get any sleep because that room has too much noise around. I barely had any sleep until 2am.I had to complain at midnight and tell them that.Beside that, room had no TV or a working clock (needs a battery).Not a deal breaker, but if you want to sleep \"DONT \" let them give you room 10. Ever,It's close to entrance so too much noise.No issues with safety or cleanliness.Affordable price for sure.",
      "rate": 3.0,
      "tripDate": " December 2022"
    },
    {
      "title": "Excellent place to stay in Toronto on a budget",
      "text": "Kaisar Guest House is a centrally located hostel in Toronto. We paid $65/night + taxes when major hotels were asking 10 times that amount a night. Someone here says it's a rip-off - well, it is a market economy, and I would have gladly paid $150 a night for a regular hotel but that was not available. So, it is a hostel, not a hotel - no doubt. Our 2 person bedroom was windowless, and little more than a bed in it. But it was clean, bath and toilet access, and allowed us to stay in Toronto walking distance to Chinatown and the ROM, the Royal Ontario Museum, and the University. It also has free internet. Some online reviews mention it is own by a Japanese couple. That is not true. The owner is Indian or Pakistani, but a Japanese women is currently helping guests check in etc. - she is actually a guest who works in exchange for free stay - and the owner speaks Japanese. Someone else mentioned Karaoke - not now, our room was completely quiet.The one drawback is parking. I got a $30 ticket for parking overnight in the area which said \"Parking 1 hour 10 am to 7 pm\" - which I thought meant 7 pm - 10 am is free - it obviously is not, and it is hard to figure out to pay the ticket if you can't write a Canadian check. But there is an easily accessed parking lot across the street a little closer to Spadina Ave which charges $5 a night and $7 a day, and works fine. Highly recommend parking there if booking Kaisar.",
      "rate": 3.0,
      "tripDate": " March 2013"
    },
    {
      "title": "Quiet, clean and comfortable",
      "text": "I stayed here for 2 nights, very comfortably.  The Guest House is clean and quiet.  A good place to rest.  The rooms are quite small and bathrooms are shared and tiny, but functional. The establishment is within easy walking distance of the University of Toronto, restaurants and eateries.  Public transport is a step away.",
      "rate": 4.0,
      "tripDate": " February 2018"
    },
    {
      "title": "DO NOT STAY",
      "text": "first problem... I payed for 3 day of parking... on the third day after moving my car, the designated spot was gone.2nd problem, the only heating in the room was a heated rug.3rd problem, not good value!4th problem... not clean bedding.I regret staying there, i should have payed extra and stayed somewhere else!STAY AWAY!!",
      "rate": 1.0,
      "tripDate": " July 2014"
    },
    {
      "title": "Good locatuon but...",
      "text": "Via email they changed our booking we made via booking.com, so we had a room with shared bathroom. When we checked in, there was a girl at the reception that spoke really poor english. She would charge us the price for a room with private bathroom and it took her a while and a phone call to correct it. Finding our way through the maze-like house, there was a really steep staircaise we had to carry our bags up. The room and bathroom was very small and the bathroom did not look clean at our arrival and it obviously did not get cleaned during our stay. They have 2 parking lots (10cad per day) but they were not available for us so we used the public parking down the street which costed us all in all less. The wifi wasn't working when we arrived and there was nobody to be found at the front desk. A day later, we found ozt that they gave us the wrong password... The location is good, right in little italy and loads of restaurants close by. So, if you're looking for a place to sleep, i guess you would be ok but do not expect more.",
      "rate": 2.0,
      "tripDate": " July 2014"
    },
    {
      "title": "Cheap, clean, friendly, but ugly!",
      "text": "I stayed there for one night in the cheapest room they have (single with shared bathroom, the bed was a double). It was relatively cheap, actually for less I found another b&b (sweetheart) that is amazing for location, quality of the rooms, of the house, of the service, of the washrooms, of the kitchen, of the living room, everything! Kaisar was just ok for one night, the room was nice enough, everything was clean, the people kind, but the house is really ugly, the entrance and the washrooms are awful (but clean). It's like a labyrinth. It was ok, I have no complains, but I will never go back.",
      "rate": 3.0,
      "tripDate": " April 2014"
    },
    {
      "title": "convenient and clean",
      "text": "This guest house location is pretty good, close to Kensington market and there is the street car No. 506 runs on the front door. The building is renovated from the old house and rebuilt the separated small room for the guests. The room is tiny but good maintenance.  It depends on how long you want to stay. If you are Japanese people, this place is perfect. If you are not Japanese, staying short term is better. I am not a Japanese person. I was staying for four months. The first couple months were good, restful and clean, but when they change the keeping team, all the things  were changed. Japanese party almost every other night, in particular, Friday and Saturday, and you can't spend the time for cooking because they occupied the kitchen. All the utensils were used and washed after they finished the party so you have to wait until after midnight for cooking in some nights. The room walls are so thin. When I was there, I had been learnt by listening Japanese lady called back home after midnight every day for couple months until I felt unbearable. Afterwards, around 1:00 am in one night,  I went out to knock her door and said I want to sleep after that the horrible sound was away. I think many of Japanese people at here. They don't respect other people right. Anyway, they live at this guest house before me and still staying after I signed off.",
      "rate": 3.0,
      "tripDate": " January 2012"
    },
    {
      "title": "Guest House terrors",
      "text": "I booked 2 room's Dec/02 at this guest house for Dec/31 the owner took the full amount of my credit card Dec/16, When we got to Kaisar guest house Dec/31 to check in a lady that works there asked for my card so I give it to her thinking she was checking to make sure it was correct.. Well she had it I got a call from the credit card company asking if I had my card on me because kaisar guest house was taking another payment.. So I asked what was taking so long in she said the my credit card company declined the transaction I told her that the guest house got there money I even call the edit card company to let them tell her all she could say was come back tomorrow.",
      "rate": 1.0,
      "tripDate": " January 2016"
    },
    {
      "title": "terrible",
      "text": "Horrible place ! soooo sketchy! and the price is not cheap, there are very good B&B around that area that has very good price. No guide, just a young guy who knew nothing about the place. I felt ripped off. dont go there!!",
      "rate": 1.0,
      "tripDate": " July 2012"
    },
    {
      "title": "Very clean, quiet and great location",
      "text": "When I first arrived, I was sort of skeptical because the entrance was a black metal gate with a slightly uneven cement/concrete walkway, sandwiched between 2 buildings. However, my perspective changed gradually as I was warmly guided straight in (after passing several doors) to the guest house by the owner. The service was excellent, compared to the rude service dished out by snobby staff at certain boutique hotels that I stayed in while visiting Toronto previously. I booked a single room the night before and was upgraded to a double at no extra cost. The room was quiet and extremely clean. There was no carpeting (wood flooring) so no lingering foul odors, horrible-looking stains or nasty carpet beetles. Guests were requested to wear indoor sandals provided after entering the guest house and in the rooms. As a common practice of my own, I brought mine (light-colored ones) and they looked clean on the last day. The location was great because it was walking distance to Kensington Market, Little Italy and Chinatown. The room was a good size, with the exception of the bathroom. There was no bathtub (shower only) and I have to step in slightly to close the bathroom door. I didn't use the kitchen or the shared washrooms so no comments there. Excellent stay for $70 per night if you don't mind the smaller bathroom.",
      "rate": 4.0,
      "tripDate": " June 2011"
    },
    {
      "title": "Ok for 1-2 nights",
      "text": "We had a room with a shared bathroom but luckily we were in the part of the house where there are only two rooms. One was a single and the other was a double which we has. The room was clean but the bathroom not really. It can't have been cleaned for a long time because there were a lot of hair in the shower, on the floor and in the sink. The airconditioner didn't work but Kaisar gave us a fan which we were very glad about because it was very hot and stuffy in the room. There was a window but the walls are so high you don't stand a chance to open up the window.The kitchen was disgusting. On our first night we got some frozen pizza to put in the oven and the first one didn't work (after we cleaned it for about half an hour) and then we went into the big kitchen downstairs. That one was ok. We were really glad we use the cardbox of the pizzas as plates because while we were eating a couple came into the kitchen and while she was drinking some water out of a glass she realised there was mold in it! If you have a kitchen, please clean it!!!There is public parking in bellevue avenue and it costs $12 from 7am-6pm and $3 from 6pm-7am.",
      "rate": 3.0,
      "tripDate": " June 2013"
    },
    {
      "title": "Great room at a great price",
      "text": "This isn't your average corporate hotel and that's a good thing.  The staff was friendly and the room was large and exceptionally clean.  We stayed in a private room with bathroom so can't comment on the shared accommodations, but compared to the photos and reviews of the other places in the price range, the Kaisar Guest House was a dream come true.  We'll definitely be staying here again.",
      "rate": 5.0,
      "tripDate": " May 2013"
    },
    {
      "title": "Very clean and well maintained.",
      "text": "The rooms are quite good actually, though not very sound-proof but well insulated. The staff are friendly. It also has a kitchen where you can cook. It actually feels more like a student dormitory than a hotel, but in a good way. Location is OK because plenty of places to eat on College Street, and the 506 tram stops just outside which easily takes you to downtown (change metro at Queens Park). However if you are going to the airport you need to change transport a few times.",
      "rate": 4.0,
      "tripDate": " October 2012"
    },
    {
      "title": "Not recommandabel ",
      "text": "Low quality  accommodation. central location but small room, thin walls, everything very basic (poor), expensive for what you get, high cost for parking. Hard to find the entrance by the way. Shabby place",
      "rate": 2.0,
      "tripDate": " September 2018"
    },
    {
      "title": "Exterior is scary at night, very basic but clean",
      "text": "We arrived around 930PM and the exterior was scary and hard to find. There were people lounging around the sidewalk and the wrought iron grill entrance protecting the entry to the Kaisar did not add to the atmosphere. Two other groups arrived immediately and we were all checked in together.It was confusing as we were to remove shoes at the door where they provided a variety of clog type footwear. The corridors were very narrow and included stairs up and down with luggage before we got to the office.  I was not always sure the person checking us in understood what we were saying although she was very pleasant. The room (11) had 14 foot ceilings and there were two windows at the very top, totally unreachable if you ever needed emergency egress. The place would be a disaster in a fire. The room and shower looked clean but the bed had palpable springs and the bedding was so heavy you could hardly turn over. What ever it was was enclosed in a duvet cover and we did not want to look to see what it was. The pillow was so bad it was like a rolled up blanket put into a pillow case. Since there was no clock we were trusting our phone but for some reason it did not reach a tower and the time was incorrect so we rose at 530 am and left. On the good side it was relatively quiet and it was very close to the Toronto Western Hospital where we had an appointment very early in the am. The street was quiet and clean then with none of the atmosphere of the evening before. We had friends deliver us from the airport and they hated to leave us at that place. I do believe some rooms are perhaps better given the windows apparent in the site photos. The site is close to numerous eateries and China town (10 min walk), Kensington Market(5-7 min walk), hospital 5 minutes walk. Would I stay there again ? Perhaps if desperate, the risk of fire was most scary and I now understand why they got you to sign a full page legal waiver that you would not smoke.",
      "rate": 3.0,
      "tripDate": " September 2015"
    },
    {
      "title": "Good for price",
      "text": "A very last minute booking but it was a good stay! The front entrance seemed a little sketchy but it was nice on the inside. The staff was very nice and welcoming. The room was pretty large but remember it's not a 5-star hotel. Good location in the city! We walked to the Rogers Centre (about 1.5 miles) but it was a nice walk. They have parking but we didn't know about it until we had already parked down the street in a parking lot.",
      "rate": 4.0,
      "tripDate": " October 2015"
    },
    {
      "title": "March Stay",
      "text": "Located in a great location near public transport & places to eat, staff were pleasant & helpful especially the manager who advised/arranged places to see and how to save money on these. Check It Out.",
      "rate": 5.0,
      "tripDate": " March 2014"
    },
    {
      "title": "Solo AND couple travel: My new home away from home in Toronto",
      "text": "I love the Kaisar guest house. I came in Feb. 2013, and again for my visit this past Christmas. This is my home away from home in Torontoland.It feels very homey, and that's exactly what I wanted in my trip. It's very quiet, and very comfortable. A lot of the people here stay long-term (many are taking ESL courses), and they rent out a few of the rooms on a night-by-night basis. The residents/guests take such good care of this property. You won't find dishes in the sink, and everything goes magically quiet at 11 pm.Most of the people here are in their late teens, 20s or 30s. But, they're not the typical hostel crowd. Because this is \"home\" for many people, they don't trash their home. If you're looking for a place to throw noisy annoying parties, don't stay here.One night, I had a friend come into my room, and we drank a bit...and, we were loud. But, nobody complained. I am sure that type of thing is OK (as long as you're not unreasonable - the rooms are pretty sound-proof), but don't have 10 people over. It's not that type of place.This is also not somewhere to make friends, really, unless you speak Japanese. I've never been invited to join a dinner, or whatever, like I have in other hostels but I am sure I would be if I asked.Staying here is more like getting a room (filled with very respectful and friendly roommates) in a house than a hostel. And, being \"home\" while I came to my home town was what I wanted.I love you, Kaisar Guest House! See you next time. :)I'll never stay anywhere else. Unless, that is, I get rich, and can stay in a 5-star hotel. Even then, this hotel meets all of my needs.Clean, friendly and homey. But, bring slippers. No shoes allowed inside!",
      "rate": 5.0,
      "tripDate": " December 2013"
    },
    {
      "title": "Nice place to stay for a few nights",
      "text": "A great location, just off of College/Spadina, a stones throw from kensington market and chinatown. I stayed here last summer prior to moving into my new house. The owner was very friendly and helpful. The room was clean and spacious enough. I shared a bathroom with another room however I never saw the people, and never had to wait to use it. The bathroom was fairly clean although obviously wearing flip flops is a must. It is cheap and cheerful and good value for the money.",
      "rate": 4.0,
      "tripDate": " August 2013"
    },
    {
      "title": "Not for the squeamish, great location if you love Chinatown",
      "text": "This hotel is relatively inexpensive and in a good area near Spadina Avenue (except that it is directly across from a fire station, with sirens going off all night). This is Toronto's Chinatown, and there are a lot of great restaurants and shops. There are also many streetcars on Spadina to take you all over the city. The downside is the cleanliness. Ironically, they demand that you remove your shoes inside the house, but the floors are filthy! They ask you to put on used, filthy slippers while they watch. The check-in process is very lengthy, with lots of paperwork. I felt like I was filling out a college application or something! Most of the rooms seemed clean. Ours was OK, but we saw a roach on the wall in the first night. We slept with the lights on after that . . . Bathrooms are fairly gross by today's standards and the house is quite old and not well kept-up. Basically, if you are not too picky about cleanliness and modern accommodations, this might work for you. Also, beware most of the bathrooms are not in the room. We were promised one in the room, but they switched us to a down-the-hall bathroom at the last minute. $80 a night isn't too cheap, so I'm only half-heartedly recommending this one. Mainly for the central location, but watch your purse. There are many homeless in the area.",
      "rate": 2.0,
      "tripDate": " September 2013"
    },
    {
      "title": "Couldn't recommend it highly enough",
      "text": "I was lucky enough to hear about this place from a recommendation that another guest house owner gave me, and i'm seriously thankful. The service and kindness has been unbelievably helpful in the middle of Toronto's busiest month, which makes the city a nightmare to navigate and find accomodation in. Don't be distracted by the website, as it doesn't do the place justice. The guest house itself is a modest house-apartments conversion and carefully hidden away in the middle of Toronto's academic district, directly opposite the fire station on College St (very easy to find and a brilliant central location). You won't find better rates ($50-60) downtown anywhere. The rooms are again modest, but clean, well-fitted, and quiet - slightly hot at night, but each has a fan. Yes, you have to take your shoes off as it's a Japanese custom apparently, but it's weirdly homely/cosy. No food, but you can save money by making your own in the kitchen. The TV reception isn't great, but it's quiet, there's a laundry center, keys to come/go as you like, loads of travel information, and a policy to be relatively circumspect about who to let in the door.What really made my trip was the smiling help i was given by the Bangladeshi owner (Kaisar) and his shy-but-charming team. Not only did he go out of his way, but he was even kind enough to not only find me space in an *upgraded* room for a *discounted* price - for no other reason other than to help out. I spent 4hrs stressing myself out trying to find the last room in the city for the film festival, only to come back and hear he had space anyway. Little things like that go a very long way when things make the day tough.It's basic, but a really, really friendly place. It's great value for the money, and you won't be there most of the time anyway. If you need a place to crash at night that's peaceful and helpful, for a low rate, and relatively unknown, definitely book in.",
      "rate": 5.0,
      "tripDate": " August 2013"
    },
    {
      "title": "Good price",
      "text": "I know a few people complained about the shoe policy, cooking, and rules.  It did not bother me at all.  The room and bed were comfortable.  I had a private bath for a slightly higher price than a shared bath.  The room was quiet and clean.  The location cannot be argued with.  It is just minutes away from Chinatown, Little Italy, Kensington Market, and the University.  The booking description said there was cable TV, but it had one station.  The fan cooled the room.  One small complaint, they did not come and clean or replace the towels during the day.  The hotel looks like a apartment house and there is not a lot of presence from the staff, but that never bothered me.  If you are used to backpacking and European guest houses, this place will be just fine.  It's not the four seasons, but you aren't paying four seasons prices.",
      "rate": 4.0,
      "tripDate": " July 2013"
    },
    {
      "title": "Excellent location",
      "text": "Clean room ok for basic purpose comfortable beds.  Friendly and welcoming staff. Good wifi. Working TV in room Communal kitchen ok for making hot drinks, clean fridge but some of the kitchen wasnt the cleanest I've seen.  Very quiet.  Walking distance to street cars Kensington market or if you are reasonably fit you could walk to CN tower and main town.",
      "rate": 4.0,
      "tripDate": " February 2019"
    },
    {
      "title": "Stay the Hell Away!",
      "text": "This is by far the sketchiest business I have ever dealt with! They charged my credit card the full amount for the room I booked weeks before I was set to check in. The policy I was sent clearly stated that you pay when you arrive. I called to ask for an explanation and the staff were extremely rude to me stating that they have unreliable guests and need to charge ahead and if I don't like it they will cancel my reservation. The staff told me I don't know how to run a business and should not be questioning their practices. They spoke over me, raised their voice and ended by hanging up on me.I had to call my bank to have them follow up with the charge. Needless to say I am absolutely disgusted with what has happened and strongly recommend staying away from that place. We ended up finding a much cheaper place on Air BNB and were not charged weeks before booking in - as business should ethically be conducted.",
      "rate": 1.0,
      "tripDate": " October 2015"
    },
    {
      "title": "Great guest house, cheap and good location!",
      "text": "We stayed there in a double room with shared bathroom this summer, the staff were really friendly. Decent room with reasonable price. Everything was clean, but a little old. The only downside was that the room was really hot, and we were afraid to open the window because of mosquitos. Otherwise this location is great!",
      "rate": 4.0,
      "tripDate": " July 2014"
    },
    {
      "title": "Not good value for money",
      "text": "I was expecting a better place due to the price but it was very disappointing. Im not sure if i would go back to this place again. I just think is too expensive for what it is. Good location tho. They were refurbishing (i hope) and all the carpets were covered with sheets and stuff. It looked really messy too",
      "rate": 3.0,
      "tripDate": " September 2014"
    },
    {
      "title": "Comfortable and good location",
      "text": "I really liked this place, the location was amazing and the staff was extremely friendly and helpful. I had a shared bathroom, and both my room and bathroom were spacious and very clean. The only negatives were some of the strict rules- no shoes past the entryway, even though the carpet was not very nice, no food in the rooms, and the notices that cameras are watching you at all times. Also, no free breakfast in the morning, but there are a lot of coffee and breakfast places nearby. There is a bit of a fee to pay with a credit card, so I recommend bringing cash. They do take American money for no extra fees. The place did smell a tiny bit, not bad really but kind of a foreign smell mixed with cleaning products. I definitely recommend it, but remember that its a budget kind of place so dont set the bar too high.",
      "rate": 4.0,
      "tripDate": " June 2013"
    },
    {
      "title": "Dirty and sketchy",
      "text": "We arrived and were directed to the parking spot, which was in a tiny alley that would have been completely unreachable if I wasn't driving a Prius.  Nearly scraped the side of my car on a metal post.  At check-in, they told us that we would be charged a 5% fee for paying with a credit card, first red flag.  Then we asked to see our room... it was a windowless room on the ground floor level, next to where they were keeping their trash.  We told them nevermind and left.",
      "rate": 1.0,
      "tripDate": " September 2016"
    },
    {
      "title": "best budget stay in toronto downtown",
      "text": "I loved this place.Best price.everything is nearer.try to book in advance. all rooms are good.No noise.Mostly rooms have separate bathrooms. but that is okay at this particular place.local transport is close.",
      "rate": 4.0,
      "tripDate": " September 2015"
    },
    {
      "title": "Really Poor Guest House",
      "text": "I booked to stayed at Kaisar Guest house June/12,until June 18 on my first day at this Guest house I seen a Mouse it was no big deal.. The next morning I got up to cook breakfast I seen 5 cockroach there could have been more as I turn on the kitchen light I seen thing running across the counter until I got a good look then I knew what it was.. I talk with the owner in he got really rude I told him I could not stay at a place like this in he would not refund my money for the other 5 day's bad business..",
      "rate": 1.0,
      "tripDate": " June 2015"
    },
    {
      "title": "Good hostel,",
      "text": "Easy to get to places from. Great it is near Kensington market, for food and drink.  The staff were lovely and very helpful. Good value for money ------------------------------------------------------------=..",
      "rate": 4.0,
      "tripDate": " June 2015"
    },
    {
      "title": "Decent room in a great location !",
      "text": "I booked a single room , and it came with a queen bed . The washroom is a little small , but it's clean . Free wifi, and kind hosts . Nothing fancy , but nothing not to like either . The location is fantastic !",
      "rate": 4.0,
      "tripDate": " September 2014"
    }
  ]
}