{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Kashaneh Furnished Suites",
    "url": "/Hotel_Review-g155019-d1592366-Reviews-Kashaneh_Furnished_Suites-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.0",
      "reviewCount": 6
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "25 Greenbriar Rd Unit 3",
      "addressLocality": "Toronto",
      "postalCode": "M2K 1H7",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/08/1a/48/90/nice-and-big-room.jpg?w=500&h=400&s=1"
  },
  "description": "More living space than a traditional hotel room. Competitive rate and even greater savings for long-term stays. Television, computer, phone, washer/dryer, coffee maker, toaster, all linens, weekly housekeeping and much much more! We also offer a fully equipped kitchen, including stove, refrigerator, microwave, as well as all small appliances, housewares, cutlery and crockery, so you can feel free to \"eat in\" whenever the mood strikes and save the DOLLARS and the TIME you otherwise have to spend on eating out in restaurants.",
  "featues": [
    "Free parking",
    "Airport transportation",
    "Shuttle bus service",
    "Laundry service",
    "Iron",
    "Bath / shower",
    "Hair dryer"
  ],
  "reviews": [
    {
      "title": "Residential Neighbourhood",
      "text": "Imagine my surprise to find this listed on TripAdvisor.  The apartment building is located on Greenbriar just south of Sheppard.  It is advertised as short term rental - but I'm sure the neighbours had no idea that individual rooms are being rented out.  Yes it is close to the subway but it is on a residential street in an old neighbourhood.",
      "rate": 3.0,
      "tripDate": " September 2011"
    },
    {
      "title": "Great place",
      "text": "I LOVED the character of the place! Very clean, great value & service, I felt right at home. Not a single complaint! And the location is phenomenal; very close to  bessarion subway station , Bayview Village mall , banks",
      "rate": 4.0,
      "tripDate": " March 2014"
    },
    {
      "title": "Do not pay for Economy accommodation without viewing it first.",
      "text": "We reserved and paid for a 2 bedroom economy accommodation.  After viewing the apartment, we decided to go to a hotel instead.  This decision was made based on the condition and cleanliness of the apartment and furnishings.  We had paid for three nights up front and it took numerous months to get a partial refund of one night.  Therefore, I can not recommend these accommodations and would strongly advise anyone considering staying here to view the accommodations BEFORE making a payment.",
      "rate": 1.0,
      "tripDate": " April 2010"
    },
    {
      "title": "They put us on so much trouble",
      "text": "I rented a two bedroom apartment and the date we wanted to move in they told us that the apartment is not ready and took us to another apartment and after five days they told us that the place is ready.When we moved to that apartment we saw that somebody is living in one of the rooms.They insist that they already told us but they didn't.I could't even get my money back.I finally get a hotel.",
      "rate": 1.0,
      "tripDate": " October 2013"
    },
    {
      "title": "shirin hotel is great location great room",
      "text": "shirin Hotel is located in city center. Clean with nice honest personnel and really good breakfast. This is apartment hotel with equipped kitchen so you can prepare your meal. Bathroom would need some restoration but good location and nice people compensate this.thay gave us a cheap taxi to abyaneh village it was great . I will come back when next time in kashan.",
      "rate": 5.0,
      "tripDate": " June 2015"
    },
    {
      "title": "sepi abzad",
      "text": "I recently rented an apartment from this company that is very clean and has good facilities. It is in a very good location that I can reach everything I need. This company has a patient and responsible manager and customer service.",
      "rate": 5.0,
      "tripDate": " November 2023"
    }
  ]
}