{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Kensington Market House",
    "url": "/Hotel_Review-g155019-d7332069-Reviews-Kensington_Market_House-Toronto_Ontario.html",
    "priceRange": "$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "2.5",
      "reviewCount": 29
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "112 Oxford St",
      "addressLocality": "Toronto",
      "postalCode": "M5T 1P3",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0c/40/5e/7a/our-room-in-the-basement.jpg?w=500&h=400&s=1"
  },
  "description": null,
  "featues": [
    "Free High Speed Internet (WiFi)",
    "Children Activities (Kid / Family Friendly)",
    "Non-smoking hotel",
    "Shared kitchen",
    "24-hour front desk",
    "Laundry service",
    "Air conditioning"
  ],
  "reviews": [
    {
      "title": "Bad",
      "text": "I got really dissapointed with this hotel. Firstly,I waited more than 10 minutes for someone to open the door of the hotel. Secondly, They didnt accept debit/credit card so I had to withdraw money from the bank, which includes fees. I told the manager when I will come back, I will pay all the bill. After, they called me to know if I will come back and that bother me a lot. Once I withdrawed the money I went back to the hotel and nobody was there so I went directly to my room and 20 minutes later they went near to my room to know if I was there. I felt I was traited as a theft and not as a costumer. In addition, there were many people out of my room and the washroom was shared so I didnt have any privacy.  The breakfast wasnt included and the wi-fi didnt work good. I've stayed in better places  and paying around 30-50& per night. The only good thing was the washroom and the room which were clean. I DO NOT RECOMMEND THIS HOTEL AT ALL!",
      "rate": 2.0,
      "tripDate": " April 2016"
    },
    {
      "title": "Basic, location good, unusual",
      "text": "We are a couple in our 30's, travelling across Canada over a month. Our accommodation is basic, our main requirements being location, price and cleanliness.Upon arriving, I have to say I was in two minds about the place. The owner had already emailed to say his credit card machine was broken so cash only. It's a pretty unusual place, not a hostel, or hotel, or guest house. Essentially a house on a residential street with three floors (we were in the basement).We arrived at like 9pm and so it was dark and we hadn't got our bearings, this may have added to my anxiety about the property.I was unsure to say the least. Even started to look for alternatives to move to...However - after the first night, and full day exploring the area - I felt much better. My partner and I started to enjoy our stay. Yes the accommodation is basic to say the least... No mirrors in rooms, one bathroom per floor, limited cleaning in communal areas BUT for the price, our bedroom was clean, bed was comfy, yes it was small but it was cheap. I had to clean a fellow residents hair from the shower but look.. It's not a plush hotel. The bathroom and communal areas could have benefitted from a clean however it wasn't terrible. It was average. The other guests were pleasant and by the end of the trip I actually had grown fond of the place!!Location was good, street is a bit run down but the surrounding streets/area very up and coming - maybe like the Camden of London?! On Augusta Avenue (1min away) there are some cool restaurants - Thai place is good.So pros: LocationBedrooms were cleanResidents nice and place safeCheapCons:Basic basic basicNo mirrors in any of the roomsOverall cleanliness was average",
      "rate": 3.0,
      "tripDate": " September 2016"
    },
    {
      "title": "ok",
      "text": "Several day ago,before I check in,I sent the message to the hotel by Booking.com,to inform the hotel I will check in from 23:00 to 24:00.But when I check in around 23:46,the hotel is close,and call the boss,he told us the there is no vacancy in Kensington Market House,and took us to another packed,dirty,and stinky room in the apartment.I don't know what happened,maybe the boss missed my message,but I think  the boss is lack of responsibility because he didn't explain anything or make any compensation though I move back to Kensington House Market next day(I stay two nights).Next time if I go to Toronto again,I'd spend more money for a good sleep.",
      "rate": 3.0,
      "tripDate": " September 2015"
    },
    {
      "title": "Very good location",
      "text": "This place is as customary as staying in your own home.The owner is very nice and allows you to pay for stay with the legal currency of Canada (cash)The place is very nice with hot water when ever you want The place also accommodates parking for a price you wont be able to get anywhere in the cityThe problem with this place is “the walls have ears), meaning paper thin and you can hear everyone in the houseOther then that the location is perfect So the place primarily gets these scores because of the positives it also brings with this location.This place gets two thumbs up A+++",
      "rate": 5.0,
      "tripDate": " November 2023"
    },
    {
      "title": "Good location, not too expensive and with parking option",
      "text": "Good option if you are looking for a cheap place to stay in Toronto. Two parking lots are available directly behind the house. I would call upfront to check if it is still available during the time of your intended stay. The location of this hotel is quite good. Not too far away from the center, but you have to walk a little. It is located right next to the Kensington Market. Cute rooms with shared bathroom. Queensize beds only. No breakfast but kitchen is available. Very nice staff.",
      "rate": 4.0,
      "tripDate": " November 2015"
    },
    {
      "title": "Safe, quiet, inexpensive and cute",
      "text": "This is a small (maybe 6 rooms) family owned, rooming house style accommodations. I suggest calling ahead the morning of your check in to let them know you will be arriving soon - the check in is just like going to someone's home. It is a no shoes home - and there are house slippers if you want them. The woman who greeted me was very friendly and welcoming. My room is cheerful blue and yellow colours. Comfy bed. Clean. Quiet, apart from hearing other guests come and go - but no sound leaking from room to room during my stay. There is a shared fridge, coffee maker, tea kettle and microwave. I'd stay again.",
      "rate": 4.0,
      "tripDate": " July 2015"
    },
    {
      "title": "Never book this place if you are looking for als decent hotel",
      "text": "When we arrived, we thought it was a crot. The street looked like the slump. We room was tiny and awfull. Ik told the person who received us that we did not accept this room. He said that it was allright and that he would get his money anyway. He has cancelled the reservation so we could not write a comment ons booking.com but cashed the money. Do not book this place if you are looking for a hotel. Door not believe the recommendations on booking.com.",
      "rate": 1.0,
      "tripDate": " June 2017"
    },
    {
      "title": "Unique atmosphere!",
      "text": "I met a friend there for lunch for my very first visit.   Lunch at the Cafe was plentiful and delicious along with well priced. Our wait staff was pleasant and accommodating and gave us space to visit over an extended lunch.   Afterwards we strolled thru the market Commons and explored all the different unique shops.  It is a \"Must Visit\" place when in Toronto downtown.",
      "rate": 5.0,
      "tripDate": " October 2014"
    },
    {
      "title": "The insides are nice, the entire exchange of getting the room is not",
      "text": "I first called this place up from home a few weeks before I was to arrive. I ended up talking to the guy in charge on his phone and was offered a room at 50.00 CAD which I thought was an outstanding deal. He asked me to text him my CC# I asked him if he took Amex and he said yes. I texted the card number and my contact info, then crickets. I texted and after doing an *old crap what did I do (I am a savy traveler and if you look at my profile, I should know better than to do this.)  I finally get a hold of him. He tells me if I feel more secure going through hotel.com I should use that route. So I did, I booked a room with a bed and a sofa for 85 USD.   After showing up to Toronto I call to see about checking in and I am moved from one house to another. Not a big deal , but the price changed a bit, we haggled over the price , and I ended up getting a decent deal out of it. (I was happy.) At this point he tells me they all of a sudden don't take Amex and he wants my bank card, which Is where I decided to just pay cash. -The room was nice and clean. -The shower was  ok , let's just say I used my travel flip flops for the shower. It wasn't disgusting, it was just used and that is to be expected from a hostel. -good internet- There were wall outlets to charge your devices. - the people living in the building were very nice. The only bad thing is there is no parking, the guy running this tells me you want to remove all your electronics if you park on the public streets, take the chance of a random break in and to do this you have to park a few blocks away. I ended up parking in a public parking garage next to the security booth. This cost me 8 bucks. I walked several blocks to the room , which I didn't  mind.Would I stay here again? Maybe , it is a clean cheap room in a decent location. However, if I found a room with more privacy ,parking, and more business oriented  I would pay extra.",
      "rate": 3.0,
      "tripDate": " August 2015"
    },
    {
      "title": "Avoid It, they should be closed",
      "text": "We stayed in June 2019, they sent someone to know your door with bad mood at 2 am, again at 9 am, Crazy, It smells, Is dirty, they are impolite, stay away of this Place!Worst Place of my life, they ONLY Cares about Money, should have give me my money back as they woke me up sending someone to the room, the Chinese owner haven't have balls to tell you the things so he sends a homeless and he hides it like a coward",
      "rate": 1.0,
      "tripDate": " June 2019"
    },
    {
      "title": "DO NOT BOOK THERE EVEN IF YOU ARE DESPERATE",
      "text": "I have stayed in many hostels around the world through my whole life and i have to say this particular one was the most horrible and unpleasent one. I reserved for one night and when me and my wife got there, they made us wait for 15 minutes upstairs only to tell us that there was no room available at this place  but they had another room available in another location which was 15 minutes away BY CAR. I immediately requested for some sort of compensation for the trouble as i do not have a car and i would have to take a taxi up to the other location, and it was clear the mistake was theirs and not mine! They where extremely careless and rude and did not want to offer us any compensation at all for their overbooking lack of attention. We had an event to attent and it was 3 minutes away from the place i originaly reserved at, needles to say thats why i reserved there. After a few minutes, they suggested they would take our stuff and they would leave it in a room of a location i didnt reserved at so we could ``do what we had to do and not worry about going there until whatever time you want to come at night'``.... ! They were insisting they would take our things... and in my humble opinion you have to be either dumb or stupid (or both) to give your backpack to a stranger that you already have a bad opinion of, so of course i abruptly refused. The guy in charge offered then to drive us there so we'd leave our things and then he would drive us back but the price for the room would be the same. I was not happy but it seemed like the only reasonable option so I agreed.  He drove us there, as soon as we got at this other location the guy that have offered to drive us back and forth as compensation for the trouble simply stated ``IM NOT GOING BACK THERE``,  i lost my patience, the guy immediately told me that if i didnt like it we could go to another hostel, I wonder what somebody else would have done in my place and many thoughts went through my mind, but one thing was certain: We were not to stay at this place with a service this bad but i would not walk away without the name of the person in charge, he refused to give me his name so i couldnt make a complaint, even though when you make a reservation at this place you have to submit you full name, phone, email and credit card number (only charged at the arrival), so they had all my information and i should have been able to have his name, to say the least.  1 hour and a half lost and too much energy spent unnecessarily, so i stormed out with my wife  but not before i let the guy know what i thought of him and his sh** way of running a business. I do NOT recommend this particular place. Do not even bother. I wanted to save a couple bucks staying there but the lesson is you get what you pay for. So I just went with my wife to a nice hotel instead and didnt let this incompetent people that run their business in the worst way ruin our night. NEVER AGAIN.",
      "rate": 1.0,
      "tripDate": " April 2019"
    },
    {
      "title": "Basic accommodation",
      "text": "The location was good, convenient to Kensington Market, Chinatown and various streetcar stops. But I would not stay here again. I felt the rooms were overpriced, not terribly clean and the bathroom had mould in it.There is no actual reception. To pay the bill, the owner took my credit card and then gave the details to somebody over the phone. Apparently they have no credit card facilities on-site. I then received a receipt several hours later, although not a proper tax invoice.It's not a hotel, and not a hostel - just a large house with lots of small rooms and no real atmosphere. Overall a strange experience.",
      "rate": 2.0,
      "tripDate": " August 2018"
    },
    {
      "title": "Only if you're desperate",
      "text": "The only good thing about this place is the location. I moved here from a nearby hostel because the private rooms were only a little bit more expensive than dorm rooms at the other place and I wanted privacy. It was barely worth the money. My room had been only superficially cleaned, and there was a thick layer of dust under the bed. My room was in the basement, where there was no cell phone coverage, no daylight, and the air was really bad. The bathroom was cleaned only sporadically during my 5-day stay, not every day, and there were bugs in the bathroom. There was no separate reception, and they only accepted cash, claiming the card machine was broken. When I asked when they were expecting to get it fixed, the guy just laughed. I got a receipt for my payment, per request, which the guy wrote by hand on a note from a chequebook he took out of his backpack. The \"receipt\" stated my name, the amount of money I paid and the duration of my stay. No dates, and no recipient. Clearly not operating legally. When I left, no one was around for checkout and when I called the guy, he just told me to leave the key in my room. Four hours later, when I came back to pick up my suitcase, my room was still open and untouched, I could easily have stayed well past my checkout time and no one would have even noticed.",
      "rate": 1.0,
      "tripDate": " March 2018"
    },
    {
      "title": "Best hostel for insect lovers",
      "text": "Among pros of this hostel I can name only great location with view on CN Tower, available wifi and affordable price for few nights standing. Checking in was quite fast.The rest - it was not so bright. Disgusting bathroom, nasty kitchen, lots of old dusty stuff everywhere. But the most unforgettable - cockroaches and woodlice.",
      "rate": 1.0,
      "tripDate": " October 2016"
    },
    {
      "title": "Stay Away!!",
      "text": "The guy who owns it is very cheap; he wants you to pay in cash before (don't) claiming his credit card machine is down. Very cheap inside, duct tape holding pieces together. If you need a place to just sleep then it will suffice. House smells and there's mold in the shower.",
      "rate": 1.0,
      "tripDate": " August 2016"
    },
    {
      "title": "place to avoid!",
      "text": "When we arrived we were informed that our reservation was cancelled. This while our reservation was still visible on the website we booked it on. Beside the hotel owner had an Ipad and our name was visible under the list of reservations. Without any further information or help we were put outside. Very unprofessional!",
      "rate": 1.0,
      "tripDate": " August 2016"
    },
    {
      "title": "Friendly, comfortable and cozy",
      "text": "It is more a 3,5/5 than a 4/5.This accommodation is a budget choice relatively near to the centre in this great city that is Toronto.The \"manager\" is very friendly and was sure to make himself available if we had any questions about our stay and the city. The room was really cozy, so you could feel at home. Our room was in the basement and the ceilings were low. To be able to comb myself I had to stand on my knees in the bathroom. The bathroom was shared. Luckily there weren't any other guests at the time so we didn't have any noise problems, which we would definitely have had, since the doors are not sound-proof.All in all, a good stay.WiFi is included, so are towels and soaps and shampoo in the bathroom.",
      "rate": 4.0,
      "tripDate": " April 2016"
    }
  ]
}