{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Kimpton Saint George",
    "url": "/Hotel_Review-g155019-d183078-Reviews-Kimpton_Saint_George-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.5",
      "reviewCount": 297
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "280 Bloor St W",
      "addressLocality": "Toronto",
      "postalCode": "M5S 1V8",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2c/62/47/ba/hotel-lobby.jpg?w=500&h=-1&s=1"
  },
  "description": "The aesthetic of Kimpton Saint George brings to mind Toronto’s heritage of craftsmanship and its evolving identity as a dynamic modern hub. Authentic flourishes, like custom art and furniture pieces from local artists and artisans, illustrate the distinctive identity (with a touch of irreverence) that makes Torontonians and travelers alike fall hard for the city. In each of our 188 guestrooms, including 20 suites and one Presidential Suite, we’ve created a haven for our guests meant to evoke the neighbourhood’s heritage residences. Clever touches, like carefully layered collected sculptural furnishings, complement a soothing palette of moody blues, greens and grays juxtaposed with warmer tones. It all comes together to create a visual narrative that immerses guests in elements of true Toronto.",
  "featues": [
    "Electric vehicle charging station",
    "Free High Speed Internet (WiFi)",
    "Fitness Center with Gym / Workout Room",
    "Bar / lounge",
    "Bicycle rental",
    "Bicycles available",
    "Kids stay free",
    "Taxi service",
    "Valet parking",
    "Paid private parking on-site",
    "Wifi",
    "Yoga room",
    "Restaurant",
    "Breakfast in the room",
    "Complimentary Instant Coffee",
    "Complimentary tea",
    "Happy hour",
    "Wine / champagne",
    "Conference facilities",
    "Meeting rooms",
    "24-hour security",
    "Baggage storage",
    "Non-smoking hotel",
    "Doorperson",
    "First aid kit",
    "Umbrella",
    "24-hour check-in",
    "24-hour front desk",
    "Express check-in / check-out",
    "Dry cleaning",
    "Laundry service",
    "Shoeshine",
    "Allergy-free room",
    "Blackout curtains",
    "Air conditioning",
    "Desk",
    "Housekeeping",
    "Cable / satellite TV",
    "Sofa bed",
    "Walk-in shower",
    "Bathrobes",
    "Interconnected rooms available",
    "Room service",
    "Safe",
    "Telephone",
    "VIP room facilities",
    "Wardrobe / closet",
    "Iron",
    "Laptop safe",
    "Private bathrooms",
    "Wake-up service / alarm clock",
    "Flatscreen TV",
    "On-demand movies",
    "Bath / shower",
    "Complimentary toiletries",
    "Hair dryer",
    "City view",
    "Bridal suite",
    "Non-smoking rooms",
    "Smoking rooms available"
  ],
  "reviews": [
    {
      "title": "Fantastic Family Stay at Kimpton St George",
      "text": "My family and I stayed at the Kimpton St George Hotel to celebrate the holidays with our children who live in Toronto. Before arriving I spoke with David on the phone and mentioned that I was experiencing a minor health concern. When I arrived, Mary at the Front Desk asked if I were feeling better and suggested a room that might help make my stay more comfortable. Once settled into my room, I required the services of both Housekeeping and Maintenance. Each of the respective people came to my room and was professional, courteous and helpful. The only complaint I have is that the bathroom door did not close properly and there was no lock on the bathroom door. I would have also liked a coffee machine in the room.My husband took advantage of the complimentary wine bar from 5 to 6 pm. He enjoyed that very much.Our room was quiet, clean and the beds were very comfortable. The curtains were well fitted to the windows so as to block all street lights if desired. In the morning, we ate Breakfast in the hotel restaurant and Monica was our server. She had a relaxed way and made us feel at home. Our breakfast was delicious and there was lots of food. Our teenage son was very happy with his pancakes with strawberries and whipped cream. Definitely something he does not get at home!Later that morning my university son joined me for coffee and found that the ambiance was very much suited to talking and that the music was easy to listen to but not too loud. He said that he will consider meeting university friends there as he thought it would be a great spot. Our whole family enjoyed the convenience of the location of the Kimpton St George hotel. We had such a great stay that we look forward to staying again soon when we celebrate some big family events later this winter.",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Fantastic Local Stay Experience",
      "text": "As Toronto locals, we booked our stay at the Kimpton Saint George this July last-minute because our A/C went out during a heat wave and we have a newborn, so needed a cooler place to stay. The team at Saint George was incredibly accommodating as we were also bringing our cat with us. I know the hotel is pet-friendly, but they went above and beyond, providing a litterbox, fresh litter and scoop for us. We were a bit nervous to stay anywhere other than our home during the pandemic, but I felt totally safe and well taken care of at the hotel. I saw on the website they had protocols in place and the room was super clean (and stylish). Everyone had masks in the common spaces and extra care was even taken during payment with handing off my credit card. The front desk also checked in via text if we needed anything. It was great. I couldn't have asked for a better stay during a pretty stressful time.",
      "rate": 5.0,
      "tripDate": " July 2020"
    },
    {
      "title": "Wedding + Honeymoon at Kimpton = Amazing",
      "text": "My wife and I decided to book Kimpton's SG's venue \"The Peregrine\" for our wedding during the pandemic. The pictures turned out amazing because of the many beautiful and diverse areas for photos. We also spent 3 nights in their \"King Deluxe\" room and we couldn't have asked for a better room. Beautiful living room area, super soft bed, and the nicest bathroom I've ever seen. Everything in the hotel was clean and followed all the COVID protocols. We definitely felt safe being there during the pandemic since everyone was wearing a mask at all times and the hotel was absolutely spotless. The total cost was also very affordable, especially considering the cost of other potential wedding venues. There are also so many restaurants in the area, with lots of variety from different cultures. Finally, the best thing was the staff. WOW. They were extremely helpful during the wedding planning process, they allowed us to be there a day early to set everything up, emailed us always to double check on our plans/timeline. The cherry on top was when they brought us some treats to our room after the wedding. All in all, my wife and I couldn't have asked for a better place to get married and spend our pandemic honeymoon.",
      "rate": 5.0,
      "tripDate": " March 2021"
    },
    {
      "title": "Best anniversary ever!",
      "text": "Choosing the Kimpton St. George for our anniversary celebration was the best decision we could’ve made. We wanted to have a little staycation and my partner’s only requirement is that we got a tub. So we booked the 1 bedroom suite for the tub. The entire suite was thoughtfully designed and the record player was an added touch. The washroom for the record, had rainfall shower and the really nice tub seen in pictures on the website. The robes were also really comfy might I add. My only criticism is the lighting in the suite was not optimal for taking photos whatsoever haha. But that’s my harshest criticism which isn’t even a real criticism haha. Our check in experience was stellar. We showed up at 3pm and told Dave (thanks for the hospitality Dave!) it was our anniversary as he told us about free wine hour. He offered to send us a bottle of wine to the room. After a few minutes I was told there might be a little bit of a wait to turn over a suite and to enjoy a complimentary drink at the hotel bar (which I’ve been to before and do recommend! Really good eats too!). It was really no problem and as we were about to head over we were told our room was actually ready so that worked out. As soon as we got up and took our coats off someone came by with the bottle of wine! How lovely!! I then got a text from Dave that if we needed anything to feel free to text them instead. Which is really nice seeing as I when I’m travelling phone calls cost as texts do not. The hotel itself is situated in a pretty nice area with tons of nicer restaurants appropriate for our anniversary plans. It’s also right by St. George TTC which is really good for those who plan on using subway (it’s a cross section of 2 subway lines).We did order breakfast on the door knocker for the following morning and it was 100% the right choice. Breakfast came hot and was perfectly cooked. They also gave us late check out (2pm) which was greatly appreciated. In summary, beautiful suite, good location,  and the best staff ever! Thanks so much Kimpton 😊",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Kind service and nice decorations",
      "text": "Room is nicely decorated. Everything is clean and new. Quality of furniture and mattress is good. Room doesn't have appliances by default but you can just request them easily. It's a thoughtful thing actually because the room is not cluttered unless you need it",
      "rate": 5.0,
      "tripDate": " August 2020"
    },
    {
      "title": "Nice Staycation and Wonderful Service!",
      "text": "My partner and I decided to have a small staycation in Toronto in order to celebrate my birthday. We chose the Kimpton Saint George due to its proximity to the St. George subway line and the fact that the rooms looked really nice online! We were not disappointed at all...We were greeted by friendly front desk staff and absolutely loved our room! The bed is probably the most comfortable I’ve ever slept on and the room was spotless. Any decorative pillows were removed for safety and the couch smelled like it was just cleaned. You can tell that this property is taking their COVID-19 cleaning measures seriously, which I definitely appreciated. Also, the wine hour in the lobby was such a nice touch along with the coffee in the morning. We even asked to borrow an HDMI cable to watch a movie and it was at our door in minutes. Will definitely be returning in the future! Really great service.",
      "rate": 5.0,
      "tripDate": " November 2020"
    },
    {
      "title": "Outstanding personal service",
      "text": "I can’t wait to return to the wonderful Kimpton Saint George Hotel in Toronto. Aside from the cleanliness from the hand sanitizer to the plexiglass at the front desk, they went above and beyond by offering a welcome package at arrival with a mask, sanitizer, gloves and alcohol wipes. So smart.  We are in a pandemic so why not make your guests more comfortable the minute they arrive?Within seconds of checking in I had a text from Mary at the front desk suggesting I contact her if there was anything she could do to improve my stay. The overnight staff at the desk were also incredible, offering to keep their eyes on my car parked out front during the night.  The room was spotless, the staff fantastic and my one night stay felt like a vacation. I will come back again and again thanks to the personal service from Mary and her team. Running a hotel during a pandemic must present many obstacles, but the Kimpton St. George has found the opportunities and it’s about making the guests feel special. I am so impressed.",
      "rate": 5.0,
      "tripDate": " October 2020"
    },
    {
      "title": "Birthday Quarantine Escape",
      "text": "I booked a few nights at the Kimpton Saint George in Toronto for my wife's birthday during the pandemic. The Front Office Manager Christina and the rest of her staff went above and beyond on all levels to make the our stay feel special. They helped organize a surprise (flowers and bubbles) in the room, and were attentive to all our needs during the stay. The complimentary coffee in the AM and wine in the PM also made for perfect bookends  to each day.Mid-century styling and luxury in-room features like a massive premium tub and monster-sized bed make this a five star experience at a fraction of the cost. Absolutely a top reco in the city. 10/10 would Saint George again.",
      "rate": 5.0,
      "tripDate": " September 2020"
    },
    {
      "title": "Perfect Overnight Getaway",
      "text": "My wife and I needed an escape from the living room lockdown (COVID) so we rented a hotel suite for Valentine's Day, just down the street from where we live. The Kimpton Saint George was the perfect choice! Great staff/great service (prompt with email questions before the check-in and accommodated a last minute change request with pleasure), gorgeous room, incredible beds/linens, and perfectly suitable amenities (TV with Chromecast, bluetooth speaker, all the bathroom stuff, etc.). Nothing spared, and a well manicured boutique experience. They were limited in what they could offer in terms of food and beverage on account of the pandemic guidelines, but coffee service in the morning was appreciated and I've happily eaten at the on-site restaurant as a local (gastropub with a good menu and great value). Consider this a strong recommendation!",
      "rate": 5.0,
      "tripDate": " February 2021"
    },
    {
      "title": "They took care of everything!",
      "text": "We came to Toronto to help our niece move into her dorm room at the University of Toronto.  Due to some issues with her final COVID test for her quarantine release, we ended up having to stay an extra two days.  We had been working with the concierge Nabeel to make our reservations and he was able to extend our stay at the hotel with no problem.The location of the hotel is great for exploring the city and is right next to the campus of the University of Toronto.  Due to some COVID restrictions, the restaurant in the hotel did not serve breakfast, but the hotel had an arrangement with a local restaurant to provide breakfast for us each morning and would deliver it directly to our room.  There was a coffee and tea station in the lobby that was perfect for us.The room was spacious enough for both my wife and I to work for 3 days with no issues.  The wifi was fast and reliable - we both were able to conduct several meetings from our room.  The bed was very comfortable and the bathroom very clean.  The best part of our stay was the service we received.  Everyone at the front desk was very friendly and willing to help us in any way they could.  The concierge Nabeel was especially helpful.  He was able to direct us to a testing facility for our COVID tests needed to re-enter the US as well as recommending dinner/lunch spots for us.  He even arranged for a car service to take us back to the airport at 3:45am for our 6am flight.We thoroughly enjoyed our stay and will be coming back for our next visit to Toronto!",
      "rate": 5.0,
      "tripDate": " September 2021"
    },
    {
      "title": "Fun boutique hotel with real art!",
      "text": "This hotel is a bit off the beaten path, but a nice brisk walk to yorkville.When you pull up it’s vey unassuming, you pull down a little ally way and walk through the door.  I was greeted by someone at the desk, everything was very professional but it seemed a bit off,  almost cold, maybe understaffed.  We had to park in a very, very shady parking structure that looked like it was going to fall apart or your car may go missing… I was not fond of this at all.  There was no valet service, strange for the clientele this hotel attracts, but dollar didn’t fit the bill.The hotel is kind of cool, it has organically art decorating the walls and that is very pleasing.  We got the the room and it was nice, it lived up to the notion of boutique.  I don’t know what to say other than I liked it!  I loved the bathroom until you tried the shower on and it sprayed all over the floor, they need waterfall shower heads, they only have a half glass wall half open, so it would be better personally… but towels caught the over spray and puddles.One thing I did not like at all was I had to go down to get coffee, I was not impressed, I know it’s covid and it’s an reason for everything, but it was a big deal for me.The bed was decent, it did what it was supposed to, provide a good nights sleep!I am glad I stayed, but I don’t think I would go hear a second time, but happy I stayed once!",
      "rate": 3.0,
      "tripDate": " July 2021"
    },
    {
      "title": "Solid hotel choice",
      "text": "Stayed in room 1418, nice view of Casa Loma in the distance.  Room was clean and decorations were cute and quirky. The beds were soft (if you prefer a firm mattress, may want to take that note into consideration) and and bedding was comfortable. Took a hot bath and it was lovely.  If you take a shower, recommend placing wash cloths on the edges of the tub surround, otherwise water will spill onto the floor.  Gym was usually empty and has everything you need for a good workout.",
      "rate": 4.0,
      "tripDate": " July 2023"
    },
    {
      "title": "Great stay at the Kimpton St.George",
      "text": "Had a great stay at the Kimpton Saint George. The one bedroom with their amazing soaker tub was so appreciated at the end of the day.  They were very careful with contact. We asked for a kettle and it was delivered via a rolling cart appearing in front of our door on a tray.    I didn’t even see who delivered it.  Thank you to all the staff who are working during these times. We were helping our daughter move out of her place and coming back to the hotel with all the precautions was greatly appreciated. If we’re ever back in Toronto this will be our place to go.",
      "rate": 5.0,
      "tripDate": " May 2021"
    },
    {
      "title": "Absolutely Amazing!!",
      "text": "If you are looking for an amazing place to stay in the heart of Toronto, I highly recommend the Kimpton Saint George. The hotel Manager on Duty, Ineza, was absolutely fantastic!! Arrangements were made for business purposes without knowledge of the hotel (just by chance picking). The reservations representative was so awesome! I've had rave reviews from my team who stayed there about the beautiful rooms, how clean they were kept, the on-point change of keys first thing in the morning on Wednesday, March 6, due to breaking up the reservation to get a better price point (world-wide conference at the first part of their 6-daystay), the service by all staff, and the wonderful lobby wine, which was free and greatly appreciated by my team after a long day of travelling and meetings. When you keep on top of arrangements you require with the Manager on Duty, they really go out of their way to accommodate you. Huge thank you to the Team at the Kimpton Saint George!!",
      "rate": 5.0,
      "tripDate": " March 2024"
    },
    {
      "title": "Another Wonderful Stay!",
      "text": "We recently stayed at the Kimpton for our third time. We really enjoy our stays here when we come to visit family in the area. We love the location of this hotel and the staff are fantastic. The rooms are really nice and have everything you need to be comfortable plus they have an artistic flair! Once in our room they brought up a couple of special waters for us since we have been here a few times. We appreciated this nice touch! The rooms are always extremely clean and well appointed. You will find a safe in the drawer bedside. There is a mini fridge for your use. The closet has an iron and board, yoga mat, umbrella, robes and lots of hangers. The bathroom has large pump bottles of shampoo, conditioner and soap. The hair dryer works really well. The bed is very comfy. Once again we purchased the included breakfast with our nights at the hotel. If you have purchased this option when you check in please ask for your vouchers. They are have the dates on them for the applicable days.  The head server Don remembered us and even remembered where we like to sit. We really enjoyed our breakfast on both days! Don works very hard and he is so pleasant! The lobby area has a fireplace and comfy furniture. They have a lovely coffee, tea station in the morning and there is a wine hour which we always seem to miss lol. It feels a bit like coming home when we come here now. We will definitely return!",
      "rate": 5.0,
      "tripDate": " April 2024"
    },
    {
      "title": "Very pleasant experience",
      "text": "We had a very pleasant stay at the Kimpton Saint George 2 weeks ago. Of course the main reason to choose this hotel is location,  location,  location but it is a very comfortable hotel with 9excellent service.  We liked the new design from the refurbishment and found the staff to be very helpful whenever we needed something.  The hotel is quite expensive but there are discounts available if you search for them.",
      "rate": 4.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Wine O’clock not to be missed",
      "text": "We arrived after our flight from London and negotiating the heavy  Toronto traffic to be offer a glass of wine, we’ll have their ‘wine o’clock’! Car parked for us though to be honest the access is very easy. Be warned parking is not cheap at $40/50 CAD. Great comfortable room with a walk-in shower. The Fortunate Fox bar is attached to the hotel and provides good food in a lively atmosphere. Hotel provides a great morning coffee service in the lobby.",
      "rate": 5.0,
      "tripDate": " May 2023"
    },
    {
      "title": "Beautifully Decorated Boutique Hotel",
      "text": "For his birthday weekend, my boyfriend and I stayed at The Kimpton St. George. It has been recently renovated into a contemporary, Scandinavian style that is unlike any other boutique hotel. Being inside feels like you have stepped into a magazine for interior trends. From the arch dresser to the picture light, the inclusion of current design details contributes to a visually-appealing stay. We had a room with a king size bed that was large, yet cozy. The bathroom was clean with recurring gold metals. We did not dine at the hotel’s restaurant, although we indulged in the wine hour, which was very fun. This hotel is conveniently located in the heart of Toronto, with many attractions (e.g. The Royal Ontario Museum, The Bata Shoe Museum), and restaurants (Gyubee) a short walk or commute away. The staff is extremely friendly, and they were kind enough to provide us with a little gift for our special weekend. I would recommend staying at The Kimpton whether you are visiting Toronto or having a staycation!",
      "rate": 5.0,
      "tripDate": " April 2022"
    },
    {
      "title": "It was great to stay at a place like this",
      "text": "Location is very good. Beautiful and modernly designed rooms, easily accessible, clean, comfortable and very tech friendly. I liked that I could communicate with the front desk via text and that I was able to order food to my room.",
      "rate": 5.0,
      "tripDate": " October 2021"
    },
    {
      "title": "Saint George Kimpton - a wonderful hotel to relax and recharge!",
      "text": "Our first trip since the pandemic and it was so worth it! Such a lovely, luxurious room with all the extras- yoga mats, umbrella and environmentally safe bath products! Check in was efficient with professional, friendly staff to help navigate us through the process! The front foyer was so cosy to enjoy our first coffee and tea  while we planned  our day. We ate at The Fortunate Fox restaurant and staff there could not be more accommodating or helpful- always a smile on their faces! They handled the new QR code process with aplomb and it was impressive! Excellent pun choices and shares as our family was hungry! The Saint George Kimpton is in such a lovely area of Toronto and it is ideal for walking and sightseeing. We will definitely return to Saint George Kimpton for our next family get together!",
      "rate": 5.0,
      "tripDate": " October 2021"
    },
    {
      "title": "Toronto on business",
      "text": "Was a solo traveller, first outing since the changes happened so I was a bit apprehensive until I arrived at the St George Kimpton. Then I relaxed because of the atmosphere and proximity to the transit system. So glad I chose this  hotel since it is spotless,  the rooms are comfortable and the guest service staff made each morning and evening a pleasure.  Without effort they were welcoming, courteous and experts in the care they gave me while I was a guest. The hotel restaurant the Fortunate Fox each night served very delicious food. Again, the wait staff were welcoming engaging and courteous.  There is not daily room make up in order to limit contact for the guest and honestly that suited me fine. I can’t wait to go back.",
      "rate": 5.0,
      "tripDate": " October 2020"
    },
    {
      "title": "Great hotel run by a wonderful team",
      "text": "This is a heart felt thank you  to the wonderful people at the Kimpton Saint George.My family and I stayed at the hotel for a good three weeks and we couldn't have picked a better place.The management and staff went out of their way to  make the place feel like home and ensure we were comfortable and had all our requests met.The property is well maintained and has a warm friendly vibe thanks to the staff.We were in Toronto to settle my son at University. It was touching beyond words when we were surprised by a basket of snacks  and a beautiful card placed in our room the night before my son was to move to his Uni accommodation. A big thank you to the lovely ladies Maria, Carla, Dari for continuous support and care. A shout out to our amazing Hiroko who took such good care of our rooms and made sure they were cleaned and kept perfect every day. And finally, David Gallagher, the reservations/ guest services manager who is a gem of a guy. David made all the initial reservations hiccups go away in a flash and thereafter made sure everything flowed with ease. If it wasn't for David's initiative and responsiveness, we would have never had the opportunity to stay at the Kimpton (and that too for 3 weeks!).My family and I look forward to staying at the Kimpton again.Thank you, once again.Alizeh",
      "rate": 5.0,
      "tripDate": " August 2022"
    },
    {
      "title": "cool are deco hotel, too bad about the bar/restaurant",
      "text": "Really interesting space and decor. Unique art deco style and nice touches like robes, glassware in rooms, a yoga mat even. But we tried to go to the bar tonight for  a drink and snack,  sat at the bar, and were promptly ignored for close to 10 minutes. No eye contact, no \"be with you in a minute\", just ignored. When the bartender stood in front of us and turned away before even acknowledging our existence for the third time, we left. Too bad... at this price point for a hotel you should be able to count on bar and food service without leaving building (there is no room service either). Had to walk 8-10 minutes down the street to the Park Hyatt for a  drink.",
      "rate": 4.0,
      "tripDate": " February 2022"
    },
    {
      "title": "Excellent hotel",
      "text": "We stayed at the hotel for 3 nights, it was a pleasure to stay there. The staff were very helpful, the rooms were a good size and the beds were so comfortable, you did not want to get out of them. The hotel is located in an excellent location, the tour bus stop is stones throw away as well as the Metro. The hotel offers wine between 5 and 6 pm to all the guests as well as tea and coffee in the morning. There was no room cleaning service whilst we were there, this did not matter as we could ask for anything and it was provided. It also has an excellent bar and restaurant which is open till about 2am. There is free bike hire and overall I would highly recommend the hotel. Thank you for a lovely stay.",
      "rate": 5.0,
      "tripDate": " June 2022"
    },
    {
      "title": "A great hotel !",
      "text": "We had a fabulous two night stay here on the 14th floor. (See photo of window view). Staff were very friendly and helpful, especially the doorman. There were large pump bottles of quality  products in the shower, which was nice (as opposed to miniature bottles, slightly reducing plastic waste).  It was a very long walk to the tourist areas, such as the CN tower but the hotel is close to lots of restaurants and convenience shops. We found two excellent restaurants within walking distance. We went along to the free wine tasting in the lobby on our first night there. It was nice to have access to iced water throughout day in the lobby also.",
      "rate": 5.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Staycation...",
      "text": "We chose the Kimpton for a birthday staycation. COVID precautions are good, plenty of signage reminding to wear a mask and social distance, sanitizer is readily available in all public areas. The room was spotless, which made us feel very comfortable. The bed was comfy and provided a great nights sleep. All staff we interacted with were friendly. The location is great for exploring the city. We will definitely be back!",
      "rate": 5.0,
      "tripDate": " September 2020"
    },
    {
      "title": "A warm and cozy place to stay",
      "text": "Toronto was is Covid lockdown and many of the amenities had to be removed from our room, however we received a warm welcome from reception who were also very helpful as we needed to order in our meals. It was a surprise to have coffee offered in the lobby in the morning. We are back to stay for three nights next week and as Toronto has opened a bit we look forward to the same great treatment. The Saint George is an easy walk to the clinic I am attending as well a very convent to Bloor Street shopping, Yorkville and the subway.",
      "rate": 5.0,
      "tripDate": " March 2021"
    },
    {
      "title": "June visit 2022 for education related to work",
      "text": "Again had an uncomplicated visit at the Saint George. The staff were once again spot on and easy to work with as well as accommodating. The in-house restaurant selections are very good. It was satisfying in the fact, being alone, traveler, I did not have to venture out to find meals appetizers or happy hour while there, definitely recommend staying at the Saint George again the proximity to the shopping world, Ontario Museum, and the transit system makes the location very desirable",
      "rate": 5.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Travel Zoo Promotion",
      "text": "Travel Zoo had a promotion which included free parking, breakfast and accommodation for two in an upgraded Premier room.It is an excellent deal.COVID-19 protocols were followed. Staff were friendly and helpful. The room is simple and tastefully decorated.We liked that a window could be opened.The one negative is the duvet. For whatever reason accommodations now prefer to use duvets. We find they are too warm almost to the point of being uncomfortable (sweaty).We look forward to staying again, once COVID-19 restrictions have been lifted.",
      "rate": 4.0,
      "tripDate": " June 2021"
    },
    {
      "title": "We Thought Kimpton was Special. Nope.",
      "text": "This was our first stay at a Kimpton property. We were on a Travel Zoo long weekend deal. The staff were very helpful. The location was excellent. The included parking with the package deal was a bonus. Unfortunately the room was incredibly underwhleming. IHG portrays Kimpton as their special, high end, unique property. We were excited to stay here for the first time. The hotel was reviewed on the Air Canada in flight system. It's not hard to tell these are paid testimonials as the review did NOT match the actual experience. The room and bathroom was VERY basic, tiny and had very few ammenities. The mini fridge had a small of the food that the prior guest(s) had - but the room itself was the issue. The experience didn't ruin our stay but it left us disappointed from the second we walked in to the time we checked out. Other than a  compfortbale bed, if this is what the Kimpton brand is we're not staying at another one. We'd never stay here again. If you choose to stay be sure to set your expectations appropriately low versus the glossy reviews and recommendations.",
      "rate": 3.0,
      "tripDate": " February 2022"
    },
    {
      "title": "Very personal service",
      "text": "We made the Kimpton our home to get ready for our wedding. First, I would like to give a shout out to the front manager, Sean, who made sure my husband and I, and our families, were taken care of before we even arrived. Because we were getting married during COVID, and a bit nervous about staying in a hotel, Sean made us feel at ease, and really personalized our service. The hotel itself is stylish, and great for some photos. We stayed in a suite, and were shocked by how large it was. The trendy furniture felt very Art Deco, and everything was spotless. Our favorite part was the bathroom, which had a giant soaker tub and Malin+Goetz toiletries (the best!). They even threw in a bottle of bubbly given the whole COVID wedding thing :)",
      "rate": 5.0,
      "tripDate": " October 2020"
    },
    {
      "title": "Great stay",
      "text": "We decided to take a mini trip downtown to celebrate our anniversary. We brought our dog with us and they went above and beyond to make sure our experience was great, from providing a little doggy gift bag (poop bags and variety of treats) and some chocolates for us to making sure everything was to our liking and inviting us for wine in the lobby. The Kimpton hotel was just the mini vacay we needed. The staff were always very helpful and friendly. We also ate dinner at the restaurant in the hotel and the food was delicious and reasonably priced.",
      "rate": 5.0,
      "tripDate": " August 2020"
    },
    {
      "title": "Disappointing Kimpton",
      "text": "The hotel looked gorgeous in photos and has good ratings but it did not live up to previous Kimpton experiences mainly due to the building it’s located in and the below average service.I was very disappointed when arriving at the hotel. Although the hotel has been decorated with stylish fixtures and a pleasant decor it is like putting lipstick on a pig. This hotel has low ceilings, is dark and just feels ‘damp’. After doing some research this used to be a Holiday Inn which makes so much sense.The bones of the building are not great, but the room layout was very sad. It was like being on a room on a cruise ship - one basic rectangle with one window and zero character. I expect more for Kimptons who either go for new build or character building. At 350$ a night this was unacceptable. The service levels here were also poor. I had just arrived from Vancouver where every person I interacted with with happy, friendly and social. Not at the Kimpton. Would not recommend. Stay elsewhere.",
      "rate": 2.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Fantastic stay",
      "text": "An incredible location and an even better memory- the staff running the hotel make you instantly feel safe and welcome, like you are home. They truly go above and beyond - they are the definition of what hospitality should feel like, with attention to every detail to make your stay that much more enjoyable. I loved it so much... I am back again this week! Thank you.",
      "rate": 5.0,
      "tripDate": " November 2020"
    },
    {
      "title": "Cozy and Stylish Hotel",
      "text": "We decided to stay here during our 27th wedding anniversary and a day before husband's medical appointment schedule.This hotel is directly located infront of the University of Toronto downtown campus and is a few steps away from Bata Shoe Museum and the Royal Ontario Museum.What's striking with this hotel is that it has a homey vibe(the lobby is almost like your own living room) and an elevator that has a mind-bending mirror that seems to stretch back forever.The rooms are average in size but the beds are one of the comfiest beds I have slept in.There's a lot of mood lighting inside the room which sometimes make it a bit dark.Instead of a closet there is an armoire equipped with an ironing board, bathrobes and even a yoga mat.Other amenities inside the room are the small bar fridge, large flat screen smart TV  and a safe.They serve coffee in the lobby in the morning and wine at night to hotel guests.I love its location being near the best museums in Toronto and the shopping district of high end stores.",
      "rate": 4.0,
      "tripDate": " January 2022"
    },
    {
      "title": "Welcoming stay at the Kimpton Saint George",
      "text": "The staff at the Kimpton are very friendly and helpful with any questions or requests. The mini fridge in my room wasn't working and they sent someone up immediately to fix it. In the morning, I missed coffee service (6am-10am) so I called down to the front desk and they were able to send up a kettle and selection of teas. All around great service!Also - the Kimpton is in the ideal location for restaurants or museums for those who stay here when places open. The Yorkville/Annex neighbourhood is very nice to walk around in as well.",
      "rate": 5.0,
      "tripDate": " February 2021"
    },
    {
      "title": "My new favourite Hotel in Toronto. If you’re a bath lover, this is the place for you!",
      "text": "Everything about our stay here was perfect. It’s clean, spacious, in a great location, and really beautiful. The staff were all friendly and helpful, and the bed and pillows were so comfortable (and I’m picky).During the pandemic, you don’t really see anyone, you just text the front desk if you need something like an extra blanket, or if you have garbage you would like disposed of. They even send you a text with recommendations for ordering in from restaurants in the area. It’s very helpful.We were in a one bedroom suite, and it was so comfortable and had everything we needed. But the bathtub was the show stopper. It’s huge and really deep. If you’re a bath lover like I am, this is the room to get in this hotel.My only regret is that I didn’t try this place earlier. It’s a gem!",
      "rate": 5.0,
      "tripDate": " February 2021"
    },
    {
      "title": "Great aesthetic and location",
      "text": "My husband and I stayed for a few days for a little covid vacation and we were very happy with the look and decor of the hotel. It's nice to stay at a place with character with rooms that aren't white on white on grey. Sheets were very comfy, staff very friendly, the free glass of wine in the evening was very appreciated. We ordered in a lot and had left overs so they brought up a microwave for us to use. They kept in touch via text and were very quick to respond. Would definitely stay here again.",
      "rate": 5.0,
      "tripDate": " October 2020"
    },
    {
      "title": "Too noisy & over priced",
      "text": "We stayed here for 3 nights during our second stint in Toronto on our 2 week holiday in Canada. We stayed at 5 other hotels/airbnbs during our stay in Canada and despite being the most expensive, this definitely wasn’t the best place that we stayed. We ended up staying in a different room every night of our stay - our first room hadn’t been cleaned properly (most notably someone else’s hairs left in the shower tray), it was noisy (faced the road despite asking for a quiet room) and the air con didn’t work properly meaning it came on and off constantly throughout the night. In addition, the charge held on our credit card was C$200 more than expected. As compensation we were moved to a junior suite and the charge for our late check out was removed - this was great for the second night until 2 guests moved into the room next door. As the rooms were adjoining I could hear their conversations word for word (I found it odd that a room deemed to be a ‘suite’ would be adjoining with another room). I again complained about noise and this time we were moved to a suite. I feel the management team, David in particular, handled the situation well and I didn’t leave the hotel feeling annoyed, but I think it’s fair to share my experience for the benefit of others. If you’re looking for a quiet hotel, this probably isn’t the one for you (we realised, having checked in, that this building used to be a Holiday Inn and despite the aesthetic refurbishment, the fabric of the hotel remains the same). I should also note that the hotel parking (self parking, not valet) is extortionate at C$36 per night!",
      "rate": 3.0,
      "tripDate": " November 2021"
    },
    {
      "title": "Wonderful hospitality from all staff",
      "text": "Our trip to Toronto started off with a bit of hiccup due to my husband's forgetfulness, so we had to arrive separately. Since I checked in first, my husband sent his apology gesture via hotel staff — Dari and Stephen, who were extremely thoughtful and helped my husband deliver his messages + gifts so that our trip could start off at a better note :) Aside from the unexpected (exceptional) service mentioned, I just have to say everyone in this hotel was really great. From housekeeping to restaurant staff, we felt welcomed and enjoyed our interactions with everyone. The location and room decor was also lovely. I liked the fact that we're somewhat close to the city center but we were still able to have a quiet night of rest. During Covid times, we also pay extra attention to the cleanness of the room and this hotel certainly did not disappoint us. Ps. If you're looking for not just a vacation getaway but also a place to work remotely, I highly recommend this hotel. I could take a work zoom call and teach online with nice background and lighting throughout this stay without any problem :)",
      "rate": 5.0,
      "tripDate": " November 2021"
    }
  ]
}