{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Knights Inn Toronto Scarborough",
    "url": "/Hotel_Review-g155019-d1382746-Reviews-Knights_Inn_Toronto_Scarborough-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "2.5",
      "reviewCount": 238
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "4694 Kingston Rd",
      "addressLocality": "Toronto",
      "postalCode": "M1E 2P9",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-s/01/2f/6d/c1/scarborough.jpg?w=500&h=-1&s=1"
  },
  "description": null,
  "featues": [
    "Free parking",
    "Parking",
    "Free High Speed Internet (WiFi)",
    "Wifi",
    "Free breakfast",
    "Pets Allowed ( Dog / Pet Friendly )",
    "Non-smoking hotel",
    "24-hour front desk",
    "Vending machine",
    "Air conditioning",
    "Flatscreen TV",
    "Non-smoking rooms",
    "Family rooms"
  ],
  "reviews": [
    {
      "title": "You get what you paid for",
      "text": "It wasn't really the worst of the absolute worst, but the price really reflects the quality. Dirty carpet, gross floors, and questionable staff. The light at the entrance of the room didn't work upon walking in. There was only conditioner in the bathroom (4 bottle of it) and no shampoo or lotion. Hair in the towels. I found a crumbled muffin paper-wrap beside the bed with some cigarette butts. I also happened to find folders under the mattress containing information that shouldn't be known to guests - bills and statements for Rogers and such. A lot of housekeeping paperwork too. I booked it because it was close to where we had to go for business, it was cheap, and there was free breakfast and wifi. Bless them for having clean sheets! I still wouldn't come here again.",
      "rate": 3.0,
      "tripDate": " February 2015"
    },
    {
      "title": "3 star review, but hard to qualify for 2.5 star hotel",
      "text": "The hotel outlook seems not too bad, but the room is too far away with 2.5 star hotel concept.  1. The carpet is terrible, material worn out all around the edge, lean on the wall make you feel it just throw on there.  2.  No bath tub, very strange while you take shower, and of course not comfortable at all.  3. The toilet is stained, yellow, very scary.4. The light button is oily 5. The most horrible is the heater, it only has super heat and cool fan, and can not adjust high and low.  plus the other features not working at all.  so the room is full of dry heat, extreme hot otherwise cold with cool fan on.  you can not have the other chose except turn it off.  But as the night while I stay is very cold, then I have to keeping busy all night to switch the heat on and off,  to avoid too hot,  but not catch cold.  Imagine fighting with the heater all night, could I have a good sleep?6. In general,  the ceramic floor of the breakfast room is dusty and darken too.  Thank you for the bedding sheet, it's clean and no smell, at least make me feel a bit better for what I paid for.  But I only can give the credit for the hotel staffs, they're friendly with patience.  even when I complain about the hotel can not compare with 3 star(it states 3 star when I checked online),  they still smile and answer, \"just 3 star review, 2.5 star hotel indeed\"!",
      "rate": 2.0,
      "tripDate": " November 2014"
    },
    {
      "title": "Wyatt",
      "text": "Was only average.  Had a storm with lots of snow and ice before we arrived.  Did not salt parking lot or stairs or sidewalks sufficiently.  Breakfast was marginal. Place to eat was not pleasant - bare bones.  Staff did not speak good English making it difficult to communicate.",
      "rate": 3.0,
      "tripDate": " December 2013"
    },
    {
      "title": "Terrible behaviour of Tushar Shah",
      "text": "I have very poor experience of Mr. Tushar shah. He is handling the gujrat bhavan but he is 0% sense. He is very irresponsible person. He abused me at the reception of motel and I would suggest everyone that please choose any other motel for making stay good.",
      "rate": 1.0,
      "tripDate": " August 2020"
    },
    {
      "title": "The worst experience in a hotel ..",
      "text": "Never go here their bedding were filthy, when  I (I am his daughter ) asked  for  clean sheets they took  the dirty one and left the beds bare. The bathroom wasn't clean I was forced to purchase my own cleaning supplies. I did not get the essentials  such as: soap or toothpaste.  I am representing my father he told me to speak with personnel when they came to the room it was a disaster , I also took pictures, could you imagine having to purchase your own toilet tissue?",
      "rate": 1.0,
      "tripDate": " May 2014"
    },
    {
      "title": "Cheap pimp office not a hotel",
      "text": "Go away...this is not a hotel...this is a drug dealer house, prostitutes in the entrance...homeless in the hallway...not a howard jhonson...now is a Knight Inn...the only good thing is that i got a full refund of my money",
      "rate": 1.0,
      "tripDate": " May 2014"
    },
    {
      "title": "Worst Motel EVER",
      "text": "Absolute nightmare! Unfriendly indian at reception said motel was fully booked, total lie! Booked hotel on the internet few minutes later. Room was dirty, motel old, broken bathroom. Found hair on my bed. Filthy overall experience. STAY some place ELSE!!",
      "rate": 1.0,
      "tripDate": " May 2014"
    },
    {
      "title": "FALSE ADVERTISING! DO NOT BELIEVE PICTURES",
      "text": "FALSE ADVERTISING! DO NOT STAY HERE! I had the misfortune of checking into this dumpster about 30 minutes ago. This is literally the worst hotel I have ever been in. I do not understand how this place is allowed to be in business. I was fooled into reserving a room here through the pictures found online and through booking.com. Do not believe them. When I pulled into parking lot I had a bad feeling. The lobby was a mess, and totally cluttered and dirty. The man told me at check in that I needed to pay a $100 security deposit in case I smoke or damaged the room. By looking around the lobby I could tell this hotel did not take care of itself and told the man I would not pay the deposit. He told me I had to pay it, and I told him I wanted to see the room first because I was worried that he would “find damage” and keep my deposit. So he showed me the room. It was literally the worst hotel room I have ever been in, and I have stayed in a lot of cheap hotels in my lifetime. He also told me most people are charged their security deposit which is $100, so be warned. He ended up not charging me my security deposit because I complained for so long. The room was filthy. Holes all over the walls. The bathroom door had obviously had a very cheap patch job done. The entrance floors/ bathroom floors have not been mopped. The toilet has not be cleaned. There is mildew in the shower. The carpets are tattered and coming off of the floor. There are two office chairs in this room, and both of them are completely destroyed and unusable. There are two lamps in this room, both of them have shattered lamp shades. The mini fridge looks like someone dropped it off a truck, because it is warped. There are marks all over the walls. There was a dirty towel in coat rack! I am sitting in my room, 30 minutes after checking in, writing reviews on every site I can imagine hoping that I might help other people avoid making the same mistake I did. DO NOT STAY HERE. Pay a little more and go someplace else. The world will be a better place as soon as the Knights Inn Scarborough Toronto goes out of business. Please do your part of making the world a better place by going anywhere else and making this place go out of business.",
      "rate": 1.0,
      "tripDate": " June 2018"
    },
    {
      "title": "Stayed 5 min and left",
      "text": "The lamps were missing lightbulbs and the linens on the bed were still dirty (hair etc).  Went down to front desk and told them about it and the attendant didn't even blink an eye at what we found.  He said he couldn't give us another room, reversed our credit card payment, and we left. The next day the charge for the room and the incidental fee that is only to be charged for damages both were put through anyway.  Health and Welfare Canada and perhaps Fraud Canada both should investigate this place. If I were Knights Inn International I would be pulling the name off this location.",
      "rate": 1.0,
      "tripDate": " February 2017"
    },
    {
      "title": "Hair!!!",
      "text": "I stayed at this motel this pass weekend for a family gathering nearby... The room I stayed in was so darn nasty there was hair in the bed sheets, there was hair on the toilet seat, and hair in the shower. There was type of strange smell there too.... the parking lot was very scary.. I had to sleep with the light on..",
      "rate": 1.0,
      "tripDate": " August 2014"
    },
    {
      "title": "Awful hotel - basically a 1 star with a brand name",
      "text": "This hotel was an utter disappointment. I will do this in point form starting with the good.The good:-bid on priceline for 41 USD + taxes and fees = less than 50 USD which is a pretty good deal however I have stayed at the Pickering Comfort Inn and the Scarborough Travelodge for less and they are both waaay better hotels- friendly staff, flatscreens, fresh waffles in the breakfast buffet, quick check-inThe bad:- minutes from one of the worst neighborhoods in Canada (Morningside/Lawrence) and the hotel is not well lit both outside and inside- no elevator.  no handicap friendly at all.  I was on the 4th floor with 4 bags.  Not a great way to star a hotel stay especially after a 3 hour drive.- dirty and old hotel with new flatscreens and linens basically- arrived and wanted to have a shower, one hand towel and one face cloth in bathroom.  called down for more.  was only brought up hand towels and face clothes.  The next day the room cleaned and I was left with no bath towels only one of each small towel.  Had to call down and this time was brought up 2 bath towels.  Had to leave a note for staff to leave bath towels - found this very odd.- the carpets are soiled and the shower did not work properly- The hotel is literally feet from busy Kingston Road and my room faced the road which was loud especially at night and early morning.- the breakfast was OK.  2 cereals, bagels, toast, fresh waffles, muffins, coffee, juice, tea.  No eggs, protien or yogurt which is very common at most 2 star breakfasts.- the location is not great for Scarborough.  To get to the 401 takes about 12-15 minutes because there are no left turns onto Kingston so you have to go to Morningside and then north.  Also not close to Scar Towne Centre or DVP.  I heard it is very close to the zoo, but then again you cant turn left (East) on Kingston so you would have to go west then turnaround and go east on Kingston, which is a waste of time and gas.- no restaurant/bar/pool/workout roomI guess this summarizes the hotel well.  I have been staying at hotels in the Scarborough area for work for about 2 years now.  I have to say that this is easily the worst \"name-brand\" hotel I have stayed at in Scarborough.  There are a lot of good and reasonably priced alternates in the area which I would stay at instead.  This is a 1 star hotel at best and is comparable to one of those mom and pop run motels you see on the side of the road.",
      "rate": 1.0,
      "tripDate": " April 2012"
    },
    {
      "title": "Never Again",
      "text": "Very unkept property from the inside and out.  The building itself needs a good cleaning and fixing up. The rooms were quite filthy.  Some rooms had refrigerators, some did not. The outside parking lot was littered with garbage.  The carpet was very dirty.  The tv quality was horrible.  The only positive was the free wi fi. Just seemed as though the owners did not care about their hotel.",
      "rate": 1.0,
      "tripDate": " May 2014"
    },
    {
      "title": "WORST hotel ever",
      "text": "Asides from the awful smell, unkempt atmosphere and all around dirtiness, I could NOT believe how rude the Indian man at the front desk was. He was an unprofessional sketchy man who could speak hardly any English and yelled at me for not understanding my question.Worst experience of my life. 0/10.",
      "rate": 1.0,
      "tripDate": " March 2014"
    },
    {
      "title": "Terrible Experience",
      "text": "The hotel room was in a deplorable state; smelly, old shaky funiture, loud staff, no wifi. Not good!!",
      "rate": 1.0,
      "tripDate": " March 2014"
    },
    {
      "title": "To:Quality Department Of Howard Johnson hotel chain",
      "text": "Some complain there is no elevator in this one.What I did not find in my room was no coffee maker,no telephone,no TV remote.AC unit on the wall could use some cleaning once in awhile beside being very loud while working.Room as whole could be in better shape.Some would say ; what you pay is what you get-seriously?Chose this location only if there is no other place available in the city,period.",
      "rate": 1.0,
      "tripDate": " October 2013"
    },
    {
      "title": "scary place to stay",
      "text": "In very bad location next to very sleazy motels.Room had no interior lock on door. Eating area had dirty cigarette butts on floor. Food was slopped all over counter. Bread bags left unopened. Coffee containers were empty.  I'd have to say the basement where the laundry room was looked the worst. However I never got bit by anything and the interior room and bathroom was okay. Tub looked newly refinished, heat in room worked well, had fridge and iron. Best of all my car was still there in the morning. I didn' t pay much to stay there but it was still better than the travelodge in Richmond Hill. What made my room bad was the horrible spray in there. Anyone with asthma be careful.",
      "rate": 1.0,
      "tripDate": " October 2013"
    },
    {
      "title": "Not up to HOJO standards",
      "text": "There was no hot water for showering. The bathroom did not seem to be cleaned for a new guest. The shower had hair from the previous occupant. The toilet tissue was near empty.",
      "rate": 1.0,
      "tripDate": " September 2013"
    },
    {
      "title": "Mold, dingy towels, flat pillows, breakfast in dark basement",
      "text": "My husband and I spent 5 days at the hotel to visit family. The carpet is filthy upstairs, downstairs and in the room. The bathroom had black mold on the tiles, dingy worn towels, wash cloths and the bathroom needed cleaning.  The hotel side door is left open and there are people hanging out in the parking lot. The breakfast area is dirty and dark. The pictures of the breakfast area that is shown on their website looks nothing like dirty dark basement where you will have your breakfast. You will have a choice of bran flakes and corn flakes from a dispenser. Your milk is in a pitcher and your orange juice in a dispenser and there is waffles, and toast. My husband went to the front desk to ask why the hotel have pictures of another hotels breakfast area however he was told he needs to speak to the manager, who was not there. I would never recommend this hotel and I will never return.",
      "rate": 1.0,
      "tripDate": " October 2012"
    },
    {
      "title": "Terrible ... Horrible ... NightMare ...",
      "text": "Well we stayed there for a few days ... It was a scortching few days and our air conditioner only blew hot air ... The shower wasn't working properly, then to top it all off the hair dryer didn't work ...We had no chair for the outside balcony ... And whats worse they are renting half the hotel to students which have access to all the amenaties that us paying customers pay for ... The pool and hot tub are barely usable due to this ! ! ! Had workers in and out of our room for days and nothing being done ! Horrible, terrible, beware people this place is a dump ! Take your time to use online tools to find better hotels ... For $19.00 more, you can stay at the Crowne Plaza or Holiday Inn .... And I have videos or this horrible experience ...",
      "rate": 1.0,
      "tripDate": " August 2012"
    },
    {
      "title": "Don't do it!",
      "text": "I booked though hotwire and that was my first mistake. I then did not check the reviews here.When we got there we knew we made a mistake. The manager asked if we would like to see the room first so we went to look at it and it did not take long for us to turn around and find an other place. There was a broken headboard left behind one of the beds,  cigarette burns in the sheets, pee stain on a mattress, and black mold in the shower.Don't make the same mistake we did.",
      "rate": 1.0,
      "tripDate": " August 2016"
    },
    {
      "title": "Get back in your car",
      "text": "We booked online no time to look around as we were attending and unexpected funeral. It was close to the funeral home we didn't have time to look around. Hotel is a Health & Safety hazard. Our room was on the backside of the hotel and it was the only room available of course. Debris a garbage laying around. Outside staircases are ripped carpet, broken and chipped concrete and steel. Many abandoned rooms on the way to ours with doors open and a mess inside. Housekeeping door just off to the left from ours. Pile of wood, glass pieces and construction materials on the walkway outside our door. In room the security bar was broken off, door didn't seem to be secure. Carpet was dirty, table hadn't been wiped, lacking general cleanliness. Due to time we stayed the night. The best part of the stay was the TV worked and we had s continental breakfast in AM. Do yourself a favour get back in your car, price is not everything!",
      "rate": 1.0,
      "tripDate": " June 2014"
    },
    {
      "title": "What a dump!",
      "text": "Where does one start?  My family and I had the misfortune of staying at this location on Christmas night 2013, because our home was affected by the big ice storm and we had no electricity from December 21 onwards.  We mistakenly thought that the Howard Johnson brand would ensure a certain level of comfort and cleanliness.  Wrong!  From the top - icy driveways and sidewalks were perilous...throw some salt down at least.  Then we entered our room, where there wasn't even a dollar-store mat to place our snow covered boots.  There was not even a hook to hang even one coat, much less three...so two were hung from the ironing board and one on a chair back.  In the bathroom, there were threadbare towels and a minimum quality of toilet paper, so one of our party had to go to the front desk to acquire sufficient quantities of each.  The bedding and pillows were lowest quality possible, totally inadequate for a cold winter night.  The heating unit was extremely noisy and prevented two of our party from getting any sleep.  The telephone in the room was circa 1975 and seemed like it could fall to pieces at any moment.  At 6 am In the morning, there was no hot water in the shower, and when called the front desk said \"just let it run for 10 minutes, it should come on\".  We then went to the front office to partake in the advertised breakfast, and found coffee that was probably run at least three times through the same grounds, plus scant supplies of bread, bagels, and other basics.In short, all of us in my party implore you to find another place to stay along the Kingston Road motel strip.  Otherwise, you might as well just set fire to a $100 bill and let it blow away in the wind, as this Howard Johnson's at 4694 Kingston Road is that big of a waste of your money.",
      "rate": 1.0,
      "tripDate": " December 2013"
    },
    {
      "title": "Totally disgusting!!!",
      "text": "We arrived last Saturday afternoon for a night stay. We were put in a basement room. Completely gross!! As we walked down the basement we could already see how dirty and badly maintained it was. The room was so dirty that we had to walk with shoes all our time there. We asked to be moved out of the basement and we were told that there was nothing they could do, that short staying guests were put in the basement. What an absurd! And this was NOT a last minute booking and we could see the hotel was almost empty. They just could not care less about our complaints. The bathroom had mould around the shower and was looking terrible and towels had stains or were simply dirty or both, I can't be sure. And to our horror, we found hair on the pillow case and toes nails on the sheets under the bed covers. It seems they didn't bother to change the sheets after the previous guest. Can you believe that? And the previous guest had gone into a nail clipping frenzy and the bedroom had not been cleaned. There were toes nails everywhere on the carpet and the room was very dusty as well. Since we had a performance to attend short after we arrived, we had no way to complain to Expedia or look for another hotel. So we simply demanded new sheets and pillowcases and changed them on our own to ensure they were really changed. Next morning, for our surprise, the breakfast room was also in the basement. Such a sad, dirty and ugly environment! The bagel was hard. It must have been a few days old. We were all disgusted by this experience. So please NEVER EVER get even close to this property. It was a terrible experiene for us.",
      "rate": 1.0,
      "tripDate": " November 2013"
    },
    {
      "title": "Disgusting",
      "text": "First, if you are travelling with a dog, they will stick you in a basement room. Gross! The first room they offered me reeked of cigarette smoke. The second room hadn't been dusted in weeks. There was dust on every surface, including the headboard. The bedding did not fit the mattress and it slipped overnight revealing that I had been sleeping directly on an unprotected mattress. Double gross.I had to direct them to clean and outfit the room properly, which only helped moderately. I can't even think about the carpet, which was still impregnated with the previous dog's hair.I don't need luxury, but I do need clean. I've been in frat boy rooms that were cleaner.",
      "rate": 1.0,
      "tripDate": " October 2013"
    },
    {
      "title": "Filthy and disgusting place",
      "text": "This is  hotel is an extremely dirty and filthy place with blood marks on their towels..My jewellery also went missing when the cleaning lady came in while my husband and I went out..They don't change their bedsheets regularly evn after we used them for a week and when I asked the cleaning lady to change them she got angry and began shouting at the front desk.. The place stinks of cigarettes and the area is also not a good one..I would suggest you pay more and rent a decent place..",
      "rate": 1.0,
      "tripDate": " July 2014"
    },
    {
      "title": "It is a dump",
      "text": "I have never stayed in a hotel/motel as disgusting as this.  The carpet is dirty - I am not sure that the towels were clean - there were \"dust-bunnies\" on all the furniture services.",
      "rate": 1.0,
      "tripDate": " July 2014"
    },
    {
      "title": "The worst stay ever.",
      "text": "there were bugs in my tea maker, lice in the pillows",
      "rate": 1.0,
      "tripDate": " May 2012"
    },
    {
      "title": "Never again",
      "text": "When I was booking the hotel  I called ahead and asked if I could be guaranteed a fridge in my room because i have a baby and need to store milk, I was told yes and once I make the reservation to call and they would put a note on my reservation. When I checked in the man said he doesn't know  which rooms have a fridge and if the room he assigns doesn't have a fridge he would store it in his fridge and i could get it anytime. The room was in horrible condition.  One corner of the ceiling was peeling off.  Dead spiders squished into the curtain.  Someone's hair in the shower.  Floor wasn't vacuumed or swept. The fitted sheets didn't fit the beds. And the rain came in under the door and soaked the first 1.5 feet of the carpet.  The owner didn't seem to care because they were not keeping the franchise.",
      "rate": 1.0,
      "tripDate": " October 2014"
    },
    {
      "title": "Please find yourself another place to stay!",
      "text": "I've seen quite some hotels in my life but this is by far the most terrible one!!! In some way it was my own fault because I should have checked reviews better before booking.When arriving at the hotel we immediately noticed a smell everywhere. We decided to put the window of the room open so some fresh air could come in and hopefully solve the problem.The bathroom was very dirty and I did not want to walk in either the bathroom or room without wearing slippers. We were planning to stay just one night here but we couldn't bare with staying here all night. The whole smell of the room made both of us very annoyed and so in the middle of the night we decided to just check out and go away; somehow this messed up 2 days of our holiday since we had a disrupted nights rest... or no rest at all.I wouldn't even wish my enemies to stay at a place like this. Absolutely unbelievable that people dare to offer these kind of rooms. The biggest dump I stayed at ever!",
      "rate": 1.0,
      "tripDate": " June 2013"
    },
    {
      "title": "Yikes",
      "text": "Outside looks terrible. Room smelled. No windows that open. Hair in the sink and shower. Breakfast was in a basement room with very little selection. Had to climb 3 flights of outdoor stairs to get to room. Not a picky person but this hotel was sketchy.",
      "rate": 1.0,
      "tripDate": " June 2013"
    }
  ]
}