{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Knights Inn Toronto East",
    "url": "/Hotel_Review-g155019-d184100-Reviews-Knights_Inn_Toronto_East-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "2.0",
      "reviewCount": 527
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "22 Metropolitan Rd",
      "addressLocality": "Toronto",
      "postalCode": "M1R 2T6",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-s/03/34/ed/29/howard-johnson-inn-suites.jpg?w=500&h=-1&s=1"
  },
  "description": null,
  "featues": [
    "Free parking",
    "Free High Speed Internet (WiFi)",
    "Pool",
    "Free breakfast",
    "Pets Allowed ( Dog / Pet Friendly )",
    "Car hire",
    "Business Center with Internet Access",
    "Banquet room",
    "Parking",
    "Wifi",
    "Hot tub",
    "Pool / beach towels",
    "Indoor pool",
    "Vending machine",
    "Meeting rooms",
    "Baggage storage",
    "Convenience store",
    "Non-smoking hotel",
    "ATM on site",
    "24-hour front desk",
    "Laundry service",
    "Self-serve laundry",
    "Air conditioning",
    "Safe",
    "Non-smoking rooms",
    "Suites",
    "Family rooms"
  ],
  "reviews": [
    {
      "title": "Cheap ",
      "text": "While the price point is good the quality of rooms and service is way off the mark.  The rooms are out of date and the rooms are not what is in the photo.  Not good for families or kids.  Electric sockets didn't have covers, heater or air didn't work.",
      "rate": 1.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Worst stay of my life",
      "text": "White mold outside my door with fan blowing on it.  Pool supposedly closed for maintence, but lwas full.  Sliding door ripped my shoulders out of sockets was so hard to open.  No fridge, microwave, etc.  Will never ever stay there again!",
      "rate": 1.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Stay away at all costs !!!",
      "text": "STAY AWAY AT ALL COSTS !!!We left the Howard Johnson's in a BAD snow storm, went to another hotel, and paid THREE TIMES THE PRICE.    If that doesn't say enough, read the rest of my review below.We were in Toronto for a christmas party, and due to a BAD snow storm, decided to stay the night in a hotel, rather than try to drive home.  (3 hrs on a good day)The Howard Johnson was located close to where our party was, so we drove over to get a room before they filled up.We approached the front desk, and waited while the 2 desk clerks spoke to the 1 man at the counter.    Neither of the clerks could speak clearly in English.We finally got a room.    While walking down the hall, we were met with terrible smells.    We made it to our room after dodging numerous kids playing in the halls.     We entered our room after a long day to find that the room smelled even worse.    The bed sheets were FILTHY.    My wife turned on the lamp beside the bed, and GOT A SHOCK !     I went to use the washroom, and found the towels were FILTHY as well.THAT WAS IT!We went back to the desk and DEMANDED a refund to our credit card.    The two clerks made numerous excuses, but their excuses were lame.    We found out that all these kids were from 2 sports teams, but were lacking adult supervison.     GREAT, but why should the other guests suffer.     What about the filty room, and horrible smells?    Again, more lame excuses.I told the front desk staff that they have only 1 chance to make a \"first immpresion\", and they missed the mark by a long shot.    I again demanded a refund to our credit card.We left in the snow storm, and went to the next exit along the 401...it took 15 minutes for a 3 minute drive...and checked in to another hotel...AT THREE TIMES THE PRICE, but the rooms, bedding, and washroom were spotless.As a previous Torontonian, it made me wonder what a lousy impression travellers must have of Toronto after staying at Howard Johnson - Toronto East.",
      "rate": 1.0,
      "tripDate": " November 2005"
    },
    {
      "title": "We laugh now....but...!!!!",
      "text": "We booked from New Zealand so had to rely on the website and didn't it look great for our holiday in June 2005!! Outdoor pool, landscaping, free breakfast, I thought this will do us for 5 nights !! After the the first night if our money hadn't already been taken by Visa and we would have had to have found somewhere else in a city we didn't know with our child in tow, we'd have gone.....far, far away ! If I had known then that we could check hotels on the internet like I have just done, the reviews would have rung alarm bells. Our first room had no air conditioning....in June ! We had 1 coffee cup to share and after phoning the reception to ask for another, we got a percolator an hour later and a telling off about what had we done to the first one ?? I explained my husband and I preferred our own coffee cups as we were planning to drink at the same time. The manager huffed off and 30 minutes later I went to reception to try my luck again. When the grumpy and unhelpful son of the manager went to get one from the \"restaurant\" he came back and said he couldn't find one !!! Asked for one from a room that wasn't occupied and that was a problem for him too. The air con was supposed to be getting fixed the next day, so I left it at that and hoped that would fix the musty smell in the bathroom also. The next day our key wouldn't let us back in as it had only been programmed for one night so in we had to traipse from one end of the hotel around to reception from the outside with a very tired 4 year old as there was no way we could get into our room. The air con wasn't fixed, the room stunk like something dead and we were NOT happy.After the key had been sorted out, my husband asked the handyman who had come to check that the air con really wasn't working if we could go to another room. He said no problem and was a honey about it. Opened up a room about 4 doors along and the air con worked, it had 2 coffee cups and it didn't smell.....thought we'd gone to heaven !! We moved all our luggage to the room  as he said the other one shouldn't have been used. My husband went back to reception to get the keys redone and was told we couldn't have that room....it was booked for someone else !! In words somewhat other than this, my husband said we were NOT moving and to give the next victim our old room instead.As he is quite a large man and was seriously ticked off about the treatment so far we had received, I think the son at reception did the wise thing and said okay ...we could keep the room.Now the breakfast was something else ! Stale pastries and paper plates and cups and plastic cutlery made us wonder when the UN supplies were arriving....by now we were starting to get a sense of humour about the place because it was like being in a episode of Fawlty Towers (an English comedy set in a poorly run hotel with a rude, arrogant manager). The outdoor pool that had looked so inviting on the website was empty and full of leaves and other assorted trash. The landscaping was an overgrown mess and after a flock of Canadian geese used the front entrance area as a mass toilet, it stayed like that from when we went out that morning until late in the afternoon when we came back and my husband complained about the smell and potential hygiene hazard from it.......grudgingly, someone went out and hosed the mess away......I mean ewwww! We were really pleased to leave and once bitten, did not stay at another Howard Johnson during the rest of our holiday in Canada. This place gives the chain a bad name and with my husband and I having travelled all over the world, this has got to be the worst we've ever encountered. The only redeeming feature of the whole experience was the heated pool was clean and a more pleasant place to be than our room, which quite frankly was grubby and smelly and not up to 3 stars at all. This is not a happy place.",
      "rate": 1.0,
      "tripDate": " June 2005"
    },
    {
      "title": "We survived it!",
      "text": "We and our two children spent two nights from July 1 to July 3 in the hotel. We booked based on the photos in the web-page, the brand name and price. Now we know why it is cheap. It was downright disgusting! We were absolutely disappointed. The exterior of the building is in a state of deterioration. The door lock at the back entrance was broken. The hallways stunk so much that we held our breath going through sections. The carpets clearly hadn't been cleaned or vacuumed for months based on the amount of dirt and cob webs, as well as a towel and a black bra lying in the hallway, which never got removed. The first night we spent in a room with a howling air conditioner with the insulation falling out. Because of the noise, we had to turn it off during the night. The pillows smelled, the sheets had holes and light bulbs were burnt out. One of the bedframes had protruding metal parts on which our 7 year old daughter cut her leg. The bathroom was fithy and moldy.Upon leaving the room the next morning, we discovered that the electronic door lock didn't function. So we got moved to another room which wasn't any cleaner.At breakfast there were just paper dishes and plastic utensils. There wasn't any staff around wiping the tables even after the guests had removed their own garbage. The outdoor pool resembled an abandoned rain filled pit. It was surrounded by a locked rusting metal fence.This hotel is absolutely bad advertising for the Howard Johnson brand. All of us were so glad, when we finally left this terrible place. Coming from overseas after a long flight, this is an unfortunate first impression of Toronto or Canadian standards!!",
      "rate": 1.0,
      "tripDate": " July 2006"
    },
    {
      "title": "Oh my god!!!!!Do not go here",
      "text": "ABSOLUTELY DISGUSTING!!! I booked this room through the Medeival Times Website. Well, I've written them and told them to take this hotel OFF their list. It's SICK. It STINKS, the rooms, are awful, the bathrooms are all rusted and the I left with a back ache and sore Neck from one night of sleep in this place. Plus I felt like I stunk after leaving!!  I was almost in tears when I walked into the Lobby let alone our Room!! DO NOT GO HERE!!!! Spend a few extra dollars and stay at a decent hotel. I would have spent $300/night rather than stay here. WILL NEVER GO BACK NOR RECOMMEND IT.",
      "rate": 1.0,
      "tripDate": " August 2006"
    },
    {
      "title": "I should have read the reviews first!!",
      "text": "This place is a mess.No ashtrays in the smoking rooms.Not vaccuumed properly.No plug for the tub.Missing security devices on doors and windows.The whole place smells of disenfectant but it is not enough to cover up the stench of who knows what!I stayed in 2 different rooms with exactly the same results.At least they are consistent!!!Management was rude and insulting.2 good points about this place:The maintenance guy went out of his way to find me an ashtray and apologized for the state of the hotel. He said that they didn't want to put any money into it as it was for sale.The pool and hot tub were very well kept. (But the changerooms were discusting).I tried to find a place to complain about the conditions but was unable to do so. i can't understand why Howard Johnsons would lend there good name to such an establishment.I they wish to contact me, i can be reached at: dnoseworthy@qxtechservices.com",
      "rate": 1.0,
      "tripDate": " November 2006"
    },
    {
      "title": "Would not recommend",
      "text": "Everyone has own opinions but needed to check out myself. We stayed here July 16-18 2006.  My family was disgusted with Motel. Landscaping was not up to par. Carpets filthy, needs to be cleaned.  The hallways smelled musty, the groundfloor room we had, we could not open sliding door, it was bolted into the frame. We needed to air the room out, but had to have air cond. on all the time. Beds were hard as a rock, could not sleep good.   We were placed all the way to the back of the Motel.  Giftshop was about 90*, the pool area was very humid and dry, much more than most of them.  Raccoons running around outside motel.  I would not go here again, if it was the last motel in the area. Shocked that Howard Johnson's name still on it.",
      "rate": 1.0,
      "tripDate": " June 2006"
    },
    {
      "title": "The Begining of the End!",
      "text": "After reading all these negatives reviews on TripAdvisor. I decided I'll stay here as Toronto Tourism had a deal where if you stayed 1 night you get a free $50 gas card and the rate was only $69 + 15% taxes. I want this review to be the beginning of the end of the Howard Johnson Toronto East. We visited the Inn a couple of days before our trip because we had some concerns about the place. The manager assured us we would be getting one of there better rooms and sh picked it out personally. We arrived at the Inn around 4:00 p.m. on Friday May 12th, 2006. We get in-line to a front desk personal who barley's understands English. He wanted to photocopy personal information like my son's e-mail address (We got our confirmation here), credit card number, and driver licence. I have been to many hotel in the last year and I have never came across this. I know you need a Credit Card for movies, damages etc. My son had many concerns about this has he had study identify fraud. We don't know who this guy is. After about a 15 minute argument he finally gave in. Then we ask where are gas card was he had no clue what we were talking about. He went to the back and found it. He gives us a map and circles are room with the no directions how to get there. (The map is from when it was a Quality Inn).DAY 1:We found the room and we were shock. When we first enter there is a box in the garbage can. Some paper on top of the T.V, the fridge door open, and a open bar of soap on the sink. We were booked in a Non-Smoking room but found some matches and an astray on top of the desk. When we were leaving we came to a staff member and ask if she could put  a Do Not Disturb Sign on as one was not provided. She said she would do it right a away. In the meantime we went out and bought a digital camera to take some pictures. (Which I'll be posting with this review). After my son took the pictures we went to the front-desk to ask to speak to the manager. The guy who could hardly speak any English said she went out but would be back in about 15 minutes. We sat at a desk while we waited for her to come back. My son search through it to find a lot of garbage. We saw the person who said she would put a Do Not Disturb sign on the door. (It wasn't there when we took the pictures). She told us that the Manager had gone home and won't be back until Monday but she was the Manager on Duty and could handle are concerns. We ask if we could go to another room until the manager came back. She said she could clean it but we refused as we wanted to show the manager. My son wanted to go to another place. He suggested the Best Western because it is the Official Hotel of NASCAR. But the Manager on Duty was bad mouthing my 16 year old son making him fell stupid that he didn't know what he was doing. He went outside and I said that We did not want the room clean and a Do Not Disturb sign on the door. I later found out that my son wasn't felling well because of the smell in the halls. He felt so sick he did not eat dinner that night. Until they invent camera where you can smell the area you won't know how bad the smell is. My son said that Second hand some smelt better. We left and head to the Best Western at Markham 3 highway stops down. Day 2: We came back to the Inn to find no Do Not Disturb sign. We try to get in but the keys do not work so back to the front desk to get it fix in the smelly hallways. We get in to the room to find it somewhat clean. This was an invasion of Privacy as we ask the room not to be touch. Luckily my son had no electronic in the rooms or they might have been stolen. My son eventually found a dirty DO Not Disturb sign in the big red garbage box near are room. (It was there the whole time we were there) and put it on our door. We went back to the Best Western.Day 3: I finally meet the manager after having to wait for her to come out of a meeting and she was shock to see the photo and was very sorry and offer me and my son 3 free night in there best room on another weekend and got the women who promise to put the Do Not Disturb on the door. The room  look O.K. When the Manager confronted the girl we dealt with over the weekend declined making fund of my son. The Manager said that she would show my son the room and follow up. My son is a very observant person and figure out what happen. When we were checking-in a guy came and complained about his room. He gave him our room. He took the keys that the guy threw down. That why it did not work the next day. The envelope the keys were in was very dirty. After about two week the Manager got back to us leaving us a [--] message saying how sorry she was and that she fired the girl who promised to put the Do Not Disturb sign on. Using the excuses that it was a old hotel. Being old means the wall paper peels off. That is no excuse for dirtiness. Every in that hotel seem dirty.I've been to some old places in Toronto East and Ontario and never had this problem. The HoJo is cheap and doesn't want to put any money into it. (That why they gave us a map from when it was a Quality Inn). I phone back and yet to hear from the manager and is a month later. I guess she doesn't want to get back to us because out Credit Card has been charged bit we are fighting the charges with Toronto Tourism. I am sorry for the long review. I really want this to be the beginning of the end of the Howard Johnson Toronto East.I finish off by saying that there are better place in Scarborough that are the same money, less, or a few dollars more. Some are the Travelodge, Best Western, Holiday Inn, and some cheaper place are the Super 8, Grand Motel, Manor Motel. All but the Manor Motel or AAA approved. If you look in this year book they are not listed. If any one from Cendant or HoJO is reading this yank there licence. I love your properties are rarely have problems don't let this place take away business from you be smart like Choice Hotels and Quality Inn. I hope you look at the Pictures and realize this place is a dumb and doesn't deserve a penny of your hard earn dollar. In respond to the most recent post the guy was probably hired by the HoJo because no one would like this place. This is the first negative review I wrote after about visiting a 100 hotel/motels and wriing reviews for them. E-Mail me if you want more pictues these are just some of the dirtiness.",
      "rate": 1.0,
      "tripDate": " May 2006"
    },
    {
      "title": "PAY ME $100 AND I WILL NOT STAY THERE AGAIN!",
      "text": "I would just pay the extra $20 and go to another hotel. My friend booked this hotel without checking reviews... And yes.... once we arrived, it was disgusting as hell! You cannot even walk on the carpet, I felt like my shoes were getting dirty while walking on the room carpet. The pictures which were uploaded through management do NOT in NOWAY describe what the rooms really look like. Every corner you turn to you will find something. From run down wall paper, dirty stained towels, shower disgusting (felt like walking into a sewer)!!! Oh boy oh boy, let me tell you, if you paid me $100 to stay in that hotel for a night, I would decline!! You guys just read and avoid this hotel. It is worse than anything else I've ever seen, and trust me I have been to many motels & hotels.",
      "rate": 1.0,
      "tripDate": " March 2012"
    },
    {
      "title": "AVOID",
      "text": "The place says 'NO Smoking' yet our room reeked. Bathroom not clean with a damp towel and, carpet WET. My wife found hair and stains on the sheets. I've stayed in lower price hotels but not often bad enough to warrant a review. It was pretty bad. Avoid unless you[re stuck",
      "rate": 1.0,
      "tripDate": " July 2012"
    },
    {
      "title": "Worst room I have ever rented - DON'T GO THERE",
      "text": "The walls in the halls had the wall paper coming off. The room was not clean...there were left over crumbs on the floor.  The box spring was torn and who knows how old. The bed was uncomfortable.  The heat did not work and neither did the phone to call the desk or get a wake up call. It was also very hard to locate.The whole exprience is one I wish to forget.....don't go there.",
      "rate": 1.0,
      "tripDate": " November 2011"
    },
    {
      "title": "Absolute garbage",
      "text": "Stayed with my Fiancee and her daughter for one night and thank God it was only for one night! The outside of this Hotel looked good as did the lobby area. But on our way to our room, we noticed that the carpets in the hallways were old and dirty. The room we got was filthy. The two chairs in the room had what looked like urine stains and one of the pillows smelled like someone's perfume. We complained to the front desk and we were told that if we wanted a cleaner hotel, don't stay here. Anyways, we got another room that was a little better but still the carpets in that room was not the best. Didn't walk bare foot the whole time we were there! Not worth the ninety bucks we paid!!",
      "rate": 1.0,
      "tripDate": " February 2009"
    },
    {
      "title": "OMG - Terrible and an OLD place",
      "text": "I had a room at the Ramada off the Don Valley but they were doing construction.  So they had to find me another hotel.This was the best they could do for the nite.  It was hot that nite, the air conditioner made soooo much noise i had to sweat all nite.  The place is old and dirty.No way is it a 3 star place.  Maybe 1/2 a star at the most.choose another place to stay.  pay the little extra, you'll be happy you did.  this place is a dump.",
      "rate": 1.0,
      "tripDate": " September 2007"
    },
    {
      "title": "Hojo not even fit for hobo's",
      "text": "I stayed at this hotel with my family and I have to say it was horrible.  I should have saved my $89 and stayed in a cardboard box at the city dump, that would have been an improvement.  The reservation manager who sounded like she was asian was extremely rude.  Even letting homeless people stay at this hotel would be cruel.",
      "rate": 1.0,
      "tripDate": " July 2007"
    },
    {
      "title": "Never again...",
      "text": "What can I say about a place that is in a sketchy neighborhood, in the middle of nowhere, very run down, dirty, unfriendly staff, ripped wall papers and carpet, maid service that never provide any towels.  Even at $69 it isn't worth it.  I wouldn't go there again if it is free...",
      "rate": 1.0,
      "tripDate": " April 2006"
    },
    {
      "title": "I would rather go camping than stay at this hotel!",
      "text": "I would rather go camping than stay at this hotel!Decided to try this hotel because of the low internet rate ($75.00 CAN per night) and because it was part of a large hotel chain (Howard Johnson).  I’ve learned from this experience to never trust the name alone.  From check in to check out (which was within an hour) customer service sucked. Make sure to check out the rooms before checking in.   The rooms are gross and make sure to especially check out the disgusting bathrooms.   The hotel internet site lies about the outdoor pool.  It was empty when we got there.   The plaque in the front lobby pledges that they hope to make you feel at home.  Well take my word for it there is not much they could do to make you feel at home, unless your home is as disgusting as the hotel.We checked out as soon as we had a look at the rooms and were able to find another hotel last minute.  We stayed at a Holliday Inn and yes it was well worth the money ($129.00 CAN per night)",
      "rate": 1.0,
      "tripDate": null
    },
    {
      "title": "Worst hotel in my memory",
      "text": "The location was  not good. I took it cause my appointment was only couple of mins away and Howard Johnson brand. All interior was VER VERY outdated including a tube tv. Lol. Bath fixtures were cracked. Toilet wouldn't flush in the morning. Omg. Never to that specific location again. And I'm sure Is infected with bugs. I have bumps which started appearing on my way back home on my left side of the body that I sleep on . I have stayed in the chain before.",
      "rate": 1.0,
      "tripDate": " April 2017"
    },
    {
      "title": "If you really want cheap & sleazy come on in",
      "text": "Upon check in the unfriendly guy at the desk kept me waiting to check in for near 10 mins while he messed with some paper that was apparently more important than looking after me. I would have turned around and left right then but my ride had left. I got checked in finally and proceeded to my room. The farther I walked, the more I wished that I had left. This place smells BAD. I hated to even touch anything. The room was cold, but I was OK with that but my if my wife had been with me there would have been a problem. On second thought , if she had been with me we would have left before even entering the room. The room was clean, no bugs( surprise, I looked ) but old and tired. I had expected to eat dinner on site as I had no car , they say there's a restaurant on site but it has been closed for a while. Not knowing the area I asked where I could eat and was told you can order pizza, I said that's it and was told yes that's it ??  Greasy pizza, couldn't eat it. Went hungry. The bed sucked, tv old and fuzzy. Little bath towels the size of hand towels. My morning shower was a treat, the water temperature kept going from very hot to cold so I had to trying to adjust it but nothing worked , I finally gave up. I went down to the free breakfast to get some orange juice & coffee but no orange juice. I was told that they had run out and there wouldn't be any until next week - not tomorrow next week?? I stayed here on someone else's dime and its hardly worth that. Howard Johnson's must be hard up for sites if they can keep there name on a place like this. I won't ever be back.",
      "rate": 1.0,
      "tripDate": " March 2013"
    },
    {
      "title": "Bad place to stay",
      "text": "Unexpectedly bad for a Howard Johnson name. I was totaly shocked by how dirty this place was. Hygiene was absent with flys humming around, garbage left in the hallway, filthy... And they still charged $92.05/nite.",
      "rate": 1.0,
      "tripDate": " June 2011"
    },
    {
      "title": "If ZERO was an option that's what I would rate it..",
      "text": "This is the absolutely worst dump and pathetic lodgings I have EVER encountered and I mean WORST!..I stayed in the Algoma Hotel in Sault Ste. Marie in 1981 on a trip from out west(a place where drunks sleep in the doorway and rooms with community bathrooms on the floor went for the astounding cost of $8 a night and it put this place to shame!!!..Weeds growing out of all areas of the concrete at entrance..Ugly landscaping..poorly lit..messy entrance because there are parts and sections of newspapers and magazines in the rack that were 3 - 4 months old and should have been cleaned up hundered times..my wife who was with me was ill so I asked that we be placed in an area where there were no children or full rooms as the hotel was almost empty..so they gave us a room around the back where the entrance to the hotel was so covered with old cigarette butts and litter as well as an overflowing garbage can..the area inside the entrance stunk of marijuana and urine..the hallways were musty smelling and dank and after we got into our room they started putting the other guests in all the rooms around us..my wife couldn't sleep because the Asian people(I love the Chinese, very family oriented but the ones who owned this place don't give a crap about anyone who isn't Asian) in the next room kept their room door open as they had other family members given the rooms around us and one had a small child that screamed and bawled until one in the morning..we had travelled 500 miles that day and were way too sick and tired to move to another room but the next day I found out there were dozens of empty rooms all over the hotel but they gave those rooms to their family guests so \"the maids didn't have to walk all over to clean that day\"..even after I asked for a room where no one was adjacent because of my wife's illness..going into the Chinese buffet restaurant located in the hotel is enough to turn you off the food as it smells like a cat litter box and stale urine..then when I went to that restaurant, the place was virtually empty and they sat me in a corner where there was no air circulation and it was very hot..then as more people came in which obviously were well known to the owners, they gave them central tables and only then turned the air conditioning on..the ONE thing I was looking forward to was a swim after a warm uncomfortable dinner experience.. yet the outdoor pool wasn't even maintained and the indoor one was closed by the Toronto Health department because of 'safety issues' with the doors..was told it would be fixed in an hour but wasn't fixed at all..no apology for my inconvenience..the next morning after a fitful night of semi-sleep we were awakened by the female STAFF who had gathered in the centre courtyard to talk and have coffee and pick flowers!!..and it wasn't even 7 A.M.!!!..even after I told them to quiet down they ignored me so instead of being able to sleep as needed(my wife had surgery the previous day and was ill) we ended up getting up and checking out because after the noisy staff had finally moved on the people in the neighbouring rooms opened their doors to 'visit' one another and the young child began to make noise while playing in the hall..upon checkout I said,\"I came here to get some sleep. Not be woken by your noisy staff who should know better.\"..and I received not an apology or concern, but only a dumb unknowing stare as if I was some kind of idiot..I never even bothered complaining to the HJ chain because I was so pissed off about the whole stay I didn't know where to start..even at it's cheap rate and half decent location for what we needed it for I would NEVER stay here again..unless you are 100% desperate and every other place is booked you'd be better off sleeping in your CAR!!!",
      "rate": 1.0,
      "tripDate": " June 2009"
    },
    {
      "title": "Absolutely Awful Place",
      "text": "I stayed at this place more than two years ago and I still can not forget how awful was the experience.  After reading grant.gill@gmail.com's review, I just have to reiterate that this place ought to be shutdown.  Absolutely horrific.Right off from my memory:(1) The parking lot was full of litters(2) Long check-in process and unorganized.  It took the front desk more than 30 minutes to check-in our rooms.  At first they lost our reservation and had to scramble and looked for it.(3) We booked 3 rooms.  All of them were filthy.  There were problems all over:leaky faucet, moldy bath tubs, spider webs, some of the beds / mattresses had collapsed springs (you couldn't sit on the side of the bed because you would slide down the collapsed springs), stinky pillows, the exterior doors of the hallway all had malfuctioning locks, the dust on the coffeemaker was thick enough to write our names on it, ...(4) the swimming pool was not to be used.  It looked more like a pond.  It took me a few seconds to recognize that it was a pool.(5) I can come up with more from my friends and relatives whom stayed with me.  But you should get the picture.I will never stay at that place again.  I would not recommend this to anyone.  If this place was recommended by my friend he will lose my trust forever.I guess they haven't done a thing in the past two years to fix up the place either.",
      "rate": 1.0,
      "tripDate": " April 2004"
    },
    {
      "title": "Gives HoJo's a Bad Name",
      "text": "How in the world could this get a hotel rating of 3 stars?? The room was smelly, as was the rest of the building. There was an overflowing garbage can that was never empited outside the back entrance. So much for security! The door to enter the building was broken! It didn't close properly so there was no point in the key card swipe! The room itself had dirty walls, stained shower stall. One garbage can for the whole room? Not even one in the bathroom. A 'sketchy' neighbourhood indeed... I went to get something from my car at about 10pm and there was a small group of young men hanging out with the music blasting from their cars.  The worse was at 9 am the next morning someone opened my door! It must have been housekeeping, and I yelled to tell them to get out - what is the staff doing in my room 2 hours before check out?? This place is the epitome of a disgusting place - dirty and unsafe.",
      "rate": 1.0,
      "tripDate": " June 2006"
    },
    {
      "title": "you get what you pay for",
      "text": "i stayed here from 11th oct 05 till 18th oct then back again from 26th till 3rd nov 05 the room we were given was a smoking room we asked to be moved and was given another room right away .. the room was basic but it suited us and like i say you do get what you pay for and it was cheap .. staff were helpful and when we returned on the 26th we asked for the same room and was given it ..the tv was not working called the front desk they replaced the tv for us . i did'nt want a 5 star hotel and what i got for my money was i think good.. after all you only sleep in there ..and the beds were clean .. i will be going back there .. so all i can say if you want a cheap place to sleep this is the place for you.. don't go there if you want five star service.. you will be dissapointed we were out most of the time so it suited our needs perfectly .... don't know about the pool did'nt use it but it loooked  very nice when we went to take a look",
      "rate": 2.0,
      "tripDate": " October 2005"
    },
    {
      "title": "Creepy and sketchy",
      "text": "I am not able to leave any stars.  None of the pictures seen were the same as the ones online they don't even have a sign.  This place has no signs, its run-downed horribly.  Smells moldy the outside looks like a ghetto scene from the movies.  We had no other place all was booked.  We should of slept in the car instead.  I would NOT RECOMMEND to anyone.....  Perfect place to film a horror movie.....",
      "rate": 1.0,
      "tripDate": " May 2018"
    },
    {
      "title": "Avoid at all costs",
      "text": "This hotle looks like it has not be renovated in 20 years. Our non-smoking room had about 50 cigarette burns and it looked like it was used for teenage parties for years. Do not stay here unless you like old carpet smell and average service.",
      "rate": 1.0,
      "tripDate": " July 2009"
    },
    {
      "title": "A DUMP.. Avoid",
      "text": "One on the worst hotels I have ever stayed in. Room was old with broken furnature that look as if it was picked up curb side somewhere. The walls are paper thin and I swear that prostitutes use this hotel on the weekends. Pay the extra $20 or so per night and move to the Raddsion or Comfort Inn a few exits down the 401.",
      "rate": 1.0,
      "tripDate": " July 2009"
    },
    {
      "title": "Embarrassed to bring my family there...",
      "text": "I wish I had read some reviews before going. I'm with most of the other people about how terrible the conditions were. We had mould in our bathroom ceiling. The carpets hadn't been vacuumed in who knows how long. The paint flakes were all over... The comforter on the bed had cigarette burns. We were going to the zoo in the morning so it would be nice to let the kids swim in the pool before breakfast but the pool didn't open before 9am??? PLEASE STAY AWAY FROM THIS HOTELI wrote to HoJo about this so I will update the review if they respond.We checked out after the first night and went to the Delta Toronto East. Delta saved our vacation and my pride.",
      "rate": 1.0,
      "tripDate": " August 2007"
    },
    {
      "title": "Best Deal in Toronto",
      "text": "This is a two storey hotel, that was once a Holiday Inn Many years ago according to my old map. Each room has a patio door that overlooks the parking lot-type hotel. The patio doors do not open for security reasons I guess, which is good. Easy to find location right off the 401, next to the Zellers Distribution Center. Easy drive to Toronto Zoo, and close to Don Valley Parkway, making it easy to drive into downtown core.Positives:  Kid friendly.  Toy kids played with in the lobby. Staff friendly. Heated indoor pool. Hot hot tub (104F), Sauna is nice. This was a family highlight to go back every evening to the pool. Tile floors in Bathroom were heated..nice surprise. Free Daily newspaper dropped off at your door every morning (National Post and Financial Post). This is a nice touch that usually you only see in high end hotels. Man in breakfast room does excellent job keeping the breakfast clean and restocked. Call to your room from staff after arrival a nice touch. Requested and given a ground floor room. Do this as their is no elevator. Great family rates...The best deal in Toronto as it includes breakfast. This is a real savings for a family. It is also a real time saver, not to have to go out for breakfast. Grand piano in lobby.Negatives: The outdoor pool was not filled. The  \"beautiful inner courtyard\" was locked. We never got the promised email confirmation. We were doubled booked when we arrived (ie. 2 rooms). Only one highchair in the breakfast room. No fruit as advertised on their web page in the deluxe continental breakfast. There were no coupons for children's meals at Denny's as advertised on the main HOJO's website through which we booked. No response from management to this issue. Charged for 2 long distance calls which we never made (2 x $1.15). Front desk response: \"well, it's only $2 and the computer says that you made them\". This hotel charges DMF of $1.95 plus tax Per Night. Many ice machines are not functioning. Could use a little touch up paint along the door frames/wall paper repair to make first impressions more positive. Fitness center consists of a Health Ryder and a stair stepper. Could use a bit more stuff. Front desk is always busy, you always have to wait for assistance. You cannot call into rooms using the lobby house phone as it is a rotary dial phone \"press the room number you wish to connect to\". Carpets look clean in rooms (vacuumed), but do not pass the damp towel swipe test.Kids are still talking about how great the pool was.",
      "rate": 3.0,
      "tripDate": null
    },
    {
      "title": "Stay If you like Bed Bugs",
      "text": "We stayed there and have to say we would have been bettter off sleeping on the streets which were cleaner.  We got into our room and found a empty package of oxy contins under the sink also found powder on the sink.  There were dead bug and insect bodies between the Ac and the fridge.  There was an empty popcan on the balcony that was crawling with ants.  The best part of all was the fact that we were bitten by bed bugs our youngest child got but the worst and was seen by a dr due to an infection from the Bites.  The 98 dollars a night we paid for the room was not worth it.  What else can i say OH ya the hotel was full of exchange student who thought it would be a laugh to go running through the halls scremaing at 6am.  Ohh and if you like the smell of marijuana lofting through the hallways then this is definatly the place for you,,...We will never ever stay with Howard Johnson again",
      "rate": 1.0,
      "tripDate": " July 2012"
    }
  ]
}