{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Le Germain Hotel Toronto Mercer",
    "url": "/Hotel_Review-g155019-d268507-Reviews-Le_Germain_Hotel_Toronto_Mercer-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.5",
      "reviewCount": 1133
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "30 Mercer St",
      "addressLocality": "Toronto",
      "postalCode": "M5V 1H3",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2c/c0/21/ab/hotel-exterior-z-dc-cu.jpg?w=500&h=-1&s=1"
  },
  "description": "Set among the theatres of the Entertainment District, this chic, upscale hotel is a few minutes walk from St. Andrew subway station, the Rogers Centre, Ripley’s Aquarium of Canada and the CN Tower. The sleek, refined and luxury rooms and suites feature HD TVs, Nespresso coffee machines and Bose stereos, as well as free Wi-Fi. There's also an acclaimed restaurant, a library, and a seasonal rooftop patio and putting green for the best stay possible in Toronto. Other amenities include a fitness room and 4 meeting spaces.",
  "featues": [
    "Valet parking",
    "Free High Speed Internet (WiFi)",
    "Fitness Center with Gym / Workout Room",
    "Bar / lounge",
    "Kids stay free",
    "Pets Allowed ( Dog / Pet Friendly )",
    "Business Center with Internet Access",
    "Conference facilities",
    "Paid public parking nearby",
    "Wifi",
    "Restaurant",
    "Breakfast available",
    "Breakfast in the room",
    "Complimentary Instant Coffee",
    "Complimentary tea",
    "Banquet room",
    "Meeting rooms",
    "Baggage storage",
    "Concierge",
    "Non-smoking hotel",
    "Doorperson",
    "Umbrella",
    "24-hour check-in",
    "24-hour front desk",
    "Dry cleaning",
    "Laundry service",
    "Bathrobes",
    "Air conditioning",
    "Desk",
    "Fireplace",
    "Room service",
    "Coffee / tea maker",
    "Minibar",
    "Flatscreen TV",
    "Safe",
    "Telephone",
    "Iron",
    "Private bathrooms",
    "Wake-up service / alarm clock",
    "Refrigerator",
    "Non-smoking rooms",
    "Suites"
  ],
  "reviews": [
    {
      "title": "Have dinner in room 🍽🥂🍷",
      "text": "Currently this is a very good business way , eating in the room cost $350 including a night 2 person dinner of four courses, a bottle of wine 🍷 everything is perfect. Thank you very much . Extra cocktails, wine and coffee needed to pay. Taxes 13% plus 18% room service charging.Anyway I was enjoying the experience. Will try maple leaf place later.",
      "rate": 5.0,
      "tripDate": " December 2020"
    },
    {
      "title": "COVID update",
      "text": "In this COVID time any discerning traveller must be concerned with how the hotel performs under their protocols.Upon arrival I was met by the superb employee Frederick who welcomed me through the ultra clean lobby. The elevator wisely had an occupancy limit of one unless you are with your bubble. The room itself was spotless and promoted a feeling of calm. Top staffer Frederick arranged for a specific reservation in the gym for myself only which I loved. After my workout a cleaning squad refreshed the gym for the next lucky guest!I can highly recommend the hotel and the professional staff!",
      "rate": 5.0,
      "tripDate": " September 2020"
    },
    {
      "title": "Book it now!",
      "text": "For business I have stayed at 10 different hotels in Toronto and this one is the best. I enjoyed the hotel staffing levels, the boutique feeling vs a 500 room place, the complimentary breakfast and the overall tasteful design touches found throughout the hotel and the rooms. The only challenge is the UBER drivers can’t seem to find the place.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Poor value.",
      "text": "After two weeks touring Newfoundland this hotel was meant to be a treat before flying back to England. Although our most expensive hotel room it was somewhat lacking. Absolutely no hotel information in the room other than an extremely expensive list of items for sale which included a small bottle of water for .€5.00! Larger bottles were free in the majority of far less expensive hotels we’ve stayed in over the past two weeks. Weird bathroom! No door and bath gel in fixed bottles mounted far too high to reach whilst bathing. Great TV but sadly no channel guide do we had no clue what we could watch. Only 3 coffee pods and two creamers provided and not replaced (until we asked) for our second night. Not the hotels fault but they could have warned us about the massive construction going on in the street outside.Bedside USB sockets don’t work!",
      "rate": 2.0,
      "tripDate": " June 2024"
    },
    {
      "title": "On the hard shoulder",
      "text": "The noisiest hotel I think I have ever stayed in. It’s as if it sits on the hard shoulder of a motorway next to a building site. The advertised roof restaurant with fine views over Toronto is closed because, allegedly, they can’t get the staff and also because the new hotel being built on the opposite side of the street will obscure the view anyway.The room, not ready when we arrived at 4.30pm, is OK though gloomy and chilly. The location is dispiriting, being opposite a building site. There must be better places to stay in Toronto.",
      "rate": 2.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Strange Room Lighting Needs to be Fixed",
      "text": "Surprisingly quiet hotel considering the construction across the street. Close to the railway station and near a number of restaurants. Front desk staff is friendly and helpful. Flexible check-out time is a plus. Unfortunately, the rooms have extremely dim lighting, no sheer curtains to block the construction workers from seeing into the rooms, and a pricey restaurant with lots of staff, but slow service.",
      "rate": 4.0,
      "tripDate": " May 2023"
    },
    {
      "title": "Amazing service and staff!!",
      "text": "This was the first time that we stayed here and I will definitely stay here again.After contacting the concierge several times in the late evening, regarding some emergency first aid supplies I needed, she brought us the items needed immediately.  I'm just sorry I didn't get her name!The staff was very courteous and very helpful.  Beautiful hotel!  If there was more than 5 stars, I would rate it much higher.  The staff went above and beyond!!",
      "rate": 5.0,
      "tripDate": " September 2022"
    },
    {
      "title": "One of our new favorites!",
      "text": "Wow! This hotel exceeded all of our expectations. We only stayed one evening, but between the friendly staff, stunning rooms, and attention to cleanliness, this was the perfect choice! We will most definitely be back! Highly suggest this location as well as it is just a 5 minute walk to the Rogers Centre/CN Tower area.",
      "rate": 5.0,
      "tripDate": " July 2023"
    },
    {
      "title": "Memorable!!! Location was perfect!!!!!!",
      "text": "The room was very spacious, bed was VERY comfortable, bathroom was big with counter to place your toiletries. Everything was very clean and the location was perfect!We went to see a musical at the princess of wales theatre and it was a 3 min walk to everything we needed!Thank you for a Wonderful Stay!!MEMORABLE…We will be back!!!",
      "rate": 5.0,
      "tripDate": " April 2023"
    },
    {
      "title": "Construction noise +++",
      "text": "we woke up at 6 am with the very loud noise of construction directly across from our room. I did ask if we could be moved when we arrived and was told there was no other room like ours available. No other option was suggested.The day of our arrival all bars, restaurants, room service were unavailable due to some emergency. Not sure why they couldn't open a bar. No milk or cream available for coffee. Only 1 long coffee available for 2 people. No tea at all.We were booked for 2 nights and left after 1. Overall very disappointing for what we paid.",
      "rate": 2.0,
      "tripDate": " August 2021"
    },
    {
      "title": "Excellent",
      "text": "The room was spacious, modern, well decorated, comfortable and looked great. It is dark in the room but ultimately that helped with a very good nights sleep! The service was great with excellent personalities. Highly recommend - and the location is great too!",
      "rate": 5.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Great except for the breakfast",
      "text": "Have been there before. Room is still great, roomy and well appointed . The breakfast on the go in a brown bag less so. Great but very small rooftop lounge. Will go again if they upgrade the breakfast experience. Good location . As everywhere else, need to ask for housekeeping which we did. Was well done.",
      "rate": 4.0,
      "tripDate": " August 2021"
    },
    {
      "title": "Great customer service and great location",
      "text": "Great location. The rooms are spacious, well appointed, quiet and clean.  The beds are amazingly comfortable.   There were cute shops and awesome food within walking distance. Great service, very friendly. Overall I would stay again and recommend.",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Toronto getaway",
      "text": "Unbelievable stay at Le Germain. Haven’t been back to Toronto in years and the hotel staff made us feel like we were back home. Tatiana and team even got us dinner reservations at our fave restaurant. Will only stay here when visiting Toronto from now on. Highly recommend.",
      "rate": 5.0,
      "tripDate": " May 2022"
    },
    {
      "title": "Excellent return to open",
      "text": "I guess we ended up staying on the first weekend since being closed for covid. With everything being a stand still, the people who work there were fantastic. From the moment we got there, to the moment we left, the stay was really enjoyable. Rooms were very nice and the beds were really comfortable. Loved the rain shower as well. We will be back soon.",
      "rate": 5.0,
      "tripDate": " September 2020"
    },
    {
      "title": "St.Germain Mercer",
      "text": "Family booked the King suite to end a wonderful 75th birthday for my husband. Started out at Blue Jay game,then Rodney's Oyster House. We had drinks to finish off the evening at the rooftop,then the downstairs bar. The check in ,valet underground parking , the boutique hotel complete with robes, bedding everything was 5*.Highly recommend.",
      "rate": 5.0,
      "tripDate": " July 2023"
    },
    {
      "title": "Without a doubt the best hotel in Toronto",
      "text": "My husband and I have stayed at Le Germain hotel several times and we just came back from another stay there and I thought it was time to share my views on this hotel.  First let me say that I am very fussy about hotels and truthfully I am not a big fan of staying in hotels mainly because of issues like I am afraid to touch the bedspread and have even went as far as to bring my own towels and sheets when staying in hotels and we are not talking here about cheap hotels.  Well there is no need to do any of that at Le Germain.  It is a phenomenal hotel, just outstanding in every way. The lobby is breathtaking and very welcoming as is the staff, which we have always found to be very polite, friendly and helpful.  The rooms are modern yet cozy with plenty of space for your luggage.  I especially like the the choice of lighting and beside each side of the bed there are two lights to choose from, not counting the relaxing pot lights over the window and great desk lamp for your computer or other needs. The bed is ultra comfortable and the bedding is so clean and fresh, I have really never stayed anywhere else with bedding this incredible, well that is except the other Germain Hotel we have stayed at in Quebec City (The Hotel Dominion 1912).  The bathroom is amazing, very clean and with a great vanity to put your makeup on...and the luxurious rainfall shower is the highest quality shower I have ever seen anywhere.  I would seriously never even consider staying any where else when we visit Toronto.  For whatever reason we stay at this hotel we always feel like we are on vacation while staying here and the only negative I can think of is having to leave.  Thank you for taking the time to read my review!",
      "rate": 5.0,
      "tripDate": " April 2006"
    },
    {
      "title": "Great weekend !",
      "text": "My wife and I spent a great weekend at Le Germain. The hotel manages to be both very stylish and comfortable at the same time. The rooms are large and furnished with comfortable contemporary furnishings (great beds). The bathrooms are the best I have ever experienced ! We didn't have dinner at the restaurant but did have drinks and found the space to be very cool and the sevice excellent. The staff could not have been nicer with one doorman braving a rain storm to ensure we had a cab available to us quickly. The gym could be significantly better but given the rest of the experience we would go back in a heartbeat !",
      "rate": 5.0,
      "tripDate": " September 2005"
    },
    {
      "title": "Spectacular",
      "text": "I treated my wife to a stay at Le Germain for her birthday, and I practically had to drag her out of the room the next morning. It was stunning, from the decor -- dark wood, high ceilings, luxurious bed, comfortable chairs, beautiful bathroom -- to the service. The staff was professional and thorough, check-in/out was quick, the lobby and library are gorgeous...even the continental breakfast was impressive!I also *highly* recommend eating downstairs at Luce if you have the chance. Be sure to book a table when you make your reservation.It's not a cheap hotel, but I'd recommend it over the comparably-priced Soho Met any day of the week. That said, if you stay at Le Germain for a second night, you might want to sneak over to the Soho Met for a meal at Senses!",
      "rate": 5.0,
      "tripDate": " February 2006"
    },
    {
      "title": "Excellent Hotel",
      "text": "Spent the weekend of July 29th - mirror what many have written here - great location, excellent service and modern, funky and spacious rooms.Note - the hotel does not have a liquor license and there is no hotel bar but there is a tiny alcove of a bar in the adjoining restaurant - btw, my wife and I had a outstanding meal here - pricey but worth it!",
      "rate": 5.0,
      "tripDate": " July 2005"
    },
    {
      "title": "Amazing Stay, Excellent Service!",
      "text": "We recently stayed in this hotel for one night. Hotel delivers excellent customer service from the moment you walk until the very end of your stay. Great attention to details and thank you for that! We all felt that everyone went above and beyond to make our stay extra special.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Disappointing to say the least!",
      "text": "Dark hotel, gloomy room (apparently it’s the ‘vibe’). Awful standard Continental breakfast. No choice just a couple of croissants, dull fruit, scraps of processed chicken and a bite of cheese. Had 1 glass of white wine. Charged CAD 21. Totally unreasonable. Opposite a construction site situated on a filthy, dusty side street. Disappointing to say the least.",
      "rate": 2.0,
      "tripDate": " June 2023"
    },
    {
      "title": "Visit to the city",
      "text": "Spent two nights at this hotel with friends to celebrate birthdays. Enjoyed every minute we stayed here. Comfy beds, great coffee and personalized service is what we enjoyed. Spacious room with a state of the art washroom. Hotel is ideally located with walking distance to CN Tower, Aquarium, TIFF Bell and theatres. Lots of restaurants offering fine dining. Staff were very friendly and helpful in suggesting activities.If you like personal friendly service, this is where to stay.",
      "rate": 5.0,
      "tripDate": " November 2021"
    },
    {
      "title": "Nice location but……",
      "text": "This was a lovely hotel to go to with everything nicely appointed Nice small bar and restaurant My only issue was the shower didn’t have hot water only warm and the shower made a god almighty noise. When I told front desk they blamed the construction work across the road. For $400 a night I expected more",
      "rate": 3.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Fantastic accommodations",
      "text": "This is a gem of a hotel in a great downtown Toronto location. I was attending a conference at the Metro Toronto Convention Center, and the location couldn't have been better. Every aspect was superb - the decor, the room furnishings, the gym and the bar (shout-out to the great Manhattans!). I didn't eat at the restaurant  but the menu looked great, and I'm sure the food would have been on a par with the rest of the property.",
      "rate": 5.0,
      "tripDate": " May 2024"
    },
    {
      "title": "Business Stay",
      "text": "I stayed at this hotel while attending a conference held at the Metro Toronto Convention Centre. The hotel was a short walking distance from the centre. The lattes at breakfast were very yummy and recommend. The rooms were very beautiful and the beds were extremely comfy. Would stay here again!",
      "rate": 5.0,
      "tripDate": " March 2019"
    },
    {
      "title": "Luxurious and quiet stay",
      "text": "We just got back from a 3 night stay, and it was fantastic! The rooms are large and cozy, and the bathroom is like a spa. (That shower!) My husband and I both commented on how quiet our stay was, probably the quietest stay we've ever had at a hotel. All of the staff we encountered were friendly and lovely, with check in/out being such a breeze. Would highly recommend staying here!",
      "rate": 5.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Very good stay",
      "text": "We recently stayed for the weekend and had a great experience. Right from my first phone call, staff were spot on in terms of their customer service. Our room was well appointed, comfortable and well laid out. Love the dyson hairdryer and molton brown products!!! Everything is available upon request. The only negative is that there is construction going on across the road and it started at a very early hour on Saturday. Special thanks to Stephanie for helping us figure out our stay. I look forward to my next visit! Thank you",
      "rate": 4.0,
      "tripDate": " September 2020"
    },
    {
      "title": "Would recommend but skip the continental breakfast!",
      "text": "Beautifully designed and comfortable rooms (although lighting difficult to work out!). Continental breakfast very disappointing, however, al La carte menu was excellent. Restaurant staff seemed to be new, reception staff very helpful!",
      "rate": 4.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Great hotel, close to everything!",
      "text": "Stayed one night for business purposes. Rooms are modern, clean and very spacious. Bed was huge with four oversized pillows. Nice bathroom with rain water shower. Service at the lobby was very friendly, a genuine type of friendliness. I did not try the restaurant. Only down side which is out of the hotel’s control is the construction across the street.",
      "rate": 5.0,
      "tripDate": " May 2023"
    },
    {
      "title": "Wonderful local getaway",
      "text": "Superb trendy boutique hotel experience. Had a comfortable overnight stay - the room has a masculine aesthetic which is different from most bright white rooms- think dark browns and black walls which was a nice change. Brown wood slat blinds between the glass bathroom and room. Lots of spaces for hanging clothes or placing bags. Nice long lengths of desk/table for work. We used a meeting room and the catered food was superb. Delicious soup salads sandwiches and desserts. Our dinner at Victors was also beautifully plated and lovely. Agree with other comments there is a lot of construction in Toronto currently. Nobu is going up across the alley street/main door.Everyone is so friendly here from door man to check in to servers at catering. No hesitation recommending and also for local overnight getaway.",
      "rate": 5.0,
      "tripDate": " June 2024"
    },
    {
      "title": "Sightseeing trip",
      "text": "Stayed for 5 nights to celebrate my wife's 50th birthday. I am a Canadian but have lived in Scotland for over 30 years, so it was a perfect opportunity to visit Toronto, cath up with some family and enjoy the sights. As others have mentioned, there is construction going on and no mention of that on Expedia website when we booked. Saying that we were never disturbed by any workers or noise. Check in was easy and all the staff we met were very pleasant and helpful. The room was large and designed with a dark, moody style - this helped with sleeping. The location is right in the heart of the entertainment district and pretty central to .oat things - CN Tower, Etc. Would happily stay at the hotel again and would recommend to anyone.",
      "rate": 4.0,
      "tripDate": " August 2023"
    },
    {
      "title": "A noisy construction site.... don't stay!",
      "text": "Until the construction is finished all I can say is don't bother to visit this hotel.  Work starts at 7am and its awful.  We even left with concrete all over our shoes/boots, complete disaster.In terms of the actual hotel once inside I'm afraid to say it didn't improve much.  Short of staff, short on most things really.  It felt like it was closed and dark.  Bar opened occasionally.  As we left I even had to load up bags on trolley myself and the staff watched as I tried to get out the door without any help whatsoever.  Restaurant was closed so breakfast served as a cold boiled egg in a paper bag!DO NOT WASTE YOUR MONEY....",
      "rate": 1.0,
      "tripDate": " November 2021"
    },
    {
      "title": "Another very pleasant experience",
      "text": "We stayed for two lovely nights this past weekend. Had a 10th floor room with a great view. the room was very large, comfortable and had everything we needed. Safety features in effect. All staff members were friendly, professional and grateful that we were staying there. Business is so quiet for them. The bar on the first floor (Victor) was open only until 9pm each day, but server was also wonderful. During covid, cleaning staff did not enter our room to tidy up, which is completely understandable and not an issue whatsoever. If we had needed anything, we only had to ask someone at the desk. We've stayed here before and it's a great hotel, and situated in a great location. We will stay here again in the future. Highly recommended for a great getaway.",
      "rate": 5.0,
      "tripDate": " September 2020"
    },
    {
      "title": "Great hotel",
      "text": "This hotel was perfect for us. We had an executive room which means we had a sitting room and a separate bedroom. We chose this so that my teenage son could sleep on a bed in the sitting room. We have not found that many hotels which guarantee interconnecting rooms, so this was great for us. The hotel is very quiet and the beds were comfortable. As mentioned in other review, the building works start bang on 7am. We decided to use this as our alarm rather than get annoyed about it. When this work has finished (and Nobu restaurant is opposite) this hotel will be top notch.",
      "rate": 5.0,
      "tripDate": " August 2023"
    },
    {
      "title": "Amazing staff sets this place apart. ",
      "text": "I've stayed at a lot of nice places. Mainly across the US. Some in the Ontario area though. They all have beautiful rooms and a great atmosphere. But what they all don't have, and this definitely sets this hotel apart, is an incredible staff. The people who work here are the friendliest, most helpful hotel staff I've ever come across. From the moment we pulled our car to the front of the building, until the moment we left, they just looked out for us in every way. Room service was excellent, front desk was excellent, I mean everything. The valet was so friendly and not only unloaded our car, but took us and our luggage to our room. Need something out of your car, no problem, let's go down to the garage to help you get it. I'm guessing it was a manager that stood outside and talked to us for awhile while we waited for an Uber. Just an amazing experience. Oh, and I want a shower just like that in our home.",
      "rate": 5.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Great hotel, weird bathroom.",
      "text": "The room was very large and the bed, enormous and comfortable. It was hot outside so we were pleased the air conditioning worked well. With so much space it would have been good to have 2 easy chairs instead of just the one. Everywhere was immaculately clean and well presented. Now I come to the bathroom issues. Personal preference I know, but I really don't want to bathe or shower in full view of the other occupant in the room. There was a clear glass panel between the bath/shower and the main room. Yes there was a blind to close, but the slats didn't completely meet. When getting out of the shower there is no privacy. The toilet was in a separate cubicle thank goodness. Hurrah for The excellent bathrobes.The continental breakfast was tasty and the servers attentive. The staff working the entrance were excellent, friendly and very helpful. So much was very good about this hotel, but in some aspects it didn't quite meet our expectations.",
      "rate": 4.0,
      "tripDate": " June 2024"
    },
    {
      "title": "Luxurious rooms & bathrooms. Great location!",
      "text": "This boutique hotel has large, luxurious rooms and extra large luxurious bathrooms. It is trendy and chic in the lobby and rooms. And very comfortable beds! The staff is attentive and it is not busy. Short walk to the theatre, to the Air Canada Centre, the CN Tower or Queen St shopping and about 19 min. walk to the Eaton Ctr.This is where i stay every time I come to Toronto.",
      "rate": 5.0,
      "tripDate": " April 2022"
    },
    {
      "title": "Decent choice",
      "text": "Nice location within easy walking distance of waterfront, shopping, CN tower etc. Modern rooms, well equipped with a nice bathroom (no tub though). Continental breakfast was fine. Very comfortable bed with nice linen. Room (at the front of the building) was, however, very noisy with a constant ‘hum’ which made sleeping a little difficult, and there is major construction work going on directly opposite. Staff are great - very friendly and helpful.",
      "rate": 4.0,
      "tripDate": " September 2023"
    },
    {
      "title": "T he beautiful dame has lost some of her beauty.",
      "text": "I have been a loyal guest since its opening in 2003. That in itself says a lot. However, much has changed over the years. This hotel used to be the pinnacle of a boutique hotel.  Beautiful decor, chocolates near your bed, an incredible breakfast included in your stay, bottled water as you leave the hotel, and soaps and lotions from Molton Brown. Sadly, no chocolates, no breakfast, no water, no Molton Brown products. All the extras that I loved are gone. Not sure what caused the decision to eliminate these lovely perks. Worst of all, the surrounding construction has limited the sunlight into the hotel casting some darkness on several parts of the hotel. What hasn't changed, is the impeccable service and the staff's willingness to help with any request.",
      "rate": 4.0,
      "tripDate": " March 2024"
    }
  ]
}