{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Lido Motel",
    "url": "/Hotel_Review-g155019-d6522345-Reviews-Lido_Motel-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.0",
      "reviewCount": 5
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "4674 Kingston Rd",
      "addressLocality": "Toronto",
      "postalCode": "M1E 2P9",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/05/bb/88/71/lido-motel.jpg?w=500&h=400&s=1"
  },
  "description": null,
  "featues": [
    "Parking",
    "Vending machine",
    "Express check-in / check-out",
    "Air conditioning",
    "Desk",
    "Seating area",
    "Telephone",
    "Wake-up service / alarm clock",
    "Flatscreen TV",
    "Bath / shower"
  ],
  "reviews": [
    {
      "title": "Terrible stay",
      "text": "I stayed at this motel for 1 night and it was the worst stay ever. The room was so unhygienic and small. They had the TV from the 90's which din work well. Also the staff was ignorant. The sheets were pale and dirty. Overall, my stay was a nightmare here.",
      "rate": 2.0,
      "tripDate": " July 2017"
    },
    {
      "title": "Below Average Quality",
      "text": "If you have a family, this is definitely not the place to stay. Pass it up if you are looking for quality, cleanliness and privacy. The sheets were dirty, there were no towels and the carpet was wet in the room. I had to leave an additional deposit to take the TV remote to my room and, alas, the remote did not work. It is a very noisy hotel. The walls and doors are paper thin. It is definitely a budget hotel where guests can rent by the hour. Not recommended for families with children!The location, on the other, is great.",
      "rate": 2.0,
      "tripDate": " December 2016"
    },
    {
      "title": "Had a great stay and clean rooms with great service",
      "text": "I stayed here for 2 days and had a great time and great service from front desk at all times.  This motel is very clean with great service. I did request to have room cleaned daily and was not a problem.",
      "rate": 5.0,
      "tripDate": " April 2014"
    },
    {
      "title": "TERRIBLE PLACE TO STAY/BAD SERVICE!!!!!!!!!!!!!!!!!",
      "text": "The bathroom had insects. The window by the sink was falling apart. They got an amazing looking stove that NEVER TURNS ON. They have absolutely no hot water.The customer service is HIGHLY BELOW AVERAGE and when you have complaints they say you “being mean.” When you go to the office for anything two people working and both hiding or on break. That’s usually how a work setting/environment goes. It’s one or the other. There is garbage ALL OVER THEIR PROPERTY and NOBODY TO CLEAN IT. They have two big beds and one tiny tiny garbage bin for the bathroom which makes no sense (on) top of not having a place to put garbage on the outside because the big bin outside is for cardboard, metals and things of that nature. One bed was tuff and one was soft which means if more than person comes somebody has to sacrifice their comfort for the stay if not sharing the same bed.Microwave was plugged out upon arrival and the circle part under the glass that allows it to stak in place while rotating was broken upon arrival. Tv remote is SMALL AS EVER.!!!!!!!!!!!!!!!!!!!!!The location people always seem to be getting pulled over so the flashing lights from police will get tiring being reflected on your walls. It was annoying to Mi because the lights are REALLY BRIGHT against the walls.They have an amazing amount of litter outside ON THEIR PROPERTY and old used toilets out back for everybody to see that they never get rid of old and used items that once used to work on the property.!!!!!!!!!!!!",
      "rate": 1.0,
      "tripDate": " March 2023"
    },
    {
      "title": "Sehr Sauber und nettes Personal.",
      "text": "Ich hatte hier eine Aufenthalt von 15 Stunden.Was tun, erst mal schlafen.Hatte mir dieses Motel ausgesucht und wurde nicht enttäuscht.Schöne Zimmer, alles sehr sauber und nettes Personal.So soll es sein.",
      "rate": 5.0,
      "tripDate": " November 2013"
    }
  ]
}