{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Living Suites Toronto",
    "url": "/Hotel_Review-g155019-d7250557-Reviews-Living_Suites_Toronto-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.0",
      "reviewCount": 21
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "250 Wellington St W",
      "addressLocality": "Toronto",
      "postalCode": "M5V 3P6",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/07/42/32/f1/living-suites-toronto.jpg?w=500&h=-1&s=1"
  },
  "description": "Living Suites - Toronto provides furnished accommodations in the downtown Toronto area for short and long term rentals. We aim to provide visitors to Toronto with a choice of well-appointed 1 & 2 bedroom apartments located conveniently across downtown. Situated in the midst of Toronto's entertainment and business district, our suites are well placed to cater to the business traveler as well as the leisure travelers. ​ All accommodations are located in close proximity to some of the finest eating places in downtown Toronto and walking distance from famous landmarks such as the CN Tower, Rogers Center and Princess of Wales Theatre. Apart from our well appointed suites and central location, our guests can also take advantage of a fully equipped gym. If relaxing is more your style, be sure to check out our pool and spend your afternoon unwinding and relaxing in pure bliss.",
  "featues": [
    "Free High Speed Internet (WiFi)",
    "Wifi",
    "Pool",
    "Fitness Center with Gym / Workout Room",
    "Concierge",
    "Self-serve laundry",
    "Washing machine",
    "Air conditioning",
    "Seating area",
    "Sofa",
    "Iron",
    "Coffee / tea maker",
    "Kitchenette",
    "Bath / shower",
    "Hair dryer",
    "Dishwasher",
    "Microwave",
    "Refrigerator",
    "Kitchenware",
    "Suites",
    "Family rooms"
  ],
  "reviews": [
    {
      "title": "Good Alternative to Traditional Hotel",
      "text": "This facility is a great alternative to traditional hotels.  Beautiful, well appointed condos that are in the heart of the city. If you do decide to stay here, know that these condos do note received daily housekeeping or refreshing.  I stayed for 5 days, and by day 4 had ran out of toiletries and toilet paper (only provided 1 roll).  Otherwise, great facility - very quiet.",
      "rate": 4.0,
      "tripDate": " June 2017"
    },
    {
      "title": "Interested",
      "text": "It is a building that you take your meus in the another building with the Security. You can let your luggage there because there is no one in the building. It is an apto with a washing machine, dish washer, microwaves, etc. The place is near a supermarket just one block. Our apto had one bedroom and a sofa. When we rent look carefully the taxes . In Canada in the hotels they are expesive. At the apto we can see CN Tower and the stadium of the Blue Jay is in front of them",
      "rate": 4.0,
      "tripDate": " September 2017"
    },
    {
      "title": "Great location, but unfriendly and not ideal",
      "text": "Although the location of this place is great, some things are severely lacking. It is not geared towards short stays at all.The apartment was lovely and clean, but absolutely freezing - it was approx 10 degrees celsius outside and the air conditioning was on. I asked security at reception about it and they said only building management could turn off the AC. Luckily they gave me a heater for two days to use which I really appreciated.The walls are not sound proof and light comes into the bedrooms easily, so it's not easy to sleep. The security are not welcoming towards short stay residents at all, especially since majority of the apartment block has full time residents. They wouldn't accept deliveries of a couple of boxes to reception, even though other residents were picking stuff up. They also would not store our luggage on the last day like a hotel would, saying they only stored stuff for residents. Credit where credits due, they allowed us to borrow a heater and a trolley to take up our luggage, but overall v unhelpful.You also only receive one key (there were two of us staying in two different rooms), and no fob to open two other doors, we had to constantly ask security to open them for us. On the final day they refused to call us a taxi to the airport, saying 'there's a hotel across the road, ask them', even though they had called us cabs on at least 2 occasions previously during our stay. Overall I was disappointed and would not return, especially for a business trip.",
      "rate": 2.0,
      "tripDate": " October 2015"
    },
    {
      "title": "zero sensitivity towards customer",
      "text": "i wish i dint stay at this place. I made a request of early check in as i was travelling all the way from india, instead of helping out i got to know that at security they dont even know which room was allotted to me. So i had to wait over 90 mins for some one to tell me that this is your room which is currently getting cleaned at 3:30 pm when check-in time is 4 pm. When we reached the room , it was a mess, cleaner was still cleaning it. But it had insects all over the place, broken glasses on floor, wet sheets, hair strands all over the floor. So we told the guy just clean to optimum level and then leave as we wanted to crash .... When after some time i called the help desk that room was in pathetic shape pls change my room, i got the answer that i rushed the guy... Well how sloppy and slow are their cleaners? the check out time is 10 am...and check in 4 pm... in 6 hrs they cant get the room right...? And whats with total disregard for customer service , i requested 2 weeks prior to coming that i will reach 2 hrs before check in time, pls give me early check in as i would be in a flight for 22 hrs before reaching... but i got a garbage filled room instead .....NOT A PLACE TO STAY...",
      "rate": 1.0,
      "tripDate": " July 2015"
    },
    {
      "title": "Excellent stay",
      "text": "Enjoy apartment type accommodation rather than Hotels and Living suites was smashing. Full kitchen and generous living space. Balcony was great to have a morning coffee although I had no views as I was at the back of building. Located minutes from CN tower and Blue Jay way and positioned minutes from entertainment district. Easy access to Metro and trolley bus services. Could not have asked to be in a better location for my tastes and needs. Plenty restaurants and drinking establishments in area. Pleasantly surprised with bonus of a small pool and Gym facilities at the top of the apartment. Very good value.",
      "rate": 4.0,
      "tripDate": " August 2014"
    },
    {
      "title": "Your Home Away from Home",
      "text": "I prefer to stay in a condo or airbnb type atmosphere when I travel vs in a hotel.  The Living suites Toronto is mostly a residential building with some 'hotel' suites for short term stays.  The apartment is modernly furnished with everything one would need to feel at home including a stove and partial cooking setup (except for a kitchen knife) washer dryer combo and dishwasher.  However, no soap included for the applicances!  It's a shame because otherwise the suite pretty much covered all the basis for guest amenities.  The location is awesome - adjacent to the entertainment district and the central business core, but it should be noted that the area around the hotel is very noisy.  Lots of traffic plus my suite overlooked 2 rooftop patios for bars that were open until 2 am or so every night, as well as 5 construction sites (I counted the cranes) not to mention the good old Toronto traffic.  Closing the patio door mutes most of it, but if you're a light sleeper I recommend bringing ear plugs.  I should also mention the the management was very accomodating of my request to check in early, and check out late and the concierges in the building were great too.",
      "rate": 4.0,
      "tripDate": " June 2015"
    },
    {
      "title": "Value for a SMALL condo",
      "text": "We visited Toronto for the weekend and needed a room near the Royal York where we had to attend a conference but did not want to pay an exorbitant amount for a room. My wife found the Living Suites condo rental for under Cd$200 - a great bargain. However, you get what you pay for.The condo was a very modern 1 room suite with small TV, kitchen, and bath. There was no daily maid service, other hotel amenities, and included a small double bed. When there was a problem with a faulty bathroom bulb and drawer, there was no one to fix it - this is the owners responsibility, The value was there but ...",
      "rate": 4.0,
      "tripDate": " May 2015"
    },
    {
      "title": "excellent accommodation",
      "text": "absolutely amazing. every thing was perfect.clean and homely it is ideal for a family who want to cook while they are on Vacation. Centrally located, owners were amazing and very helpful.would recommend it to any one travelling.",
      "rate": 5.0,
      "tripDate": " November 2014"
    },
    {
      "title": "Great location",
      "text": "We stayed for two nights in this apartment: it was supposed to be for four people, however the beds were one double bed and one very uncomfortable sofa bed which was not made up when we arrived, and for which the right sheets were not provided. The balcony with city views was actually the view of the back of the building behind. It was clean and the location was fantastic, the gym in the building was good, the pool was very small and not really usable by more than 2 people at once.",
      "rate": 3.0,
      "tripDate": " August 2014"
    },
    {
      "title": "It was a real Nightmare",
      "text": "We booked for two nights a suite and a parking place at Living Suite Toronto on August 2018 for 2 adults and 2 children . It was really a nightmare. It took us 40 min to find the spot on the garage. Instructions weren't clear. At the reception we received the keys for a different suite respect to the one had been notified us by e-mail.With respect to the third and forth sleeping places, we found very poor the quality of the SOFA and sheets. It is a rudimental way to sleep, we would expect a more functional solution (see pictures).Unfortunately, some other things didn't work well. The wifi did not work well, was very unstable. The washbasing (sink) was clogged and we had to use the plunger continuosly. The pillows and sheets were very dirty. We had never seen sheets so dirty. In general the quality of the suite is poor (see pictures).We wrote twice to the e-mail of the suite's manager...no answer.After the first night we were so disgusted that we left in advance and booked a room in a hotel to continue our staying in Toronto. The only good thing of the Living Suite Toronto is the location that is very central Salvatore",
      "rate": 1.0,
      "tripDate": " August 2018"
    },
    {
      "title": "Nice condos",
      "text": "Could use some noise cancellation the bars were very noisy and maybe thicker curtains as there were none in the bedroom.  Overall great stay but could use updating.  Needed a comfortable couch and a little table would have been nice.  Hot tub and gym were excellent.",
      "rate": 3.0,
      "tripDate": " June 2018"
    },
    {
      "title": "One Bedroom Apt. Downtown Toronto",
      "text": "I read some reviews and got ready for the worst but wanted to try it because of the low price. There's no indication on the exterior (270 Wellington) of the building that it has rental units.  We drove around back to a little lane (Mercer Street) off Blue Jays Way, Phoned the contact number, and followed their instructions to enter building lobby and go to security desk (not really a concierge).  I had asked for parking but the management is not good at communication so none was reserved for me and the desk personnel only hand out and receive keys.  Anyway, a paid lot ($15 overnight or $35 for 24 hours) is on Mercer.  Security signed me in and gave me a key and electronic fob that opens the exterior door and a hallway door to the elevators,  Room was as advertised and was very similar to what we get from RCI. Bedroom was small and the mattress was really bouncy.  But full kitchen, washer/dryer, large TV, balcony.  Hardwood floor.  Very nice for price and location.  CN Tower and Ripleys Aquarium within walking distance.  Convenience store at corner.  Wifi included.",
      "rate": 4.0,
      "tripDate": " April 2018"
    },
    {
      "title": "Horrible Place",
      "text": "If you guys stay here. Please upload pictures because this place is horrible. I stayed at the Queens Park location. Our check in was 4 pm and they didn't give us access until 4:45. There is no front desk so the manager kept saying they were coming?! Then we go to our room the internet did not work. The remote had no batteries. Seriously I was horrified at such a terrible experience and the manager is the worst.",
      "rate": 1.0,
      "tripDate": " August 2017"
    },
    {
      "title": "Bit battered and expensive",
      "text": "So, we thought that after travelling in hotels for 3 weeks an apartment with a washing machine and tumble drier would be a good idea. Hmmmm. It was as expensive as a hotel at nearly £200 a night. However it was quite well worn, with a dirty carpet in the bedroom, a rather horrible shaggy (and quite dirty) rug in the front room and the furniture covered in dust. In addition the doors on the wardrobe were broken, so you couldn't use it, and in any case the wardrobe was filled with bedding. As to the concierge (from whom you have to collect the key), well he has to be the grumpiest, and most unpleasant concierge it has ever been my pleasure to meet - \"I don't get paid for doing this you know'. The washing machine and the drier did, however, work well. Was it worth it? Absolutely not.",
      "rate": 2.0,
      "tripDate": " August 2017"
    },
    {
      "title": "You get what you paid for. ",
      "text": "The room was pretty inexpensive, that's a plus (especially for a small business owner).Now, the whole thing didn't start very well. Living Suites had double booked our room. So the gentleman at the desk (who DOESN'T work for Living Suite) told us to call them and see what's​ happening (and was quite rude the whole time). I had to call them a few times before everything got settled. The room (which is a small condo in fact) was pretty nice. It was clean and well decorated. Location was great, downtown and a few hundred meters from the Metro Center.That's pretty much it for the positive... A LOT of stuff didn't work well in that room.1- the toilet didn't flush properly2- the blinds in the bedroom were completely broken (in a heap behind the bed)3- the sofa bed frame was broken4- the tv didn't work5- the windows were ZERO sound proof, very noizy6- we only were given ONE key (for 3 guys) definitely not ideal.It wasn't a horrible stay, just not great one... Not even a good one.I will stick to \"regular\" hotel rooms from now on.",
      "rate": 2.0,
      "tripDate": " March 2017"
    },
    {
      "title": "Great apartment",
      "text": "I rented an apartment at 20 John Street just across from the rogers centre. Great apartment, nicely furnished, clean, central. The price was good for the location. Check in/out easy. Fridge, oven etc.",
      "rate": 4.0,
      "tripDate": " January 2017"
    },
    {
      "title": "Nice apartment in the Entertainment District",
      "text": "Better than a hotel...in my opinion.3 of us shared an apartment on Wellington St W in Toronto. It was classy, clean, and had everything that we needed. 2 people in a bed and one on the couch (which had a trundle). Dishes, dishwasher, full fridge, towels, corkscrew!, linens for the couch, an iron, etc. Finding our spot in the underground garage was the trickiest part of the weekend! The entrance is not obvious, but it IS down there! We were in decent walking distance to la Tour CN, the aquarium, Rogers Centre, the trolley, and many other destinations. Highlight of the apartment...patio!",
      "rate": 4.0,
      "tripDate": " October 2016"
    },
    {
      "title": "Not a real hotel",
      "text": "This place just rents apartments in residential buildings then rents them out like a hotel. No front desk, you need to find a security guard to get the keys. If you have any issues you can call and leave a voicemail on some sketchy cellphone thing. Very unfriendly and unwelcoming once they've got you there. Almost seem to revel in the fact that they've ruined your trip.This place is a nightmare, stick to regular hotels.",
      "rate": 1.0,
      "tripDate": " May 2016"
    },
    {
      "title": "Good standard of accommodation with all amenities",
      "text": "Our apartment had 2 bedrooms, 2 bathrooms, a living room and dining area and full kitchen. The overall condition of the apartment was very good and well furnished however the kitchen would benefit from a more comprehensive range of cookware/utensils.eg no scissors and no cutting knives. There was also a washer/dryer. Also had a great view of th the CN Tower from the large balconyOn the plus side I had booked a parking space and on request was allowed to use it from 11am. Also you are met on arrival and shown to your apartment and was also allowed access to the apartment from 11am. This was really good as it allowed us to explore Toronto for most of the day. Much appreciated.Location wise the apartment block was easy to find and 2 blocks from the Gardner Expressway. Directly across the road was the CN Tower and Rodgers Centre. We used the City Sightseeing Tour to get around and there was a stop just around the corner. A subway stop was several blocks east.Most of the popular areas were to the north and east and walkable if you are able. If not transport was good. There were 4 of us travelling and this apartment offered us a good alternative to booking 2 hotel rooms and overall was probably cheaper",
      "rate": 5.0,
      "tripDate": " October 2015"
    },
    {
      "title": "Great price, luxury living.",
      "text": "This was a condo, leased out as hotel. I would have loved to give it 5 stars because the price and the location were great--I got a penthouse suite with balcony. It would have stayed at 5 stars despite the early check out time (10 AM), low wattage lighting throughout, and the fact there was no TV in the small bedroom, because the it was quiet and otherwise spacious. But the place was not satisfactorily cleaned; specifically the kitchen. I was almost willing to overlook the poorly cleaned ceramic stove-top (we have one of those ourselves, and they are a bear to clean but they CAN be cleaned!) but part of the granite countertop were sticky, and the top of the fridge had a several-months collection of dust on top. So--demoted to 4 stars. All that being said; I'd go there again!",
      "rate": 4.0,
      "tripDate": " May 2015"
    }
  ]
}