{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Locarno Hostel",
    "url": "/Hotel_Review-g155019-d6728337-Reviews-Locarno_Hostel-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "2.5",
      "reviewCount": 20
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "287 Parliament St",
      "addressLocality": "Toronto",
      "postalCode": "M5A 2Z6",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/06/8e/2d/85/courtyard-living-hostel.jpg?w=500&h=-1&s=1"
  },
  "description": null,
  "featues": [],
  "reviews": [
    {
      "title": "Needs some work",
      "text": "This is not a bad hostel at all, but at the same time it is not great. I am going to start by saying it is very well decorated and obviously newly refurbished house turned into a hostel. But they advertise things that they just don't have like a shared lounge/ tv area or we couldn't find it. The kitchen had no utensils apart from a pan and giant serving spoon. The location is very close to downtown and all sights too see, although it doesnt appear to be the best looking place at night and would probably catch a cab. Parking is an additional surcharge yet I have no idea why as it is in a lane way drive which cant hold more than 3 vehicles. If you are put in room 101 request a different room as you are right next to the electronic door with keypad that bangs when opening and closing and if your a light sleeper you are woken up alot. There is no staff member on premises and you have to call the manager if you need anything or catch them in the evening while they check in for 10 minutes or so. It sounds like I am not recommending this place which is far from the truth it was a nice hostel with a good little coffee machine to use in the mornings at a good price but these are a few of the things that need to be changed to make it alot better.",
      "rate": 3.0,
      "tripDate": " July 2014"
    },
    {
      "title": "Kiepski hostel",
      "text": "Hostel wybraliśmy z uwagi na niską cenę i w miarę dobrą lokalizację. Niestety rzeczywistość okazała się zupełnie inna. Wg informacji na booking.com można płacić kartą - niestety nie można.Właściciel (albo pracownik) sttasznie śmierdział. Po przyjściu zamiast powiedzieć \"hello\" spytał, czy mam pieniądze. Był bardzo zbulwersowany, że nie mam gotówki.Pokoje skromne, ale czyste.Łazienki strasznie zagrzybione",
      "rate": 2.0,
      "tripDate": " May 2019"
    },
    {
      "title": "Pas terrible",
      "text": "Pas très loin du centre ville à pied, mais situé dans un quartier peu fréquentable. Ce n'est pas un hôtel mais une sorte d'auberge ou l'intérieur est simple et pas hyper propre. Niveau confort à part la douche tout est à revoir.",
      "rate": 2.0,
      "tripDate": " August 2017"
    },
    {
      "title": "Do not stay here.",
      "text": "Had a terrible time here. I booked my stay a few months in advance. When I turned up, there was no one at the hostel to let me in. I rang a phone in the porch which had a number on the wall next to it and someone on the other end said they were on their way. After about 15 minutes, a young guy arrived. He checked in some other guests that were waiting, then informed me the person in the room I was to have hadn't left yet and they didn't know where he was, so I had no room. I found this a bit weird, considering their check out time is 11:30am and this took place at 9pm: surely they should have known there was a problem and at least emailed me? No one had contacted me however. He offered me a room in a different hostel in Chinatown (which looked awful going by the pictures on his phone), which I refused, and I went ahead and booked a different place. This was obviously expensive to do at the last minute, and entailed a taxi ride across the city that cost $25. The guy did, in fairness, offer to drop me there but then changed his mind when he saw it was far away. I asked if he would refund me for the taxi ride I had gotten to the Locarno Hostel and he said he only worked there and wasn't the manager, so couldn't make any decisions, and offered that I return to the manager the next day (not really what I ant to spend my one day as a tourist in Toronto doing: arguing over $12!). It was incredibly frustrating: this all took place at 9pm, I had just arrived in a strange city after a 5 hour bus ride and I just wanted my bed! When I arrived at the next hostel I phoned booking.com who said they would ensure I wasn't charged for the stay at Locarno. I was emailed by booking.com the next day to tell me that the Locarno hostel management had told them that I had walked out because I didn't like the area (untrue) and that they had offered me a free upgrade (equally not true). I was utterly appalled that instead of just apologising for their mistake, they literally lied about what had happened, probably with the view to keeping my late cancellation payment. The area was admittedly not great but what I saw of the interior of the hostel was clean, the wifi worked, and I had planned an itinerary for myself based on being in that location, so I would not have left due to the \"bad area\": who wants to trek across Toronto with a massive suitcase alone at night and spend crazy money on a last-minute hotel or guesthouse when they have one paid for and they are there already?? However thanks to their lack of organisation and proper management I ended up spending a hell of a lot of money on alternate accommodation and transport, then found myself having to convince booking.com that I was telling the truth to prevent them from pocketing my \"cancellation\" fee. Never in my years of travelling across South America, Asia, Australia and Europe have I encountered such an utter lack of disregard for customer service, respect for others and just general common sense. Even in budget accommodation, there is zero excuse for this. Cheap/good value/budget is not, in my experience, synonymous with lack of professionalism and dishonesty. Don't give these people your business.",
      "rate": 1.0,
      "tripDate": " August 2016"
    },
    {
      "title": "Nobody In!?!?!",
      "text": "Travelling around USA and Canada with my girlfriend has been amazing, however when we arrive in Toronto after having this hostel booked for months in advance. We arrive on the 25th of March to checkin but when we arrive there is nobody there! And i mean we couldnt even enter the property because there was absolutely nobody living there! We wait two hours trying to get in contact with the owner but we hear nothing. With no telephone or wifi we had to try and track down a hostel/hotel to stay the night and find a way to sort this situation. We sleep on it and go back the day after but no one was there again. This is totally unacceptable and according the to guy next door its not the first time this has happened. DO NOT STAY HERE",
      "rate": 1.0,
      "tripDate": " March 2015"
    },
    {
      "title": "It's almost like a scam",
      "text": "Better put your money in the trash.Location: Adjacent to homeless people areaBe aware of all the nonrefundable policies that's the siren!But you always get into these tourist traps for the first time",
      "rate": 1.0,
      "tripDate": " June 2018"
    },
    {
      "title": "terrible!",
      "text": "Terrible experience. We booked 8 months in advance to get a good price. When we arrived after a 12 houres of travel, they said it was cancelled and we could only stay if we payed more and cash!Total scammed! Out of pure misery we payed because it was already 11PM and we were exhausted. But I hope nobody will experience the same as we did.",
      "rate": 1.0,
      "tripDate": " September 2017"
    },
    {
      "title": "Longe e sujo",
      "text": "O local é longe do centro, se você estiver andando, serão uns 30/40 min para chegar ao centro. A vizinhança é meio esquisita, apesar disso ainda é bem mais seguro do que aqui no Brasil. Por vezes chegávamos tarde a pé, mas ainda com segurança. A entrada do local da hospedagem não é tão nítido, parecia até uma casa meio abandonada. Pensamos na hora até se não haviamos tomado um calote. Lá dentro o banheiro era até limpo, mas os quartos tinha muita poeira debaixo das camas. Sei disso porque dormi em quartos diferentes durante as duas diárias de hospedagem no local.",
      "rate": 5.0,
      "tripDate": " October 2017"
    },
    {
      "title": "Good value for money",
      "text": "Booked it last minute on a friday evening and was quite happy with my choice. It’s relatively central, with good bus connections. The immediate neighborhood looks a bit rough, but in walking distance is the ‘trendy’ Gayville and nice Cabbage-town. The room was very nice, big & clean. Unfortunately it faces the main street so it was pretty loud in the morning. The shared bathroom, that was clean when I arrived in the late afternoon, was a mess in the morning. But that’s not the fault of the management, but rather of the guests who do not care that others will have to use the shared (!) bathroom after them in the morning. I thought it was a bit strange that we had to pay in cash, given the information on booking.com was that this hostel accepts credit cards (and after I checked in and paid in cash I saw another guest paying with a card…) Made me a bit uneasy at first, especially I was given no receipt, but it was no problem.",
      "rate": 4.0,
      "tripDate": " July 2018"
    },
    {
      "title": "Scary! We ran away after the second night and filed a report to the police",
      "text": "The location is not good. Despite being close to the center, the neighbourhood is abandoned and it gets scary to get in there in the night.In the hostel, some people seemed to be drunk or drugged... well ok, but not ok when they got aggresive and scary!! The second night, one of the people living there (he was not a guest) started shouting at one of the guests cause \"she was making too much noise\" (it was evening, not late by the way, she didn't even make that much noise compared to his shouting), very aggresive, slamming doors all over the place, he kept on shouting that \"he was shouting for everyone to hear, he was tired of all the people in his house making noise\". The owner of the place (which seemed nice) was trying to calm him down. I was scared, even if we locked the door, the doors are just paper and who knows what that aggresive drunk guy wanted to do with \"all those people\" (who are just coming because \"your house\" is a HOSTEL!, or it pretends to be....)We ran away (literally) and filed a report to the police.Ah, and yes, you have to pay all cash and there is no \"hostel\" sign anywhere outside.Kind of looks like a scam.But it gets dangerous with that aggresive guy living there.",
      "rate": 1.0,
      "tripDate": " July 2018"
    },
    {
      "title": "Stay away",
      "text": "Black mold.Terrible area with drug addicts scattered on the block.Heavy stench.Cash only and parking not included as advertised.Onsite \"manager\" reeks of BO, appeared intoxicated and follows you around. Creepy. Unprofessional.Never again.",
      "rate": 1.0,
      "tripDate": " September 2018"
    },
    {
      "title": "Pretty good Hotel.",
      "text": "Very good location, near City (about 2.5km by walk), 50m to car bus station No. 505 (tramway) on Dundas Str. to Bloor Station (train to airport). Peace and quiet. Very good WI FI. Hotel unmarked. No information board. Full self-service.",
      "rate": 4.0,
      "tripDate": " January 2018"
    },
    {
      "title": "Cheap and nice ",
      "text": "We have stayed here with my boyfriend for 3 nights while travelling. (Age 21-23) I was a bit scared at first to stay due to the reviews I have read but honestly it was perfectly fine. As soon as we got there someone has opened the door for us and let us in. The room was basic but clean. It was heated well, while the weather was freezing outside! We were originally gonna stay for one more day but our flights got changed by Westjet to go to our next destination so I asked the owner about 2 weeks prior to arriving if I could just not pay that one night. His answer was short but agreed straight away even though it was after cancelling time. When we arrived they did charge us however after contacting him again he came back next day just to give us the money which was quite nice of him. The hotel is quite far from the airport and the centre itself but it has public transport very close by. When we arrived to Toronto we got a train to the central and we thought we’d save some money and do a bit of sightseeing so we walked and it took about 35 minutes. On the way back we’ve used uber as it was an early flight and surprisingly it cost about the same as the train and the bus would have so I definitely advice that, especially if you’re travelling in the morning! There’s a Tim Hortons about 3 minutes away from this hostel where we had our breakfast every day. Honestly couldn’t fault this hostel it was cosy and extremely cheap.",
      "rate": 5.0,
      "tripDate": " February 2017"
    },
    {
      "title": "Locarno hostel  par Booking : fausses informations et refus de remboursement",
      "text": "Réservation faite par internet. Endroit mentionné comme étant un hôtel. Jolie présentation des chambres, avec salle de bain particulière, est-il écrit. Arrivée dans un quartier peu engageant, dans une maison particulière pas soignée. Il fallait téléphoner à quelqu'un pour avoir accès à la chambre. Impossibilité de se garer sans gêner l'accès à une maison particulière. Une seule \"place\". Où se gare une éventuelle seconde voiture ?Le bas de la maison est louée à ??? : étalage de chaussures dans l'entrée et odeur de fauve ! Une chambre s'ouvre pour laisser sortir un jeune homme et on voit alors un matelas par terre... Où sommes-nous ? Chez un marchand de sommeil ? On monte à l'étage : chambre petite, à peine correcte, sans salle de bain privative. Le bruit monte du rez de chaussée...On annule notre réservation de vive voix et...  Le montant est immédiatement retiré.Refus de Booking de rembourser alors que rien ne correspond à l'annonce.Deuxième déboire avec Booking. FINI !",
      "rate": 1.0,
      "tripDate": " October 2017"
    },
    {
      "title": "Molto buono",
      "text": "Io e la mia ragazza abbiamo prenotato per 4 notti in questo ostello abbastanza economico. In contrapposizione alle recensioni che ho letto, noi siamo stati accolti da qualcuno al check-in. Un giovane ragazzo ci ha appunto accolti, spiegato alcune cose della casa e ci fatto sentire a proprio agio. La nostra stanza era molto carina e pulita. Bagno e cucina sono condivisi, ma anche loro molto puliti. La posizione non è proprio centralissima, ci vuole infatti poco più di mezz'ora a piedi per arrivare ad esempio alla CN Tower. Nonostante un avviso appeso in casa di un transfer per l'aeroporto, ci è stato negato il viaggio, ci è stato detto che quel giorno non aveva viaggi, mah. Nel complesso bella esperienza.",
      "rate": 4.0,
      "tripDate": " July 2017"
    },
    {
      "title": "Very nice place in the outside of town",
      "text": "The place where this hostel is located is not the best, but the walk to the center of town wasn't bad. Me and my friend are young though and in good shape so if you don't want to walk it's probably not for you. The hostel was very nice inside! You can use the kitchen whenever and the rooms and bathrooms are very clean and in good shape. Hope more people use advantage of this place, since it's cheap and surprisingly nice inside!",
      "rate": 4.0,
      "tripDate": " April 2017"
    },
    {
      "title": "Le falta",
      "text": "Me asignaron una habitación pequeña individual, estaba limpia y al parecer, recientemente acondicionada. Sin lugar a dudas, eso fue lo mejor del hostel.Sobre los espacios comunes, estos prácticamente no existen y los encargados habitualmente brillan por su ausencia. Esto último puede ser interpretado de diferentes formas, porque por un lado, no te hacen restricciones de tipo alguno (incluso puedes llegar a la hora que te parezca y todo bien), pero lo malo es que si necesitas algo, nadie está ahí para ayudarte.Hay una cocina que descubrí por casualidad, pero no sé si puede o no ocuparse. La ducha del baño del segundo piso no funcionaba, pero pude ducharme en la planta baja.La ubicación es bastante buena, puedes ir caminando al centro de la ciudad y a las principales atracciones de Toronto.La verdad es que no me quejo... No es un hostel bueno, pero “salva\".",
      "rate": 2.0,
      "tripDate": " October 2015"
    },
    {
      "title": "Okay",
      "text": "Wir hatten eigentlich ein anderes Hostel gebucht (Kensington Market Hostel), hatten aber spontan eine weitere Person in unserem Trupp. Wir haben also relativ spontan bei dem anderen Hostel angerufen (welches mit diesem Zusammenhängt) und haben ein etwas größeres Zimmer bekommen. Normalerweise ist das ja nicht unbedingt selbstverständlich. Unseren Wagen konnten wir für umsonst in der Einfahrt parken. Wie schon in anderen Reviews erwähnt gibt es hier keinen Front Desk der durchgehend besetzt ist, d.h. für Fragen und soweiter gibt es nicht immer einen Ansprechpartner. Das Zimmer und das Bad waren sauber und soweit war alles in Ordnung! Man läuft zum CN Tower etwa 40 Minuten vom Hostel aus, also deutlich weiter weg als das Kensington Market House! Die Gegend ist okay, nur hatte ich das Gefühl das in unmittelbarer Nähe nicht wirklich viel los ist!",
      "rate": 3.0,
      "tripDate": " August 2015"
    },
    {
      "title": "nice and simple",
      "text": "Stayed one night at the countyard hostel in Toronto.Price 95$Free Wifi that work very well at all time. Note: During TO Film festival all hotels were book so I gave this hostel a try, and I am not disappointed.Room: Refurbish furniture, clean (no smell or humidity) and simple-nothing over the top. Was in room number 102.Bathroom: connecting to room (deluxe room with private bath) very practical, space, and clean.Kitchen and other parts of the hostel: hall was quiet (can not pronounce myself on other parts as I did not use them)Host-front “desk”: Well there is none, but I was able to meet a staff member when I arrived (Nikky) and she was very lovely and helpful with all my questions about Toronto, transport etc…  Location: Great great great to go Down Town Toronto with the Street Car (#505, max 10 minutes and on Queen st the car street run 24h). From the outside of the place look sketchy and one really start to wonder about their hostel choice but once inside, all is fine.Parking: There is NO parking as advertise.  One has to use Public Garage parking. The one under FreshCO. (corner Parliament and Dundas) is 1 minute walking distance and not expensive for TO standard : 5$ for 6am to 7pm and 5$ 7pm to 6am.If you look for hotel service-like with 24/7 front desk and such amenities, Courtyard living hostel is not the place for you - it’s a hostel as stated in it name. If you don’t need something too fancy, care about the place being clean and a practical location – it do the job.I recommend :)BusinessSeptember 2014",
      "rate": 4.0,
      "tripDate": " September 2014"
    },
    {
      "title": "Excellent service and place to stay",
      "text": "We spent 1 nignt in the hostel but I think that  is more a guest house.  We had a room with a private bathroom. Everything is brand new and clean. I would spend there 1 week if I have a chance instead of booking a hotel. The location is perfect, 10 mins walk to Dundas, parking lot is close by, nice restaurants  to dine down the street. They offer good coffee in the morning.",
      "rate": 5.0,
      "tripDate": " July 2014"
    }
  ]
}