{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Making Waves Boatel",
    "url": "/Hotel_Review-g155019-d2218987-Reviews-Making_Waves_Boatel-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "5.0",
      "reviewCount": 235
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "539 Queens Quay W",
      "addressLocality": "Toronto",
      "postalCode": "M5V 3G3",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/17/f9/46/61/making-waves-boatel.jpg?w=500&h=400&s=1"
  },
  "description": "Enjoy your stay at the most unique Bed and Breakfast in Toronto aboard a 65 foot motor yacht moored in the heart of downtown Toronto. Guests are gently rocked to sleep and wake-up to the smell of freshly brewed coffee and a gourmet breakfast surrounded by a post card view of the city and Toronto harbour. Leave the car and walk everywhere, shopping, catch a baseball game with Toronto Blue Jays at the Rogers Centre, CN Tower, and restaurants galore... all within a short walk or street car access away. Close to the theatre district with many choices of live theatre and musicals to choose from. Take time to enjoy a hop-on-hop-off tour of the city or rent bike to tour the waterfront. Book the whole boat and ask us about having dinner on our skylounge. Take in one of the charters in the harbour for a romantic evening cruise before returning to your own private yacht. Come back to the boat to enjoy the spectacular view from the aft deck and experience life on the water. Warning: marine life is addictive; your first visit won’t be your last.",
  "featues": [
    "Free High Speed Internet (WiFi)",
    "Wifi",
    "Free breakfast",
    "Special diet menus",
    "Bicycle rental",
    "Baggage storage",
    "Currency exchange",
    "Non-smoking hotel",
    "Air conditioning",
    "Safe",
    "Iron",
    "Wake-up service / alarm clock",
    "Complimentary toiletries",
    "Hair dryer",
    "Non-smoking rooms",
    "Family rooms"
  ],
  "reviews": [
    {
      "title": "Favourite place to stay in Toronto",
      "text": "This is Toronto's ONLY boat bed and breakfast, located as downtown as you can go; the 'Boatel' is moored in Toronto's Harbourfront. Breathtaking views from the skydeck of the Toronto Islands, CN Tower, Rogers Centre. Owner/operators Ted and Diane Greene are a delight--the Canadians you've always thought you wanted to meet, and in the winter they sail the Boatel to the Bahamas so they're just full of stories. Diane's gourmet breakfast is not to be missed, and apart from the whimsical experience of living, sleeping and eating on a boat for a few days with someone you love, it's ALL about the location!",
      "rate": 5.0,
      "tripDate": " August 2010"
    },
    {
      "title": "THE BEST way to experience Toronto.",
      "text": "I headed to Toronto for a convention and ended up at Boatel by chance because the filled up hotel situation that week.  To my delight I discovered a warm and memorable experience.  I was treated with more hospitality that I have ever received before by a couple that knows how to make a person comfortable and relaxed.  The boat has plenty of room to chill out whether inside for rain or on the back in the sunshine.  The harbor area has gone thru a renaissance and Boatel has gardens galore right out the door for both lovers and joggers.The hosts waited up until after midnight to greet me and when I arrived I mused how nice a shot of scotch would be before bed.. out pops an unopened 15 year old single malt.  Now I ask you, have you met someone who was that friendly to you 2 minutes after you met them?Breakfast was tasty and filling every day, internet and a nice big table allowed me to get some serious work done too!!  Botel was perfectly positioned right in the middle of all the Toronto action.By some odd chance I had an iTouch with a recordings of thngs like rain, streams etc. Well I had a wooden ship recording too, which was a blast to play as I was gently rocked to sleep dreaming of subtropical islands.",
      "rate": 5.0,
      "tripDate": " September 2011"
    },
    {
      "title": "Floating home away from home",
      "text": "I had a very nice stay at the Ted and Dianes Boatel, a wonderful experience with nice views good company and clean and comfortable rooms. If you would like to experience living on a boat and have the best location this is the place to go. You will probably gain 2 new friends in addition.And the breakfast is delicious.",
      "rate": 5.0,
      "tripDate": " September 2011"
    },
    {
      "title": "Really unique experience, one of the best sleeps I've ever had.",
      "text": "You can't beat the location. Boatel is right in the harbor in downtown Toronto and my wife and I really enjoyed our stay. Diane and the crew took great care of us. We stayed on their 70ft yacht and walked to the CN Tower, over to the theatre district, minutes from all the fabulous restaurants, and watched the sunsets from the deck. One of the best toronto bed and breakfast experiences ever.",
      "rate": 5.0,
      "tripDate": " July 2011"
    },
    {
      "title": "A truly memorable stay",
      "text": "This was the most wonderful experience both myself and my girlfriend (who was the amazing girl to find the Boatel) could have hoped for, not only were Diane and Captain Ted very welcoming and friendly, they made us feel truly special during our 7 night stay. The breakfasts were delicious and different every day, the most itself is beautiful and the room and bed really comfortable. Diane is an amazing source of information and gave us loads of ideas of things to do each day, as we had never stayed in Toronto before it was invaluable information that allowed us to get lots done in our time there. I can not express how wonderful it was to stay on the Boatel, so relaxing and so special, a few families and couples joined us on the Boatel during our stay, so it was a great social time as well every breakfast and evening. It will be hard to find such a wonderful and unique place to stay on holiday again, we will always remember our stay, so much so it has made us want to buy a boat :).",
      "rate": 5.0,
      "tripDate": " August 2014"
    },
    {
      "title": "Best B&B in the world!",
      "text": "This was my first visit to Toronto and the boatel  is a very welcoming, relaxing environment to arrive to after a long plane journey. Both Diane and Captain Ted are wonderful hosts full of local knowledge and ideas of how to fill your stay. Very helpful on how to get around and very friendly they made me fell very welcome.Breakfast were both delicious and creative, the perfect way to start a packed day of sightseeing. I think if I had to choose my favourite it would be between the fresh peach cobbler and the blueberry French toast! just yummy. something for everyone.My room was very comfortable, cleaned everyday with little chocolates for the evening. The bed was just perfect for me and you will sleep like a baby. The location is great for the tourist sights like the CN tower, Toronto Island, and much much more.I'm so happy I found the boatel to stay on instead of a hotel the whole experience made my trip much more memorable. and I would defiantly stay there again when I get the chance.",
      "rate": 5.0,
      "tripDate": " August 2014"
    },
    {
      "title": "THE QUAY TO A GOOD VISIT",
      "text": "THE QUAY TO A GOOD VISITMaking Waves Boatel is Toronto & Ontario's only boat motel.And it's been rated as one of the best boat hotels in the world!Although location is key (Queen's Quay West, to be exact) the real reason to LOVE this BOAT is that Captain Ted and Diane offer completely comfortable cabins and high-class hospitality.And an egg-cellent breakfast prepared with TLC!In short, it's a better B&B.Did I mention that my stay here was very comfortable and convenient?It's close to downtown Toronto - minutes away from CN Tower, Union Station, Rogers Centre and Ripley's Aquarium.Not to mention Billy Bishop Airport and the Toronto Islands.And you can easily get there by TTC streetcar.But - because you're on the waterfront - you don't FEEL like you're downtown.You feel like you're on holiday!How good is it?So good that they don't do Air B&B.I'd love to stay there again and recommend it to anyone who appreciates the personal touch.",
      "rate": 5.0,
      "tripDate": " September 2019"
    },
    {
      "title": "Fabulous!",
      "text": "Staying on the boatel was fabulous!  The location is beautiful and central to downtown and easy transportation.  Diane’s love and enthusiasm for Toronto is contagious and she is a wealth of information.  The boat itself is beautiful and comfortable and has everything you need.  Don’t hesitate, just book it.  You won’t be sorry!",
      "rate": 5.0,
      "tripDate": " June 2018"
    },
    {
      "title": "Idyllic get-away in Toronto",
      "text": "Staying aboard Making Waves was a wonderful and truly exceptional experience. It is an idyllic get-away, on the water, in a perfect location.  The beautiful and spacious boat is docked in the middle of everything - all harbor attractions, Rogers Centre, CN Tower, restaurants, mass transit, etc.. Diane and Captain Ted Greene are amazingly warm, helpful, informative, and welcoming. The breakfast that Diane prepares is delicious. It was a delightful holiday and unique experience, terrific!",
      "rate": 5.0,
      "tripDate": " August 2016"
    },
    {
      "title": "So sollte Urlaub anfangen! A great start in our holidays!",
      "text": "Dear Diane and Ted!We are glad, that you made our start into the holidays in Canada so memorible! Unser Urlaub in Kanada konnte nicht besser beginnen. Das Navi funktionierte nicht, but Diane sent us a perfect description to the boatel 😘😘.Das boatel ist etwas ganz Besonderes - to sit in the evening on deck and have a spectacular view to the skyline of Toronto! Diane helped us a lot, on the boatel you stay with friends!",
      "rate": 5.0,
      "tripDate": " August 2016"
    },
    {
      "title": "Magical",
      "text": "We were lucky enough to have chosen Making Waves Boatel for the start of our Canadian tour. Diane and Captain Ted couldnt be more helpful and accomodating. They certainly went the extra mile by sailing us over to Hanlan Island to spend the night just so I could get an amazing sunrise shot. Diane is a wonderful hostess and fab cook dishing up wonderful delights everday. Ted is an amazing captain amd host. I cant praise this unique boatel enough just book it and enjoy. Check out Dianes handmade jewellery !!!!",
      "rate": 5.0,
      "tripDate": " June 2016"
    },
    {
      "title": "Relaxing Tranquility",
      "text": "My wife and I were in town at a conference and wanted a unique experience.  We sure got that!  We enjoyed the Harbourfront location and the many amenities within walking distance.  Ted and Diane were very knowledgeable about the area and offered us many tips for eating and exploring.  Both nights we had an excellent sleep and woke up to a wonderfully prepared breakfast.  We would recommend this B&B to anyone travelling in the Toronto area.",
      "rate": 5.0,
      "tripDate": " June 2016"
    },
    {
      "title": "Wonderful location",
      "text": "Excellent hospitality.  Ted and Diane made us feel a million dollars.  The home cooked food was superb, a culinary surprise every morning for breakfast.   Great lounging on back of the boat in the evening and watching the world go by in tranquility.  Absolutely faultless. Thoroughly recommend.",
      "rate": 5.0,
      "tripDate": " June 2016"
    },
    {
      "title": "Like if we were home",
      "text": "Diane speaks French which we appreciated.  She and her husband Ted are excellent hosts.  We appreciated the Harbourfront location which is accessible to many activities.  Their suggestions and advices for their knowledge of Toronto were really interesting.  My husband and I really recommand this b&b.",
      "rate": 5.0,
      "tripDate": " June 2016"
    },
    {
      "title": "Toronto for two",
      "text": "My wife and I made a trip to the land of Canada and decided to extend our stay to include a trip from the Niagara Falls area up to Toronto to stay. We found the Boatel and booked it. We were not disappointed!During the reservation process, one of the questions was about parking passes. Diane offered them for purchase for a fee each day. We went ahead and purchased the passes and that was one of the smartest things we could have done. The passes were at a price half of what the garage was charging and the garage was located close to the Boatel. So close in fact, that Dianne met us there at the top to welcome us after we arrived and contacted her. The parking passes are the best value for parking you will find!Dianne welcomed us aboard as we approached the Boatel and Ted helped us move the luggage inside. After a quick tour and some information about our stay we were set to relax atop the Boatel in the sun. The Boatel has adult beverages for purchase inside as well. We had purchased a dinner cruise on the harbor and were so close we simply walked every place we went during stay. Park and walk is just one more fantastic benefit from the parking passes. We met two other couples the following morning and had a delicious breakfast made and served by Dianne.The breakfast was beautiful and full of taste. The rest of the day we were able to plan with help from Dianne who has several large folders full of information from restaurants to fun things to see and do. Dianne spent a lot of time finding more things to do while we stayed there. She takes the entertainment of her guests to heart. We set out on foot and enjoyed so many things in one afternoon we had to return to the Boatel for a nap. For dinner we weren't sure where to go or what we even wanted. Dianne was so well acquainted with information on food, food type and the best and closest locations, she paired us with a restaurant after a few questions. We enjoyed it immensely!We returned to the Boatel and had a great evening with another couple from Spain, just talking and having a night cap. After realizing the time, we hit the rack and had another great night on the lake. The following morning we had another amazing homemade breakfast from Dianne and said goodbye to amazing friends as we waved goodbye to the Boatel. This place will be our spot of choice if we make it back to Toronto!",
      "rate": 5.0,
      "tripDate": " June 2016"
    },
    {
      "title": "Great location, hospitality, and overall experience",
      "text": "Ted and Diane were very welcoming hosts. The local knowledge they had about downtown Toronto was thorough and depending on the calendar had Blue Jay tickets!  Diane outdid herself with the breakfasts. I would now count Ted and Diane as friends and definitely stay there again, especially if Diane serves eggs benedict for breakfast.",
      "rate": 5.0,
      "tripDate": " May 2016"
    },
    {
      "title": "Great experience",
      "text": "This was a unique location with excellent hospitality.  i recommend this place without any reservation.  Very close to attractions and great restaurants.  Public transportation is at your door step.  Dont hesitate and bool",
      "rate": 5.0,
      "tripDate": " October 2015"
    },
    {
      "title": "Great way to stay in Toronto!",
      "text": "Diane & Ted were fabulous hostess & host!!  The boat is beautiful and the breakfast was delicious! While the room & bathroom were small the rest of the boat areas were very comfortable. We even enjoyed a picnic up top with a great view of the CN Tower and downtown. The location of the boat could not be better. A great place to stay while visiting Toronto!! Thanks again Diane & Ted.",
      "rate": 5.0,
      "tripDate": " October 2015"
    },
    {
      "title": "As your hosts, Diane and Ted will become your friends!",
      "text": "My husband found information online about the Boatel, and we had a life-changing experience. Diane and Ted not only welcome you aboard their boat, they welcome you into their lives. They are living the dream and we become part of it. The Captain (Ted) and Diane left their high-pressure corporate jobs and sold their homes and possessions to live aboard a boat. Now they host guests from all over the globe on the Boatel. You will be gently rocked to sleep abroad the boat. In the morning you will wake to the most wonderful cinnamon and other cooking smells. On the sunny fantail, you'll feast on Diane's breakfast made from recipes gathered from far and wide. Ted is a licensed captain and Diane has an academic degree in hospitality. Names of current  guests are written on a blackboard to help you interact with other guests aboard. There are games on board if you want to stay. But there are also travel books, brochures, and (better still) discounts for the many attractions in the city of Toronto. As we walked through this very vertical city and saw the towers of hotels, we felt so fortunate to have the personal care and hospitality lavished on us at the Boatel. We will go again for sure. You will love it!",
      "rate": 5.0,
      "tripDate": " September 2015"
    },
    {
      "title": "A Special Experience on Making Waves Boatel",
      "text": "It was wonderful to be in Ted and Diane's home and to experience their hospitality in such a lovely location. They are very willing to share their knowledge of the city and the breakfasts were truly gourmet. The rocking of the Boatel will cause you to fall asleep in such comfort. Their boat is truly beautiful and they are delightful.",
      "rate": 5.0,
      "tripDate": " September 2015"
    },
    {
      "title": "Relaxing",
      "text": "After a day of visiting the city and all the hustle and bustle, it is wonderful to come back to this relaxing quiet sanctuary from the noise and craziness. Diane and Ted are wonderful hosts very helpful and knowledgeable about the city and the breakfasts are out of this world! This was our second visit and we will return again and again!",
      "rate": 5.0,
      "tripDate": " October 2013"
    },
    {
      "title": "Great place to stay in Toronto",
      "text": "We wanted a different experience and got it. The location of the Boatel is perfect & in prime location on the waterfront. We stayed in the bondi cabin obviously less room than in a hotel but very comfortable & we had plenty of room for everything. Diane's breakfasts were very nice and diferent everyday & having my morning coffee sitting out at the back of the boat with a view of the CN Tower on one side & the lake on the other was just perfect.My husband wanted to visit a dive shop & as Diane explained it was difficult to reach without a car took us out there in hers.Both Ted & Diane make great hosts & were both very helpfull when it came to planning our days,booking trips & making dinner reservations for us.Definitely recomend you visit you won't be disappointed.",
      "rate": 5.0,
      "tripDate": " September 2013"
    },
    {
      "title": "I am reluctant to review as others will follow to Making Waves!",
      "text": "My partner and I spent the T Giving Weekend with Ted and Diane on their Boatel. Not only is this a most unique way to spend a weekend but it is also a warm, relaxing atmosphere thanks to the Captain and his wife. Breakfasts innovative and flavourful; room quiet and comfortable as heck; and attention to detail clearly shows.  Jamila and I will be back without question! JESleeth",
      "rate": 5.0,
      "tripDate": " October 2011"
    },
    {
      "title": "Perfect Alternative",
      "text": "I'm not quite sure what I can add to the already rave reviews of this charming hotel alternative but I'll try. We too were looking for a room near the Conference Center for a Green Building annual blowout. We had hoped to find a LEED certified hotel in Toronto, but did not. The regular hotel choices close to the Center were expensive and some were even full. So I googled bed and breakfast choices in the city. Among them was the Boatel which just happened to match not only our pocketbooks (Toronto is expensive) but the fact that it's a ten minute walk from the Conference location. How green can that be! Once on board, the contrast between the noise and hullabaloo of this vibrant Canadian city, was dramatic and delightfully welcome. If while considering a stay makes you wonder if you'll get sea sick or dizzy, I can say that probably due to completely benign weather, the boat hardly moved. When it did, if another motor boat passed nearby, the effect was minor and made me feel, for one, as though I had gotten up suddenly after a glass of wine. The feeling, not in any way unpleasant, lasted for only seconds. I'm not sure I would feel as sanguine if the weather was less than perfect. We stayed in the largest of the three quarters, with a very roomy bed and an en suite bath. While dark during the daytime, I was surprised that I did not feel in the least claustrophobic and because I didn't spend much time there during the day, the lack of lack was immaterial. Once on the upper deck and most especially in the breakfast eating area, all you have is light and the views, all around of the Lakefront. Can't be beat. As the other reviews have noted, the Boatel hosts are perfect. There if you need them, otherwise, you are pretty much on your own. Breakfast was wonderful as were all their touring suggestions, after first determining what sort of touring we preferred. So if you are planning a trip to Toronto, keep this option on the top of your list.",
      "rate": 5.0,
      "tripDate": " October 2011"
    },
    {
      "title": "Perfect place to stay in Toronto",
      "text": "If you are looking for somewhere different to stay for a break in Toronto look no further than the Making Waves Boatel. The location is ideal for attractions and transport, yet enjoys the peace and views of the waterfront. We booked a double ensuite room which was very comfortable and surprisingly spacious for a cabin. The boat is owned and run by Diane and Ted, who are extremely  charming hosts and make you feel at home with access to living and deck areas which give plenty of options for relaxing in sunshine or shade.Each morning Diane serves a delicious breakfast, using fresh, locally sourced ingredients which taste great and are presented in a colourful, imaginative way, with something different every morning.Ted and Diane are very helpful in providing maps of the area, details of things to see and tips and advice on how to get the best out of your stay in Toronto.We feel that we arrived as strangers and left as friends.A little oasis in the heart of the city.A highly recommended experience.",
      "rate": 5.0,
      "tripDate": " August 2016"
    },
    {
      "title": "A Peaceful Oasis",
      "text": "After parking our car at the marina, we started our two day Boatel adventure. Greeted by Diane at the marina, we walked to the Boatel to begin our two days of experiencing Toronto from a different perspective. After running some errands before our check in, we were offered a glass of wine to start our visit which we enjoyed with Diane our hostess who explained our options on and off the boat. Our original reason for our visit was to see Barbra Streisand on the second night. We spent most of our first afternoon sitting on the boat, sipping the wine we brought with our travel wine glasses while watching the hustle and bustle around us and smiling, thankful for our seats on the water. Walked to Pai Thai restaurant for a late dinner recommended by Diane. Returned to the boat for another glass of wine while overlooking the lights of the city. The next morning we shared a lovely home cooked breakfast with Elsa an Alfred from the Netherlands before taking the Tiki taxi outside our door for a trip to Centre Island for the day. Another gem in the big city. Again after returning to freshen up before the concert, we had a lovely chat with Diane and her son while sipping more wine and being serenaded by four young Toronto ambassadors on the pier. After a leisurely 30 minute walk to the ACC we enjoyed a 3 hour Barbra Streisand concert, then made our way back to the Boatel for a last look at the city lights before retiring to a lulling sleep. We needed to be off early the next day, and enjoyed an early breakfast with Ted and Diane before having to leave the peace of the boat with a promise to return next year.",
      "rate": 5.0,
      "tripDate": " August 2016"
    },
    {
      "title": "A home away from home!",
      "text": "Diane and Ted are friendly and make you feel right at home on the boat! The breakfast Diane puts on is delicious and beats any hotel I've previously stayed at hands down.The stay is enjoyable and fun and I recommend this B&B as an awesome place to stay. If you enjoy something a little different, then you will love it!  if you need some help in where to go and what to do in Toronto, Diane will take you through all the great things to do here. If you're worried about sharing a bathroom, as I was, it is actually good and I found it easy with my own \"little cubby\" to store my bathroom items in.The boat is clean and there is plenty of different areas to enjoy on the boat.All in all, the best place I have ever stayed! 🙂",
      "rate": 5.0,
      "tripDate": " August 2016"
    },
    {
      "title": "The boatel made our trip to Toronto!",
      "text": "What an experience! The boatel is in a perfect location shadowed by the CN tower. Diane and Ted are fantastic hosts and will go out of their way to make sure that your stay is perfect, from organising bus tours to printing off directions for the streetcars and subways, no task is too big or small! The room was cosey but perfect, every space is used for storage so there is enough room to store your things. Finally, the breakfasts...wow! Better than any hotel breakfast I have ever had in the past and different everyday! Everyone needs to stay on the boatel at least once!",
      "rate": 5.0,
      "tripDate": " August 2016"
    },
    {
      "title": "Toronto Indy",
      "text": "My reviews generally involve a small back story. My choices in travel usually have a reason. So here we go. I'm an open wheel racing fan. My Dad raced and it's what he'd hoped I would do. Fast forward almost a gazillion years and I got the opportunity to nab some great seats at Toronto Indy, an event I was present for the very first, and a few from 1986 until now, the 30 year anniversary. I HAD to go. Plain and simple and not just for the race, but for the entire weekend. End of back story. I needed to secure, close, affordable accommodation. I used numerous online finders..either booked up or so far away from the race as to be silly. Those available, were crazy in cost. Then I saw a \"pin\" on the hotel map that shouldn't be there because, as far as I knew...no hotels, motels, B&B or whatever should be there. The Making Waves Boatel was though. I'm glad I found it and this is why: If you are searching for a great location, convenient to local transit, attractions, entertainment, dining and scenery...nothing beats harbourfront. If you want to add to that, the unique experience of a floating B&B located in that area that is HALF the price of nearby hotel rooms, read on. I arrived early morning on check in day. I'd arranged via email ( Diane and Ted, the Hosts) to drop off my backpack so's I could enjoy the day at Toronto Indy. Diane met me at the door with a welcome smile, a few basics about the Boatel, stowed my bag, gave me a key and made me walk the plank with a grin and off to Indy. I returned after the day's races to meet her husband Ted. Retired to the aft deck and time flew conversing with him. They are truly an engaging couple. I absolutely understand why they have rated so highly here. I opted to out and about for dinner and returned. Bunk time. In a very comfortable bed. I have slept aboard vessels from skiffs , my own relatively small cabin cruiser, to ice breakers to destroyers...that bed in the forra'd stbd cabin just sucked me in until breakfast. So very cozy!!! Bed part done... breakfast part of B.Diane is nothing short of genius regards the chow she serves. I'd followed the FB page, saw the breakfasts other guests had enjoyed and was rewarded the first morning of my two day stay with a blueberry crepe to kill your spouse over and the next morning with what Diane simply called Carnivore Pie. Ohhhh, it was!!!! If bacon could be wrapped in bacon, sitting under and over sausage, with sausage side bumpers and using cheese for glue....keeping it healthy with purée greens on top..... Let's put it this way....you needn't ask to have whatever for breakfast... go with what the maestro serves up. She reads her audience like Kreskin . Look him up. The premises: The Boatel does not leave the dock. It's a B&B that is incredibly, conveniently located to everything downtown. It's meticulously maintained and deceivingly spacious. Guests are informed how to use various areas on the boat ( toilet, doors, hatches etc), out of bounds areas, honour bar and location of lights. This is a 65 foot, gorgeous, floating home. Top forra'd is an open deck, where you can enjoy sunsets and lock up your bike. Aft, you'll find the swim platform for a quiet getaway. In between....she's big. Beautifully appointed salon with reading or TV. A sweet, partially enclosed, dining area aft of the salon. It is spacious enough to seat 10 at the table. Below decks, shared bathroom for the two forra'd cabins that has a Battleship sized H&C shower. It's the biggest shower on a vessel, I'd ever been in. Each of the two forra'd cabins are same in layout but differ in decor. Both nicely done, functional and a lot of storage. There's also towels and a bathrobe in there as well as mini library. Mine, coincidentally had a book named \"Making Waves\". I notice little things. I had a short tour, earlier, of the big guest room. Beautiful but if solo like myself, too big for one unless you really want to indulge. A great spot to take a significant other? Yup!!! Very top deck is by ladder. It's huge up there, great views all round. I think there are 6 muskoka chairs topside with a side table. Designated smoking area as well, if required. The boat has Wifi, I can't vouch for it's speed as I'd used my own data on my phone out of pure habit. The vessel was beautifully appointed, immaculately maintained and in short, a joy to experience.The owners: Ted and Diane are an absolute joy! It was easy to explore topics of conversation but given my background, it always came back to nautical. This couple enjoy welcoming people of like minded spirit!  The aftermath: I'd repacked just before I'd left and my tablet mouse. Diane found it, emailed and said she'd hold it for me when I came back down. I hadn't even noticed, since she sent that so quickly. Guests will have to pose for a \"good bye\" picture and this part of the review I will stop short on or spoil a unique suprise you get in your email. Trust me on this... you'll love it. I think there may only be one negative about using a floating B&B and it probably could be worked around is it is inherently not very accessible to those with severe disabilities. It's a boat. A dock side boat, but still a boat. Beautiful one at that. I highly recommend Making Waves for value, location, ambience, cleanliness, friendliness of the Hosts and meals.Thank you so much, Diane and Ted! My regards to Scarlet :)",
      "rate": 5.0,
      "tripDate": " July 2016"
    },
    {
      "title": "Stay in the heart of Toronto in its most tranquil district - the waterfront",
      "text": "My husband and I had the pleasure of staying at the Boatel this summer and we were wowed! From the moment we arrived, we felt like we were at home. Diane is an incredible host, so hospitable and thoughtful. This Boat was built my a man who is 6'4'' so it is really spacious and boasts generous ceiling heights. The bed was incredibly comfortable and we slept like babies. The boatel has 4 generous exterior deck areas where guests can lounge, enjoy coffee, take in the sunrise/sunset, or relax with a nightcap after a day downtown. Breakfast is fresh, homemade, and done right. If you're a foodie, this is one of if not the best breakfast we've had at a B&B and we work in the travel biz. We could go on and on about how wonderful Diane, Captain Ted and the Boatel is, but instead, we recommend that you book a stay and experience its beauty for yourself. There's something unrivaled about waterfront living, so you won't want to miss out.",
      "rate": 5.0,
      "tripDate": " June 2016"
    },
    {
      "title": "Unique experience with a breath-taking view of Toronto",
      "text": "We stayed with Ted and Diane on this warm welcomed boat in early August.  What a special experience for us! Diane's breakfast every morning was the best we ever had. They welcomed everyone in open arms and provided us with information and suggestions for our visit to this city and we followed many of them and were so glad we did.  Diane went out of her way to have mimosas for our anniversary which was such a great way to begin the day.  The view of the city as you sip your wine on their deck at night is one you can't get by staying at any hotel.  Staying at the Boatel made this vacation one we won't forget. Would whole heartedly recommend them.",
      "rate": 5.0,
      "tripDate": " August 2015"
    },
    {
      "title": "Great Location",
      "text": "We stayed at the Boatel for our anniversary getaway, couldn't have picked a better place,Ted & Diane were very friendly, the boat is great, super clean and the location can't be beat if you want downtown Toronto,",
      "rate": 4.0,
      "tripDate": " June 2015"
    },
    {
      "title": "An incredible experience - unlike any hotel I've ever stayed in.",
      "text": "I normally stay at the Westin Harbour when I visit Toronto for business. But everything was booked up. I saw the listing for the Boatel and thought that might be interesting. And I was right!The Boatel is a bed and breakfast. Hosts, Ted and Diane go above and beyond to make your stay fantastic. I arrived early and Diane was quite willing to meet me at the boat earlier than the regular check in time. We started off with a tour of the boat. You can lounge on the deck and watch the boats go by or hang out in the comfy living area and watch TV.  There is free wifi although you are encouraged not to watch Netflix or Youtube as the streaming is too taxing on the wifi.  Still, they've got a good selection of movies to watch if that's your thing.  The cabins are cute. They are a little on the small side, but then this is a boat...not a massive hotel. Everything was nice and clean and I felt quite safe and at home.Breakfast time was amazing. I am on a challenge right now to eat a whole food plant based vegan diet. Diane stepped up to the challenge and created a masterpiece each morning for breakfast.  On one day I had a gorgeous fruit pizza sprinkled with hemp seeds and other delicious and healthy stuff.  The next, I had a quinoa breakfast an incredible mint-lime sauce. There's great coffee and there is also beer and wine available.  This would be a fantastic place to take a few friends for a night of a few drinks and enjoying the view.Before I went, I found it difficult to understand exactly WHERE The Boatel is. It turns out that it is quite easily accessible. I didn't have a vehicle (but if you do have one, parking is available at a very reasonable rate). I arrived on the Train at Union Station. The Boatel was an easy 20 minute walk from there. But, it is also quite easy to get to via the streetcar. It's super close to the Rogers Centre or Air Canada Centre. There is a pharmacy and a Sobeys near by in case you need anything. But, Diane and Ted have also stocked the bathrooms with pretty much anything you could need in case you have forgotten to pack something.The feeling of sleeping on a gently rocking boat is amazing. I will definitely do this again.",
      "rate": 5.0,
      "tripDate": " June 2015"
    },
    {
      "title": "Always Fabulous",
      "text": "The Boatel is the perfect escape from the ordinary to the extraordinary.  There is a special pleasure to being on the calm of the water with the activity of the city so close.  Walking distance to downtown, and any number of fabulous entertainment and restaurants. Breakfast on the back open deck is a treat of a lifetime.  Diane and Ted are the perfect hosts.  There simply is no experience like this or better than this.",
      "rate": 5.0,
      "tripDate": " September 2014"
    },
    {
      "title": "A wonderfull stay in Toronto",
      "text": "We had a really perfect stay at the boatel. The two owners Diane & Ted are awesome. The breakfast was delicious. The location of the boat in close to the city with an amazing view on the Ontario lake. I will definitively recommend this hotel whatever is your trip in Toronto.",
      "rate": 5.0,
      "tripDate": " October 2014"
    },
    {
      "title": "Incredible stay at the Making Waves Boatel.",
      "text": "Choosing to stay at The Making Waves Boatel in Downtown Toronto was the best choice I could have made.  The location was perfect! Just minutes from everything I wanted to visit during my stay.  A mere 5 minute walk from the island airport, the Ripley's Aquarium, CN Tower and Rogers Centre.  The view was amazing! Surrounded by water and beautiful parks, one would never guess that the bustling big city was so close. Our Hosts Diane and Captain Ted are very welcoming, friendly, informative and accommodating.  ...and Breakfast was incredibly delicious. I look forward to planning my next stay.",
      "rate": 5.0,
      "tripDate": " September 2014"
    },
    {
      "title": "Toronto ahoy!",
      "text": "If you are looking for a unique experience-choice location-top notch hospitality and like to be near the water in the heart of everything - you will LOVE the Boatel.  Diane and Captain Ted are terrific ambassadors for the city  ready to help make your visit special and complete in every way.  As longtime residents of Toronto- they have great passion and knowledge of the city. The en-suite is surprisingly spacious, while the two front bedrooms are cozy yet very comfortable. the common areas and deck space are handsomely furnished and comfortable rain or shine. Diane's breakfasts are not to miss and she even shares her recipes! I cannot imagine not seeing Toronto from the Boatel- we will be back!!",
      "rate": 5.0,
      "tripDate": " August 2014"
    },
    {
      "title": "Stay at making waves boatel.",
      "text": "If you are looking for something different then this is the place to stay in Toronto. Captain Ted and Diane are the perfect hosts. Very helpful couple and delicious breakfasts. They truly enjoy meeting people from all over the world.",
      "rate": 5.0,
      "tripDate": " August 2014"
    },
    {
      "title": "Like Home Away From Home",
      "text": "Location, Hospitality and the Uniqueness of the experience gave my husband, ten year old daughter and I a fabulous visit to Toronto. Being in the core of downtown within walking distance of the CN Tower, Aquarium, Music Garden, Harbour Front, and even the CNE and yet having peaceful water space around us was exceptional. Diane and Ted are a wealth of knowledge of Toronto as well as diving, travel, sea life and boating. The conversation around the breakfast table was stimulating. Breakfast was casual and yet exotic. Gourmet breakfast served by Diane who is very adept with special dietary needs. We felt we were welcomed into their home with true sincerity. They were the perfect hosts. Flexible, kind, helpful, and friendly. Our ten year old had the time of her life. She loved the boat atmosphere - breakfast overlooking the harbour, the swans and ducks, the freedom to move about the boat and feel at home, the information and hands on display of shells collected from around the world.We used the two rooms with shared (not adjoining)  bathroom for our family and it worked out well. Being on a boat the rooms and bathroom are small and yet it was the most comfortable \"hotel\" bed I have slept on. We all slept amazingly well. Very relaxed mornings with breakfast served at 9:00 a.m. and yet it is flexible if a guest needed to eat earlier for any reason. The rocking on the boat was noticeable from the moment we stepped aboard which surprised me a little considering we are in harbour, but it caused no sea sickness. We were told it was a little more than usual the first night due to a south wind. Nights two and three were decreased and quite pleasant.All sorts of little extra touches made this a beautiful experience. All three of us want to return.",
      "rate": 5.0,
      "tripDate": " August 2014"
    },
    {
      "title": "A bed and breakfast experience to remember forever",
      "text": "The accommodations charming, the hosts fantastic, the location central, the breakfasts; out of this world.Everything is perfect: the boat is detailed  the hosts attentive with a light touch.This was an ideal alternative to the hotels everyone else stayed at for the conference.  Boatel is less than a mile walk from the Toronto expo center.In the middle of one of the great cities of the world is a boat. Next to the boat are city bike rentals that allow you to go all over the city droping the bike anywhere and continuing on another any time.",
      "rate": 5.0,
      "tripDate": " April 2014"
    }
  ]
}