{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Maple Leaf Motel",
    "url": "/Hotel_Review-g155019-d1475203-Reviews-Maple_Leaf_Motel-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "2.5",
      "reviewCount": 9
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "4540 Kingston Rd",
      "addressLocality": "Toronto",
      "postalCode": "M1E 2N8",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2b/5f/ff/1c/caption.jpg?w=500&h=400&s=1"
  },
  "description": null,
  "featues": [],
  "reviews": [
    {
      "title": "Good location Excellent price",
      "text": "We stayed there 5 days in Nov 2015 . Nice location just bang opposite to Market place . Budget price , Car parking available ,Only Food is not available . Out side service also good . Free Internet is there but some up gradation required . Price wise location wise excellent stay .",
      "rate": 3.0,
      "tripDate": " November 2015"
    },
    {
      "title": "Its a  bugs life",
      "text": "BUGS!!!   i know its an older basic hotel and the room was clean but well worn with a ciggarette burn in the bed cover.   After being in the room 20 minutes (id gone to get dinner) i felt to bites... i pjlled back sheets to find 2 bugs.   Call front office he told me it was my fault.   I took pictures.   I asked for a refund he refused .  Old furnature piled outside the room.",
      "rate": 1.0,
      "tripDate": " February 2024"
    },
    {
      "title": "This should be renamed The Maple Flea Motel, it makes Motel 6 seem like  a 6 star hotel.",
      "text": "The owners last name must not be Parel as they do not know how to run a motel. I needed a cheap room for a night so I was not expecting much, I got even less than I expected.Bedding as expected, appeared clean, but worn. Adequate cable. Very tiny TV. Most everything was broken in room, even the toilet paper holder. No hangars, hooks in the walls.light in main room, in the wrong place. Curtain fell down in the middle of the night,good thing I had duct tape from camping.Ice was given out by the tray from behind the owners cage. It was laughable to have a 10 dollar key deposit, as the key may have been the most valuable think in the room. There were ugly fake flowers, crappy potpourri ina  crappy dish, and the best was crappy lacedoileys on the crappy furniture.No attention to detail, how they operate legally is a mystery. The city of Toronto should be checking them out. Perhaps another line of business for the operator would be best as they do not know how to be in the hospitality business, even for a such a flea bag motel..",
      "rate": 1.0,
      "tripDate": " October 2012"
    },
    {
      "title": "What a suprise!",
      "text": "I haven't been here for years and had a bad experience last time. That's all changed now, management has finally changed and  they've completely turned the place around! Renovated from the bottom up, you can tell these new owners really care. Its great to finally have a fairly priced and clean room to stay in around this area!",
      "rate": 5.0,
      "tripDate": " September 2015"
    },
    {
      "title": "Not worth the trip",
      "text": "Id rather stay in a cardboard box over this place any day.  My husband and I got a room at this establishment and from about 5 minutes after walking in we couldnt have been more disappointed.  The curtain in the window is held up by a plastic like shower curtain rod  which doesnt stay up.  There is but 2 plug outlets in the whole roon which for somebody like me who has OSA and requires a CPAP to sleep, that does not work well.  The one outlet that wasnt in use we attempted to use to charge our phone. Which unless you have extra batteries I suggest you buy a couple portable chargers because once you turn off the light to sleep the outlet does not work.   The shower is too close to the bathroom sink requiring you to squeeze through just to shower. Theres no water pressure and when you want hot water, let it run because  its always ice cold.   The list goes on.   All in all,  Never stay at that motel.",
      "rate": 1.0,
      "tripDate": " February 2015"
    },
    {
      "title": "Health Check please!!!",
      "text": "My cousin lodged in the motel for one week. This is the worst motel I've ever heard of in Toronto. Can't believe how and why this owner(s) is/ are allowed to run a motel. Something needs to be done. It's more than terrible. My cousing lodged in there. No microwowave despite the huge fee paid for a week. Tiny fridge. To warm your food, you have to go to the caged room called office where the micowave is behind the owner. I've had to drive there everyday to drop off cooked food for them from my home.I once called the office to be directed to the room where my cousin was, the person or the owner in the office said \" make sure you collect their number and room number next time\" I was shocked. The bathrooms are bad. Only one central kitchen with some men carrying frying pan around like a family house. It should be closed down. Not in Toronto.Giant mosquitoes in the room.",
      "rate": 1.0,
      "tripDate": " August 2014"
    },
    {
      "title": "Do I have any privacy or rights?",
      "text": "Do not go to this motel I stayed there once because I was about to go home last I looked in it seemed OK at first I got into the room the tiles in the bathroom we're all moldy falling out of the ceiling the shower curtain was late atrocious looking there was dirty looking towels but they were still clean but terrible shape in the room itself the bed was broken the radiator would not turn off it was just constant heat making the room ridiculously hot and if you open the window you would get a phone call from the owner telling you to shut the window that they don't want to waste electricity and then if you open the window you have to pay more money if you have anybody over to visit during the day you have to pay more money for those people it's a terrible hotel or motel I would not recommend that they are rude I don't know how they're still in business and the place is filthy then they kicked me out for having my dog even though they advertise that they have rooms for dogs but they said that one was taken up by the owner so I could not have my dog there and I question why would you give the owner the only room that's allowed pets that makes no sense you should not advertise that you can take animals there and they refuse to give a portion of my deposit back because I had brought my dog",
      "rate": 1.0,
      "tripDate": " January 2015"
    },
    {
      "title": "Best of Its Class",
      "text": "Tremendously friendly owners who live on site and do their absolute best to provide safe and reasonably priced budget accommodation make staying here a good choice. Rooms are clean and comfortably furnished with a double bed, flat screen TV, complimentary WiFi, mini fridge and microwave. This is not a five star hotel. This is a Kingston Road budget motel but for $70 a night during peak season, you can't go wrong here. Free on-site parking is a plus. Highly convenient to basic shopping and services with a plaza directly across the street. Chinese restaurant adjacent. Fast food within a two minute walk. Nothing fancy about the motel or the neighbourhood but if you are willing to sacrifice luxury for value, you will absolutely love the Maple Leaf Motel.",
      "rate": 5.0,
      "tripDate": " July 2016"
    },
    {
      "title": "Surprising Turn Of Events.",
      "text": "Stayed at this location around 5 years ago and it was terrible beyond words.. But I was in the area and decided to stay there again since it was closest to the event I was attending, I noticed new people at the front desk and immediately noticed the brand new office, it wasn't this shady run down motel that I knew before. I was talking to the manager and he told me that it was under brand new management as of a few months ago and I could immediately see that. Once entering the room to my surprise everything was different from what I remembered and this stay was very pleasant for me, I would definitely go once again, glad to see that they've turned this property around. Definitely would recommend going here for clean rooms and very friendly service with a large smile!",
      "rate": 5.0,
      "tripDate": " March 2016"
    }
  ]
}