{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Margie Townhome Suite",
    "url": "/Hotel_Review-g155019-d6623344-Reviews-Margie_Townhome_Suite-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.5",
      "reviewCount": 38
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "44 McGill St",
      "addressLocality": "Toronto",
      "postalCode": "M5B 1H2",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/06/a7/77/62/margie-guest-house.jpg?w=500&h=400&s=1"
  },
  "description": null,
  "featues": [
    "Free High Speed Internet (WiFi)",
    "Wifi",
    "Snack bar",
    "Non-smoking hotel",
    "Shared kitchen",
    "Shared lounge / TV area",
    "Clothes dryer",
    "Air conditioning",
    "Desk",
    "Seating area",
    "Iron",
    "Coffee / tea maker",
    "Kitchenette",
    "Bath / shower",
    "Complimentary toiletries",
    "Microwave",
    "Refrigerator",
    "Kitchenware",
    "Hair dryer",
    "Non-smoking rooms",
    "Family rooms"
  ],
  "reviews": [
    {
      "title": "Walking distance to Toronto General Hospital",
      "text": "I needed a place within walking distance to the Toronto General Hospital and found this gem. It’s only a 9 minute walk to Toronto General Hospital and Toronto sick kids and other hospitals in the area. It was a comfortable clean room with separate living area & Private bathroom. Shared kitchen facilities on ground floor. Reasonably priced especially considering it offers free parking. The website says parking for 2 vehicles however only one fits. Lots of restaurants and shops in the area. Walking distance to Eaton Centre.",
      "rate": 4.0,
      "tripDate": " December 2018"
    },
    {
      "title": "Excellent position, good accommodation ",
      "text": "We visited Toronto and stayed at Margie Townhouse.  Our room was upstairs and there is not a lift so we had to drag our heavy luggage up one floor.  Or room consisted of the bedroom and a sitting room.  The bed was very comfortable. We were surprised that we were sharing the house with other people however this was not a problem. We felt that the owners need an instruction book in each room talking about the house, local attractions and restuarants.There was one other downside for us.  The air conditioning did not work very well upstairs so or room was quite warm and a bit uncomfortable for sleeping.  Other than that i would recommend staying here.",
      "rate": 4.0,
      "tripDate": " July 2016"
    },
    {
      "title": "cozy",
      "text": "Its tucked away in the middle of Toronto. Easily missed but for the white 48 number on the door. Its steps from the eaton center and yonge street. Lots to do around. College and Yonge is the closest subway stop an 8 minute walk. The regional bus station like coach Canada or megabus is 15 minute walk . The owners were nice and helpful, room was great, clean, well made. Felt homey! Bathrooms needed an update, that was the only draw back.",
      "rate": 4.0,
      "tripDate": " November 2015"
    },
    {
      "title": "It's a boarding house, not a townhome",
      "text": "We were beyond disappointed when we arrived. I booked the room because it is in a quiet, shady downtown neighborhood; very convenient. It is not at all as advertised though. It's a boarding house with 3 or four narrow flights of stairs. No way was I going to drag all our suitcases up all those stairs. Parking was out of the question. There is paid parking in a garage across the street; a long walk from the property. We didn't stay there. We had to go rent a hotel.",
      "rate": 1.0,
      "tripDate": " October 2022"
    },
    {
      "title": "A Last Minute Switch that was not Impressive!",
      "text": "For our last trip to Toronto, we had trouble finding a hotel in which to stay - not sure what was happening other than summer. The beautiful hotel where we stayed in early July wasn't available. We ended up booking at a place called \"Margie Townhouse Suites\" at 48 McGill Street just north of Gerrard. It looked nice online. However, before our arrival, we were directed to check in at 44 McGill. We had the room next to the shared kitchen - quite noisy in the morning! The room was small with no bedside tables, lamps or clock. There was also no closet! Not even any hooks! The ensuite bathroom was tiny with a squeaky bi-fold door. There was a silk flower in a vase that was glued to the toilet tank! I asked a woman that I met in the kitchen if her room had a closet.  She said yes but that it had no hangers and no rod!   The room was air-conditioned and clean and the bed was comfortable but, at $190 a night, we expected more, especially since the beautiful room on the 40th floor cost $154 a night! Not impressed!",
      "rate": 2.0,
      "tripDate": " July 2016"
    },
    {
      "title": "missing some VERY basic features",
      "text": "buyer beware: my room was missing the following basic features that ANY hotel would include:• a closet or dresser or any place to hang or store my clothing.• a mirror of any kind•a place to put trash: no trash can.• A BATHROOM i was shocked to find no private bathroom in my room.i arrived around 9:30 in the evening and since there was no one there (in fact there was never anyone there to take care of any needs i might have.)  and no note, i had to search the entire house for a bathroom. after snooping into every door on all 3 floors, i could find no bathroom. only after i opened a door that was clearly labled \"PRIVATE' did i discover one. i'm not even sure this was a bathroom for my use, i used it anyway as there were no other options.for around 130./night i was expecting these basic features, if not more!also if you require any kind of assistance there is never any one there expect for other lodgers. i did see a woman there twice who i thought was margie. she told me margie was her boss but her english was so poor she couldn't help me in any way.",
      "rate": 2.0,
      "tripDate": " July 2016"
    },
    {
      "title": "A Convenient Place to Stay in Downtown Toronto",
      "text": "I stayed here for one night on the 21st October 2014.  Not a hard place to find and parking can be arranged but you don't really need a car everything is so convenient.  No clock radio alarms so have one of your own just in case.  The TV is not set up with a HD receiver so be forewarned.  Mind you, if TV is what you want, why are you staying here?  Kitchen is adequate for microwave meals or snacks or breakfast before you head out to investigate the area.  The suite with the loft bedroom is the one I would book if I was spending more than one day here.",
      "rate": 4.0,
      "tripDate": " October 2014"
    },
    {
      "title": "Great location with easy access to public transit and restaurants",
      "text": "The location was excellent and easy to find. Convenient to public transportation and lots of restaurants. We stayed in the bedroom on the main level adjacent to the kitchen, and it was very easy to access. A few steps up into the townhouse, and then just a few down into the bedroom area. The room itself was clean and welcoming, and the bed was very comfortable. There were some other guests staying at the same time as us, and everyone that we encountered was friendly in the common spaces. The welcoming treats were appreciated as was the complementary coffee and tea in the kitchen area - rental was perfect for a quick two night trip.",
      "rate": 4.0,
      "tripDate": " April 2023"
    },
    {
      "title": "Book in advance and get the best room! Nice, handy place",
      "text": "We were on the 2nd floor in a duplex with 2 queen size beds and an enormous bathroom. Everything was clean and welcoming. From the nibbles to the bathroom accessories (beauty creams and sanitary towels included).Lovely comfortable bed but a bit short for my 2m04 man. Shoes not allowed past the hallway but kitchen at your disposal for tea/coffee.Small remarks: blinds would be needed on the upper window to darken the room in summer but also to shut out direct view on opposite building windows. Also, it's a pity we didn't get to meet our host who made sure we got all access information by email.Thanks Margie, we had a great stay at your place!",
      "rate": 4.0,
      "tripDate": " October 2018"
    },
    {
      "title": "Glad it was only one night!",
      "text": "This was not what we expected. I am not a germ phobe and usually rate places better than they are. We booked Margie Townhome Suite as it was close to where our son lives. For $276/ night we expected something satisfactory. I however did not expect to have to put my toilet paper into a dirty can so that the toilet wouldn't plug!! Last time I had to do that was in the countryside of Guatemala. The blinds were broken, there were no hangers in the closet and the air vents were covered in dust. There was a skylight over the bed with a paper blind that we thought would disintegrate if we tried to pull it.  Everyone who stayed there also had to take off their shoes at the front door before going to their room.  A variety of previous worn slippers were offered for one's use.  On the up side....It was close to where my son lives and we didn't get bed bugs!",
      "rate": 2.0,
      "tripDate": " September 2018"
    },
    {
      "title": "Comfortable and Well-Located",
      "text": "This little guesthouse is right off Yonge Street but feels in its own little corner -- a perfect blend of both worlds.  The street was quiet and the house might have been also, except that the floors were REALLY creaky and the walls thin.  If no one was moving about or watching TV, it was super quiet ... but I have say I was kept up a bit later on one night than I would have otherwise been, and I was shocked awake one morning too early.  Otherwise I slept well.The house was well kept, but well kept ala 1980.  Some new paint and a bit of updating on the bathroom fixtures would be nice, but not essential.  A/C was not strong but kept the building warm-comfortable.  Don't expect cleaning while there ... I was there 3 nights and never had any housework done, nor were the drinks and cereal in the kitchen restocked.  I wasn't relying in that, but I would have been bummed if I had.Still, I had absolutely EVERYTHING I needed and I would happily stay again.  The owner waz super kind by email, and the electronic reservation was vey smooth.  Pearson Airport to the guesthouse via UP and subway was a dream ... get a PRESTO card.Overall, don't hessitate unless you are a light sleeper or can't handle stairs.",
      "rate": 4.0,
      "tripDate": " June 2015"
    },
    {
      "title": "Great Option For Downtown Toronto",
      "text": "We were very pleasantly surprised with the Margie Guest House. The loft we stayed in was clean, spacious, and very comfortable. The kitchen was full of snacks and the host was friendly and accommodating, even allowing us to park in her driveway after we checked out for the day.",
      "rate": 4.0,
      "tripDate": " November 2014"
    },
    {
      "title": "very sweet place",
      "text": "i really appreciate this homestay. so sweet, comfortable, convenient like home，they prepare many snacks for clients. the master couple are very nice and warmhearted. the host cleans the house many times every day. i joked with him: u have mysophobia :P",
      "rate": 5.0,
      "tripDate": " October 2014"
    },
    {
      "title": "Great Service, Great Amenities, Great Location!",
      "text": "This was a great place to stay. I was in town for three nights for a conference at Ryerson University, and this is a short walk (about 8 minutes in heels) to the center of the university. The city center is also a short walk away. The owners are very accommodating and friendly. I would definitely consider coming back here with the family and renting the whole house for a week. You can't beat the location or price for your stay in Toronto!!",
      "rate": 5.0,
      "tripDate": " October 2014"
    },
    {
      "title": "Excellent Place to Stay",
      "text": "Great for a short stay, excellent service and extremely clean / tidy. Very helpful information available and the owner (s) were very friendly and kind. Perfect location for city centre access and only a 30 minute walk from CN Tower.",
      "rate": 5.0,
      "tripDate": " September 2014"
    },
    {
      "title": "Simple B&B",
      "text": "B&B that has little in the way of suites!!The structure is a typical English house built in heightWe stayed in the basement, that is, in the garage transformed into a room with bathroomThe very steep stairs, even with just a few steps, are very uncomfortableThe room is a banal room in a B&BWe suffered from the cold since the air conditioning was not adjustable!!!!The area is frequented by many homeless people, especially in the eveningPositive notes: proximity to the metro stop and use of the kitchen shared with other guestsNot satisfactory quality/price ratio",
      "rate": 3.0,
      "tripDate": " August 2023"
    },
    {
      "title": "Well Situated",
      "text": "The townhouse was in a convenient location near downtown.  The place was clean, but I had a few issues.  Parking was an issue, although we were allowed to park for free in the driveway after I complained.  It does state in the write up that there was no parking, so if you are driving here take note and download the parking app on your phone to save major money for parking.  There are a few spots on the road across the road, but for the most part they are always full.  There is also a underground parking facility across the street, but we paid $35C for one day.  Plan ahead.  The second issue is the accessibility . There are 40 stair steps from the street to the bedroom for our room.  Take note if you have mobility issues. The only maintenance issue I had was the grout around the bottom of the fabulous shower.  A good place if you are forewarned about some issues.",
      "rate": 3.0,
      "tripDate": " September 2018"
    },
    {
      "title": "Reasonably priced home away from home.Highly recommend.",
      "text": "Location is excellent and price cannot be beat in downtown Toronto. 5 min walk from Eaton Centre, apartment is located on a quiet street and Ryerson University is one street away. Perfect for anyone who prefers to feel like they are in a home as opposed to the confines of a hotel room, it was considerably cheaper than any of the hotels in the same area. I checked out the other rooms(4 rooms in all) and they were all tastefully decorated, some have designated little sitting areas separate to the bedrooms, bathrooms were small but clean and well stocked with towels and even aftershave and face creams were provided in our room! The room we stayed in was on the top (2nd) floor, split level, so sitting room and big bedroom upstairs with a skylight (no cover), comfortable beds, room was always a good temperature. Master bathroom was large, well lit, jet shower. Our toilet had a message saying not to flush paper! We were very careful and did not have any issues but this toilet obviously gives trouble. I believe this was the only one like this as the others did not have messages. Suitcases have to be lifted up narrow stairs, there is one room which would suit someone with issues lifting. There is a communal dining area and kitchen which was really well stocked with everything from butter and milk to coffee and tea. Noise from neighbors could be a problem but we were lucky to have the whole place to ourselves for nearly all of our 5 day stay. There were 2 over night guests but they were very considerate and they didn't disturb us. The lock on the apartment door is not the best, a bolt would have made me feel safer, the main door had a dead bolt which did give a little trouble but the owner was quick to respond with a solution. Personally I would not have stayed in the basement but I live on an island in the Caribbean so I need to see the sun, the basement is exactly as advertised!",
      "rate": 4.0,
      "tripDate": " December 2017"
    },
    {
      "title": "Well situated, but the price was too high for this small cabin",
      "text": "The bathroom with no shelves, no hooks. Noise from upstairs, noisy icebox, no place to put even your suitcases. So the room was really small . We also had an invasion of ants. The small Garden looked intidy, it was not like in the pictures. (For the same price  we paid, we had an excellent 40 m2 suite in a luxurious Hotel in Montreal). We didn't meet any person, any owner during our two day Idon't recommend at this price, but at halfprice it would be okay.",
      "rate": 1.0,
      "tripDate": " September 2017"
    },
    {
      "title": "Extremely dissapointed!",
      "text": "There was a glaring difference in what was in the pictures and the reality.Very noisy refrigerator and air conditioning in the room. Ceiling creaked every time someone in the room above walked or moved there bags and belongings! I was in the room next to the kitchen and could here slightest of the noise made by other guests in the kitchen. The bathroom was a hole in the wall. Shower did not work. The side table below the TV was unclean. The backyard was nothing great - this was a selling point for the room that I rented. The owner was nowhere in sight - On the last there there was a lady who did not even make an eye contact when I left but went straight to my room to check the condition of the room.",
      "rate": 2.0,
      "tripDate": " May 2017"
    },
    {
      "title": "Perfect!",
      "text": "Found this gem on expedia and am so glad I did. I had to make a last minute cancellation to another reservation and was able to get this. The owner, Margie, communicates quickly and has a cute set-up. It is a townhouse on a cute little street right in the middle of the city. You walk into a little dining area. Our room was on the second floor- it consisted of a main area and then an upstairs loft area. With 5 of us it was exactly what we needed to not feel crowded. The bathroom is big. My kids loved the little candy treats left for them and I appreciated the water bottles. Since it is in the city we were close to public transportation and could get to a lot of what we wanted on foot. The beds were really comfortable!",
      "rate": 5.0,
      "tripDate": " April 2017"
    },
    {
      "title": "Love this place!",
      "text": "Thoroughly enjoyed our stay here. Me and my best friend spent 3 nights here over New Years. Staff were great and very helpful, the rooms were comfortable enough with the added delights of your own bathroom downstairs as well as a kitchen and a living room. Add to that how good the location was, and you're looking at a great place to stay off one of the main strips.",
      "rate": 5.0,
      "tripDate": " December 2016"
    },
    {
      "title": "Great for an overnight stay.",
      "text": "This is a great place if you don't mind taking off your shoes when you enter,sharing a bathroom,kitchen and dining aria with others. The place was clean and quiet and offered soda,water,and snacks. The parking was free,but limited. wifi was a big plus. The downside was no air in our room,wasn't sure when checkout was and no ice machine.This is a great place if your are passing through town overnight.",
      "rate": 3.0,
      "tripDate": " August 2016"
    },
    {
      "title": "Heart of Toronto",
      "text": "We arrived and were lucky to park in the driveway, I think there is more parking, not sure where. Place is well set up, we were early so we walked to maple leaf gardens, just around the corner!  We had the loft , nice setup, warm after a sunny day. Needs some touch up painting and dusting but great. Bed was firm and skylight was a nice touch, would have liked a better lock on our door.",
      "rate": 3.0,
      "tripDate": " April 2016"
    },
    {
      "title": "You feel at home",
      "text": "We loved the place. You just have one of the rooms in family house. Quiet street in a nice part of the city. Very cozy house and nice small, clean rooms. You will feel like at home. Kitchen and bathrooms to disposition. Good connection with the rest of the city. If you have enough of hotels, that's the place for you.",
      "rate": 5.0,
      "tripDate": " December 2015"
    },
    {
      "title": "External toilet meant on a different floor IN THE BASEMENT. Dave Kincardine",
      "text": "The house is in a great location and it was very clean. The room was off the kitchen overlooking the back garden. It was very small and the external bath was through the kitchen and down a full flight of stairs to the basement, then trough the laundry room. The shower was the  smallest I've ever seen. I have bad legs and back, I avoid stairs when I can. We told them that the room was unacceptable the best they could do was offer us a 50% refund which we accepted to cut our losses and headed home( a 3 1/2 hour drive ).",
      "rate": 2.0,
      "tripDate": " October 2015"
    }
  ]
}