{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Marriott Downtown at CF Toronto Eaton Centre",
    "url": "/Hotel_Review-g155019-d183092-Reviews-Marriott_Downtown_at_CF_Toronto_Eaton_Centre-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.0",
      "reviewCount": 1963
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "525 Bay Street",
      "addressLocality": "Toronto",
      "postalCode": "M5G 2L2",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2b/7a/da/c7/king-guestroom-nathan.jpg?w=500&h=-1&s=1"
  },
  "description": "Welcome to Marriott Downtown at CF Toronto Eaton Centre. Our upscale downtown Toronto, Canada hotel offers spacious guest suites and hi-tech meeting rooms for the business traveler. With free Wi-Fi in our public areas and an array of family vacation packages available, plus more services and amenities to make your stay an enjoyable one, we are a top choice among all Toronto hotels. Travelers looking for Toronto Downtown hotels will find that our hotel in Toronto's city center is ideal. We sit near famous attractions in the downtown area, such as CN Tower, Eaton Centre, and the Hockey Hall of Fame. We offer stylish and feature-rich accommodations, including thoughtfully designed guest rooms with modern amenities. Whether you are staying in Toronto to work or play, you will find that our Toronto hotel provides everything you need for a pleasant and productive experience.",
  "featues": [
    "Valet parking",
    "Free internet",
    "Fitness Center with Gym / Workout Room",
    "Pool",
    "Bar / lounge",
    "Pets Allowed ( Dog / Pet Friendly )",
    "Business Center with Internet Access",
    "Conference facilities",
    "Paid private parking on-site",
    "Wifi",
    "Paid wifi",
    "Fitness / spa locker rooms",
    "Hot tub",
    "Pool / beach towels",
    "Indoor pool",
    "Heated pool",
    "Restaurant",
    "Breakfast available",
    "Breakfast buffet",
    "Breakfast in the room",
    "Complimentary Instant Coffee",
    "Complimentary tea",
    "Snack bar",
    "Wine / champagne",
    "Vending machine",
    "Banquet room",
    "Meeting rooms",
    "Salon",
    "24-hour security",
    "Baggage storage",
    "Concierge",
    "Convenience store",
    "Currency exchange",
    "Executive lounge access",
    "Gift shop",
    "Newspaper",
    "Non-smoking hotel",
    "ATM on site",
    "Doorperson",
    "24-hour front desk",
    "Express check-in / check-out",
    "Dry cleaning",
    "Soundproof rooms",
    "Bathrobes",
    "Air conditioning",
    "Desk",
    "Coffee / tea maker",
    "Cable / satellite TV",
    "Sofa bed",
    "Walk-in shower",
    "Housekeeping",
    "Interconnected rooms available",
    "Room service",
    "Safe",
    "Seating area",
    "Sofa",
    "Telephone",
    "Iron",
    "Private bathrooms",
    "Wake-up service / alarm clock",
    "Refrigerator",
    "Flatscreen TV",
    "Radio",
    "Bath / shower",
    "Complimentary toiletries",
    "Hair dryer",
    "City view",
    "Landmark view",
    "Non-smoking rooms",
    "Suites",
    "Family rooms"
  ],
  "reviews": [
    {
      "title": "exceptional stay",
      "text": "My 2-night stay at this property exceeded my expectations. I regularly have stayed at the Courtyard Marriott on Young St, however for location convenience I reserved at this property (Marriott Downtown at CF Toronto Eaton Centre).My experience began at check in.  Our flight arrived early, and we arrived at the hotel, expecting to have a room not available at 11:00 am. Much to our surprise the very professional front desk lady told us that a room was available and check in went very smoothly, and professionally.The Room assigned,  was very clean, and met our needs exactly. All features and fixtures were in good repair and operational. The room was clean and very welcomingI was most impressed with the security system built in the elevator, not allowing access to guest rooms without a functioning room key.I did experience some difficulty accessing the Wi-Fi on my phone. After several attempts I went to the front desk to see if anyone there could assist. After several attempts, and problem solving failed, I decided that there was something wrong with my phone. The gentleman at the front desk was exceptionally helpful, and sought assistance from 2 other staff people to assist – although unsuccessfully. When I returned to the room, my teen aged daughter was able to resolve the problem.  However, the following day, two men were sent to my room to assess the Wi-Fi status, and evaluate its accessibility.I found that all staff, without exception were cordial, and put customer service above all else. At 11 pm I was looking for someplace to eat, and once again personnel in the lobby were able to direct me to a place that was safe to walk to.  The housekeeping staff, were notably happy and cheerfully greeted guests with a smile and kind words, in the hallway, on the elevator, or even in my room when I returned early.There was an unfortunate visitor, in the lobby, who clearly was not a guest, struggling with a mental health issue, and security discreetly ensured the safety of guests in the lobby, while keeping a watchful eye on the visitor, and providing him with dignity and respect, and did not create any altercation, or drama.Front desk personnel were able to accommodate my request for a later check out, upon request. My luggage was safely stored until my departure time, and a taxi was promptly obtained for my ground transportation to the airport.In short, every aspect of this property functioned well as a team, were customer service driven, were accommodating, helpful and above all professional.  I would ask that this letter be shared with all departments to be shared with all personnel with praise for a job very very well done.  Not only would I highly recommend this property, but I will continue to stay here whenever visiting Toronto.Please feel free to share this correspondence with any relevant person.Thank you for an exceptional experience and stay at the Marriott Downtown at CF Toronto Eaton Centre.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Great Hotel and location",
      "text": "We stayed in this hotel August 14 to 16 and were very impressed with it.   The room was clean and up to date.   Complimentary bottles of water in the refrigerator would have been appreciated but we asked at the desk and were given some then.  The location is ideal for the downtown area and going out the back entrance to Trinity Square provides a quiet little diversion with the lovely Trinity Anglican Church. Also when you pay $369/night for a room,  a complimentary breakfast should really be included.",
      "rate": 5.0,
      "tripDate": " August 2022"
    },
    {
      "title": "No upgrades! Better rooms available.",
      "text": "Checked into Eaton Centre Marriott yesterday for a 5 night stay. Titanium Elite, booked well in advance. No upgrade available - given the most basic king room with a view of the alley when rooms that featured views (city / Trinity square) were available online to book for my entire stay. Disappointing! On the plus side, check in staff were great, hotel is conveniently located, 1st breakfast was great, yummy pancakes - have the option to eat in the restaurant or pick up and take back to room - elites can order an 'entree' per person and a beverage (coffee/tea/juice/etc.) . Rooms are a little tried and need updating. Plenty of sanitizing stations throughout the hotel.. which actually work.. unlike my recent stay in another city.",
      "rate": 3.0,
      "tripDate": " September 2021"
    },
    {
      "title": "A professionally run operation",
      "text": "For me this Marriott ticked all the boxes, including the ultra courteous and helpful staff, the clean quiet rooms, the large and up-to-date TV, the walk-in shower, and the reasonable rates for a quality hotel in downtown Toronto.Special mention to front desk person Fortunato, who could not have been more pleasant to deal with.This operation is a model for all hotels to emulate. We'll be booking again soon.",
      "rate": 5.0,
      "tripDate": " November 2020"
    },
    {
      "title": "Lockdown in Toronto, basic at best",
      "text": "Stayed for 2 nights during stopover to Toronto before an international trip. I have stayed at this property before and enjoyed it for the most part. Unfortunately Toronto was in full lockdown and this limited the property amenities severely. While that factor is not the fault of the hotel, it was bare minimum regardless. The location is excellent and central but Eaton Centre was all but closed making it pointless. Despite being a Titanium Elite member I was disappointed not to be offered a room upgrade, especially as the hotel did not appear anywhere near being at capacity and the property could not offer any amenities at all almost. My room was instead stuffy and somewhat dark and overlooked a homeless encampment that has sprung up in Trinity Square adjacent to the Eaton Centre and a church. Somewhat updated but still felt far from fresh. Staff was pleasant enough, especially front desk, but otherwise could not really 'enjoy' a stay that consisted of my room and nothing further, given that the Club Lounge, gym, restaurants were all closed. Not even room service offered. Doubtful I'd consider a future stay given the area has become seedy, sadly, and there is nothing terribly outstanding about the property itself.",
      "rate": 3.0,
      "tripDate": " December 2020"
    },
    {
      "title": "Great experience",
      "text": "This hotel may not have the great views but its location is perfect in terms of walking distance from most downtown attractions.  The hotel itself has got underground parking which is convenient if you have a car.  The staff at this hotel are very accommodating and friendly.  The rooms are clean and really spacious.  We couldn't use all the hotel amenities due to the whole covid situation, but it was still a great stay for us.  The a la carte' breakfast was pretty good too, even though it was packed to eat in our rooms.  Will definitely be coming back!",
      "rate": 5.0,
      "tripDate": " January 2021"
    },
    {
      "title": "Wonderful Stay - Pleasantly Surprised",
      "text": "Easy access off of Bay, parking garage very clean and easy to navigate. Room key access to elevators which made us feel safe. Staff were very helpful and courteous. Restaurant serves a great buffet breakfast or off menu, Happy hour and restaurant stays open until 11. We got take out coffee, brought it up to the room while we woke up. Room was clean, comfy beds. I loved the toiletries bottles for shampoo, conditioner and body wash are mounted to the shower wall - no need to pack. Planning another stay.",
      "rate": 5.0,
      "tripDate": " April 2022"
    },
    {
      "title": "Horrible AC, dirty room, construction wake up call at 7am",
      "text": "I’m an ambassador at Marriott which means I stay over 100 nights in marriotts year round. I’ve never experience something like this hotel. Requested a room not facing the road, a quiet room. They put me directly facing the street. Moved us to a different room that had a used robe and dirty clumped up towels in the closet- clearly, they don’t clean! Soap dispensers were broken off the wall. Manager was nice. They moved us to a suite. Maintenance woke us up around 7am! This was an absolutely horrible hotel- would never recommend and won’t return. You will ask for towels or things to be delivered and they’ll never come or say “they don’t have it”. Air conditioning had to be fixed twice only to never get below 22 degrees. Hot and muggy sleep. Never will return!",
      "rate": 1.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Great Choice in Toronto",
      "text": "This was a good choice for a short stay in Toronto. The room was comfortable with the bathroom around the corner to not disturb sleeping family when waking in the night. The front desk was helpful and offered us water bottles when we came in from the heat. The small cafe in the lobby was good but, as expected,  a bit expensive. There is a food court just steps away in the Eaton Center which my kids preferred to the breakfast at the hotel. While in town we saw Hamilton and Ubered back and forth for a reasonable price.",
      "rate": 5.0,
      "tripDate": " July 2023"
    },
    {
      "title": "Highly recommend for a weekend in the heart of downtown Toronto",
      "text": "My wife and I decided to partake in a vacation weekend in Toronto, our first since the start of the pandemic, and as a Marriott Bonvoy member, decided to book at this hotel. We were extremely happy with our decision! We drove to the hotel, and while the valet parking was unavailable, the self parking was easy, as the entrance to the garage is right beside the main entrance and easy to access. A well-mIntained and clean garage.While we checked in online and received a mobile key, unfortunately the Bonvoy app doesn’t allow to have a second key, so we went to the front desk to snag real keys.Our room was extremely nice on the 17th floor, with a view of the Eaton Centre and old church… with the pandemic, there was no regular housekeeping (you can request it, but we were fine without it). The elevators, even with capacity limits, didn’t require a lot of waiting. As for amenities, internet was great. The fitness centre was available, but required a pass and contact tracing verification at the front desk beforehand… but the both times I was there, only one other person was in there. The pool was also open, but we didn’t go… again, didn’t look super busy.For breakfast, we ate at the Trios Bar the first morning, and then had takeout service the subsequent two mornings, which we ordered online and picked up in the restaurant. The service and quality was awesome (as an Elite Bonvoy member, breakfast was actually included in our room rate… an extremely nice perk , especially during a pandemic!)All in all, we were there 3 nights, and had a great time. Location is excellent (in between city hall and the Eaton Centre), service was great, with all staff extremely friendly. Highly recommend this hotel to enhance your toronto experience!!!",
      "rate": 5.0,
      "tripDate": " August 2021"
    },
    {
      "title": "Overnight Stay",
      "text": "The mattresses are in a dire need of replacement. This is sad considering this is a Marriott property. The property itself is in good shape.The entrance, lobby, and room decor are very pleasing to the eye. Prices for room service are excellent. This property doesn't take advantage of their guests.Overall, we enjoyed our stay but the sleep quality was definitely poor. The mattresses in these rooms have not been replaced for several years. Why don't you attempt to do a floor at a time? You can charge more and advertise that this room category has a brand new state of the art mattress.",
      "rate": 4.0,
      "tripDate": " January 2024"
    },
    {
      "title": "Excellent Experience. Excellent Staff. Highly Recommend. ",
      "text": "From start to finish, this was a great hotel experience. Check in was fast and efficient. Parking, while expensive (naturally in downtown TO), was extremely convenient, close, and safe. You can do self-park or valet. Hotel amenities were wonderful. We enjoyed the elite member lounge, which offers you a quiet place to eat breakfast and a nightly happy hour. And the hotel had a churro lady in the lobby. The kids loved that. Rooms were spacious, modern, clean, and cozy. Everything you needed was there for you. The pool was small and shallow, but my kids loved it. There's a hot tub too. The walk to the subway is super fast. Eaton Centre is even closer. About a 30 second walk out the door. One note- this is a busy hotel. When we stayed, there was the Waterfront marathon as well as 2 conferences happening at the hotel. It was busy, but it never felt chaotic. The Marriott team who was on staff at the hotel was nothing but courteous and kind the entire time. Very professional team working here. Will definitely stay here on future trips as this satisfied and surpassed every single requirement.",
      "rate": 5.0,
      "tripDate": " October 2022"
    },
    {
      "title": "Fantastic home away from home",
      "text": "Such a great welcome and stay here at the Marriott Eaton Centre. The front desk staff are fabulous, feel very safe with all the health and safety precautions the team is providing, close parking and morning breakfasts and lattes are wonderfully convenient and enjoyable.Thank you to great staff, and Director of Operations Heather for above and beyond client service excellence. It is much appreciated.",
      "rate": 5.0,
      "tripDate": " May 2021"
    },
    {
      "title": "Beware the adjoining room!!",
      "text": "Excellent customer service in the lounge/restaurant and the concierge with recommendations for the city. Walkable location to many places. Clean rooms. Very loud room noise due to adjoining room. Learned a valuable lesson there - find out in advance if room is connecting. Person in room next to us appeared to have the whooping cough, and the noise which began about 6am startled my wife so much she thought someone was in our room.  We did mention this to the front desk and after several rounds of respectful complaints we finally were awarded with 1000 bonus points (or the equivalent of like $7). DEFINITELY request a room that is not adjoining. We could even see the light at night coming in from the room next door.",
      "rate": 3.0,
      "tripDate": " March 2023"
    },
    {
      "title": "Good for Business executives ",
      "text": "Conveniently located near eaton centre. The room is set up for business executives who need to work on their laptop in the room. I only wish the lights in the room can be brighter. Wifi is chargeable if you are not member.",
      "rate": 4.0,
      "tripDate": " December 2022"
    },
    {
      "title": "Great location and well Run. We would stay here again. ",
      "text": "We found the Marriott to be a very good experience overall. The location was great. It's close to both the subway and buses, and being next to Eaton Centre was awesome. The desk and housekeeping staff were perfect.  About the only thing we would have improved would be the food offerings  in the club room, which we found to be minimal compared to the other club rooms we've experienced.",
      "rate": 4.0,
      "tripDate": " July 2023"
    },
    {
      "title": "Security barged into my room in the middle of the night",
      "text": "I was here for two weeks while my dad had heart surgery. My second last night there, I fell asleep with my tv on. I woke up to two security men in my room telling me to turn down the tv. I complained to guest services in the morning and she said it was only for my own “well-being” cause they had to make sure I was ok!!!!! I asked her why she didn’t call my cellphone and she said that would be a breach of my privacy......but sending two security men into a single females room in the middle of the night in this day and she isn’t a breach of my privacy? Horrible and I will never return to this hotel",
      "rate": 1.0,
      "tripDate": " March 2021"
    },
    {
      "title": "Location is great. Hotel is OK",
      "text": "Location wise is the most this hotel has going for it. Lots of great places to eat nearby. It’s close to Chinatown, Queens St, Kensington market and has the large CF Eaton centre mall next to it. The breakfast however is a rip off, the one day I did eat there out of necessity I ordered an avocado toast - the avo was dark and I found a hair on my food, and paid 24 CAD for the privilege. Also who still charges for Internet??? and at extortionate prices unless of course you sign up to be a BonVoy member - and even then you get the lower tier. The room was ok -  but was grubby and I used an alcohol wipe to clean the side tables and lamp. Not great when the room rate was very high due to low availability in Toronto that week.",
      "rate": 3.0,
      "tripDate": " September 2023"
    },
    {
      "title": "We thoroughly enjoyed staying at this hotel",
      "text": "We loved staying at the Marriott Downtown at CF Toronto Eaton CentreWe stayed for 13 nights and from the first second that we arrived we found all  the staff to be friendly, courteous and helpful.  The hotel is centrally located, you can park in the adjacent parking lot.The rooms were very comfortable and clean and came with a small refrigerator and safe. As well, there was a large couch that was comfortable to sit on.The lounge was great, was open until 10pm, and was stocked with  bottles of water, soda, juice and a variety of snacks. The staff manning the lounge, specifically Anna, were always friendly and helpful.We had a great time staying at this hotel and regretted having to leave at the end of our stay.We very highly recommend this hotel.",
      "rate": 5.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Relaxing short staycation",
      "text": "We had a quiet room on the 14th floor with a partial view of Nathan Philips Square. The room was clean but a little dull in colour. The chaise lounge was grey and didn’t have any cushions like they showed in the pictures, probably a former guest made off with them! Despite the Covid restrictions, it was nice to be able to order breakfast and pick it up downstairs. We couldn’t use the pool unfortunately because it was closed. The location is great!  The neighbourhood has plenty of restaurants to choose from. We had a short walk to Eaton Centre to do some shopping.",
      "rate": 4.0,
      "tripDate": " July 2021"
    },
    {
      "title": "Clean modern hotel that is centrally located",
      "text": "This was my second stay at the property which is centrally located at Bay and Dundas. Checking in was pleasant and the staff were very accommodating. Depending on the room, you can get a nice view of downtown Toronto. Room was spacious with a small upgrade as an elite guest. Great gym to work out.The elite lounge was closed due to Covid restrictions but they provide a breakfast voucher.  As I was busy, they prepared a to do with 2 different items a smoothie and a yogurt dish, latte, juice and so forth.Parking is $40 but that is normal in major cities.  Had a late checkout which was nice so that I can go for lunch, come back and get rest before heading to the airport.The rate was reasonable compared to other properties downtown. Walking distance to many areas like city hall, ROM, Chinatown, Kensington market within 20 to 30 min.",
      "rate": 4.0,
      "tripDate": " March 2022"
    },
    {
      "title": "Great location and staff!",
      "text": "We stayed for one night in December to celebrate my friend’s birthday with a staycation in Toronto for the weekend and it was the perfect spot. It was convenient and easy to get to the Eaton Centre for shopping as well as great location for restaurants.Goran was great at checkin making us feel welcomed, wishing my friend a happy birthday and explaining all the amenities. He was working when we checked out and offered us bottled water as we were checking out which came in handy. Thank you again for your warm, welcoming service! The parking was easy to use and had in and out privileges.I’m platinum status and was given a great room overlooking Nathan Philips square and we enjoyed the club lounge for coffee and snacks. In the morning we had the breakfast buffet  in the restaurant and took them back to the lounge to enjoy which makes sense. There was a good selection and Edith’s omelette were the best! The hotel  provided a birthday dessert upon arrival which was thoroughly enjoyed and a nice touch.",
      "rate": 5.0,
      "tripDate": " December 2023"
    },
    {
      "title": "Almost perfect",
      "text": "The hotel was clean, friendly and inviting. My only negative is…..if I’m paying almost $500 for one room for one night, I would expect the beds to have actual sheets on them….not just flat sheets layered on top of the bed and draped on top and below the duvet. Looked like I was sleeping on a bare mattress, which halfway through the night I was because all the bedding had slipped and slid everywhere. Not comfortable at all, and very unappealing to be sleeping on a bare mattress and an uncovered duvet.",
      "rate": 4.0,
      "tripDate": " May 2024"
    },
    {
      "title": "Total Disappointment ",
      "text": "As a frequent guest of Marriott, I expected professional services. However, it was run as a 3 star motel. Although paid in advance for my entire stay, they kept charging my credit card on daily basis until I protested. The heater in the room can barely function in an average temperature of-7C. By the 4th night, the bathroom was out of hot water. There were no bathrobes or slippers in the room. Toiletries are not sufficiently supplied. This hotel has ruined the image l used to have about Marriott.",
      "rate": 1.0,
      "tripDate": " January 2022"
    },
    {
      "title": "beautiful hotel; shame about their room service",
      "text": "This is our first trip back to this hotel in almost three years. It had been one of our favourites. It still is a beautiful hotel and our room was clean and spacious. The concierge lounge staff was attentive. We had lunch at the Trios Bistro and it was lovely and breakfast there was wonderful as usual. We were so pleased to see that Abdoul was still at the Bistro and he provided his customary excellent service and superb lattes. We had planned a romantic evening at the hotel and we had ordered room service: two plates of lobster pasta and a couple of drinks. We had pre-ordered it to arrive at 18:00. We were surprised by a knock at our door at 17:50 and even more surprised to be handed a paper bag with our pasta and a can of coconut water that we had not ordered and neither of the drinks  that we had ordered. We called the desk and a pleasant attendant said she would deal with this but our drinks did not arrive for half an hour. We ate the pasta off paper plates with wooden utensils. I should add that the pasta was no longer hot, barely warm. Not the romantic room service meal we had expected.",
      "rate": 4.0,
      "tripDate": " January 2023"
    },
    {
      "title": "An Outstanding Hotel",
      "text": "Earlier in November 2022 I spent four nights at the Marriott Downtown at CF Toronto Eaton Centre.  This was an enjoyable stay.  The hotel property is located within easy walking distance of a number of excellent restaurants, shopping stores, museums, and historic sites.  My room with a king-size bed was large and well maintained.  What really struck me about this hotel was the quality of the staff - all were friendly, helpful, accommodating, and professional.  On several occasions they went out of their way to make something happen for me.  I would certainly return to this hotel the next time I visit Toronto.",
      "rate": 5.0,
      "tripDate": " November 2022"
    },
    {
      "title": "Big comfy room, great location, amazing views!",
      "text": "I was upgraded to an enormous corner room when spectacular views of the Toronto skyline.  My contactless check-in worked seamlessly except the mobile app sometimes took two tries in the elevator.  The staff was outstanding and the property is gorgeous!  My only complaint which is standard to Marriotts is the paper cups in the room feel cheap.  I'd be so much happier with glass.  Other than that, I only have good things to say!",
      "rate": 5.0,
      "tripDate": " October 2021"
    },
    {
      "title": "Great Customer Service, Great Location, Perfect Stay",
      "text": "The customer service from check in to check out is top notch.  The staff work hard to make your stay safe and comfortable.  Covid 19 protocols are in effect and we felt safe.  You have to show vaccination status for the pool and fitness centre for example.  The pool is shallow at 1.2 m and perfect for kids!  There is also a restaurant in the hotel and the Eaton Centre is right beside the hotel, which is great to get your shopping on!  The Dundas subway line is also a few steps away.The general manager Jonathan Holiwell is an incredible human being who takes care of guests.  It was our child's birthday and the gesture of sending cake to our room for the occasion added a special touch of joy to our already happy stay.  Conor at the front desk is also very kind and patient.  Thank you Jonathan and team for all of your effort in keeping your guests safe, comfortable, and happy!You will NOT be disappointed staying here.  Enjoy!",
      "rate": 5.0,
      "tripDate": " November 2021"
    },
    {
      "title": "Excellent Toronto Vacation",
      "text": "From initial reservation to final checkout the Downtown Marriott at Eaton Centre provided excellent service.  We had a complicated reservation which was confirmed by email prior to our stay by Thomas Jurik.   Then, several days before our arrival we received a warm welcoming email from Heather Guay, Director of Operations.  We were upgraded upon arrival and our suite was perfect.The furnishings were immaculate and housekeeping was excellent.The Concierge Lounge provided a full breakfast and was open 24/7 for beverages and snacks.Most impressive however was the entire staff.  Friendly, helpful, warm and welcoming.",
      "rate": 5.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Excellent hotel in an excellent location",
      "text": "I stayed at the Marriott Downtown Eaton Centre for four nights in May 2022.  The location is excellent near Eaton Centre, Trinity Square and New City Hall.  There is a garage for self-parking your car with an elevator that goes up to the lobby.  The check-in process was smooth and the front desk and other staff were very helpful.  My room was on the 14th floor and it was very comfortable with a nice bed, good A/C and a decent bathroom and shower.  I had access to the Elite Members Lounge and was able to eat a light breakfast there and an evening snack.  The staff in the Elite Members Lounge were very friendly.",
      "rate": 5.0,
      "tripDate": " May 2022"
    },
    {
      "title": "Poor quality stay",
      "text": "Have been staying at the property since last week but in spite of repeated requests, linen and towels have not been changed. made a special request this morning but when we returned this evening, not only had the linen and towels not been changed, the toilet had also not been cleaned. One pays excessive room rates to ensure comfortable stay but what one gets is lousy service.",
      "rate": 1.0,
      "tripDate": " November 2022"
    },
    {
      "title": "Quality of this Marriott not what it used to be",
      "text": "I used to stay at this Marriott every November for about 6 years in a row with my two best friends for a weekend getaway. Haven't been here in a few years but am sad with the quality of the rooms and quality of the food. The staff are still friendly and still have excellent customer service. However, my King room was just average. The little perks in the room were not good. The mini fridge froze my drinks. The coffee was terrible. The furniture was banged up and old. The bed and pillows were not as comfortable as they used to be known for. The heating and fan system didn't work properly as it wouldn't regulate the temperature. It was so hot  I actually had to have the air conditioning on all night. They upgraded the bathroom and the shower was lovely. The doors to the room are extremely loud now when they shut. Hearing all the slamming doors on the floor was annoying and kept me awake. Sadly due to covid there was no breakfast buffet but my breakfast was cold. They got my order wrong then brought the new one and it was cold. All of these things I mention may sound trivial but when  you pay for a Marriott you expect better quality. This hotel is now on par with the Holiday Inn Express . Yes it is in a convenient location in downtown Toronto but I would try another hotel sadly.",
      "rate": 3.0,
      "tripDate": " November 2021"
    },
    {
      "title": "Fabulous Location",
      "text": "A good choice for families. The location was so convenient to walk to theatre, the movies, many restaurants, museums and great shopping. I loved that there is a back door so you can walk through a nice quiet courtyard to the Eaton Centre instead of braving the congested sidewalk. We used the top floor pool and hot tub every day. The Club Lounge was great. As it is adjacent to the restaurant it was great to use the breakfast buffet there and take it back to the lounge. Makes so much more sense than doing two separate spreads. The lounge was nicely set out too with some quieter spaces towards the back. Our room was comfortable and housekeeping was very prompt each day. Would stay here again.",
      "rate": 5.0,
      "tripDate": " August 2023"
    },
    {
      "title": "My Home away from Home",
      "text": "I recently stayed at the Marriott Downtown Toronto for almost 7 weeks. As you can imagine, the needs of a long term guest are more and different than the short term stays. I am grateful to Ms Heather Guay for helping me every step of the way - from anticipating the room requirements, adding additional things which are required on day to day basis, and being available throughout my stay to help in any other possible way.This proactive approach and customer focus was apparent throughout my stay with the attentiveness and professionalism of the Marriott team but I want to specifically acknowledge Nicholas and Constance for their excellent help. I would go to them with many requests but would always be sure that they will be handled the right way and in a professional manner. Thank you to the Marriott team, and specifically to Heather, Nicholas and Constance, for making me feel at home and making my stay comfortable and memorable.",
      "rate": 5.0,
      "tripDate": " July 2020"
    },
    {
      "title": "Establishment nice; extremely negative situation and zero resolution",
      "text": "First of all, we are Marriott Junkies, Marriott Elite members, as well as Marriott Vacation Club Members, and Marriott Visa Card holders.  It has been our ‘go to’ standard for national and international travels.  Situation: I was booked for major surgery at a Toronto downtown hospital, which is why we booked this location - walking distance from the hospital so that my husband could be close by, for a 2 night stay. While the operation was major, they only keep you one night post operatively.  We live 3 hours away from Toronto; booked for the night before surgery plus night of surgical date for hubby to be close.  Day of surgery:  we are told I will now be a ‘day surgery’ and no overnight hospital stay; my husband subsequently cancelled the 2nd evening accordingly. Post operatively, unexpected complications and I was admitted to what become a 2 1/2 week hospitalization/recovery situation.  Hubby rebooked the 2nd night again in order to be close by before needing to travel home.  The original billing for 2 nights/cash plus small points redemption:  $268.93New billing, for ONE night only:  $511.21 which was NOT explained properly to my unsuspecting spouse.  Had he been aware, he definitely would not have booked here at that cost.  I have contacted the hotel directly (emails, phone calls to management) to ask for any form of consideration in terms of the amounts charged, given this very unexpected and unplanned situation.  A credit to offset the exorbitant one day charge, revert to the original costs, anything.  In response, I get an answer discussing supply and demand, pricing structures, etc. and that nothing at all can be done.  Are you kidding me?  I work in business and understand technology; that is a lame excuse for zero customer relations.  Credits/pricing refunds/offsets can easily be posted to the c/c on file.  This establishment offered what is essentially a ‘zero satisfaction’ resolution.  We will be revisiting all our Marriott connections; it’s beginning to look like a ‘Good by Marriott, hello Hilton’ situation.  And I almost NEVER write negative reviews, preferring to work things out with the establishment directly.  Tried that, zero resolution in our opinion.",
      "rate": 1.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Marriott CF Toronto centre",
      "text": "Location is excellent for shopping and security is good. Guests will have to tap in for entry to the hotel to ensure safety of hotel guests.  Hotel front desk is not so friendly when we want to confirm whether the wifi is free for Marriott bonvoy members when there is a prompt showing it’s payable? The staff show irritation when we ask questions.  Housekeeping is not so thorough and food choice is minimum.",
      "rate": 5.0,
      "tripDate": " December 2022"
    },
    {
      "title": "Great hotel with modern rooms and bathrooms",
      "text": "Excellent hotel and excellent value.  Clean modern rooms.  Modern bathroom with tiles that weren’t from 1980. Bathroom also had lots of countertop space to spread out on (unlike other hotels in this price range).  Definitely would stay here again.",
      "rate": 4.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Great Lounge, Great Staff!",
      "text": "One of my favorite locations in Toronto.  Love the location and the property.  Sometimes the price is a bit out of reach, but I have stayed here probably a dozen times and generally feel like it is a decent value.",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Great hotel in a great location in a great city",
      "text": "We loved our stay here! Our room was clean and spacious. The bed was comfortable and I loved the big, modern shower (it had a shower head and a wand). Bonus points that the shower had the shampoo, conditioner, and body wash in pumps attached to the wall, which means less little one time use bottles to waste.  Every staff person we encountered was very friendly and attentive.  The location is perfect.  We were right across the street from Nathan Phillips Square and we loved that the hotel was right next to a big mall. This made it really easy to get our Tim Horton's fix at the food court in the mornings.  There were also plenty of restaurants in the vicinity.   Walking to the heart of downtown Toronto was very straightforward and convenient from this hotel.  We were here for an event at the Scotiabank Arena and didn't mind the 15 - 20 minute walk there.  Even walking to The Rec Room and CN Tower (about 30 minutes) was doable. We used the pool and hot tub and thought it was a nice facility.  I especially loved the  little outdoor patio adjacent to the pool to catch some sun.  It was a really private area and I loved the view of being surrounded by tall buildings.  While I didn't use the gym, I took a peek inside and would highly recommend it if you're a fitness buff.  It had the feel of a posh private gym.  The equipment looked really modern, there were inspirational sayings on the walls, and the view from the treadmill was nice. (just like the pool patio, it had great city views).We ate at the Trios restaurant the night we got in.  We received attentive service and the food was fresh and of good quality.  In fact we enjoyed the food offerings so much at Trios that we went back for a second time during our stay.  Get the wedge salad, it's one of the best I've ever had. We also loved their unique drinks from the bar.Overall, I highly recommend this hotel.  If we're ever back in Toronto we will be staying here again.",
      "rate": 5.0,
      "tripDate": " June 2023"
    },
    {
      "title": "Excellent Location comfy beds",
      "text": "Excellent location, lots of food nearby, everything is walking distance or a short drive away. During check in there was a cute bike cart of cold drinks. So sweet! The beds were extremely comfortable and the washroom shampoo/conditioner/body wash was so good and big bottles (I have a lot of hair)! I believe the guy at the front helping you find places to tour or eat was Ralph. He was energetic, friendly and helpful. I would highly recommend staying at the hotel!",
      "rate": 5.0,
      "tripDate": " September 2022"
    }
  ]
}