{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Massey College Summer Rentals",
    "url": "/Hotel_Review-g155019-d224558-Reviews-Massey_College_Summer_Rentals-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.0",
      "reviewCount": 17
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "4 Devonshire Pl",
      "addressLocality": "Toronto",
      "postalCode": "M5S 2E1",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/06/22/5e/4d/massey-college-student.jpg?w=500&h=-1&s=1"
  },
  "description": "Whether you're in Toronto for a few days or a few months, Massey College is an ideal place to stay from May 1 to August 27. Designed by celebrated architect Ron Thom and nestled in the heart of the University of Toronto, the College is just steps away from public transit as well as some of the city's top restaurants, shopping districts, and museums. During the summer we also open our doors to non-affiliated guests and travellers from around the world. As part of the Massey summer community you will have access to many of our facilities, including: Ondaatje Hall, the Robertson Davies Library, the Upper Library, the Common Room, and our beautiful treed quadrangle. Residents' rooms are located in five houses that make up three sides of a quadrangle. The fourth side contains the Master's Lodging and Office, the Robertson Davies Library, the Upper Library, Ondaatje Hall, the Private Dining Room, and the Common Room. Standard Rooms consist of a bedroom and an adjacent private study. A private bathroom, accessible from the hallway, is shared with one or two other standard rooms. The majority of rooms at Massey College are standard rooms. Senior Suites are limited in number and consist of a bedroom, a private study with a fireplace, and a private bathroom adjoined to the bedroom. All rooms have basic furnishings (including a twin bed, linens, a large built-in desk, coffee table, work chair and reclining chair) and are serviced by the housekeeping staff. A complimentary breakfast in Ondaatje Hall is also provided each morning during your stay. Twin occupancy rooms are furnished with 2 twin beds, 1 in the study and 1 in the bedroom. All summer residents have access to a communal kitchen, a laundry room, recreation room, and private carrels for study, all of which are located on the lower level of the College.",
  "featues": [
    "Free High Speed Internet (WiFi)",
    "Wifi",
    "Free breakfast",
    "Restaurant",
    "Suites"
  ],
  "reviews": [
    {
      "title": "Best Bet",
      "text": "Larger rooms than most hotels! Easy access to subway. Beautiful courtyard. For this price, there is not a safer or cleaner place to stay!",
      "rate": 5.0,
      "tripDate": null
    },
    {
      "title": "Idyllic",
      "text": "An oasis of beauty and care , with just the restful qualities which enhance one's visit to a dynamic town, just beyond its gates in the heart of midtown. In every way , from thoughtful staff to delightful food and a quiet quadrangle with lily pond ,fountains ,and benches for contemplation under magnificent towering trees amidst carefully nurtured flowers, this was outstanding! Privacy with geniality made my stay an idyll midst a busy life. Buchanan",
      "rate": 5.0,
      "tripDate": null
    },
    {
      "title": "No frills, great location",
      "text": "I've stayed at Massey College Summer Residence/Dorm probably 6-7 times over that last decade. I love the central location. It's quiet if that's what you're looking for, but if you want more of a community/social scene you might want to consider one of the neighboring dorms/summer residences. While there tend to be a good number of people that stay here in the summer, there are no community social events or gatherings. You hardly ever hear people -occasionally when people enter/exit. From what I've seen, not a lot of young travelers stay here so that helps with the serene nature of the place (along with the koi pond).There are plenty of places to read and study if that's what you're looking for. They have ethernet and (finally) Wifi here now. It used to be an extra charge, but I'm not sure if it is now - I never look because I know I'm going to want internet regardless.Cons - no A/C or heat. You can ask for a fan before arrival (if it's not crowded you should be able to get one). I'm sure you can ask for an extra blanket if you need 1, but I didn't.  There are no elevators (3 levels of rooms). So if you're  a heavy packer like me, ask for a lower floor.If you're a picky eater, then plan on doing your meals elsewhere. Breakfast is included but it was minimal. Lunch costs an extra $13-$14CDN. There's plenty to eat on Bloor or food trucks down St. George. There's also food on Spadina.If you're coming in the next couple weeks, there might still be street closures immediately around Massey (I wasn't informed of that and had to walk an extra couple blocks with my suitcase because the taxi didn't want to take a chance on dropping me off closer/at the corner of Devonshire and Hoskin/Harbord.",
      "rate": 4.0,
      "tripDate": " August 2015"
    },
    {
      "title": "No bargain",
      "text": "Because I was attending a week-long conference at the U of T, this was a convenient location only a short walk to Hart House on campus. Access to the two TTC subway lines and buses was close by, as were various shops, restaurants, and museums (including the ROM).However, other than the convenience, there were few positives, especially considering the price. The single beds in our double room were ancient and exceptionally uncomfortable. The bathroom had a cracked toilet lid, and the toilet paper was single ply and rough. Blinds were missing on one of the windows  The complimentary continental breakfast was inconsistent in its offerings: on some days, they had boiled eggs; and on other days home-made yogurt.There was no housekeeping service provided during the entire seven-day stay. Storage space was very limited. The room's usual resident left personal items in the dresser drawers and numerous boxes in the closet.The atmosphere is aloof and intellectually hostile. The College's fellows (or members), some of whom remain in residence during the summer, can be heard engaging in political or philosophical discussions in the common areas. This may be offensive and demeaning to guests who do not share this elitist, 'progressive' ideology.",
      "rate": 1.0,
      "tripDate": " June 2013"
    },
    {
      "title": "Great hideaway in the heart of the city",
      "text": "I stayed here from July 1-11, 2010. Although there was a lot going on at the time of our arrival in Toronto (Pride Week, end of G20, canada day, jazz fest), this location offered a quiet haven in the U of T/Bloor Yorkville area.  It's close to the Museum and St. George stops (on the 2 different train lines that run through the city center) and has a library, common areas, kitchen, tv lounge areas for common use. There are 2 bathrooms (with toilet, sink and shower) per floor to be shared by 3 suites around it.There is 1 stand alone shower in between the 2 floor bathrooms. Linens are provided. Mid-week cleaning typically occurs. There is a lovely courtyard with 2 koi ponds to sit by. The college itself is quiet and offers ample space to study, relax or to do whatever you wish and its surrounded by other college buildings for the St. George Campus of University of toronto.IN summer continental breakfast is served, but is minimal...although during weekdays there seemed to be more options that hard toast, fruit and cereal. I didn't try dinner. no lunch was served in summer, but Bloor STreet West has restaurants as does St. George (cafes, U of T eateries, street vendor trucks). Handicapped (large, more modern) restrooms are in the basement near computers, library and copier. They do offer a student rate and Chris and Ankita (summer staff) are wonderful. My only suggestions for improvement are:- it's a dorm so that means if it's 30 degrees celsius you are going to need a fan in your room to avoid heat stroke! by our 4th or 5th day here a shipment of fans came which helped, but going back and forth to the common areas for a/c was a better option- the bathrooms could use some painting, tub needs re-surfacing or replacing- rooms should be swept and mopped before arrival of summer residents -as we won't be coming with a full stock of cleaning supplies for short staystips:- it's a dorm so that means no elevators- keep up with your keys because you need the key to get out of the gate and to get back into the gate- lower level & basement library and common areas are chilly so bring a light jacket, sweater or blanket down with you- there's only 1 fridge for common use so shop wisely...blank labels are there for your use though along with some common utensils and appliances",
      "rate": 4.0,
      "tripDate": " July 2010"
    },
    {
      "title": "Excellent Value; Comfortable Setting right Downtown",
      "text": "I have stayed in a single room (shared bathroom) and a \"senior\" room (private bathroom).  Both instances were comfortable. The residence is clean, comfortable, quiet and very centrally located.  Constructed by Ron Thom in 1962, I am a fan of the architectural style and design details.  As well, the inner courtyard, on a warm summer day or evening, is a lovely, restful oasis.  Bottom line, while there may not be all the creature comforts of a hotel, it is a great, economical option and they now have WiFi in all the rooms too.",
      "rate": 5.0,
      "tripDate": " June 2015"
    },
    {
      "title": "Economical and good location, but do not expect the usual hotel conforts",
      "text": "This was a low cost stay in the middle of a major City. Apartments are available when grad students are away. Location was very good, as it was close to Bloor street and within 10-15 minute walking distance to Yonge street. Lots to do and see on Bloor. Even though the living room was very spacious, the bedroom was very small. The full size bed made for a somewhat uncomfortable sleep for my wife and I. It did not help that it was very hot and very humid, and the apartment did not have an A/C. Of course the weather is nobody's fault. We requested a fan and it was provided the following day. Luckily, the weather cooled down. A small fridge was available. the area seemed to be very safe. Our apartment was on the 2nd floor, so be prepared to walk up the stairs with luggage. The students do it. The price included breakfast which was very good. I felt like i was eating at Hogwarts",
      "rate": 4.0,
      "tripDate": " July 2014"
    },
    {
      "title": "Bed bugs beware!",
      "text": "Affordable and beautiful place. However, crumbling washrooms with peeling paint and cracked tiles on the floor left much to be desired. The worst thing was not being notified that one of the rooms on the floor I was staying in had recently experienced a bed bug problem.",
      "rate": 2.0,
      "tripDate": " May 2012"
    },
    {
      "title": "Comfortable long term stay",
      "text": "I stayed at Massey for nearly 3 months as a newcomer to the city. It's a good base to plan and get on your feet if you're relocating.Nothing fancy about it and the rooms do get quite dusty but you get fresh linen once a week, free breakfast in the morning and friendly porters who are a great guide to the surrounding area.My only complaint is that some of the fellows of the university are quite abrupt towards summer guests. Perhaps they have had issues in the past but it can be quite disheartening.However, the grounds are well kempt, the rooms and libraries are worth a wonder around late at night and (one of the big bonuses) the internet is pretty fast! Definitely a bargain!",
      "rate": 4.0,
      "tripDate": " June 2015"
    },
    {
      "title": "What a great location and bargain!",
      "text": "I'm surprised there are any negative reviews... I've stayed here twice and loved it both times. It is very safe (it is gated) and in a great location- it is right on the U of T campus, near a few museums, and is close (5 minute walking distance) to two subway stations! The rooms are very simple but at the same time they have what you need. The rooms I stayed in were VERY clean as well and so were the restrooms. It is a chill place- a nice quiet niche in the middle of a huge city like Toronto- the atmosphere is just calm and relaxed.- it even has a nice courtyard with a fountain. There is a lounge to hang out in with a large TV (with a DVD player), board games to play, and various newspapers. And there's breakfast included! The breakfast is kind of bare bones but it does the job. It's not a five-star hotel but it's such a bargain and has a great, calm ambiance!",
      "rate": 5.0,
      "tripDate": " June 2015"
    },
    {
      "title": "Wicked Bargain for Downtown Toronto",
      "text": "Stayed here for much of the summer. This is a really unique place in the middle of Toronto, close to subways, food, entertainment and the like. I've stayed here before and was pleasantly surprised to see all of the old bathrooms completely modernized, which was a real perk. The staff are extremely nice, and if you're here for a while you get to know them, making the whole travel and hotel experience much less mechanical and temporary. One issue is the lack of AC and lack of elevators. Make sure that if you have a back or leg problem to notify the staff before making the booking. The college has fans that it loans out to people so if you're feeling especially hot, ask for one. Still, the price is unbeatable, seeing as you receive a proper breakfast (it's not just continental) and you get a central location in some of Toronto's best shopping and entertainment districts (not to mention the beautiful architectural and historical gem that is the University of Toronto). Prices at nearby hotels are astronomical in comparison. On top of all of this, the college has a kitchen, onsite laundry, and a private quad with a set of beautiful fountains. Not to mention, a Foosball table, darts room, and ping pong table.",
      "rate": 4.0,
      "tripDate": " May 2013"
    },
    {
      "title": "Toronto",
      "text": "A great town with a wide range of shops, restaurants, hotels, museums and other tourist attractions.I would personally recommend the hop on hop off bus tour of downtown.  A 2 day valid bus ticket allows you to board and hop off at any of the stops along the route.  The bus tour itself lasts for approximnately an hour and a half (the complete loop) taking in all the major attractions of downtown including Casa Loma, the CN Tower and the Royal Ontario Museum.I stayed at Massey College, University of Toronto during my weeks' stay in Toronto.  As it was in August there is a summer rentals programme where you can hire a single or double room for the duration of your stay.  Much cheaper than many of the hotels and B&Bs. Massey, being central is very close to the downtown atttractions,  particularly the Royal Ontario Museum.A day trip to Niagara Falls is definately recommended, particularly if you are staying in Toronto.  The Niagara Freedom Tour which costs approximately £64 includes after stopping for lunch a ride on the Maid of the Mist Boat which takes you right up close to the falls- prepare to get wet.  Ponchos are provided and the wine tasting at Niagara Village.  A helicopter trip, not included in the freedom tour is also extremely popular.  The tour is on a Greyhound bus (operated by Gray Line) leaves around 10am from the bus station at the intersection of Bay Street and Dundas Street and returns around 7.30 pm.",
      "rate": 5.0,
      "tripDate": null
    },
    {
      "title": "Great venue, great price  in centre of Toronto",
      "text": "Had a great stay at the Residence on recent visit . The grounds are calming oasis  on centrally located University of Toronto campus  .The local is conveniently located for key sites in Toronto - that is,  to downtown , art galleries , music and sport venues  For the price - can do better love it",
      "rate": 5.0,
      "tripDate": " June 2019"
    },
    {
      "title": "A Victorian Dump",
      "text": "Elegant in appearance, run down, not clean, and seedy understates it.If you like Victorian relics, and do not mind what many would call a dump, go for it.Sadly, the personnel in the College show their resentment continually.Avoid!",
      "rate": 1.0,
      "tripDate": " October 2017"
    },
    {
      "title": "Great budget accommodation!",
      "text": "We're and older couple and spent 6 days in Toronto the end of May/2016. Rooms are a bit shabby but clean. We just requested a basic room with 2 beds.( They put an extra bed in the room). However there are suites also. We shared  a bathroom but that was no problem. Breakfast was lovely and there is a common reading room where there are daily newspapers.The place is about a 5 minute walk to the subway and close to the Royal Ontario Museum, legislative buildings and central Toronto. Cost was about $93,night for the two of us. The only negative is there is no central air conditioning and it was about 32 degrees during the day in Toronto at the time. There was a large fan in the room and it  certainly helped. For independent budget travelers who enjoy a good breakfast we would recommend Massey Summer rentals.",
      "rate": 4.0,
      "tripDate": " May 2016"
    },
    {
      "title": "Renovated, reliable, inexpensive",
      "text": "The bathrooms have been completely redone in the last six months. This is nicer than the usual university residence, the rooms are much larger. Good place for visiting scholar or anyone who wants to be right downtown--very central! You can walk anywhere. Only problem: no air-conditioning in bedroom though they do provide fans. The common rooms and dining room are air conditioned at least. Since most rooms share their bathrooms with one or two other rooms, it's a bit of a game of chance who the other person will be but I could just go further down the hall and use another bathroom or a little shower room if I wanted or needed to and I didn't have a problem. The cleaning staff were very good.  The food here is very good--beyond any cafeteria I'd ever eaten at.",
      "rate": 5.0,
      "tripDate": " March 2013"
    }
  ]
}