{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Mina's Guesthouse",
    "url": "/Hotel_Review-g155019-d3637369-Reviews-Mina_s_Guesthouse-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.0",
      "reviewCount": 50
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "246 Sherbourne St Sherbourne and Dundas",
      "addressLocality": "Toronto",
      "postalCode": "M5A 2S1",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/04/92/6d/c2/mina-s-guesthouse.jpg?w=500&h=-1&s=1"
  },
  "description": "Mina's guesthouse is located in downtown Toronto offering fully furnished rooms and full kitchen. We have two rooms with private bathrooms in downtown location and other rooms every two or three rooms sharing one full bathroom. We have laundry washer and dryer and Iron . close to subway station or bus stop is right at the door step to any directions. Need help just drop a line we will be happy to assist you at any time. We hope to see you soon.",
  "featues": [
    "Free High Speed Internet (WiFi)",
    "Wifi",
    "Non-smoking hotel",
    "Shared kitchen",
    "Private check-in / check-out",
    "Washing machine",
    "Air conditioning",
    "Iron",
    "Kitchenette",
    "Refrigerator",
    "Non-smoking rooms"
  ],
  "reviews": [
    {
      "title": "Best accommodation available in Downtown Toronto at this price.",
      "text": "I stayed in room 203 ( one of their best rooms) from November 1 to November 18 2015. Let me tell you few things that will clear your doubts about this place.Firt of all when i first came across their facility online, i read some of the reviews here and was reluctant towards them. But then i said i will try them myself as their rates are nothing when you compare the location and amenities you will be getting. So i came here on 1 of November and boy was i amazed. Dale, responsible for dealing with the guest is the most friendly and helpful person i have ever met. He offered to help me with my bags and did everything to make me feel at home. Owners and caretakers here are nothing but friendly. Room was exceptionally clean. I had a 32 inch very good quality flat screen, a small fridge and tables and lamps in the room. This room is awesome as the window opens to the balcony and road. Kitchen had all the things you need to make a meal. From dishes to spoons and fork. And i never saw it dirty or messy. Everybody here cleans after themselves. Bathroom was even better than the kitchen. It ALWAYS remained clean. They maybe clean in daily or every other day. So you will never find these two places messy or dirty.Now the neighborhood. I know that there are few homeless around this neighborhood and believe me it concerned me as well before moiving in. But when i moved in i asked a guy living above me about the neighborhood his words were \" I never had any problem or issue with the neighborhood\". He has been living here for four years now. I also noticed that if you keep to yourself when walking outside nobody is going to bother you. They wont even talk to you. And i have seen more police and security then the homeless so its kinda more secure. I never ever reviewed a business before but they deserve to be reviewed as many people are just writing reviews plainly untrue. Moreover, i needed a parking spot for my car ( i rented one for a week) so the onwer, Arya, he offered me free parking in a secured location only 3 houses away. These people are here to make sure you are comfortable and happy. So please show some respect.RegardsQazi",
      "rate": 5.0,
      "tripDate": " November 2015"
    },
    {
      "title": "Good backpacker accomodation near to downtown",
      "text": "We went there on foot from Union Station. Entry was as agreed, we could settle everything. On the reservation site it says you can pay with credit card, but after the booking charge, they expect cash. The photos about the room are not exactly reflecting the truth. Our room 10 was in the basement, which we did not know before. We wanted a double bed, instead of this we got two single beds in two separate small rooms, within the room. It was cold, and despite our reservation we had to share the bathroom. Altogether if you dont want to spend so much time at your accomodation, just for sleeping, it is acceptable. For this price, you will not find anything else for sure. The room was clean, the bathroom was clean, altogether i would say it is above average, im just rating it average because i think, that by the booking we were not properly informed.",
      "rate": 3.0,
      "tripDate": " June 2017"
    },
    {
      "title": "156 Cummer Avenue was the choice I made !",
      "text": "I was in 156 cummer avenue room number 3 for about 2 months. I was very happy with my stay at the north York location. I do recommend it to those who need a place to stay for vacation. There services are great, they provided me with a clean room with, full kitchen, living room, and dining room. I am sure the next time I come back to Toronto I will book my stay at mina's guest house !",
      "rate": 5.0,
      "tripDate": " September 2012"
    },
    {
      "title": "Not Sure What Others Here are Talking about",
      "text": "We just about walked out after walking in and seeing our room. The place is very run down, and at first glance, appears to be the kind of place that might have insects or vermin. After checking a bit more thoroughly we decided to try it for one night and see how it went. Well, the place IS clean and the other guests ARE quiet - with the exception of one pair who had quite a group take over the kitchen one night. There were no bugs or anything such, and seeing as how we had no intention of doing much more than sleeping, we decided to stay. Also decided to forego use of the kitchen because I don't know who says it is clean, but obviously standards differ because I wouldn't call it clean for a personal residence, let alone a paid accommodation although we did see a woman there cleaning at least twice during our week long stay. I think she was in daily, or every second day. We were in a basement room and everytime someone ran water on the street level floor, it sounded like it was running right in the room. Same with footsteps. In fact, sawdust or something fell from the ceiling onto the dresser daily. Very poorly done repairs, evident they are trying to save a buck everywhere they can, such as piecing together trim rather than using one continuous piece. Cover missing on an outlet right at the head of the bed. I'll post a few pics of some of the worse, so you aren't under any delusions like I was when I booked. Kitchen supplies were very tired looking for the most part. Perhaps garage sale items? In spite of all this, if you are looking for a bare bones place to sleep, where you can heat up simple meals, this fits the bill. Beds were comfortable and bedding was clean. Security system was excellent,which is good because the neighbourhood is very colourful and varied; hookers, druggies, also yuppy types and students. Appears to be kitty corner to  church with an outreach program, so it really attracts interesting types.Public transportation is right outside and runs very frequently, close enough to down town to walk, convenience store directly across the street. NOT a place for families or single young women if you will be outside after dark.",
      "rate": 2.0,
      "tripDate": " April 2013"
    },
    {
      "title": "Dodgy location",
      "text": "Walking along the street outside of this place, we saw an actual drug deal, prostitutes, and more homeless people than I have ever seen before, and that was within a 5 minute walk to the closest bike share rack. On one evening, right next door, one lady spent literally the entire evening screaming. Just yelling. At no one in particular, mainly her own inner demons, but just screamed. Seriously. To make matters worse, there was a misunderstanding with our bill. So, the landlord thought it was appropriate for him to enter our locked room (with his master key), when we were not there, rummage through our belongings, and proceed to take my iPad as \"hostage\" until our bill was resolved. Seriously, he thought this was appropriate. No note, no email, no information on what he thought was owing, just come on in and take what you like. Wow. And once resolved, totally unapologetic. In fact, he said we were lucky he didn't just throw our stuff out on to the road for all the homeless people to take. Again, this was with no prior warning! It's cheap, the room is ok, but if I were to return, you couldn't pay me to stay there! Do yourselves a favour, stay somewhere else where there aren't the serious drug problems and a landlord that believes it's ok to invade privacy and hold your items for ransom!",
      "rate": 1.0,
      "tripDate": " October 2014"
    },
    {
      "title": "Bedbugs, worst experience of my life",
      "text": "This was the worst stay of my life.  In November 2012 I had booked several nights here.  After four days I finally realized what the strange rash was that I kept getting, my first encounter with bed bugs.  They were everywhere in the mattress.What was even worse was the landlord's reaction.  He accused me of having brought them, told me he would not reimburse me for what I had paid up front, and so on.  He didn't sound surprised, so I assume he has had this problem several times.  He also would only do something the next day, since he didn't want to drive in all the way.So I was forced to move out.  I later received a partial refund, the landlord talking about me having damaged the TV, which I didn't even turn on once.  I contact the Ontario Landlord and Tenant board, but it did not fall in their responsibility because of the short term rental nature.I had to clean my laundry several times, keep everything quarantined in plastic bags.  I did manage to not spread the pest, this is the only thing good about the whole stay.I can safely say this was, by far, the most unpleasant experience I have ever had.(In case you do not care about bed bugs, here is something that did not bother me but might bother others, in particular women: the house is in a very sketchy area, with a homeless shelter right across the street.)",
      "rate": 1.0,
      "tripDate": " November 2012"
    },
    {
      "title": "DIRTY, DUST, STICKY FURNITURE, DIRTY CARPETS AND WALLS, MOLD, CHARACTERISTIC ODOUR",
      "text": "•\tA fridge in the room•\tHelpful manager - Alex•\tClose to the supermarket•\tManager's holy principle “Mina's Guest house is located in the center of the expensive city, the rooms are cheap so don't complain! •\tNo use of the kitchen, no shower or walking around the house after 11 p.m. Unfortunately, the old house and everything is being heard! Someone is bathing and you feel like you are in the bathroom.•\tThe kitchen is equipped but many tools are suitable for rubbish! •\tA lot of dust! The cleaner cleans the carpet with a sweeper and not with a vacuum cleaner. •\tThe furniture is old, terribly dirty and sticky from old fat. •\tRoom/room hall (Terribly dirty, stained carpets, holes in walls, very poorly fitted parts. full stopgap, field beds, the cheapest spring mattress and the Mattress/springs was damaged). •\tNo air conditioning. When it is cold, you heat the heater and when it is too hot, you cool the room by opening the window. Ventilation outlets are sealed. The description of the offer includes air-conditioning.•\tThe customer pays the same price for the room/books every day. At the place he is informed that the towel is one for the whole time of stay (independent of the time of residence). The manager points to the laundry and drying company on the other side of the street! •\tVentilation grille and patio terribly dirty •\tMina's Guest House is cleaned every day, but probably only by customers. Examples: Room dustbin is not cleaned during the stay, occasional bathroom replacements, dirty toilet. The liquid suggested by the manager is used for cleaning and not for disinfecting the toilet. A fungus on the walls of the bathroom and in the corner of the bathtub (it's not cement as Alex says). •\tSurrounding area (Plenty of redheads and beggars. Apparently not dangerous, but once I got a bottle, because I didn't give the cash, another time a woman wanted to come to my patio for a cigarette).•\tWhen you return home everything will smell like the Mina Guest house. •\tThe description of the hotel should include notes about: 10% charge for card payment, towel replacement and night time silence",
      "rate": 2.0,
      "tripDate": " June 2018"
    },
    {
      "title": "Clean room dirty neighbourhood ",
      "text": "Pros: Room was cleanCheapCentralCons: the neighbour hood wasnt safe. We come back from sightseeing at midnight in a taxi and one of the guys started banging on the taxi window telling us to get out. We also heard people openly talking about needing heroine to \"shoot up\". Felt intimidated by the gangs across the road and also only one block away from homeless shelter where there were quite a few shady people.We didnt feel safe on our trip which is a shame, if the guesthouse was in a different location it would have been perfect. The room was clean, unfortunately we were in the basement so there was no window and the room was small but it was fine.",
      "rate": 3.0,
      "tripDate": " June 2016"
    },
    {
      "title": "A guide for the first time traveler",
      "text": "Here is what you need to know about this placePros:1) Location: Amazing location at the heart of Toronto. 5 min walk to Dundas square and Eaton center. TTC at doorstep. Loblaws and No Frills within 15 min walking distance. All kinds of good places to eat out within minutes walk2) Owner: Amazing guy. Very helpful and friendly. Easily reachable and resolves problems immediately. For instance: lost my keys and he replaced them within an hour notice. 3) Low price: No need to say moreCons:1) Location: Many homeless people wandering the street at night. There are multiple shelters within couple of minute walk. However, I have to say that they did not cause me any problem at all during my stay. But you might want to be careful if you are staying out late at night2) Rooms: Choose them carefully. Some rooms, like mine, were facing the adjacent house's wall, so I did not get any sunlight at all. Basically, all lights have to be on, otherwise it is very dark even in a sunny day. If this is a concern to you, try getting one of the rooms at the front of the house or at the back.3) Kitchen: Overall had everything that you would need to cook/eat. However, some other people don't clean up/wash dishes well once used. You might want to consider bringing some basic personal utensils for personal use. Overall experience: I have to say it was a very pleasant one. Because of the house's location, combined with the low price and the very friendly and resourceful owner, I have to say that I recommend this place.",
      "rate": 4.0,
      "tripDate": " May 2014"
    },
    {
      "title": "Mina's Guest House - A convenient location",
      "text": "Me and my daughter stayed for almost a month at Mina guest house and we found it very good. Street car and bus at door step. It is very near to Dundas square downtown almost 2-3 minutes through street car and 8-10 minutes by walk. Shops and Restaurant's near by. It's a clean tidy place with a wonderful kitchen. free net access and Rogers cable. Staff is very helpful and friendly. Thanks to dale, jasmine and edwin for providing us such a wonderful time which we fully enjoyed through our vacation. We found it a confortable and safe guest house.",
      "rate": 5.0,
      "tripDate": " April 2014"
    },
    {
      "title": "Clean, Quaint and Convenient",
      "text": "I have just returned from Toronto and stayed in Mina's Guesthouse for almost two weeks. I was very pleased with the service, the cleanliness and quaint Victorian architecture. The pricing is very competitive which certainly is important when trying to stretch your travel dollars. The most exciting aspect for me is the convenient location of Mina's.. the bus literally drops you off at the front door and Mina's is so close to everything that IS Toronto!",
      "rate": 4.0,
      "tripDate": " January 2014"
    },
    {
      "title": "Security where it's needed.",
      "text": "Would have rated \"Good\" if that had been an option as \"Very Good\" seems too much but \"Average\" too little. The room was a very warm (which was both pleasant and unpleasant depending on outside temperatures), but the bathroom very cold and the shower turned to ice if you flushed the toilet.The building itself is very secure but the neighbourhood seems quite shady to the point where we were glad to have so many locks. The people we met were friendly, helpful and a pleasure to talk to however so, overall, we were quite happy with the experience!Rated \"Terrible\" for Swimming Pool and Fitness Centre as we never saw them!",
      "rate": 4.0,
      "tripDate": " January 2014"
    },
    {
      "title": "a cosy environment",
      "text": "I stayed in mina guesthouse for 35 days( 1 week in room 3 and 1 month in room 2). It was very comfortable and very clean, not only the rooms, but also the kitchen and laundry room. Also at the house I really felt I was at home. Everything is near the house, such as supermarkets, grocerystores, Metro station( just a 10 minute walk), shoping centers and a park( just a 5 minute walk). The kitchen was very clean and a maid cleaned the house 2 times per week. Overall, it was very friendly and perfect. The most important point was the safety of the rooms and the house. I strongly recommend it for staying in Toronto downtown.",
      "rate": 5.0,
      "tripDate": " November 2013"
    },
    {
      "title": "Very comfortable and wonderfully nice people",
      "text": "At first glance, I was really disappointed, because the building is somehow old. Now after 10 days stay, I can say I really enjoyed it. The weather became -10 c and our room (Room 3) was large and a big wall and two windows facing the street. The heating system couldn't warm this room, however other rooms were so warm. Finally I gave up and decided to wear some layers to keep myself warm at night, but the service guy didn't give up and brought us an extra heater. He is so kind and whatever happens he would be at your door the minute you call him. I can assure you that you will feel extremely comfortable here. Also it has a full equipped kitchen, we enjoyed cooking as well. I highly recommend this place if you enjoy a calm, clean place, with wonderfully kind service.",
      "rate": 5.0,
      "tripDate": " December 2013"
    },
    {
      "title": "Not a bad place to stay for those who like to stay thrifty",
      "text": "I stayed here for two weeks and have to say I had a very enjoyable stay. The Ritz it is not but for the money I had to pay versus the proximity to the centre of downtown it was great. The area is a bit \"special\" but as long as you are sensible and safe nobody annoys you. The house is very secure and it is so quiet. I'd stay here again in a second.",
      "rate": 4.0,
      "tripDate": " August 2013"
    },
    {
      "title": "I am satisfied",
      "text": "Everything was fine and very nice environment with other guest staying in the guest house. I like the nice kitchen and the park close to the guest house, nice place for jogging :-)Everything was fine and very nice environment with other guest staying in the guest house. I like the nice kitchen and the park close to the guest house, nice place for jogging :-)",
      "rate": 3.0,
      "tripDate": " July 2013"
    },
    {
      "title": "Clean, comfortable, close to downtown; great owner",
      "text": "Stayed at Mina's for 2 weeks; would stay there again; good value for money; happy to recommend it. Fully equipped kitchen. About a 10 minute walk to the subway, but you can grab a streetcar from corner 30m from front door. Small store across the street. Very convenient.",
      "rate": 5.0,
      "tripDate": " March 2013"
    },
    {
      "title": "home away from home",
      "text": "I have to say Mina's guest house feels very much like home. actually  home away from home. staff members are very friendly location is great. If you have family or couple looking for extend stay I do recommend North York.  A. clean B. very convenient for anything you would need.C.Owner is very nice and there is no if or may be just simple yes. of course  I will come back only if I can make reservation usually they are busy.   \" just like you had long day from your work and come home\" Alex -Uni  from New York",
      "rate": 5.0,
      "tripDate": " February 2013"
    },
    {
      "title": "Comfortable and good place (Sheppard&Young)",
      "text": "Hi! I lived for many nights and this house become the real home for me. House looks very nice, rooms are renovated, absolute clear. Furniture brand new. Loudry included. And for sure in this very popular place you can't find as clean and nice home for that resonable price. By the way landlord nice gay ;).",
      "rate": 5.0,
      "tripDate": " January 2013"
    },
    {
      "title": "Surprising",
      "text": "I stayed for 6 nights at the 246 sherbourne location, and was quite surprised at the value of this place. My room was very clean and tidy on the third floor - room 8. There's several cafe within a couple minutes walk, and an arboretum just north 5 minutes. China Town is a bit further, but definitely within walking distance. I really liked staying here - kind of felt like I was staying at a relative's house. Nice feel to the place.",
      "rate": 5.0,
      "tripDate": " January 2013"
    },
    {
      "title": "Mina Guesthouse",
      "text": "The house is quite and clean. There is regular cleaning. House owner is so nice and responsible, and always available. With this in mind that it's in heart of the city, the price is very good. Generally, it was a good experience staying in Mina Guesthouse.",
      "rate": 4.0,
      "tripDate": " February 2015"
    },
    {
      "title": "Convenient  Place to Stay",
      "text": "The biggest advantage is the downtown location. So if someone is landing first time it is comfortably close to Eaton Centre which is the largest mall, Bus terminals and Service Ontario offices. The guesthouse is clean and comfortable place to stay with regular cleaning of common areas, kitchen etc. Many takeaways, groceries at a few step distance. There is a Salvation Army Centre nearby as a result the area has a few homeless people around I guess but nothing really  to be worried about and usually safe. I stayed there for a month and considering the price and location it was a comfortable stay.",
      "rate": 4.0,
      "tripDate": " January 2015"
    },
    {
      "title": "Staying at Mina's Guesthouse",
      "text": "I moved to Toronto in autumn of 2014 in order to do my practicums which are part of my studies and have been living at Mina’s Guesthouse since then.It has been a pleasant experience thus far. The guesthouse is very quiet, clean, safe and cozy. Management is extremely responsive to guests’ needs.The guesthouse is strategically located. It is within walking distance to grocery stores, pharmacies, downtown and the subway. I would highly recommend staying at Mina’s Guesthouse!Grace",
      "rate": 5.0,
      "tripDate": " September 2014"
    },
    {
      "title": "Thank Minna guest house , thank you dear , Adween''",
      "text": "I would like to thank and appreciate Mina's Guest House.  Home is clean, quaint, secure and Super convenient to all forms of transportation . You can walk to so many popular Toronto sights the location is that superb, I would like to thank the owner's as well, he is so gentle and friendly man , every time I came to Toronto I stayed in this hotel , thank you for every thing ,,,",
      "rate": 5.0,
      "tripDate": " December 2014"
    },
    {
      "title": "Comfy stay as advertised",
      "text": "I stayed for the week at Mina's Guest House and it was clean and conveniently located walking distance to the downtown core as advertised. Management was helpful and accessible by phone whenever needed.",
      "rate": 5.0,
      "tripDate": " August 2014"
    },
    {
      "title": "great!!",
      "text": "I stayed in mina`s guest house for over a month, good accommodation , i got everything i needed, if i needed something else i just got in contact with the manager and he ll be present, its very close to the city core which it made it easy for me to move around and know places in downtown, the bus stop its just right outside mina`s house, I had a great time there, great staff.",
      "rate": 5.0,
      "tripDate": " April 2014"
    },
    {
      "title": "Best Bargain/Location Location Location",
      "text": "Please recall the old saying about \",,,not judge the book by the cover\"! My first impressions of Mina's were less than sterling but as I moved into the house and got to know the place and especially the location...my goodness,,,I defy you to find a better location in the very heart of Toronto and especially the access to public transit, at these prices! Mina's Guesthouse is clean, courteous and so unbelievably convenient. I always enjoy my stays here, I will return and I recommend it to the seasoned traveler or the basic beginner looking for competitive pricing and great conveniences.",
      "rate": 4.0,
      "tripDate": " May 2014"
    },
    {
      "title": "Mina's guest house",
      "text": "I really enjoyed my stay in Mina's guest house .the house is in downtown area very good and safe location . it  is nice and clean . you have options to choose a large or small room according to your financials and overall the prices are reasonable . the house owner is a nice man . you can trust him . enjoy your stay at Mina's guest house as I did.",
      "rate": 4.0,
      "tripDate": " April 2014"
    },
    {
      "title": "A place I'll recommend to my friends",
      "text": "I joined a program in downtown for 1 month, I stayed in Mina's guesthouse. I enjoyed my stay in this place, it is very close to every thing. the Young/Dundas square less than 10 min. walking , supermarket cross the street , restaurant every where, Rabia supermarket is 3 min walking and open 24H.The Room was very clean, the place was warm and the option to use the kitchen was great so in some times i cook my self. all the time i see the kitchen is clean and ready for me.If I will plan a next visit to Toronto this place will be my first choice and I'll recommend it to my friends as well.",
      "rate": 5.0,
      "tripDate": " January 2014"
    },
    {
      "title": "good value for long term stays",
      "text": "Stayed at this guesthouse (room 4) for just over a month in January 2014. Main advantage of this place the location and the price. The place itself isn't too flashy but it has everything you need and would expect for what you are paying. The staff were very helpful and were on call 24hrs if there were any problems. We were even offered the same monthly rate when we decided to extend our stay for an extra few days which we very much appreciated. Only drawback is the area itself. Not dangerous, just a few weird characters roaming the streets. The building is quiet and secure, and is very close to all forms of public transport.",
      "rate": 4.0,
      "tripDate": " January 2014"
    },
    {
      "title": "Nice Neighbourhood! Close to Sheppard Center, and Yonge & Sheppard Subway Station",
      "text": "The basement apartment that i rented from Mina's Guesthouse Services was at 138 Poyntz Avenue in North York, Ontario. It was fully equipped with all utilities included. It was also a clean, comfortable, warm, and spacious place to live. The Owner/Landlord was very respectful, helpful and courteous, all of which are worth paying a little extra for. Thank You Mina's Guesthouse!",
      "rate": 4.0,
      "tripDate": " November 2012"
    },
    {
      "title": "One month in Mina´s Guesthouse Room 3",
      "text": "I was a month in this room and my experience was really good. The house had everything that I needed (kitchen utensils, washer and dryer, linens, good heating, duvets and towels ...) the owner is very friendly and always asked if everything was okay. The house is located in downtown Toronto, that's the great virtue, perhaps the only thing is that the street has some crazy people but I never had any problems. Really for the price it is very well located and very comfortable. I also had good roommates and I shared great moments. I recommend it! Estuve un mes en este cuarto, me pareció muy buena experiencia. La casa tenía todo lo que necesitaba (útiles de cocina, lavadora y secadora, sábanas, buena calefacción, edredón y toallas...) el propietario es muy amable y siempre me preguntaba si todo iba bien. La casa está situada en el centro de Toronto, esa es la gran virtud, quizás lo único es que la calle tiene algunos locos pero nunca tuve ningún problema. Realmente para el precio que tiene está muy bien situada y es muy cómoda. Tuve también buenos compañeros de apartamento con los que compartí excelentes momentos. ¡La recomiendo!",
      "rate": 4.0,
      "tripDate": " November 2012"
    },
    {
      "title": "Terrible place",
      "text": "If I could give this place zero stars, I would. When we arrived the room was super hot so we asked where the thermostat was and were told there was only one thermostat for the whole house. So we opened the window only to discover that there were no bars on a ground floor window, in a super sketchy neighbourhood, and the screen was shredded. We were then told not to leave the window open overnight because they have had raccoons come in. The shower was moldy and when we returned from our concert about 11pm the toilet wasn't working. We left first thing the next morning and since we had paid for two nights we emailed to request our money back. After multiple attempts to contact the owner, we haven't had any response or refund. Absolutely terrible experience.",
      "rate": 1.0,
      "tripDate": " October 2019"
    },
    {
      "title": "Shabby place in the worst of Toronto",
      "text": "I really don't know how that place is that well recommended. On arrival, we found junkies injecting whatever barely 10 meters away from the entrance, and the whole area around is none better. Some of them use the entrance gate as urinal, you won't miss it. Inside, the place is safe and undergoes daily cleaning, but opening the windows brings in the stink of the street, garbage etc. Everything is shabby, and against their announcement on booking.com there are plenty of rooms with shared bathrooms. If you book and make the first advance payment, check closely in what category you land, we found out too late. People favouring the place for its proximity to downtown should consider that parking in the neighbourhood is really expensive, whereas only sightly more expensive places not too far away provide free parking, the minimum comfort you might expect while travelling and are well conected with the efficient public transport network.",
      "rate": 1.0,
      "tripDate": " August 2019"
    },
    {
      "title": "Great price for a short stay in Toronto",
      "text": "Me and my girlfriend stayed here for three nights after coming straight from London to activate our IEC visas. Paid £103 for two people for three nights, the cheapest we found online. Although the neighborhood seems rough its OK if you are looking for something cheap and just a bed to sleep in. The room itself was great, comfy bed, a lot of storage, TV, a/c (the pillows were awesome). Kitchen area with everything you would need in it. Shared bathroom with shower, always stocked with toilet roll and cleaned. The building itself blends into it surroundings and is very old looking, it's not a 5* place but you are literally getting what you paid for. If you don't have think skin the area may seem very intimidating, but again there was no point either of is felt threatened or in any sort of danger. Its only a ten minute walk to the center and has shops close by. I did find a cockroach in the freezer but genuinely laughed it off because that's what you do when you're travelling haha. Paulo was also very nice.",
      "rate": 3.0,
      "tripDate": " August 2018"
    },
    {
      "title": "Low cost accomodations with extras",
      "text": "After staying with a friend in Etobicoke, I returned to inner city, Toronto for the remainder of my stay. I selected a guest house a little off the beaten track, but near good transportation. Even though it is an unmanned guest house, I was greeted by Alex, a host who acquainted me to how the house was run. In my clean spacious room, I found a large bed, large flat screen tv, mini Magic Chef fridge and a very nice communal kitchen. The area felt safe for me. I met several very nice young people staying in the house.",
      "rate": 4.0,
      "tripDate": " June 2018"
    },
    {
      "title": "Cheep Stay near by Downtown ダウンタウンでお得に滞在",
      "text": "２人での利用でしたが、少し狭めではあるが部屋の広さは特に問題ありません。また、清潔さも建物自体が古いので、多少劣化している部分はあれど、値段を鑑みるとほとんど問題ないといえるでしょう。マネージャーのAlexはとても親切です。やり取りは英語ですが、もしあなたがそれほど英語を話せなくても何とかなると思います。（私がそうでした）シェア部分の設備が充実していました。また、FreeStuf（自由に使ってよい食料）も多く、砂糖・塩からパスタ、ドレッシング類まであるので、滞在中に自炊をすればさらに費用を抑えることもできます。徒歩5分圏内にコンビニが２件とスーパーが１件、レストランが数件あります。アクセスに関してはダウンタウンに位置するDundas駅から徒歩10分ほど。Dundas駅近辺にはEaton　Centreという大きなモールもありますので、洋服などの買い物にはいいでしょう。アクセスはいいのですが、最寄りの交差点Dundas×Sherbone付近はホームレスや薬物中毒者が多い地区です。近隣にホームレス支援施設があるので、夜間の外出は避けたほうがいいかと思います。基本的にホームレスは危害を加えてはきませんが、不用意に立ち止まったり近づかないほうがいいでしょう。Although it was available for two people, although it is a bit narrower, the size of the room is not particularly problematic. Also, the cleanliness is also old in the building itself, so there are parts that are somewhat deteriorated, and it can be said that there is almost no problem in view of the price.The manager Alex is very kind. The deal is in English, but if you don't speak English well I think that it will manage somehow. (I was)Equipment of the share part was enriched. Also, Free Stuf (food that you can use freely),sugar and salt,pasta,dressings and so on, so you can even lower your costs by cooking yourself during your stay. There are 2 convenience stores, 1 supermarket and several restaurants within walking distance of 5 minutes.About access for about 10 minutes on foot from Dundas station located in downtown. There is also a big mall called Eaton Center near the Dundas station, so it would be nice for shopping such as clothes.Although access is good, nearest intersection Dundas × Sherbone is a district with many homeless and drug addicts. Since there are homeless support facilities in the neighborhood, I think that it is better to avoid going out at night. Basically, homeless people will not hurt, but you better not to stop or approach inadvertently.",
      "rate": 4.0,
      "tripDate": " October 2017"
    },
    {
      "title": "Great Room, Lovely Owner, but \"dodgy\" neighbourhood.",
      "text": "My partner and I stayed in Mina's Guesthouse from the 2nd September 'till the 5th September 2017. The guesthouse is very quaint with lovely, spacious rooms, a smoking balcony, and shared bathrooms and kitchen. There were a couple of things in the property that wasn't ideal, such as holes in the ceiling and spiders in the cutlery drawer, but for the price and the location of the property, you really can't complain. The owner of the guesthouse was not pushy and as we arrived in the early evening, he waited until morning before coming to give us details and house rules. I did appreciate that as we were very tired from traveling long-haul.The location of the property couldn't have been better for the price that we paid, it was just a 10-minute walk from Dundas Square and downtown Toronto, however, the corner on Dundas St and Sherbourne St. is known around Toronto as a bad area for crime and there were A LOT of vagabonds in the area. I did feel uneasy walking around at night but there was a lock on the gate and an automatically locking front door which made me feel safe in the actual property. Overall I'd say the value for money is excellent, it's great for backpackers like ourselves, the only issue would be if you're a person who feels easily threatened and you'd like to be out walking in the night time, you might feel a bit uneasy.",
      "rate": 4.0,
      "tripDate": " September 2017"
    },
    {
      "title": "Good place to stay cheap",
      "text": "I stayed at Mina's guest house from 7th Sept, 2015 to 11th Sept, 2015. It is a very quiet place, conducive for students and anyone who needs peace of mind. I must add that there are a lot of homeless around the area, but the good news is, nobody worries anyone. I was very busy with lectures/studies when i was there and sometimes found myself getting home at midnight but I had no problem. The guys who run this facility are very patient and courteous. Always ready to accommodate your request. Edwin was very kind to even allow me to park my car in his spot the entire time I lived there. I will however plead with you to increase the speed of the internet service. I always had to go back to school to use the internet service there. To have such a cheap place in Downtown Toronto is rear. Good job guys, keep up the good work",
      "rate": 3.0,
      "tripDate": " September 2015"
    },
    {
      "title": "Mina Guest House stay .. excellent!!",
      "text": "\"this is such a nice place to stay in down-town , Toronto. TTC near your door , walking to subway . Professional cleaning every week , groceries etc all walking . Care taker , Dave and owner Adwin are such a gentlemen, they keep up their words!.I would recommend this place to anyone who want to stay in down-town to get started with...\"",
      "rate": 4.0,
      "tripDate": " April 2015"
    }
  ]
}