{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Montecassino Place Suites Hotel",
    "url": "/Hotel_Review-g155019-d183587-Reviews-Montecassino_Place_Suites_Hotel-Toronto_Ontario.html",
    "priceRange": "$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "2.5",
      "reviewCount": 162
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "3710 Chesswood Dr Downsview",
      "addressLocality": "Toronto",
      "postalCode": "M3J 2W4",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0c/9e/0e/11/plushy-king-size-bed.jpg?w=500&h=400&s=1"
  },
  "description": null,
  "featues": [
    "Free parking",
    "Free High Speed Internet (WiFi)",
    "Fitness Center with Gym / Workout Room",
    "Free breakfast",
    "Business Center with Internet Access",
    "Conference facilities",
    "Baggage storage",
    "Newspaper",
    "Parking",
    "Wifi",
    "Breakfast buffet",
    "Snack bar",
    "Vending machine",
    "Banquet room",
    "Meeting rooms",
    "Non-smoking hotel",
    "24-hour front desk",
    "Self-serve laundry",
    "Air conditioning",
    "Non-smoking rooms",
    "Suites"
  ],
  "reviews": [
    {
      "title": "Awful hotel",
      "text": "The walls had weird stains and holes and there were stains on the beds There were weird stains on the power outlets. We asked for a room with 2 beds and a pullout couch but they gave us a room with 2 small beds for 4 people. The shower wouldn’t turn on. There was a cigar burn on my bed and the wifi was terrible",
      "rate": 2.0,
      "tripDate": " June 2023"
    },
    {
      "title": "Stay somewhere else.",
      "text": "Rooms were dirty. Double bed on a twin bed platform so the mattress rocked. Bedding falling apart. AC was broken and the plug was fried and burned. Housekeeping came in while I was in the shower despite the DND sign being on the door and argued with me I was supposed to have checked out (it was 9am and we still had one more night in our stay). Manager never got back to us about any issues.",
      "rate": 2.0,
      "tripDate": " April 2023"
    },
    {
      "title": "I'm disappointed",
      "text": "This hotel leaves a lot to be desired.  Let's start with the positives:  the room was clean and the house keeping staff was friendly.  Now on to what made us feel wanting more: 1.  There were multiple events going on when we stayed (we were one of the groups).  One particular event party kept going until 2am, with extremely loud music and bass.  Our walls and floors were shaking and we were on the third floor!!! Worst nights sleep ever.  Have the courtesy and decency to end the event earlier and respect the other guests who have kids and are trying to rest.2. AC pumps out hot air, staff says to adjust with wall thermostat but room has no wall thermostat.  It was hot, stuffy and uncomfortable.3. A family members room exhaust fan did not work so when they showered the room filled up with steam.4. The breakfast was mediocre and serving area was a mess.5. Some rooms have a hair dryer some rooms don't.  Had to borrow from someone else.6. We were told the hotel does not offer king size beds, yet a family member was given a room with a king size bed.7. Front desk staff doesn't seem to know what's going on and showed little care to our concerns.Like I said, the room was clean, but that's it.  The rest of this hotel needs a major overhaul.",
      "rate": 2.0,
      "tripDate": " April 2017"
    },
    {
      "title": "Unbelievable front staff",
      "text": "I have never been yelled at by staff personal at any hotel I have ever stayed at, but the night front desk man Keira absolutely screemed at me for walking into the kitchen by mistake. And he refused to apologize. They have no idea of what customer service is. Then I went to book a third week there and said I was over charged $3 on my last week. Could they adjust the price. Quote from the day manager \" that's not the way things work around here\". Well over $3 on $2147.69 bill I closed my account and found another hotel to stay for another month. Gee hotel montecassino must be rich, if they can turn away thousands of dollars in business over $3. Never again will I step into that hotel, and I've notified my international company not to use them and all my friends will be aware of the nightmare I was put through.",
      "rate": 1.0,
      "tripDate": " November 2020"
    },
    {
      "title": "Do Not Go!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
      "text": "horrible, horrible, horrible.  It was basically a hotel on top of an event center that was hosting rowdy stag parties.  I should have know there would be a problem when there was a security guard in the lobby.  There was a fight in the hallway right outside our door and the mirror in the hallway was smashed all over the floor.  Two hours later we decided to leave and the broken glass was all over the hallway still",
      "rate": 1.0,
      "tripDate": " April 2023"
    },
    {
      "title": "Worst experience I had in my travel life",
      "text": "I happened to book this hotel after visiting their website and it seems to be pretty decent.  Boy, I was dead wrong.This hotel is difficult to find and it is located far away in an industrial region, I believed, as the surrounding buildings are mostly work shops and warehouses.  The parking is limited and outdoors on some gravel patch beside the hotel.The lobby and reception area are dated.  It reminded me of those economy hotels that you find in Rome.  During my stay, I only interacted with the receptionist, the waitress at the breakfast room and the manager.  Their service attitude was appalling for the rates they charged.  The waitress was especially rude.The rooms do not have kitchens, contrary to their intention to make you believe.  Cleaniness is acceptable, however, the room's condition is quite worn down.  The TV remote does not work, the wall paper and furnitures have obviously seen better times.Breakfast is extremely disappointing.  They offered bread, which was still in their commericial packing! Eggo waffles, orange juice and some bad coffee.I find that the rates are overpriced, unfortunately, after I lived at this place.  From what they have to offer, I wouldn't even go back at half the price.",
      "rate": 1.0,
      "tripDate": " October 2005"
    },
    {
      "title": "Highly NOT Recommended",
      "text": "If you are a business owner and want to show your employees on how NOT to treat your clients, Montecassino Hotel is the perfect place. This has got to have been the worst reception I have ever had. I booked my stay on easytobook.com, only to be told that there was no reservation in my name. The person at the reception was so sure that they did not use that booking service, and that after 2 years of working there, she was aware of all the hotel's procedures. Anyhow, I show up with printed proof, iphone proof and even asked her to go on the site to verify and she still doubted me. She told me I had to pay again if I wanted to stay there which I refused. Incredible!!! Finally, she contacts expedia and is informed that they manage the easytobook site and they confirm my reception. Once agsin, rude as ever, she does not even apologize. Next...room is disgusting. Almost as bad as the receptionist. I have a very high tolorence to rudeness as dirt, but Montecassino really went over the limit. Do yourself a favor and avoid staying at Montecassino. I really should have listened to my wife.",
      "rate": 1.0,
      "tripDate": " April 2013"
    },
    {
      "title": "Like taking a step into a horror movie filmed in the 17th century",
      "text": "When my partner and I arrived at this hotel we had high hopes, the clean lobby kept us assuming this would be a great stay. The front desk attendant was poliete and check-in was realitivley seamless- despite a booking.com error that we had to sort out. The first major alarm bell was that this hotel has their front desk / check in point on the second floor of a building and the main floor contains nothing (not even a large sign of which way to the hotel check in desk). Alarm bell number two - the key was a physical metal key not an electronic keycard (usually this only happens with motels).The hallways were nice and I felt like I was inside a castle at some points, but my feelings as queen soon ended when we opened our room door to a room not fit for a servant.Everything had a stale-death like odor & the furnishings could have easily been found on the side of the road in 1980.We left immediatley, wasting the 90$.I would have paid 1000$ to get out of there.",
      "rate": 1.0,
      "tripDate": " January 2015"
    },
    {
      "title": "Ick!",
      "text": "The only good things about this hotel were the friendliness of the front desk staff and the decent bed. (but not pillows)  We stayed here because of attending an event.  Our room was shabby, with wall paper peeling from the wall, cigarette burns in the furniture and carpets, towels which felt like sandpaper and TV's from the 1980's.  There was a cafe to pick up snacks but no other restaurants on or near the premises.  A very small breakfast was offered which consisted of a few cereals, bread, frozen waffles, muffins and some fruit.  A coffee shop and sandwich shop across the street provide the only food fare close by.  It's a long way from Pearson Airport, a $50.00 taxi ride.  Seriously people, if you are attending an event here, stay downtown and take the subway to the Downsview station and taxi over from there.  You'll be happy you did.",
      "rate": 1.0,
      "tripDate": " February 2015"
    },
    {
      "title": "Stole my pillow from home, walls had blood splatter.",
      "text": "My friends and I booked this hotel back in May for Riot Fest, which made this hotel a convenient twenty-four minute walk to Downsview Park for us. The beds were comfortable, however we noticed blood splatter on the nightstand and wall by the window, as well as on the box spring of the bed closest to the door and bathroom. The room was small and outdated, not to mention the dial on the air conditioning was hard to tell if it was on the hot or cold settings, which you would think would have been easy to figure out.The first night we were too tired to care about a damn thing, but when we returned on the second night there from the festival I had noticed that the beds were nicely made but my pillow from home was missing. I called the lobby to ask about it, they asked if I was sure I brought it. Considering I had slept with it the night before in that room I was pretty damn sure. So they checked with the maid whom cleaned the room, she said she didn't take it. Had them check the back every day that I was there to find it, could not find one pillow that wasn't theirs. It should not have been hard to find it considering it was stained red and orange from my hair dye, which was the whole reason I even brought it. Checked out with them still \"searching\" for it, but I doubt I will ever get a call back from them about it. So no, I did not enjoy my stay here, was not expecting theft and to be asked like I was some crazy idiot if I even brought it.Also, if you have food allergies to wheat, good luck with their free continental breakfast, it's all wheat based or dairy based with apples and bananas in baskets on the side. Luckily there is a Coffee Time across the street.",
      "rate": 1.0,
      "tripDate": " September 2014"
    },
    {
      "title": "PLEASE READ BEFORE YOU BOOK AND GIVE ANY FINANCIAL INFORMATION",
      "text": "What an awful experience. I have a family member who is going through a rough time and I kindly paid by debit card for a hotel for him for a week (did not want to leave credit card for fear of charges). I was told I need to have a credit card on file in case of damages which is fair. I gave them a credit card and specifically said DO NOT charge ANYTHING to this card it is only for incidentals and please notify me if something happens. Well guess what they did - they allowed the family member to extend their stay on MY credit card WITHOUT MY CONSENT. He was able to walk up to the front desk and extend. HOW IS THAT POSSIBLE. I am in my 20s and am female and my family member is in his 50s and male. They had my identification (driver's license) to know what I look like and THEY STILL ALLOWED HIM TO AUTHORIZE FURTHER CHARGES. When I called the front desk the lady working agreed that that should never have happened and transferred me to a manger and i have never been treated so poorly IN MY ENTIRE LIFE. She seemed scared of him too. I am an avid traveler and have stayed at 500+ hotels in my lifetime. This was by far the worst experience. I did call the police to report fraud who said I could sue but cautioned that it will be very time consuming and likely not worth my time - I agree with them. Stay away from this place and feel free to be in touch if you have further questions.",
      "rate": 1.0,
      "tripDate": " February 2020"
    },
    {
      "title": "In a word...",
      "text": "Dire. I’ve never had to request coat hangers at a hotel before. And then to be told “we take them out of the rooms for winter”. This was the end of August!  Then when I did get two hangers generously provided - one of those was broken. Breakfast was bagels, toast, waffles or mini croissants, with some foreign lady (no English spoken) cake around offering Danish pastries out of the plastic tray they come packed in from the supermarket. The whole place felt odd. Possibly more like a UN detention centre (not that I’ve ever visited one) more than a hotel. I’m sure there’s better offers available whatever your budget.",
      "rate": 1.0,
      "tripDate": " August 2019"
    },
    {
      "title": "Approaching if not past its “best before” date",
      "text": "You would only be considering this hotel if you had business appointments in the surrounding industrial area (for which it has no competition) or are travelling through Toronto and want a reasonably priced room not that far off the highway (for which it has lots). If the latter, pick another spot. This hotel might once have had lots to recommend it but little of that remains. The front desk is on the second floor and the wheezy elevator took what seemed like an eternity to arrive. After checking in, where the woman on the desk did not even know if local phone calls were free and had to ask someone else out of sight, it took so long to return I gave up and walked up the two flights of stairs. The room was clean, although the stain in the middle of the carpet and the cracked tiling on the window sill were apt symbols of how little care seems to be taken in keeping the place up. The deadlock for the door would not work because of the door jamb having shifted with age - or maybe it never did, who knows? Walls were paper thin. Fortunately only two people walked by talking in not overly loud tones while I was there or I might not have had a very restful sleep. The bed was actually quite comfortable. I do give them credit for that. But, the continental breakfast was very meager and the majority of the tables were actually set in what appeared to be a corridor leading to the conference/banquet halls. Not that it mattered as I was the only person eating at the time. Conference/banquet area was all closed off and the hotel restaurant is not open Mondays and Tuesdays. The immediate area is not exactly well served with other options for dining either but you could find them within a ten minute drive if you do stay on one of those nights. So all in all, plenty of reasons not to stay.On the plus side, plenty of parking spots available close to the doors because so few people were actually staying there.",
      "rate": 1.0,
      "tripDate": " August 2019"
    },
    {
      "title": "Not Impressed",
      "text": "We checked in this evening and I feel the need to write an immediate review. I am a housekeeping supervisor at a hotel in Niagara Falls, Ontario, so of course I take a closer look when it comes to customer service and cleanliness of hotels I stay at. The first thing I noticed upon entering the room was the very filthy window covered in greasy handprints. I checked the bed sheets and headboards for signs of bed bugs as I always do and came across an oil stain and small rewashed blood stains on the sheets. The room was dusted well otherwise, but then I went into the bathroom. I ran my hand along the sink, counter top and bathtub... SOAP SCUM EVERYWHERE. Not to my surprise I also found a hair in the bathtub. No bath towels in the room either. The ice bucket lid was disgusting. On the other hand the beds are fairly comfortable, the room was small but tolerable, carpets were clean, no major wall scuffs or marks. The bathroom floor was clean. The old school door locks are super strange. I dont think I have ever seen a \"3 star\" hotel use actual keys for entry. We are staying through until saturday, will see how the stay over service is, will be leaving a note for the housekeeper to clean the greasy window and wash out the tub again. Yuck.",
      "rate": 1.0,
      "tripDate": " May 2019"
    },
    {
      "title": "Great location, weird set up",
      "text": "My friend and I booked a 2 day stay to accommodate us during the Veld Music Festival. It’s a 30 min walk to Downsview Park where the festival is held and with the free hotel parking it’s a steal in that regard. Hotel set up is odd, lobby is on second floor and there’s no clear signage. Room was good, bed comfy, and everything worked. The continental breakfast had limited options but it was fine for us since we only were there 2 days. It was expensive though, but it might have been because we booked less than a week out due to an issue with our previous lodging. Wed stay here again!",
      "rate": 4.0,
      "tripDate": " August 2018"
    },
    {
      "title": "Ok stay for price",
      "text": "Adequate hotel for price. The room was not modern or fancy but the furniture and fittings were in excellent condition. The bed was comfortable and the room temperature was easy to adjust. Despite being close to Downsview Airport, there were no noise issues at all - the hotel was very quiet.Convenient continental breakfast, not fancy but a time and a small $$ saver for getting something to eat elsewhere.Internet is rather slow as previously mentioned.For a quick stop-over, this met all my requirements. I would not hesitate to stay again.",
      "rate": 3.0,
      "tripDate": " June 2016"
    },
    {
      "title": "dissapointing room",
      "text": "our room was dirty.  the couch material was ripped, carpet was dirty, had not been vaccumed. there were brown disgusting stains by the bed on the floor, on the wall and on the mattress.  my husband slept sitting up in a chair, he wouldn't get into bed. the mattress was extremely old, with springs, very, very very uncomfortable.   the furniture was in bad repairs, dents, scratches, very old and not working.  old, old, old style televisions in cabinets, very small.  the desk chair had no material on the seat, you sat on the springs, for about 5 min, as that was all you could tolerate.  hugely disappointing.  poor continental breakfast.  would not stay again.",
      "rate": 2.0,
      "tripDate": " March 2016"
    },
    {
      "title": "Timeshiftt back to the 80s",
      "text": "The reception area and is nice, also the corridors. Room are extremely old style.Old (probably 10++ years old) furniture, with a lots of signs and damages, old tube tv, peeling wallpaper, damaged, dirty carpet.The bath was OK.",
      "rate": 1.0,
      "tripDate": " January 2016"
    },
    {
      "title": "Clean shiny floors",
      "text": "What impressed me most about this hotel were the beautiful clean shiny floors in the lobby and the hallways.  The room was large and very comfortable also with a refrigerator. This hotel is also easily accessible  However I was not impressed with the breakfast.  It was o.k. but none of the food was hot,  but there was a toaster and hot coffee.  I would go there again.",
      "rate": 4.0,
      "tripDate": " July 2015"
    },
    {
      "title": "A horrible Christmas",
      "text": "My family and I had the unfortunate pleasure of staying here during Christmas.  They initially put us on the 5th floor where the coffee pots and trays had at least 3 inches of dust on them.  The hotel itself is more of an event venue with a hotel on the side for parties that go late.  The laundry rooms are horrible and the location of the hotel is very sketchy.  Only plus side to the experience is that they moved is to the 4th floor where there was a soaker tub and the rooms were newly renovated.",
      "rate": 1.0,
      "tripDate": " December 2014"
    },
    {
      "title": "Not worth the money",
      "text": "This hotel is in very poor state.  The furniture has cigarette burns, baseboards are furry with dirt, the t.v.s are 13 inch tubes, the armoire is  missing a door, there is no bathroom fan, the porcelain in the bath tub is worn out.  Curtains are faded to burgendy and should be navy blue plus are coming off the rod.  Heating air conditioning unit is in the bedroom with a thru wall fan into the other room so you have two fans going in the bedroom, very noisy.  The couch has a ply wood base with thin cushion on top.  Room is large but no sofa bed.  We did not attempt breakfast.  The lobby is on second floor and they use keys for the locks to the rooms.",
      "rate": 2.0,
      "tripDate": " March 2016"
    },
    {
      "title": "Very disappointed - THEY DON'T CARE",
      "text": "They didn't care that their internet didn't work, they didn't offer a solution that worked, they didn't offer a discount or a complementary room, they just don't care.  It was EXTREMELY annoying when they told me, \"the internet is complementary, so accordingly, we do not need to offer you compensation for a complementary service that does not work.\"  I needed to do work here, to get ready for a meeting with a client late that evening, and I couldn't do it.   I don't care to stay there again, and neither should you.",
      "rate": 1.0,
      "tripDate": " July 2015"
    },
    {
      "title": "Clean, Comfortable, Quiet",
      "text": "I was attending an all-day event at the hotel so I booked a room for the night.  The room was not modern or fancy but the furniture and fittings were in excellent condition.  The bed was comfortable and the room temperature was easy to adjust.  Despite being close to Downsview Airport, there were no noise issues at all - the hotel was very quiet.The hotel is located in a commercial zone so there is not much to do in the vicinity, but this was not an issue.  Access is easy from the 401.For a quick stop-over, this met all my requirements.  I would not hesitate to stay again.",
      "rate": 4.0,
      "tripDate": " April 2015"
    },
    {
      "title": "Worse place I've stayed in",
      "text": "The hotel lobby (once you found it) was quite nice.  The room we stayed in was horrible.  There was a smell to the room I could not describe.  The furniture was quite old, covered in cigarette burns, and really rough shape.  The bed was the most uncomfortable thing I have ever slept on.  The floor would have been more comfortable, although I was afraid to lay on in, as it was filthy.  There were holes in the walls.  The WIFI only worked if you stood by the door. The AC only worked in the bedroom. There were signs throughout the hotel and room advertising the cafe that is open from 4pm till 11pm everyday, except the day we were there.  We went down for the breakfast to find they ran out of food, after waiting almost 20min for coffee we gave up.Upon checkout, we were told that they did have renovated rooms, and we could have moved to one of those.  It would have been nice to know this upon check-in. I would not recommend this hotel to my worse enemy.  If you choose to book it, be sure to ask for a renovated room.",
      "rate": 1.0,
      "tripDate": " September 2014"
    },
    {
      "title": "Pleasantly Surprised",
      "text": "My family and I found refuge at the Montecassino during the recent ice-storm in Toronto. We usually travel 4-5 star hotels, so I was bracing for the worst..When I walked into our very spacious 2 room suite I could not believe how lovely and comfortable it was. We booked 2 suites, since we have 3 kids, but we could have rather easily squeezed into one. It was very clean, there was a fantastic fridge that could fit so many of our supplies, and a very comfortable couch, as well as 2 tv's. All for the outrageously low price of $100/suite! The complimentary coffee in the room was much appreciated, as well as the option of ordering a light meal at the cafe, which we did. It was such a stressful time for Torontonians, and I felt the staff was very courteous and professional, even though they were dealing with a very irate and displaced crowd. The housekeepers, front desk staff all really tried their best to be nice and accommodating to the guests. We also booked a room for my in laws, and my girlfriend and her 3 kids-all without power, and we all enjoyed our stay. The location is off the beaten track, but, if you need to be around there, or don't mind a drive, I think it's a very nice hotel with more space in it's suites than the Sheraton downtown, or even the former Four Seasons. Not super fancy, but it didn't feel 'dumpy'. Very homey..I will be recommending this hotel next time I have a load of relatives from Montreal coming to visit for a family affair. Thank you Montecassino, for taking such good care of our family during the horrible ice storm.",
      "rate": 4.0,
      "tripDate": " December 2013"
    },
    {
      "title": "Value??",
      "text": "Cost of the room is not of good value.  No ice available on the floor.  Beds are soft and old.  Room furniture is old and unsightly.  TV is very dated.  Breakfast is NOT breakfast.... just VERY continental.  Bathtub is old and water stained.Cable is good.  Room was clean.  Happy they provide shampoo and body moisturizer.  Nice water pressure for shower.  House keeping provided extra towel requested and was pleasant.",
      "rate": 2.0,
      "tripDate": " November 2013"
    },
    {
      "title": "A+",
      "text": "i stayed at the Montecassino and had no problems at all.  i had a friendly check-in , had my daily service, cant complain, and checked out. I stayed a week and didn't experience any of the problems other guests have mentioned.   Id stay at the Montecassino again.",
      "rate": 4.0,
      "tripDate": " October 2011"
    },
    {
      "title": "Excellent Stay",
      "text": "I was a guest at a wedding in January at Montecassino.  The food and service was excellent!! I also stayed that evening at the hotel and it was great ! Hotel lobby looks really nice. Room was nice and clean. Good Price. and the continent breakfast was included the next day.  No issues at all.Cheers",
      "rate": 4.0,
      "tripDate": " January 2012"
    },
    {
      "title": "Terrible, Terrible and Terrible",
      "text": "We took the chance with this hotel even after reading about the bad reviews, because all the other hotels we wanted within our budget was fully booked.  Now we knew the reason why this hotel had vacant rooms, when others were fully booked...we can attest to the other reviews that this hotel is terrible as we experienced it first hand.The room was poorly lit, smelled like dirty laundry and the funitures were in bad shape.  The tube tv was fuzzy and the remote didn't work.  Front desk's service was worst than you can ever imagine with any customer service.  The breakfast was not worth eating as it was really bad.The thing that I wanted to add which the other reviewers missed, was security.  There was none.  The place was dark and arkward in some industrial area.  If you wanted to go out at night, you needed to get outside in the open because the carpark was on unimproved gravel beside the hotel.  (Looked pretty scary at night out there).  One morning when we took the stairs, we saw the exit door was damaged as if it was being forced opened.When we reached our car, there were scores of flyers advertising paid sex services and locations of brothels nearby on our windshield which was very embarrassing with kids around.We regretted saving a few bucks because it wasn't cheap anyway staying at this terrible place.",
      "rate": 1.0,
      "tripDate": " July 2008"
    },
    {
      "title": "Worst hotel stay experience ever!",
      "text": "The hotel is located in an industrial part of the city and it is far from any shopping centers. It's very difficult to travel around if you don't have a car! The lighting in the rooms is very limited, the furnitures are old. The cleaning crew are very rude and do not seem to understand what \"Do not disturb\" sign means. The receptionist people are not helpful at all. The breakfast served was the worst I've ever had in a hotel. They had frozen bagels, waffles and cup cakes!!!! The highspeed internet is provided only in a very limited area in the lobby ON THE SECOND FLOOR! The ground floor is where they hold parties and gatherings so it can get very noisy and crowded. The most important issue is that there's almost no security. One morning when We woke up the elevator kept getting stuck on the third floor and we noticed that all the light bulbs on the third floor were smashed. I would not recommend this hotel to ANYONE!",
      "rate": 1.0,
      "tripDate": " December 2007"
    },
    {
      "title": "Way Better Than Expected",
      "text": "Circumstances had us needing a cheap hotel for a few nights in TO with parking. We booked this hotel because of the rate and had low expectations. From the outside it does not look like the greatest but once inside the room, it was quite comfortable. The rooms were clean and spacious. The bathroom was also a good size. We requested a microwave and fridge as we were there for a few days and they happily brought it to our room. Breakfast is free, it's nothing major but will get you out the door. There was lots of parking which was great as we had two cars. Overall a very pleasant experience and would return.",
      "rate": 4.0,
      "tripDate": " April 2017"
    },
    {
      "title": "Noisy confusing layout and rude staff on nightshift",
      "text": "First impression...NO LOBBY ON THE MAIN FLOOR AND NO SIGNAGE FOR AN ENTRANCE!! I arrived at one in the morning after a long day of unpacking boxes for a friend to find that I couldnt find my way to get in. I called the desk and got a repeated busy signal for over twenty minutes. When I did get through I was informed the lobby was on the second floor and he called me SIR. I was tired but my voice not that masculine...perhaps they should save gender ID for when they have a name for a clue. Then when I checked in he implied I would smoke in the room and reemphasized the charge for a clean fee. He charged me for TOOTHPASTE RAZOR AND TOOTHBRUSH and gave me NO SHAVE CREAM. Don't lose your key....they won't give you another and you will be left to eat breakfast alone while your companion sits in the room alone and misses breakfast and no one on staff will care. The BEST PART>>>>> NO MANAGER AVAILABLE TO EVEN COMPLAIN TILL AFTER TEN AM....must be nice THEY got to sleep...I was kept awake well past two thirty in the morning after repeated calls to the front desk to quiet others on this floor....there were even YOUNG CHILDREN running the halls at one thirty in the morning. DISGUSTING.....will NEVER STAY THERE AGAIN",
      "rate": 2.0,
      "tripDate": " January 2014"
    },
    {
      "title": "Don't go to that hotel",
      "text": "We stayed at that hotel 2 nights. When we registered to our room I ask them for a quit room. I told them that I knew there was going to have few party of weddings and we wanted a quit room. First impression or first smell was fish, yark it does not smell good on the 5th floor of the hotel. The room was clean but vary basic with old damaged furnitures. We visited our friend on Friday night and when we came back there was no parking at all around the hotel we had to park somewhere else in another private property, that's not very good. Saturday night, someone tried to open our room by mistake at around 2 a.m.... not so good and the only thing we could hear from midnight to 3 a.m. was door closing or people speaking too loud. So if you're invited to a wedding, then stay at the Montecassino it's perfect but if you want to sleep after 11 p.m. don't stay at this hotel. Also the continental breakast was awful, we did not ate nothing from it because some of the clients of the hotel were eating directly from the plate. Any kind of jam or peanut butter for your toast so stay away of that hotel. Also, someone on the 5th floor add a cat in is room, so the smelly fish was more like a smelly cat .... yarkkkkkkkkk",
      "rate": 1.0,
      "tripDate": " September 2012"
    },
    {
      "title": "great place",
      "text": "I recently stayed at the Montecassino... Location was great ..it was very enjoyable...Room was great, bed was very comfortable ,linens were very clean (something I'm fussy about). Staff was extremely friendly & accommodatingI would highly recommend this Hotel",
      "rate": 5.0,
      "tripDate": " January 2012"
    },
    {
      "title": "Amazing value in Toronto",
      "text": "If you are looking to stay in Toronto this is the place to go....easy access to the subway system, major highways and all of the major attractions.  Don't know why there are so many negative comments since, for the money, this is the best deal in the city...",
      "rate": 5.0,
      "tripDate": " January 2012"
    },
    {
      "title": "Great banquet hall, terrible hotel",
      "text": "We stayed at this hotel for a wedding.  The wedding was wonderful, banquet hall was beautiful and we had a fantastic time.  The hotel room left something to be desired.  Upon arrival we headed to reception, which is tough to find on the second floor.  The elevators were slow, made strange noises, and one did not have certification posted.  When we checked into our room, the maid was still cleaning it.  Luckily we were heading straight out so we just dumped our stuff and left.  Unfortunately this meant we didn't notice we were given 2 double beds even though we requested and were told we would receive one king bed.  When we returned we noticed the room smelled of smoke (yuck), the mini-fridge was dirty, the paint in the shower was peeling, and overall it was a fairly unappealing room.  The air conditioner/heater was noisy and blew the curtains away from the window.  The worst part was probably the free 'continental breakfast', which consisted of cold pre-toasted frozen waffles, cereal reduced to dust, bruised apples and wonder bread.Since we were just at the hotel for a wedding and spent a very limited time in the room, I didn't feel the poor hotel room ruined our evening.  If we had been visiting for something else I would have been pretty upset!  I definitely recommend this place as a banquet hall, but would suggest you avoid the hotel rooms.",
      "rate": 1.0,
      "tripDate": " May 2011"
    },
    {
      "title": "Would Never Stay Again",
      "text": "As residents of the GTA, we were quite disappointed with this hotel. It leaves MUCH to be desired. The lobby is located on the 2nd floor and is therefore not the most welcoming arrangement. Upon checking in, you are greeted (or rather grunted at) by the front desk staff, who are really put off by seeing a guest in front of them. The rooms were not cleaned well and lacked adequate lighting. In fact, one light bulb was red, and some were missing entirely. There were 2 TV’s in the room, both of which had broken remote controls. The morning front desk person was as pleasant as the afternoon one, and the check out procedure was different each time. There was no consistency. The customer service was pitiful. We were so happy to be leaving in the morning. We would never recommend this hotel to anyone.",
      "rate": 1.0,
      "tripDate": " August 2007"
    },
    {
      "title": "Worst hotel experience of my life",
      "text": "Old fashion hotel, place worn out terribly. Room was dark with only one floor lamp and one bedside lamp. Still using metal key in 21st century in a hotel!! Breakfast only a few piece of bread, yogart and corn flakes, coffee jar was empty as well. What a joke!! The most terrible thing is during my first night the fire alarm bell rang at 2am for 20 minutes. When we tried to ask the reception, he said he doesn't know anything and need to wait for the property manager. No one tell us where to evacuate and we have to stand in front of the hotel entrance with other guest until the fire fighters arrived. What a shame!I definitely will not recommended this hotel to anyone.",
      "rate": 1.0,
      "tripDate": " September 2019"
    },
    {
      "title": "”Faulty” tower",
      "text": "No, no and no. Do you expect service and function? Pick another place!Alright, there are two good things about this place. It’s about 5 min walk from a subway and getting smack down town Toronto takes about 30 minutes tops. Our room was quite big even with 2 kids and the beds were comfy. The washroom had a bathtub and was clean as was the room.The air conditioning was good and fairly quiet. So what’s the problem? The surrounding area is a commercial district with nothing to do but as the subway is close that wasn’t a big deal. The problem is almost no service, uninterested staff and too many things were broken.When we arrived one of the elevators were broken and during our stay the other broke; naturally on the morning we were leaving (from our room on the 5th floor). A simple note on the elevators said “out of order “ and we had to carry our bags to the 2nd floor were the reception is. Why didn’t we call for help? You’ll understand...On our first night the toilet got clogged. When I called the front desk a tired voice said he would try and find a plunger. 5 minutes later he called back and asked me to COME DOWN TO PICK IT UP! I asked if he really thought I was going to fix it and he said he couldn’t do it! Well I did since we needed to use the washroom.Breakfast next day (and the following days). It consists of white toast, yogurt, butter, jam, cereal, some fruit, juice and coffee. That’s it. It’s served in the walkway leading to the front desk so you are eating in a corridor! With one exception the tables are only 2 seats! The trolley the food is on is smaller than our dining table at home. Every morning something was out and we had to look for someone to fill bread or juice and so on. Now you may understand why we didn’t bother to ask for help with our bags? Finally, when we took a cab to the airport the driver asked what we thought about the hotel. When we told him he said it had a bad reputation and he would have chosen another hotel. Believe me, we will!",
      "rate": 1.0,
      "tripDate": " August 2019"
    },
    {
      "title": "very expensive at 100 dollars a night for a very dirty old hotel",
      "text": "the room floor was full of dirt when we had arrived, we told the reception, she could not care. It is upsetting to arrive into a dirty room after travelling so long. There is nothing doing around this hotel. Breakfast is bad.",
      "rate": 1.0,
      "tripDate": " February 2016"
    }
  ]
}