{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Neill Wycik Hotel",
    "url": "/Hotel_Review-g155019-d7649497-Reviews-Neill_Wycik_Hotel-Toronto_Ontario.html",
    "priceRange": "$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "2.5",
      "reviewCount": 155
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "96 Gerrard St E",
      "addressLocality": "Toronto",
      "postalCode": "M5B 1G7",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0c/aa/69/52/received-10154391063472556.jpg?w=500&h=-1&s=1"
  },
  "description": null,
  "featues": [
    "Free internet",
    "Wifi",
    "Paid internet",
    "Free breakfast",
    "Non-smoking hotel",
    "Kitchenette",
    "Non-smoking rooms",
    "Family rooms"
  ],
  "reviews": [
    {
      "title": "Only go if you have a very strict budget",
      "text": "The room seemed very dirty and the windows had junk in them. There was no air conditioning and the fan was very loud when used. The walls are paper thin and you can hear everyone in the rooms around you. The shared bathroom was not clean as well. Overall would not recommend staying here unless you are on a very strict budget.",
      "rate": 2.0,
      "tripDate": " July 2023"
    },
    {
      "title": "Not exactly a hotel more like shortstay accommodation ",
      "text": "Not exactly a hotel more like short stay accommodation , people live here, pretty busy reception all the time. Bedroom in a moderate state of decay. Need some renovation especially bathrooms. Good location",
      "rate": 3.0,
      "tripDate": " May 2023"
    },
    {
      "title": "Convenient but",
      "text": "the street noise coming the open window in warm weather will bounce around in your small room, making you wish the walls were lined with rubber.  Late night brings no relief. Do not leave your ear plugs at home.",
      "rate": 2.0,
      "tripDate": " June 2002"
    },
    {
      "title": "Awful",
      "text": "It was the worst experience of my life. I misclicked the wrong dates to make my reservation and right after I called the hotel to change the dates explaining them the situation. I just wanted to switch the dates, not to cancel or decrease the number of days and I was willing to pay the difference in price; they just didn't let me do it. I called booking and the hotel several times but the hotel was inflexible although there was availability for my desired dates, they wanted to charge me twice, the stay with the wrong dates and the \"new one\" so I lost my money. Totally inadvisable.",
      "rate": 1.0,
      "tripDate": " April 2023"
    },
    {
      "title": "pest-infested, unhygienic",
      "text": "I am a student living at Neill-Wycik year-round and have been here for almost 2 years. The building is infested with mice and bedbugs and I would NOT recommend staying here. I moved units last year because my roommate was getting bitten so badly by bedbugs and had mice constantly running through her vent. She eventually got fed up and moved out of the building. I have discovered that the unit I am now in has mice as well. I have set traps in my room and have had to dispose of dead mice and have even seen, not one, but TWO mice running around my room at the same time! It was disgusting. I cannot seem to get rid of them, as they constantly keep me up at night. The common areas in the unit (kitchen and bathrooms) were filthy from the last people so I had to clean them myself when I moved in. I imagine they do clean them to some extent for the hotel guests, but trust me that even though the unit may LOOK clean, there are pests lurking. If bedbugs find their way into your belongings, they can be transported and eventually infest your home. Unfortunately, I will likely have to stay here until I am finished school and can afford to find a better place to live.",
      "rate": 1.0,
      "tripDate": " April 2005"
    },
    {
      "title": "Appalling!",
      "text": "I stayed at the Neill Wycik College Hotel for one night because the price was decent ($30 each person) and according to other hostel websites, it received great reviews.I was very very disgusted by the fact that as soon as I opened the door to the room, the beds were unmade! Therefore, there were no clean bedsheets!! Reading the blue card which contained the FAQs of Neill Wycik, if you read carefully, there is a phrase that's stated \"linen is changed every three days\". Oh my....how Gross!!! We also found soiled towels left hanging there. According to the blue card, if you want clean towels, just place the soiled ones outside the room door. They were never picked up. Where is Housekeeping???No clean towels and no clean bedsheets. Not a pleasant start. On each floor, there are 2 bathrooms which looked moderately clean. As for the shower stall, to my horror, the shower heads were not working!! In order to wash yourself, you would have to squat underneath the water spout and splash yourself with water!! Be prepared to bring a large basin to with you if you want a proper shower. The few good notes include a free continental breakfast (I didn't take advantage of it because I wanted to get out quickly) and an upgrade to a hot breakfast for $1 or $2. Security was good at nighttime. The place is quiet (depending on your neighbours) but mostly, the stay was unpleasant.You should note that the check in time is 4:00 pm which is not normal considering most accomodations have a check in time after lunch. Check out time is 10:00 am which is abnormal too. If you want to stay in a hostel in Toronto, go to the Grange Apartment Hotel. At least you will get clean linen, clean towels, a kitchenette, and a tv in your room.",
      "rate": 1.0,
      "tripDate": " August 2005"
    },
    {
      "title": "just absolutely a disgusting place to stay!",
      "text": "Don't stay here, it is beyond disgusting! I rented a room for four months during my internship and if I had seen the place before I would never have chosen it! The room was so dirty when I arrived, like no one had cleaned it for years! I had a mouse in my room and when I went to complain about it, the staffs reaction was just \"Oh, well do you want a mousetrap?\".The mattress was really old and had lost its suspension so that the bed was really uneven and uncomfortable sleeping in, nevertheless the windows that were so thin that the temperature inside the room was the same as outside. I was literally freezing every night and had to sleep with my winter coat on for the first few night before i bough a blanket for myself. I didn't get any sleep, especially during the weekends because of the student parties so it was really nice to go to work and school every morning feeling too tired. The only good thing about this place is the location! but there are other better places around the area as well, if you just keep searching! I wouldn't mind paying a few hundred dollars extra for a clean mouse free room.",
      "rate": 1.0,
      "tripDate": " January 2013"
    },
    {
      "title": "Cheap and downtown",
      "text": "Just stayed at Neill-Wycik for my summer vacation. It was cheap, and located right downtown. It's not luxurious by any means, but if you want to save money, its ideal. Breakfast was also good and cheap (a buck to have a hot breaky!). Recommended if you want to save some money and still be downtown in Toronto.",
      "rate": 4.0,
      "tripDate": " June 2005"
    },
    {
      "title": "Great value for the price",
      "text": "Neill Wycik is a college dorm which rents out rooms in the summer for tourists.  Do not expect anything other than a place to sleep.  The price is in the $40 range, as opposed to regular hotel rooms in downtown Toronto in the $250 range.   You get what you pay for - basic places to sleep and shared washrooms.None the less, this is where I stay in Toronto in the summer and I highly recommend that any person who can accept this basicl style of accomodation choose Neill Wycik.  Sleep well and use the cash you saved to enjoy the hours when you are awake.",
      "rate": 4.0,
      "tripDate": null
    },
    {
      "title": "Worst place I've ever stayed",
      "text": "Stayed here for two nights in August. The worst two nights of my life. First of all you can't check in till 4pm. When we checked in there was no parking spaces left so we had to park down the road which was a bit of an inconvenience with our suitcases and in the 30degree heat. Secondly the room was so hot and sticky. This would not be so bad if you could open the window but unfortunately the Windows only open about 1inch. One of the beds was very uncomfortable and the floor was covered with black hairs(we have ginger and blonde hair so definitely not from us). Furthermore the staff on reception are so rude and unprofessional. They weren't helpful when asking for directions and when we asked for a fan for our room we were told \"we have none left\"",
      "rate": 1.0,
      "tripDate": " August 2016"
    },
    {
      "title": "the worst hostel I have ever stay in my life",
      "text": "They should change the name from hotel to hostel but still the place will be not acceptable. Dirty rooms with old damaged furnitures, very old damaged bads. This place should be closed for the renovation.",
      "rate": 1.0,
      "tripDate": " June 2014"
    },
    {
      "title": "Low price, low quality, low cleanliness, quite well located",
      "text": "- Bed linen were dirty and there were stains on the pillow.- Bathrooms were limit cleaned.- It's poorly furnished and the quality of the bed changes between each bed.- WIFI only available in one room: \"the TV room\". The stream was pretty low- Most of the rooms have a side on the street and this could be noisy for those who have a light sleep.- Dirty kitchens and pan, saucepan are not provided.+ Well located close to downtown+ Free breakfast (3items)+ Free WIFI+ Not enpensive to compare to other accommodations=> I advise this accommodation only for a few nights, if you don't have to cook and if you want something cheap and close to downtown.",
      "rate": 2.0,
      "tripDate": " August 2012"
    },
    {
      "title": "Just dirty",
      "text": "I've only given this 'poor' instead of 'terrible' as the girl I spoke to on Reception was helpful and polite (although others seemed surly).There was a large quantity of pubic hair on the bathroom floor which remained there for the duration of my stay.  The fridge was growing things.  My bedroom was coated in dust.  There was dry rot on one of the floors.  My first room stank of beer as guests in two other rooms in the apartment had dumped all their stuff including about 50 empty beer cans and other rubbish into the middle of their rooms and left the doors open.  I was moved to a flat where conditions were a bit better but still dirty.  They need to employ cleaners and it would be fine (if its not too hot as there's no a/c).",
      "rate": 2.0,
      "tripDate": " August 2012"
    },
    {
      "title": "Good value with an excellent location to Toronto city centre",
      "text": "I would firstly like to say that the hotel was fantastic value for money. It was clean, the staff extremely friendly and the location second to none. For those people who complained, I can only suspect that they were in a minority. I found that the rooms were kept clean, and that the communal bathrooms, as a whole, were spotless. When looking for places to book, the hotel made it more than clear that bathroom facilities were shared, and that breakfast gave you a choice of 3 items from a generous selection of products. I for one never found breakfast items to be stale as other reviews have suggested! I personally felt that the description the hotel gave itself was honest and accurate. There are no frills here, but it is comfortable and clean, and for those who only wish to use their hotel as a base and want to spend the rest of their time exploring and uncovering the huge and diverese city of Toronto then its perfect. For the people who like to spend all their time in a hotel, then possibly give it a miss and book somewhere that caters to such needs. I for one had a fantastic time, and would like to thank the staff at the hotel for all their hard work. Also, the views from the top floor are something you'd pay a fortune for! All in all, to say the hotel is used as a student residence the majority of the time, I would say the place is a bargain for those on a budget due to its cleanliness and location., I will certainly be staying again should I find myself in Toronto.",
      "rate": 4.0,
      "tripDate": " June 2012"
    },
    {
      "title": "The location and value made for a great stay",
      "text": "Myself and my partner have just returned from a stay at the Neill-Wycik Hotel, and we were totally happy with what we recieved for the money we paid. The total cost for the accomodation was £335, roughly £20 per night each. The location is the real winner here. The hotel is a 5 minute walk from Yonge Street, Toronto's busiest thoroughfare with all the shops and restaurants you could want. For the price we paid, the location really was the stand out feature. The rooms themselves were fairly small and could do with air conditioning, as the hotel gets quite warm in the summer months. We were greeted with a very good fan however which did a decent job of keeping our room fairly cool. The beds were comfortable and aside from a few marks on the wall (which can be explained by the buildings use as a student residence in term time) the room, bathroom and kitchens were very clean. 5 private rooms shared 2 bathrooms and a kitchen, which we found was useful and the right amount of people to share with. The hotel offers free Wi-Fi in its cafe and on the 22nd floor in its internet room. Both are fairly slow but are adequate for some simple web browsing or for catching up with email, particularly as it is free. The 23rd floor roof deck is spectacular, with fantastic views across Downtown Toronto. We regularly sat up on the roof to enjoy the views. Breakfast is included in the price, another of the best qualities about this hotel. Guests can choose 3 food items and a drink, and every morning we were satisfied with it. The food is tasty and the staff were always friendly. Bagels, Toast, 4 or 5 different varities of cereal, muffins, croissants and donuts were to be found, as well as juices, water, soft drinks, tea, coffee and hot chocolate. The food was nice and saves a lot of money in a city where things can be quite expensive. Toronto itself is packed with things to do, we had a great time. This hotel is best suited to those looking for a good value base in which to explore the city. The location, breakfast and comfortable beds made for a very satisfying stay.",
      "rate": 4.0,
      "tripDate": " June 2012"
    },
    {
      "title": "Great Value for a Toronto Backpackers",
      "text": "This is a Backpackers NOT a Hotel during the summer, it is a College Dorm for Ryerson Univ during the school year. The two of us were in a room for four (single beds not bunk beds) with lockers and desks but no TV, which we had to ourselves during our stay.  It was part of a unit off the main corridor that has four other rooms of various sizes, two toilets/showers and a kitchen/lounge.  Some people complain that the facilities are not like a hotel, but I wonder what they expect for the price in downtown Toronto.  The price is great value, the bathrooms are clean, having access to a fridge and a stove is very useful.  The breakfast included in our price was very good. Like most of downtown Toronto the parking situation is pretty dire, but manageable, lots nearby are fairly expensive, the problem with street parking is that side streets (east on Gerrard, between Sherbourne and Parliament) are free during the day but residents permits only overnight while main streets are pay during the day but free overnight, so you have to switch your spot in the evening and again in the morning if you want to do it for free without getting a parking ticket.  There are not many supermarkets downtown but the two nearest are Gerrard & Parliament and in the basement of College Park at Yonge & College.",
      "rate": 4.0,
      "tripDate": " June 2011"
    },
    {
      "title": "Too expensive for nothing to offer",
      "text": "I stayed only one night (luckily), but I will never return. There are no rooms with private bathroom and this is not specified at the hotel site when you booking! The common bathrooms are really small, the room itself is very small with no closet, no phone working and they give you a small single towel, not even two (maybe no one showers!).The night I stayed there was a fire alarm, the fire buzzer started to whistle and we didn't know why! Only after 5 or 10 minutes, someone asked to evacuate the building! Fortunately, nothing happened!The unique positive point was the breakfast, with juice, fruits, jelly, cheese, milk and  coffee (even if an awful water for a brasilian!).",
      "rate": 1.0,
      "tripDate": " June 2011"
    },
    {
      "title": "The biggest mistake... DO NOT STAY HERE.",
      "text": "While this place may seem like it has great prices, some of the craziest policies you will have ever seen in your life, the agreement they make you sign gives them complete control to invade your privacy and harass you at any time, which these people will do, on a constant basis. This place is the biggest scam I have ever been involved with and have been harassed so much by this establishment that I had to leave a month early, and to no surprise was fined for that as well! The rooms are no bigger than any other dorm, and while the location may be good that really is the only thing going for this place. I seriously recommend you reconsider your choice as you will almost absolutely not enjoy your stay here.",
      "rate": 1.0,
      "tripDate": " June 2011"
    },
    {
      "title": "Simple, Friendly and great for the Budget Concience",
      "text": "Only stayed one night, but they were very friendly, I had some problems when I first booked the room through a booking site using my visa (debit visa), I contacted them and they said it wouldn't be a problem. Got to the hotel, they were very nice simply asked for ID (standard for any hotel) and paid for the night on the spot. They informed me where to find everything at the hotel. This hotel is a student co-op, during the school year, so the rooms are grouped in 4-5 bedrooms a section with 2 shared bathrooms. The room I stayed in was a single bed and desk, but for a solo traveler that wanted to see the city and not live in my hotel it was perfect.There were complaints from other Reviewers about dirty room. You must remember that these are student dorms there will be marks on the walls from things getting put on them from students. And dirty windows, yes the outside was dirty, the hotel has 22 floors, the building and windows were built in probably the 60s, in the middle of a very large city it is not easy to wash windows every day when from 22 floors up.There is a continental Breakfast that is included each morning for the length of your stay I give this place a 5 star for what it is!",
      "rate": 5.0,
      "tripDate": " June 2011"
    },
    {
      "title": "great value at Neill Wycik",
      "text": "I have stayed at Neill Wycik for one week in May for the past three years. I learned about the \"backpack hotel\" from a well known travel guide, and they were right on the money. Neill Wycik is great value. The dorm like rooms are suficiently large, and I appreciate the firm beds. Each floor has a couple of suites, each with their own common area/kitchen, and over the past several years I met at this common area/kitchen  interesting travelers from Europe, Asia, etc, with whom I shared many interesting conversations. This inn is located five minutes from subway, and less than ten minutes from the main bus depot..If there is a downside, the rooms have no air conditioner, however a portable fan is provided in the rooms. I would recommend Neill Wycik for any budget minded traveler. Randy HauserBayonne NJ USArdhauser@verizon.net",
      "rate": 4.0,
      "tripDate": " May 2007"
    },
    {
      "title": "This is not a great place, but it might be a good option...depending on...",
      "text": "I was in Toronto to stay with my brother and he was supposed to fumigate his apartment Friday, but he didn't get around too it until Sunday when I was supposed to arrive... needless to say I was not happy about that and I needed a cheap place to stay fast! Neil-Wycik was the place available that was close and reasonably priced considering how expensive Toronto has become.This place is not great. While they did me a favour in providing a roof over my head for a night, which lucky for me was the last night as a summer hotel before going back to being a college residence again the next morning. First off you share a washroom and not with another room, but with an entire corridor. I was given a quad room, but for myself which was ok. The towels and linens were clean, but I think of that as a 50/50 situation, so you never know how it could go on the next occasion. The room was clean, but hot with no A/C and I could not get the internet connection either... still in a one night bind this place came through for me.I'm giving it an average rating, but the reality is that it's closer to poor in many regards. The staff were very nice and helpful. They did their best to help and answer questions even though you could tell some of them didn't know the answers or didn't care maybe, but acted like they did so I guess it's something. While the amenities consist of soap and a towel, the place was fairly clean...mean, no bugs... that I saw and washrooms that were acceptable to most bachelor men, but likely no one else.The morning breakfast and check out was ok. The breakfast was continental. That means coffee, tea, pastries and cereal. No fruit juice, only fruit DRINK, so I passed. The coffee was ok, for free I mean, I would never pay for it though.Overall, the people were nice, they did try their best, but it's a college residence acting as a summer hotel, so keep your expectation low and you'll be fine. In a pinch it's not bad for fifty bucks for Toronto, where a hotel is over one hundred dollars on average and closer to two hundred for a nice one. If you want luxury stay at Trump Tower, it's a beauty, but cost an arm and two legs...Happy Travels.",
      "rate": 3.0,
      "tripDate": " August 2013"
    },
    {
      "title": "Terrible - Do not stay here",
      "text": "I have traveled before and stayed in hostels, but this was worse than any I've ever been in. I was not expecting luxury, but this was absurdly terrible. There is a lot within walking distance, but unfortunately that includes many unsavory neighborhoods and buildings and people. The staff is completely incompetent. There was no parking available when we got there so we had to park out on the sketchy street. Wireless internet was not reliable and not free. Breakfast was skimpy (you only get 4 items). It was unbearably hot when we got into the room. The two bed room was just a single bed room with a cot. As soon as we walked in we knew that we were going to go somewhere else for the rest of our stay. Also, this is not a bargain, we moved to a Hilton for the rest of our stay and it was actually cheaper than to stay in a tiny dirty room with no air conditioning. I have lived in many dorms and stayed in many different types of accommodations, but this was by far the worst. This is not worth the price. Seriously, when I say it was hot, I mean it was intolerable.",
      "rate": 1.0,
      "tripDate": " July 2013"
    },
    {
      "title": "AVOID AT ALL COSTS - THAT WHICH HAS BEEN SEEN CAN NOT BE UNSEEN",
      "text": "We originally booked to stay for a week but after one day booked elsewhere. Horrific place that humans should not be exposed to. The staff were rude idiot children, the rooms were tiny and very dirty, we booked a private twin room and were greeted by a single room with an extra campbed squished into the corner. Under the beds clearly hadnt been cleaned for a very long time as there were food wrappers and dust bundles covering the floor... along with 5 random hairbands dotted about the place and a stray peanut??? Underneath the widow was a delightful collection of boogeys that people have very nicely put there and the staff ever so kindly left there (I have picture evidence) the bathroom was just plain shocking... tiny dark and dirty. I felt cleaner before I went in there to coming out. Breakfast consisted of stale bagels and muffins. No Wi-Fi in the rooms, had to go to the Cafe which is reasonably clean... Overall I am disgusted that this place is allowed to operate. I wouldnt even let a childmurderer stay here!",
      "rate": 1.0,
      "tripDate": " June 2012"
    },
    {
      "title": "Pretty good when traveling on a budget",
      "text": "I liked my stay here. Staff was friendly and helpful. I've actually made a little overview video of the hotel, see the video here:http://www.bravotoday.com/?p=10I can recommend the place to budget travellers, tired of sleeping in a shared dorm room",
      "rate": 4.0,
      "tripDate": " May 2008"
    },
    {
      "title": "Value for money, well run and in ideal location",
      "text": "Stayed here for 2 weeks from end of June to 10th July. Basic but clean & comfortable.Students working there were very friendly and helpfull.Good choices for brekkie and extras for a dollar.Ideal location.Only drawback was no air conditioning.Fans could be hired at 2dollars per day. Would def stay here again.",
      "rate": 4.0,
      "tripDate": " July 2005"
    },
    {
      "title": "Wouldn't go back...",
      "text": "Non-smoking room smelled of cigarette smoke, pull-out sofa was broken & had garbage underneath it, front desk service was mediocre, advised parking included when making reservation only to be told on arrival that it was extra.  Unimpressed.  Price was decent but I'll pay extra next time to stay elsewhere.",
      "rate": 2.0,
      "tripDate": null
    },
    {
      "title": "Great value Accommodation",
      "text": "I have stayed at the Neil Wycik on two different occasions and have enjoyed it both times.The staff are very frienly and helpful, even when you arrive in the middle of the night.There are no frills, you share a kitchen and bathroom with other guests. However with the selection of restaurants in Toronto you will not go hungry. The rooms are clean, but the beds are a little bit small (although being 1.88m tall most beds are too short).It is very well located, a couple of minutes walk from Maple Leaf Gardens and College Subway, or about 10 minutes from the Eaton Centre.I have stayed at other hotels in Toronto, but this is definately the best value for money.",
      "rate": 5.0,
      "tripDate": null
    },
    {
      "title": "Agreed- worst hostel",
      "text": "Customer service extremely poor. The two bathrooms we shared with three other units were disgusting when we stayed the first night. When I brought this up with the front desk staff, they said there was no housecleaning on duty but that they would have housecleaning look after this issue first thing at 10 am the next morning. The bathrooms were cleaned the next day, however when we arrived later that night, both toilets were clogged. I was told by front desk that because housecleaning wasn't on duty, the best they could do was to provide me with a plunger. When I pointed out the fact that from a customer service point of view, it didn't make sense for me to be unclogging a toilet that I didn't clog, and that dirty bathrooms had been an issue the day before, that it was part of my fee that I paid to have useable facilities, and that it would make more sense for front desk staff to do so (there were four staff sitting around when we came in), she said she unfortunately couldn't do anything more than provide me with a plunger. It's well worth spending a bit more money to stay at a different place.",
      "rate": 1.0,
      "tripDate": " June 2017"
    },
    {
      "title": "If You have different option - stay in other place. ",
      "text": "I need something for on night. And because of location and price I choose this on. But it was mistake. In nowadays no free WiFi in room is a misunderstood. Room was very poor, dirty, bed was uncomfortable. I'm sure that cleaning service is there only once per day. So with late check-inn and early check-out I had to use dirty bathroom full of hairs of other people.View from roof terrace was nice. And breakfast was basic but OK. They charge me for late check-out  and I did it around 7:30. I reported it to them, but they require proof of my early check-out. Money back to my account but on transaction (account in different currency) I lost about 1 CAD - nothing but why I had to pay for their mistake ? No ansver when I informed them about this situation. So I don't reccomend this place. Especially that standard is not as in 1* hotel. Even hostels are better and more comfortable and friendly.",
      "rate": 1.0,
      "tripDate": " August 2016"
    },
    {
      "title": "Classic Student Housing",
      "text": "If you want to experience how Canadian students live - have to live - than stay here. it's a big complex building, staff is amazingly friendly and helpful. check out the rooftop terrace! they have parking lots as well. WiFi is not included - 4 $Cad per 24 hours",
      "rate": 3.0,
      "tripDate": " July 2014"
    },
    {
      "title": "Hmm... Please explain why???",
      "text": "Please note:  I enjoy staying in dorm rooms as an alternative to expensive hotels.  Small dings and dents don't bother me.  Worn linens are fine.  Campgrounds are great.  I, however, cannot live surrounded by garbage and hair.  Cleanliness is high on my list.My husband and I traveled to Toronto for a one night getaway.  We booked Neill-Wycik for location and value.  Our room 7x9 room was $71 tax included and FILTHY.  The bed covers and linens were covered in curly black hairs (Pubes?).  The floors were littered with hair, food wrappers, and a hygienic liner from a swimsuit.   There was a large tear in the window screen.  The room was advertized as a two bed; not true.  It was one bed and one roll-away bed. The shared bathroom (potty and shower in a closet)  was disgusting.  I could not bring myself to use the bathroom for any purpose.  The front desk staff was apologetic and radioed housekeeping right away.  When we returned three hours later, the room still had not been cleaned.  I wadded the linens up and walked down the the desk and plopped them, nasty hairs and all, and requested clean linens.  The continental breakfast was adequate to good.  However, we will NEVER stay here again.  The luggage room, hallways, elevators, etc. are disgusting.  I discounted the other reports... You live and learn.",
      "rate": 1.0,
      "tripDate": " August 2012"
    },
    {
      "title": "Disgusting, Despicable Service, Horrible overall",
      "text": "Enumerating all of the horrible aspects of Neill Wycik will take all day, but I will try to be succinct:1) Disgusting rooms - this hotel is infested by bed bugs and mice.  Some rooms, particularly the ones that have not been renovated, have also not been fumigated.  Thus, it is common to see the random mouse running around the living area on occasion.  Although management claims that there are mice in downtown Toronto, this is merely an excuse NOT to rectify the problem.  Furthermore, there are bed bugs.  In fact, word has it that a university paper recently ran a piece denouncing management's lax attitude towards bed bugs, which prompted SOME action but still did not solve the problem.  (This hotel also serves as a university residence hall).  When we stayed here, there were food remains all over our room, as well as soiled (and threadbare) sheets.  There were also dust bunnies lurking everywhere.  The washroom was also quite appalling, with rusty ceilings and showerheads.  In fact, I am surprised that universities/colleges advertise these rooms to be leased by stduents, since these rooms definitely are not habitable.2) Terrible service - when we complained about our rooms, the staff treated us rudely and in fact even had the temerity to laugh in our faces about our complaints.  3) Leakages - when we stayed, there was a light drizzle and the roof leaked.  4) The surrounding area - the area around the building is quite unsafe, with police sirens buzzing frequently and prostitutes soliciting cars.  Walking a few blocks east will lead to rather frightening encounters with neighborhood bums and derelicts.Bottom line: DO NOT STAY HERE if you do not want to damage your health or ruin your stay.  There are better budget options around Toronto that also have better locations.  We suspect that this building badly needs to be renovated, but because of management's apathy, all of the structural and hygienic problems remain unnoticed.  We can only feel sorry for the students residing here.",
      "rate": 1.0,
      "tripDate": " January 2007"
    },
    {
      "title": "Dirty and with rats",
      "text": "The worst experience of my life. The place is very dirty. I had a reservation for one month, but  I stayed for few days. I gave up staying there when I saw a rat inside my room. I Wish I had never been there...",
      "rate": 1.0,
      "tripDate": " June 2014"
    },
    {
      "title": "ABSOLUTE DUMP",
      "text": "Don't stay here! Worst place I have ever stayed in in my life and I am not the fussy type. Upon check in we were told our room was on the 16th floor in a certain block. I had booked a twin room for myself and my boyfriend. We took the dodgy lift up, found the block, first thing we noticed was that the door handle to our room was loose, we opened the door to find a tiny room with an uncomfortable basic bed and another camp bed squashed in the corner. There was no air con at all, floor was filthy. We started to unpack our things thinking we would give it a chance, ten minutes later someone rattles a key at our door and a man walks in! He said he had just been given that room. So we had to go back down and talk to the girl who laughed it off and said she gave us the wrong room. We were not impressed at all. We were then moved to a different room, on the other side, it was the same story here filthy, small, and hot. The window didn't open properly either. At The bathroom next to us, the door didn't lock, there was a mouldy shower, sink was blocked and reeked of urine. I did not want to sleep under the covers in fear of what I might have found under there. The only 'cleaning' they do is empty the bin. The one okay thing is that its location is good near the eaton centre and downtown but the street that it is on is not the safest. Yes it is cheap but you are better off staying in the cheap hotel right across the road and knowning that you are in a clean environment. Even if this place was free I would not stay here again. I cannot quite believe people have actually written good reviews for this place!! We were not looking for a fancy hotel by any means, but even as base it is absolutely disgusting, please save your money and book ANYWHERE but here!!!",
      "rate": 1.0,
      "tripDate": " July 2012"
    },
    {
      "title": "Stay away!!!",
      "text": "I am living in this horrible place as I write these words. I had to find a place to stay and quickly and this seemed to be the right choice at a time....very bad decision. THE BAD THINGS:1. NO air condition - if you arrive at summer do not stay here, it is like sauna, hot, and humid. 2. DIRTY - all the cleaning is done by the students that live here (it is a cooperative) so do not expect clean rooms, it all depends if you were lucky and you caught the guy/girl cleaning and you can ask them to clean, otherwise it is a joke. The bathrooms are cleaned once a week, the kitchens dirty and stink because they do not take out the trash every day. So you can imagine how many flies it attracts.3. NOISY - because it is hot inside the room you have to leave the window open, as a result all the downtown noise is in your room4. DOUBLE ROOMS - ARE YOU JOKING!!!! - this is the worst thing I ever saw in my life and i traveled to Europe and Middle East. To make room a double they just took out the student desk that is inside during the school time and placed a folding bed with the worst mattress you can imagine; and don't ask me what is left of the living space when you place 2 bads, you just cannot live there5. WIFI - it is a joke, one poor room on 22 floor with super slow internet, HELLO, you have 22 floors full of travelers inside who need to be in touch with people.THE GOOD 1. staff is friendly , always smiling 2. breakfast is tasty but stays the same all the time3. location - superb! you cannot compete with thatCONCLUSION: overpriced, dirty, hot and humid place run by amateurs with good location and tasty breakfastIn my book= AVOID ALL COSTS",
      "rate": 1.0,
      "tripDate": " July 2010"
    },
    {
      "title": "A Bargain, but there are drawbacks",
      "text": "The Neil Wycik is great value for money, and ideally located. However don't expect Hotel facilities. The rooms are very basic, but clean, and really only ideal for sleeping in. There is no air conditioning, which means you have to leave the window open, which means it can be very noise. On the Saturday we were there was a party opposite.A continental breakfast is included in the price which can be upgraded to a hot breakfast for one dollar, a bargain.Reception could be better, they take ages to deal with the slightest problem, which can lead to big queues on checkout.",
      "rate": 3.0,
      "tripDate": null
    },
    {
      "title": "OK, you get what you pay for.",
      "text": "We have stayed at the Neil Wycik many times. Firstly, this is not an hotel so don't expect hotel services. The reception area is clean and well staffed. Small seating area with newspapers. Always found the staff helpful and professional. Tourist info readily available. Lobby was in good shape the last time I visited (2003).Cafeteria perfectly ok for breakfast and some good deals. You may have to wait in line as there's nearly alway's school groups, but this can be fun! Rooms arranged in groups of 6 with a private corridor and two bathrooms. Simple furnishings but always found the beds comfortable. No tv. Free local calls (I think). Ask for a higher floor or a room at the back and street noise should'nt be a problem. Rooms can get hot, and depending on whose sharing the bathrooms, these can get a little dirty, but staff do their best. Location is great. 3 blocks from Younge Street. It's true, this is an inner city 'gritty' neighbourhood so you see all kinds on the street, but believe me, you get used to it. Never felt unsafe on the street but then again we come from a city.Overall, great value for money.",
      "rate": 3.0,
      "tripDate": null
    },
    {
      "title": "not comfortable at all",
      "text": "had to stay for 2 weeks for school...The room itself is very basic ( a single bed and a desk) and is in an apartment like unit that includes three other rooms. All four rooms share two bathrooms, a kitchen, and a lounge - pretty much everything  needed. NO MICROWAVE. one bathroom was right in front of my room but very dirty. Price included a towel, soap bar, and light breakfast.would not return to this hostel. would not recommend to anyone either..Freezer was disgustingly dirty and not cleaned in 2 weeks A headband was left in the corner of the shower as well as multiple bars of soap for two weeks. dirty towels left in there were not picked up. the key given to the main door of the \"apartment unit\" is the same key used to open the  private room within the unit...So now  we assume the key that opens the main room opens all the doors??????..So not much safety there.breakfast was always out of a lot food by 8 am when she went down... Otherwise there was bagel, muffin croissant, bread for toast, yogurt,an apple or orange, cereal. coffee tea juiceNo air conditioning. thank goodness we had a fan...No parking available at hotel it was fullFree Wi-Fi is only available at the ground floor lobby and 22nd floor. I had to buy the weekly Wi-Fi package for $12 to get Wi-Fi in my room Wifi  paid for in  room kicked us off every half hour while trying to do homework..Rat poison trap thing in sitting area of  unitvery old building .... had updated carpets in hallway but needs updated windows/doors etc...the desk lamp didn’t work eitherSome of the elevators were not working and the ones that do were slow and shakylocation was close to school ..front desk people were mostly friendly....as was securitychecked out a day early!",
      "rate": 2.0,
      "tripDate": " July 2016"
    },
    {
      "title": "Elsewhere",
      "text": "A 1-star hotel.  Stay elsewhere.  I paid $100 non-refundable May 28 2016.  Putrid shared bath. 3rd-rate breakfast extra. No air-conditioning (this is downtown Toronto).  Many pothead residents.  Staff think  . . . . very . . . . . slowly.. . . . parking extra.  You can do much, much better than this for $100.",
      "rate": 1.0,
      "tripDate": " May 2016"
    },
    {
      "title": "Worst Ho(s)tel I've ever been",
      "text": "The only good thing is the terrace with its view. But after staying there for a few nights, I had to change to another hostel (HI Toronto), since I definitely had enough of it. It's very dirty, not only in the bathroom with mold, but also in the common area, which is the only place where there is Wifi, and it's packed. Basically it's only a bunch of ripped, old, dirty couches in a room. My single room barely fitted a bed, a small desk and my suitcase. The neighbourhood is close to downtown, but it's not a nice neighbourhood, especially if it gets dark. If you can, stay at another place for the same price! I was happy switching to the HI Toronto and had a great time after that.",
      "rate": 1.0,
      "tripDate": " July 2013"
    }
  ]
}