{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "New Plaza Motel",
    "url": "/Hotel_Review-g155019-d1480738-Reviews-New_Plaza_Motel-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.5",
      "reviewCount": 17
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "4584 Kingston Rd",
      "addressLocality": "Toronto",
      "postalCode": "M1E 2P4",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/09/70/52/40/new-plaza-motel.jpg?w=500&h=-1&s=1"
  },
  "description": null,
  "featues": [
    "Secured parking",
    "Free High Speed Internet (WiFi)",
    "Internet",
    "Vending machine",
    "Non-smoking hotel",
    "Air conditioning",
    "Bottled water"
  ],
  "reviews": [
    {
      "title": "Canada 2017",
      "text": "We had been traveling back from the north, but had not found a room, with a on line search we chose this one.  It appears that the room had been recently updates, everything was clean and in repair.  It is a very basic type room, good beds and new bathroom.  It had a small refrigerator, which is always nice to have.  The stay also included a breakfast.Overall this is a fine place to stay on the east side of the city on a budget price.  Driving to and from is very easy.",
      "rate": 4.0,
      "tripDate": " October 2017"
    },
    {
      "title": "Simple and clean",
      "text": "Just needed an affordable place to put my head down for the night and was impressed with this motel. It is a simple and basic motel but my particular room was well kept, clean and everything I needed for a night. In fact I wouldn't hesitate to spend a couple nights. The front desk staff were very friendly as well.",
      "rate": 4.0,
      "tripDate": " May 2017"
    },
    {
      "title": "Basic but comfortable",
      "text": "Very basic ...but clean and comfortable ..new owners..in the process of renovating the motel ...very helpful ...provided with fridge..microwave..TV ...obvious we had a fairly new mattress...our room could have done with bedside tables ..small but adequate bathroom...only downside no hairdryers but can live with that..no onsite laundry facilities ..no breakfast provided ...but thicker bath towels would be nice..over all a pleasant stay..about 20 minute drive from downtown Toronto ...access to shops etc within walking distance. Owners making a good effort to improve this motel after previous owners .seems to be doing a good job ..give it a go .",
      "rate": 4.0,
      "tripDate": " June 2016"
    },
    {
      "title": "Hell Hole!",
      "text": "The worst experience we had in the Toronto area.  Owners are rude and lie to the customers.  It is a better option to stay in the back of your car than here.  Hotel is run down and smells bad.  Located in a rough area.  Overpriced.",
      "rate": 1.0,
      "tripDate": " September 2016"
    },
    {
      "title": "Horrible service",
      "text": "booked  accommodation for one week ,  They  change bed linen   , clean room and toilet once every seven days .   They do not  change towels on a daily basis , they change  towels every 2 days and you actually have to go to the front office holding dirty towels in your hand , they refuse to bring them to your room .  The management is very rude  and refused to refund me  when i decided to leave because of their poor unhygienic  service.. and even when you have dirty linen you have carry it  yourself to the front office . they  do empty garbage in your  room every day  you have to do it yourself , they say they only do it once a week ..",
      "rate": 1.0,
      "tripDate": " June 2016"
    },
    {
      "title": "Amazing, will visit again ",
      "text": "New management  and good customers  service. Felt safe  and quite. Has microwave, fridge  and tv.in room, room was clean and so as the sheets. Will go back again someday went February 1015. Check Expedia. Ca for bookings . .",
      "rate": 5.0,
      "tripDate": " November 2015"
    },
    {
      "title": "Our worst motel experience ever!",
      "text": "What we experienced was a smelly room with yellow stains on pillows, sheets and towels. ONCE A WEEK room cleaning service with NO EXTRA TOILET PAPER!!! unless you physically go to the office and ask for it.I brought up these issues to the owner's attention by phone and she hung up on me! Anything else which basically did'nt need any owner's involvement such as being close to a shopping mall or bus station was good.I would not go to this motel again and do not recommend it at all.",
      "rate": 1.0,
      "tripDate": " July 2016"
    },
    {
      "title": "Stayed 3 Times So Far",
      "text": "Exceptionally spotlessly clean motel on Kingston Rd. in the heart of the Guild matched by empathetic and warm charming service. A superb value 20 minutes flat drive to downtown. The \"classic\" rooms are older and the \"premium\" rooms are brand newly renovated. I've stayed in both and they're  both nice. Parking, breakfast, wifi and local calls are included in the rate. Restaurants, bars and shopping in walking distance. A little gem!",
      "rate": 5.0,
      "tripDate": " September 2017"
    },
    {
      "title": "Good nights sleep",
      "text": "Stayed at the motel for one night. It is currently being renovated, but my room was nicely decorated,quiet and had a nice tv with lots of clear channels. It was close to eateries,shopping,gas,and the highway. I have already booked my next stay",
      "rate": 5.0,
      "tripDate": " July 2016"
    },
    {
      "title": "Extremely poor service !",
      "text": "The tenants don't care about you. We booked a room 3 months ahead of time, made sure everything was OK before getting there, and there was no room available when we showed up ! And absolutely no solution provided ! Had the chance to peek into a ground level room. Apparently no maintenance/cleaning has been done in there for a very long time ! My advice : avoid this place !",
      "rate": 1.0,
      "tripDate": " July 2017"
    },
    {
      "title": "Itsa great place",
      "text": "Its a where nice place to stay its clean and renovated rooms I recommended to everyone Best place to stay  in that area Friendly management  in the office Its good for couples ,family, young and for older people too .We stayed for four days and its was great definitely i will go back",
      "rate": 5.0,
      "tripDate": " September 2016"
    },
    {
      "title": "Wonderful!",
      "text": "Spent 13 days here, and it was wonderful! Close to supermarkets,banks, and the busstop. Also has places to dine (try Carribean) or have breakfast close by, as well as a McDonald, Subway, Pizza Hut. The owners are very hospitable and friendly, also quite involved with their motel. The room was very clean, simple, but very functional. Fridge and microwave work perfectly. As did the airconditioning which was great, since it was very summer hot while we were there. The cabinet was big enough to store all of my clothes, and had a big mirror on top of it, perfect for when I did my hair and make up. Shower was very comfortable, always had hot water. While we were here the floors and chairs of the room were even shampoo'd, the owners clearly take very good care of their motel, and put a lot of work into it. Yet whenever we ran into them they were always so friendly, making jokes, it made us feel right at home.My biggest compliments to them, and a well deserved thank you from me and my boyfriend John; we've had an excellent stay and would definitely come back here!",
      "rate": 5.0,
      "tripDate": " May 2016"
    },
    {
      "title": "Nice, friendly family-run motel",
      "text": "This family-run establishment may be a bit far and away from the bustle of downtown Toronto but it's in a nice quiet neighborhood. The room we had was clean and had a good little fridge and a microwave, which we used a lot. The bed was really comfortable. Breakfast was included in the price and the assortment of food was a little minimal but did the job. We generally helped ourselves to the coffee and muffins. One potential downside was that there was little space to store our clothes, so we operated out of our suitcases.",
      "rate": 4.0,
      "tripDate": " July 2017"
    },
    {
      "title": "Best on Kingston Rd. ",
      "text": "This is the best motel on Kingston Road for the price...the customer service is friendly and hospitable...they provide a decent fresh breakfast every morning...the rooms are decent and clean. Location is great close to plaza strips and lots of places to eat.",
      "rate": 5.0,
      "tripDate": " August 2017"
    }
  ]
}