{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Novotel Toronto Centre",
    "url": "/Hotel_Review-g155019-d183075-Reviews-Novotel_Toronto_Centre-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.5",
      "reviewCount": 578
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "45 The Esplanade",
      "addressLocality": "Toronto",
      "postalCode": "M5E 1W2",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2c/83/af/98/exterior-view.jpg?w=500&h=-1&s=1"
  },
  "description": "The newly renovated Novotel Toronto is nestled in the historic district of Old Town Toronto. Get a glimpse into Toronto’s past strolling through cobblestone streets, enjoy a wide array of gastronomical international treats at the St. Lawrence Market or savour the flavours from myriad restaurants and pubs. Just steps from the Hockey Hall of Fame, Harbourfront and Union Station, the Novotel is 30 minutes from Pearson International Airport and 5 minutes from Billy Bishop Airport.With a European flavour, whether you are staying for business or pleasure the hotel offers a variety of services to make any stay exceptional.",
  "featues": [
    "Paid public parking on-site",
    "Free High Speed Internet (WiFi)",
    "Pool",
    "Fitness Center with Gym / Workout Room",
    "Bar / lounge",
    "Kids stay free",
    "Pets Allowed ( Dog / Pet Friendly )",
    "Taxi service",
    "Parking garage",
    "Wifi",
    "Pool / beach towels",
    "Indoor pool",
    "Heated pool",
    "Sauna",
    "Coffee shop",
    "Restaurant",
    "Breakfast available",
    "Breakfast buffet",
    "Breakfast in the room",
    "Complimentary Instant Coffee",
    "Kid-friendly buffet",
    "Snack bar",
    "Vending machine",
    "Business Center with Internet Access",
    "Conference facilities",
    "Banquet room",
    "Meeting rooms",
    "24-hour security",
    "Baggage storage",
    "Concierge",
    "Currency exchange",
    "Newspaper",
    "Non-smoking hotel",
    "Shops",
    "ATM on site",
    "24-hour check-in",
    "24-hour front desk",
    "Dry cleaning",
    "Laundry service",
    "Ironing service",
    "Soundproof rooms",
    "Air conditioning",
    "Housekeeping",
    "Safe",
    "Iron",
    "Laptop safe",
    "Refrigerator",
    "Flatscreen TV",
    "Wake-up service / alarm clock",
    "Non-smoking rooms"
  ],
  "reviews": [
    {
      "title": "Good location, nice hotel",
      "text": "The location is great, near the St-Lawrence market downtown and an easy walk to the subway and downtown attractions. There is also a Metro supermarket on Front street where you can get groceries to keep in the small fridge provided in each room.During these pandemic times, the pool and the gym are closed and there is no housekeeping. I find even after the pandemic they can offer the option to forget the housekeeping to save costs, help the environment and also to avoid having to leave the room to let housekeeping in.The room itself was very quiet on the 9th floor, newly renovated with \"engineered\" wooden floor, a large TV and very clean.The only annoying thing was the parking: I was told at reception to park in the indoor parking just behind and pay them directly. When I got there signs all over told Novotel guests to register and pay at the reception and some guy came screaming at me that I would get a huge ticket if I parked there. So I go back to reception and again they say you can pay $ 33 per night here or $ 25 per night directly with them, so went back to the parking and paid 4 nights directly at the machine. I think it may be that at $ 33 per night you get in and out privileges, but at $ 25 per night not ( of course you can always pay one night at a time). A suggestion to the hotel: post on your site and at reception clear signs of the options available, their costs and the location of the parking, it would be most helpful!Other than the parking confusion, I'd stay there again hoping the situation in the future will allow the pool to open.",
      "rate": 4.0,
      "tripDate": " August 2020"
    },
    {
      "title": "Great Location for Safe Summer Getaway",
      "text": "The Novtel is located in the St. Lawrence Market district and is a great place for walking around downtown Toronto.  The staff are welcoming and friendly.  The only consideration is that they should advise at check-in that the rooms will NOT be cleaned for the duration of your stay unless you stay longer than 4 days.  Their COVID cleaning only kicks in after a 4 day stay which means your garbage is not emptied (unless you leave it outside your door) nor will you get fresh towels, unless you go to reception to request them.  None of this is a problem but it would have been nice to know at check-in to manage the stay.",
      "rate": 4.0,
      "tripDate": " July 2020"
    },
    {
      "title": "Fantastic New Years Eve !",
      "text": "I recently stayed with my family for one night stay for a fun New Year’s Eve ! The hotel’s location is excellent. We parked our car at the parking garage immediately behind the hotel ($$$) but the great location afforded us to walk everywhere. The subway is a 2 minute walk to union station, which got us to Eaton Centre quickly. There is great coffee and restaurants around the corner on Front street. There are some nice restaurants as well right on the Esplanade. We didn’t get a chance to visit St Lawrence Market or Hot House Cafe but that’s only a 10 minute walk across Front street. We used the indoor path from Union Station which took us CN Tower and the Aquarium (20 minutes). Check in was quick and easy. The room was modern and very spacious and clean. We had a room facing the Esplanade  and the view wasn’t great but that’s ok as the hotel location well made up for it. For breakfast the hotel restaurant looked very nice but we opted for Mövenpick Marché on Yonge street (10 minute walk) which was fantastic!!  Overall, loved this hotel and will definitely return!",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Not overly impressed",
      "text": "The hotel is in a great location for attractions in the downtown core - plenty of dining option around as well.  overall the hotel lobby is nice, but the staff are incredibly inattentive, and rude.  the rooms are nice, but every time i stay here, i get a room looking into the parking garage.  the rooms are modern with large television and large shower and they are generally pretty well cleaned.  for the price, its a nice hotel, but nothing really over the top that makes you want to come back every-time except the location.",
      "rate": 3.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Great stay",
      "text": "Upon check-in, I received two bottles of water, gratis. That is a nice touch! Room was clean, quiet and modern with nice furniture including a couch. There was a quiet fridge as well as a housecoat with slippers and toiletries. Note: the coconut soap didn’t agree with my skin as it started to peel. I was on the south side (stare across to other building). Bed was comfortable and central air made all the difference in terms of getting an undisturbed sleep and having a comfortable temperature in the room. Note: If your hotel uses air conditioners in the windows it can be noisy enough to disturb your sleep. Novotel has sealed windows and central air.I stayed in August, which was a good time because the hotel was not busy and their restaurant was open. Novotel staff accommodated my requests for food from their restaurant and packages being delivered to my door during self-isolation. I appreciate it that they did not charge extra for this service. The restaurant’s fish and chips were good. I would recommend this hotel and would consider staying their again. As well, the location is superb with the restaurants, shops, downtown core and Harbour Front within a short walking distance.",
      "rate": 4.0,
      "tripDate": " August 2020"
    },
    {
      "title": "Downtown Toronto Stay",
      "text": "We havent stayed at the Novetel for a few years, but business brought us into town.We where greeted as regular customers, and recognized by some of the staff !!!Our room was exceptionally comfortable, updated, and couldnt ask for anything better.We ordered from the take-out menu, and where allowed to eat in the lobby by the fireplace, so that made up for the Covid restrictions, also, our server gave us REAL silverware with our meal..??BonusBreakfast, again was a take out, and when we went to pick it up Merick, Greeted us with such Gusto, He said it was so nice to see a Regular Customer,Thank You Merick !!",
      "rate": 5.0,
      "tripDate": " October 2020"
    },
    {
      "title": "Business trip with family",
      "text": "Family came with me on a business trip. We ended up staying here after a miscommunication about a tentative reservation at another sister hotel nearby on Queen's Quay. They had a room for us at 9pm and were helpful right away at getting us settled. I was surprised by how upscale the hotel lobby and rooms were. The rooms are pleasant and the rainforest shower was great after the long travel with children and the other hotel mix up. It was close to the Convention Centre, and you can use the heated walkway from Union Station so most of the walk is indoors. Restaurants nearby are a bit scarce. The hotel restaurant serves a pleasant breakfast, comparable with the Eggspectations across the street. The pool and hot tub are good hut I found the pool a bit cold. Fitness centre is what you would expect. There is a little tuck shop by the front desk and they will add your purchases to the room. All in all quite nice.",
      "rate": 4.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Farm Boy",
      "text": "Overall this property is great, easy access, good parking, well maintained and good Covid 19 best practices.I wish hotel kitchen had easier access and better options then 4  items during covid.Elevator Hand Sanitizer is often empty.",
      "rate": 4.0,
      "tripDate": " November 2020"
    },
    {
      "title": "Best hotel experience I've had in years",
      "text": "This hotel was a pleasant surprise. I don't recall ever staying at a Novotel property, so we took a risk based on the reviews here and it definitely paid off. The hotel was very quiet other than the usual city street noise. I usually request a room on the top floor of hotels so I can avoid hearing other people's footsteps while trying to rest. However, I was not on the top floor and never heard other guests other than the occasional closing/opening of doors. I also usually request a clean set of sheets at every hotel so that I can re-make the bed because someone else's hair is always in the bed. Not the case with this hotel! My sheets were actually changed and clean upon check-in. I don't know the young lady's name, but whoever was doing housekeeping on the 8th floor in early July is a GEM. Thank you for providing superior service! The hotel restaurant also has great service which we enjoyed for both breakfast and happy hour. Try the cauliflower tacos - they were the best thing we ate in Toronto! Location is excellent. We didn't have to walk or Uber far for everything we planned to do. Front desk staff was very attentive and pleasant even when busy. This experience was a huge win all around!",
      "rate": 5.0,
      "tripDate": " July 2023"
    },
    {
      "title": "Great location August 2020",
      "text": "Our family of four stayed for four nights. The location is fantastic, across the road are great restaurants. We loved the Old Spaghetti factory. It has a great menu and if you eat inside, the decor is quite quirky. Attractions like the CN tower and the Ripley’s aquarium are all in walking distance if you like to get some exercise while in-house facilities are closed. Don’t forget to check out on the Toronto city pass, good value attractions. Our room was renovated however still required a few improvements. We found some issues with it and got resolved within a day. Staff were always courteous and helpful. They were great actually, given the current constraints with COVID 19. Hospitality is about serving and interacting with members of the public and the restrictions and constraints limits their potential to do so, regrettably but we adapt. Unfortunately, we had people knocking next door around 3am in the mornings loud and incessantly (happened two mornings in a row!). 2nd morning I had to go down to reception to notify and staff were on the case and got resolved pretty quickly. Then we had a stranger knocking room to room and on our door at 8.30am looking for someone? What happened to their keys and how did they get to the floor if they did not have one?We enjoyed visiting Toronto, perhaps we return when things are back to normal. Thank you Paul for listening to our issues and resolving them quickly.",
      "rate": 4.0,
      "tripDate": " August 2020"
    },
    {
      "title": "Excellent location but dont take room 321 or 317",
      "text": "I enjoyed every minute of my stay in this beautiful, well located hotel.  The thing is I was allocated my first night in room 321 and next to us there is a man who from what I was told by the hotel, leaves there.... sings, has people over, speaks LOUD.  I had to change room at 1h am since the man never SHUT UP!!! He had women and men over, they were arguing, talking from 8hpm until 7ham.  I had to leave my friend in the room since she does mind the noise.  Staff was very nice and helpful and changing us room even at 1h am.  Now I can laugh about it but then I was not!.  Very clean, safe, I will go back there .",
      "rate": 4.0,
      "tripDate": " October 2020"
    },
    {
      "title": "A nice surprise",
      "text": "As you come in, the hotel style appears almost Art Deco, very stylish,  but old looking.The room I received was completely renovated with very comfortable bed and nice bedding.The bathroom had a large shower with modern accessories. Every aspect of the room is just perfect, a place for everything.The  traditional scramble   eggs, potatoes and sausages breakfast is complemented with smoothies, muslix, fruits, banana cakes, fresh croissants and blueberry scones.Well located, I would recommend to stay there !",
      "rate": 5.0,
      "tripDate": " March 2020"
    },
    {
      "title": "Spacious and clean room!",
      "text": "I stayed in this Novotel for one night. Due to the covid-19 pandemic their service was very limited. Nevertheless the staff at reception was very friendly and courteous! The room was spacious and very clean in every corner! One thing to complain is, that the night table was a bit too far away from the bed. As a member of the ALL loyalty program I could take advantage of a late check out on the day of departure. The hotel is centrally located just a few steps away from the Union Station. I would choose this hotel again in the future!",
      "rate": 5.0,
      "tripDate": " March 2020"
    },
    {
      "title": "Hidden GEM !",
      "text": "I couldnt be happier with the lovely downtown hotel. The price via Booking.com was crazy good at 129.00 CDN.  SUPER clean, I couldnt get over how immaculately clean everything was.  Bathroom amenities - larger sizes that what I see. elsewhere.  The staff were all friendly and professional, meticulous Covid-19 policies and procedures in place.  A nice surprise was the 'mouse remote control' that allows you keyboard access to the internet on the TV, perhaps I dont get out much, that was new!  ALSO, each bed has a technology station for all modern connections and one at the desk as well, but it is subtle and doesnt take away from decor.  While we understand the pool closure due to Covid-19 we will certainly back to explore the rest of the hotel in simpler (hopefully) times.  ALSO, super to close to all things downtown, without the $$$ of tired older hotels.",
      "rate": 5.0,
      "tripDate": " September 2020"
    },
    {
      "title": "Nice Hotel with great location",
      "text": "Great Location for Novotel Toronto CenterIt is walkable to Union Station.Across the hotel are restaurants like Old Spaghetti House, The Keg, and a sports bar.Walkable to Front Street where you have a grocery and more restaurants to dine.Downtown Toronto is almost walkable to everything, even chinatown. You can also walk underground with restaurants and shops at the basement, including Sephora and Decathlon.Hotel room is average. Front end staff were all accommodating and helpful.You can book UBER to and from airport. Better as it's fixed price whether you have more luggages to load rather hailing a taxi that will charge additional 15 EURO for baggages.",
      "rate": 5.0,
      "tripDate": " January 2024"
    },
    {
      "title": "Adequate, unless you decide to eat here…",
      "text": "Three nights at the start of a Canada/Alaska holiday then one last night before flying home, this hotel is ideally situated within 15 minutes walk of Union Station (a 25 minute train journey from the airport) and for the main Downtown sights. The rooms were pretty basic but functional and clean, fine for overnight stays but not so great if Toronto is your sole destination; not a place you could relax and spend time in.On our last night here we decided to dine in the hotel cafe/restaurant and boy was that a mistake! Terrible food, terrible service but still up there with Toronto’s relentless overcharging so I wish we’d just gone out to a proper restaurant.I’d say 3.5 stars in truth, 4 if you are lucky enough not to dine here.",
      "rate": 4.0,
      "tripDate": " May 2024"
    },
    {
      "title": "Modern Chic Lodging in Toronto Centre",
      "text": "I stayed at the Novotel Toronto Centre for a business trip, and I was extremely impressed by the quality and service of this hotel. The location is excellent, close to many attractions and public transportation. The hotel is modern and clean, with stylish decor and a cozy atmosphere. The room was spacious and comfortable, with a cappuccino machine and a flat-screen TV. The bathroom was spotless and well-equipped. The staff was kind and friendly, always ready to help and accommodate my needs. They fixed a broken item in my room before I noticed it, and they greeted me warmly every time I saw them. The GM, Frank, even checked on me on my last day and thanked me for choosing Novotel. I felt very welcome and appreciated by the staff.The hotel also has a nice pool, a fitness center, and a restaurant that serves delicious food and drinks. I enjoyed the breakfast buffet, which had various options and fresh ingredients. I also liked the happy hour, which offered great deals and tasty cocktails. The restaurant staff was attentive and courteous, ensuring I had everything I needed.I had a wonderful stay at the Novotel Toronto Centre, and I would highly recommend it to anyone looking for a comfortable and convenient hotel in Toronto. It is a great value for money and a great choice for business or leisure travelers. I would definitely stay here again if I came back to Toronto.",
      "rate": 5.0,
      "tripDate": " August 2023"
    },
    {
      "title": "Renovations have so many mistakes. Staff did not care.",
      "text": "The website boasts that all rooms were recently renovated and my reservation even confirmed I had a renovated room. Extremely disappointing as there were so many problem. Worst part was the bathroom which certainly did not match any photos from their website. The toilet was in an awkward position up against the door. There was no shelf anywhere in the bathroom (or in shower) for toiletries and the sink was installed in a downward slant so even the tiny space around the sink couldn’t be used because everything slipped off to the floor. I placed a cup of water by the sink and it fell to the ground. Even my toothbrush would roll off. The whole ceiling had peeling paint.In the room, other than the tiny reading lights by the bed, the only light in the room was a lamp in the far corner. The rest of the room was dark. The small coffee pot was positioned on top of the mini-fridge but there was no outlet to plug it in. The cord was so short the only place it could be plugged in was on the small bedside table, which did not seem very safe.It is my fault for not asking to change rooms but I was given a room by the elevator and ice machine and there was loud noise of people coming and going and at some point kids playing with the ice machine well past midnight.  Definitely be as far down the hallway as possible. The gym is very nice and a helpful amenity. What’s funny is the the shower in the locker room had a clear glass door. Who designed that?? Not relevant to me since I could go back to my room but it’s another example of not putting any thought into this “renovation”. I would probably not stay here again.",
      "rate": 2.0,
      "tripDate": " May 2024"
    },
    {
      "title": "Incompetent Staff, Extra Charges, Smoke Smelling Room",
      "text": "Horrible experience, paid $700 per night for a average room that smelled like smoke. Got charged an extra $600, had to fight with them to get the money back, they could not find the charge, after 40 minutes they finally found it, had no explanation as to why the mistake happened, no apology, nothing! Unbelievably incompetent and terrible customer service! Will never stay there again!",
      "rate": 1.0,
      "tripDate": " June 2023"
    },
    {
      "title": "Great Central Location",
      "text": "The hotel has a great central location that is a short walk from Union Station and also walkable to the Distillery District.  We found the hotel to be reasonably priced by Toronto standards (but with no breakfast included, as seems to be the norm in Toronto).  Staff were friendly and the hotel appeared to be well-maintained.",
      "rate": 5.0,
      "tripDate": " December 2023"
    },
    {
      "title": "Renovations have so many mistakes. Staff did not care.",
      "text": "The website boasts that all rooms were recently renovated and my reservation even confirmed I had a renovated room. Extremely disappointing as there were so many problem. Worst part was the bathroom which certainly did not match any photos from their website. The toilet was in an awkward position up against the door. There was no shelf anywhere in the bathroom (or in shower) for toiletries and the sink was installed in a downward slant so even the tiny space around the sink couldn’t be used because everything slipped off to the floor. I placed a cup of water by the sink and it fell to the ground. Even my toothbrush would roll off. The whole ceiling had peeling paint.In the room, other than the tiny reading lights by the bed, the only light in the room was a lamp in the far corner. The rest of the room was dark. The small coffee pot was positioned on top of the mini-fridge but there was no outlet to plug it in. The cord was so short the only place it could be plugged in was on the small bedside table, which did not seem very safe.It is my fault for not asking to change rooms but I was given a room by the elevator and ice machine and there was loud noise of people coming and going and at some point kids playing with the ice machine well past midnight.  Definitely be as far down the hallway as possible. The gym is very nice and a helpful amenity. What’s funny is the the shower in the locker room had a clear glass door. Who designed that?? Not relevant to me since I could go back to my room but it’s another example of not putting any thought into this “renovation”. I would probably not stay here again.",
      "rate": 2.0,
      "tripDate": " May 2024"
    },
    {
      "title": "Nice hotel. Watch out for the big groups",
      "text": "Really nice hotel. Check in was fast and easy although they ask for a $200 hold when you check in. Parking is $40 a day but right below the hotel in an underground parking lot.Rooms are nice but we had to put up with some loud teens 2 nights. Had a full university basketball team staying whilst we were there that were drunk and partying both nights, not a good look for a “upmarket” hotel. Don’t pay for anything in the hotel bar. There’s 3 bars across the road all serving food, there’s tons of places for breakfast nearby and a store next door selling drinks and snacks. And the market is only a 5 minute walk away.",
      "rate": 4.0,
      "tripDate": " April 2024"
    },
    {
      "title": "Nice centrally located hotel with good customer service",
      "text": "Good hotel in a good location. Helpful and attentive staff. The room was excellent, good size, quiet and peaceful. The double door bathroom door arrangement was a bit of a pain and felt unnecessary. Breakfast was excellent. Great choice and lovely staff. Concierge and limo service excellent. All round good stay.",
      "rate": 5.0,
      "tripDate": " April 2024"
    },
    {
      "title": "Would recommend, convenience location and great services!",
      "text": "My boyfriend and I stayed at the hotel for 5 nights and we are happy we did. It’s located very close to many things, such as a convenience store (right beside the hotel), various restaurants (a really nice steakhouse right in front, would definitely recommend), coffee shops and many attractions. We didn’t have any issues in terms of safety and staff provided great service when needed. Would surely stay there again.",
      "rate": 4.0,
      "tripDate": " March 2024"
    },
    {
      "title": "Convenient location",
      "text": "I booked Novotel due to its location. I was specifically looking for a hotel downtown and liked that it has a pool, which we ended up not using anyway! The front desk was cordial. We had a king bedroom with premium items. The bed was very uncomfortable and pillows lumpy, so we asked to change to a different room which was a slight downgrade in that it didn't have premium items in the bathroom but it was so much better. The premium/executive room bathroom door (2 doors) didn't have a lock and the two doors had space in-between. The \"less premium\" room that we moved into was more comfortable with a lock in the bathroom door. I had to push for water and amenities. When their website says complimentary water it means they have water refills on every floor. We didn't have bottles so had to really push for \"complimentary\" mineral water at least to have a bottle. The service was ok. These days there is very little difference between a 3 and 4 star. The issue with the room we moved into was loud music and street noise from Old Spaghetti House outside. I would avoid a room overlooking that. It was noisy over the weekend, and I could also hear a baby crying at odd hours of the night from another room. So I had a hard time sleeping but thankfully my kids slept better in this room. There was a breakfast buffet daily with decent options and some variations. The service was so so good here, and there is one woman who is super friendly and so nice! She had such good energy, and was a wonderful start to each morning. Overall we liked our stay here and found the hotel conveniently located to Union Station. I do recommend this but you don't need to go for an upgrade since it isn't necessarily better but you do get a higher floor, and find a quieter room.",
      "rate": 4.0,
      "tripDate": " March 2024"
    },
    {
      "title": "Amazing Customer Service And Clean Hotel",
      "text": "One of the cleanest and friendly hotel in Toronto. Very accessible to transportation and activities. Tons of restaurants in the area. Their staff is very helpful and always helped us with our requests in a timely manner. Only negative was their bathroom ceiling, paint was chipping off. We will stay again for sure.",
      "rate": 5.0,
      "tripDate": " March 2024"
    },
    {
      "title": "No accessible bathroom",
      "text": "We stayed here in order to get to an early appointment at St. Michael's hospital.   I requested an accessible room which they said they would provide.   Unfortunately the room bathroom was not accessible at all.  The toilet was about a foot away from the back wall leaving no room to maneuver a wheelchair at all.   In order to close the door you need to enter the bathroom, close the door & then sit down.  The shower was not accessible at all for someone in a wheelchair.   I asked if they had a room with a roll in shower but it was already occupied.",
      "rate": 2.0,
      "tripDate": " February 2024"
    },
    {
      "title": "Right in downtown Toronto",
      "text": "Checked into this hotel on Esplande in Toronto downtown.   It is situated right near Union station and has many things near it.   Parking was easy and ok price for the night I stayed.  Room was good and comfy bed, bathroom clean and good.   Some areas of room looked a little worn on the trim, but nonetheless not issue.   I had good sleep.   There is a bar/restaurant there, but did not use.   There is a pool and gym as well and did not use.   I would stay again.",
      "rate": 4.0,
      "tripDate": " February 2024"
    },
    {
      "title": "Good location In Toronto",
      "text": "Stayed for 2 nights  good location. Staff friendly helpful and professional. Comfortable room. Breakfast was goodA problem I had was resolved quickly and efficiently.A good location to look around Toronto close to bars and restaurants and close to train station.",
      "rate": 4.0,
      "tripDate": " February 2024"
    },
    {
      "title": "Amazing breakfast",
      "text": "Very nice hotel in a great location. Close walk to Union and to anywhere and everywhere downtown Toronto.What I really want to comment on is the breakfast buffet. While a little pricey, it was the best breakfast buffet I think I have had. The bacon was incredible and cooked to perfection, the eggs were absolutely delicious. The wonderful server provided us with carafe's of both coffee and tea, always checking to see if we needed more. I would return even just for this breakfast.I'm glad this was the hotel chosen for our trip. We will definitely be keeping it in mind if we ever need to return!",
      "rate": 5.0,
      "tripDate": " January 2024"
    }
  ]
}