{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Ode Toronto",
    "url": "/Hotel_Review-g155019-d23744167-Reviews-Ode_Toronto-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.5",
      "reviewCount": 3
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "1417 Dundas St W",
      "addressLocality": "Toronto",
      "postalCode": "M6J 1Y4",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/21/89/15/07/rooted-kitchenette.jpg?w=500&h=-1&s=1"
  },
  "description": "A place to stay on Dundas St West.",
  "featues": [
    "Street parking",
    "Free High Speed Internet (WiFi)",
    "Adults only",
    "Rooftop terrace",
    "Baggage storage",
    "Non-smoking hotel",
    "Outdoor furniture",
    "Blackout curtains",
    "Bathrobes",
    "Air conditioning",
    "Housekeeping",
    "Sofa",
    "Coffee / tea maker",
    "Flatscreen TV",
    "Walk-in shower",
    "Wardrobe / closet",
    "Private bathrooms",
    "Microwave",
    "Minibar",
    "Refrigerator",
    "Electric kettle",
    "Kitchenware",
    "Complimentary toiletries",
    "Hair dryer"
  ],
  "reviews": [
    {
      "title": "ODE IN TORONTO",
      "text": "We were going to spend 3 nights in TORONTO and had done some research on the internet to find a nice hotel.Our search led us to ODE.The neighborhood in which this establishment is located is really nice, but what we don't tell you is :1. the streetcar runs non-stop and it passes in front of this establishment making a noise and vibration that keeps you awake all night;2. there's a bar that stays open until 2 a.m. (again, it's hard to get a good night's rest when you can hear the bar's music and customers talking all the time);3. as you're in a converted cellar, your only view is of the sidewalk.Of course, these inconveniences are not mentioned at the time of booking, and no refunds are possible (except 30 days before the booking date) for a rate of CAD 400 per night.So, in order to have a good stay in TORONTO, we had no choice but to find a real, comfortable, quiet hotel...and get the hell out of there.",
      "rate": 1.0,
      "tripDate": " August 2023"
    },
    {
      "title": "Ode is like a home away from home!",
      "text": "My stay at Ode was fantastic! I wanted to stay away from the downtown core and this spot is a gem. It's in an amazing neighborhood and my room felt so cozy and like a home away from home. I really appreciated the small touches that added some lux to the room like the eye masks and robe! Erica and Tiff are so helpful and made my stay as smooth as possible. Ode will be my number one option when travelling to Toronto again.",
      "rate": 5.0,
      "tripDate": " January 2024"
    },
    {
      "title": "Hidden gem in Toronto",
      "text": "Ode is a hidden gem! You really feel like family when you stay and the hosts go that extra mile to make sure you are super well taken care of. The beds are insanely comfy and the rooms are beautifully decorated. Will definitely come back!",
      "rate": 5.0,
      "tripDate": " November 2023"
    }
  ]
}