{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Old Mill Toronto Hotel",
    "url": "/Hotel_Review-g155019-d224676-Reviews-Old_Mill_Toronto_Hotel-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.5",
      "reviewCount": 1091
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "9 Old Mill Rd",
      "addressLocality": "Toronto",
      "postalCode": "M8X 1G5",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/28/95/2d/54/exterior.jpg?w=500&h=400&s=1"
  },
  "description": "The Old Mill Toronto Hotel is the ideal location to relax, refresh and reconnect in a resort setting nestled in one of Toronto's most luxurious neighborhoods. Enjoy a romantic getaway, or indulge in our award winning Spa. This European Boutique style hotel showcases Old World Charm from early 1900's bringing timeless elegance. We look forward to welcoming you at The Old Mill Toronto Hotel.",
  "featues": [
    "Free parking",
    "Free High Speed Internet (WiFi)",
    "Fitness Center with Gym / Workout Room",
    "Bar / lounge",
    "Bicycle rental",
    "Canoeing offsite",
    "Taxi service",
    "Business Center with Internet Access",
    "Paid public parking nearby",
    "Secured parking",
    "Wifi",
    "Restaurant",
    "Breakfast available",
    "Breakfast in the room",
    "Complimentary Instant Coffee",
    "Complimentary tea",
    "Wine / champagne",
    "Patio",
    "Tennis court offsite",
    "Board games / puzzles",
    "Spa",
    "Body wrap",
    "Couples massage",
    "Facial treatments",
    "Foot bath",
    "Foot massage",
    "Full body massage",
    "Hand massage",
    "Head massage",
    "Makeup services",
    "Manicure",
    "Massage",
    "Massage chair",
    "Neck massage",
    "Pedicure",
    "Baggage storage",
    "Concierge",
    "Non-smoking hotel",
    "Sun umbrellas",
    "First aid kit",
    "Umbrella",
    "24-hour check-in",
    "24-hour front desk",
    "Private check-in / check-out",
    "Dry cleaning",
    "Laundry service",
    "Shoeshine",
    "Blackout curtains",
    "Soundproof rooms",
    "Air conditioning",
    "Desk",
    "Fireplace",
    "Coffee / tea maker",
    "Cable / satellite TV",
    "Walk-in shower",
    "Bathrobes",
    "Housekeeping",
    "Interconnected rooms available",
    "Room service",
    "Safe",
    "Seating area",
    "Sofa",
    "Telephone",
    "Wardrobe / closet",
    "Bottled water",
    "Iron",
    "Laptop safe",
    "Private bathrooms",
    "Wake-up service / alarm clock",
    "Minibar",
    "Refrigerator",
    "Flatscreen TV",
    "Radio",
    "Whirlpool bathtub",
    "Complimentary toiletries",
    "Hair dryer",
    "Bridal suite",
    "Non-smoking rooms",
    "Suites"
  ],
  "reviews": [
    {
      "title": "A Weekend Away",
      "text": "My wife and I booked a Luxury King room at The Old Mill this past weekend and were pleased with our stay overall. Our room was spacious, clean, and nicely set for us on our arrival. The bluetooth speaker beside the bed was a pleasant surprise. The TV in the room is dated and lacking any sort of smart functionality. The jacuzzi tub was wonderful. It filled quickly and was well maintained and cleaned. While a breakfast would be a nice touch, it was appreciated that the on-site Home Smith Bar offered breakfast each morning. Moreover, the Home Smith Bar provided an incredible Jazz performance both nights we stayed at the Inn. Overall, our stay was quite enjoyable. While we often stay at AirBnBs this was a nice weekend away.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Wonderful spot to spend Christmas",
      "text": "We were in town for a family Christmas and decided to stay at the Old Mill.  What a fortuitous decision!  The Inn was decorated beautifully for Christmas.  The staff were absolutely superb:  very personable and very efficient.  The only drawback was the fact that the restaurant was not serving hotel guests other than through room service or in the Home Smith Bar.  That suited our needs this time because we were having dinner with family but would not necessarily do so in the future.  I would suggest that the other arrangements be made for hotel guests because no one wants to eat at a Christmas buffet every night of a 4-day stay.",
      "rate": 5.0,
      "tripDate": " December 2019"
    },
    {
      "title": "Beautiful, comfortable but expensive",
      "text": "My family and I decided to try out this hotel when we stayed in Toronto for an event. All of the employees were absolutely lovely from the front desk to the spa. I had asked if they could find me a town car for a ride and they called one, got me a price estimate and called it up to me in my room. Though the car service itself wasn't great, the front desk workers were kind with making the booking and letting me know when the car had arrived. The establishment felt regal from the moment we walked in due to the well styled lobby. The bar was easy to locate as were the rooms. Incredibly quiet hotel, in the best way. I felt like I was alone most of the time which was a nice treat in comparison to some hotels. The room was beautiful, the bed was comfortable, the jacuzzi tub was a little older but still very functional. I booked spa services two weeks in advance and I'm glad I did because when I was there, it was quite busy so I imagine they book up quickly! Definitely worth the trip just to go to the spa. The day I went in, the salt chamber wasn't working and they called to let me know in advance which was very nice. They were very accommodating and kind. Very clean spa, wonderful aromas. I loved all the aspects of the room and spa services. My issues lie in the cost of everything. For breakfast currently, they are only serving food from a small room service menu. The options were fine, but they were quite expensive, as was the coffee. From what we saw in the room, even the Nespresso machine coffee cost money. It felt as though there was very little offered that was complimentary. Further, the dinner room service menu offered an eclectic variety of foods which were, again, quite expensive and not quite to my taste so I would most likely get food elsewhere next time. It is nice that they offered parking but with it being in a parking garage across the street, I advise caution when going to drop off and retrieve your car.",
      "rate": 4.0,
      "tripDate": " July 2023"
    },
    {
      "title": "Not worth the money ",
      "text": "For >$500 US dollars per day this hotel primarily capitalizes on it’s location. Quaint with a curbside appeal. The rooms are very basic with minimal amenities. Pillows and hairdryers need updating. The entire place is just dark with poor lighting.  Commode is in a corner and the door opens up into the eating/seating area. We ordered breakfast a couple of times and specified vegetarian omelette which came both times with just sautéed onions and we were told they were out of vegetables. So we just started ordering from Uber eats. On our last night (6th day), we took the chance of ordering dinner and was thoroughly disappointed. The owner needs to really address this. Incorrect menu in the room with the wrong QR code, drinks are not covered ( open to air)  when delivered to the room, pasta was inedible, pizza was mediocre. Parking is across the the street in an underground area, no valet. Blind spots to get run over with traffic from both sides getting to the parking. I was traveling with my 72 year old mother. People working at the hotel are extremely pleasant and try their best to assist, however upper management really needs to re-evaluate and update current necessities or drop the prices.",
      "rate": 3.0,
      "tripDate": " June 2023"
    },
    {
      "title": "The worst place ever",
      "text": "the worst place I've ever stayed in.  Let's start serving them as it is very bad.  I took responsibility for the damage I did not cause, so I called again to inform them that I did not cause this damage to the general manager who was supposed to be a professional that she was so rude and insulting.  I told her that I didn't cause this damage, as it might be the cleanest that her staff said they knew how to open the window!  I told her that I did not come from a village without windows or doors.  In the end she agreed to return the damage fee because she was not right and had no consent.  Look at the dirt in the photos as never before wiped.  If you guys are not busy, do not try to rape the customer by imposing additional charges on them",
      "rate": 1.0,
      "tripDate": " March 2020"
    },
    {
      "title": "Growing disappointment",
      "text": "Staff are great and the room and cleanliness are no problem however the recent changes in management have resulted in a continuing decline in service and a continuing increase in prices.   The bar hours continue to shrink, you can't get anything to eat most times without ordering very expensive room service, you can no longer park across the street, and getting an emailed receipt for you stay takes two or three calls.  And don't both asking for a late checkout, they say yes, no problem, and then they lock you out of your room!   A newspaper delivered to your door is a thing of the past.  After 20 years of going to the Old MIll it's time to shop around.",
      "rate": 2.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Beautiful rooms and location, ideal place to stay for a wedding next door",
      "text": "The Old Mill Hotel is attached to the Old Mill events center, which hosts many weddings and corporate events, etc. This review is only about the hotel, which is an attached by separately owned property. Rooms are very nice and fairly large. We had a King Suite with a spacious bedroom, a very spacious living room, and a very  large bathroom. Decor was in line with an old mill, not modern style, very comfortable but not in all cases luxurious. Although they maintain the hotel well, some of the furnishings were older in style. The location of the hotel is interesting, it's sort of an oasis of rustic elegance, modern Toronto is just steps away but you don't really see it right away. In fact, there is a subway station less than 5 minutes walk away, but again, you don't see it. Note that the hotel, while very comfy, has a small bar and room service for breakfast and dinner, but no real restaurant (though there is one next door) and the area is not really walkable in that there are not things tourists would want (food, entertainment,  shopping) without driving or taking the subway. But, if you have a car, that drive is 5-10 minutes tops). There is a (pricey) spa and a gym, but little else. Good service and beautiful surropundings.",
      "rate": 4.0,
      "tripDate": " November 2023"
    },
    {
      "title": "Great for a Girls Gettaway and Spa Time",
      "text": "My two siblings and I planned a Sisters weekend at the Old Mill and had a great time. The Spa has a wide menu of services that helped with our plans to relax!  The Old Mill has beautiful and well maintained grounds. The charming exterior definitely feels like you’re out of the city and their are many pretty views from inside and out. Adjacent to the grounds is a city park with walkways and cycle paths. We even saw a deer on our mid-afternoon walk! Bikes are available to rent from the city or Hotel. We appreciated that the room had a separate sitting area and also a jacuzzi in the spacious bathroom. We did have a plumbing issue which the hotel staff worked quickly to resolve. Parking was also hassle free right next to the Old Mill. Special thank you to Gavin and Sam at the front desk for the flexibility and assistance with anything we needed. If you’re looking for a quick girls getaway I highly recommend. Not to mention you’re a short drive from Sherway Gardens if you enjoy shopping!",
      "rate": 5.0,
      "tripDate": " July 2021"
    },
    {
      "title": "Highly recommended",
      "text": "Charming and beautiful hotel with a great location. Even though it is a little further from downtown, it was really easy to get the subway in from the green and yellow lines, and easy to get to and from the airport. The area is quiet, but the hotel is round the corner to the subway and bus station, and you can walk or take the subway along the green line along Bloor St West to restaurants (Jane, Runnymede, High Park or Ossington stations).Our room was spacious and comfortable, and included everything you would need in a hotel room (coffee machine, hairdryer, toiletries etc). We slept well and would definitely be back if we visited Toronto again. Highly recommended!",
      "rate": 5.0,
      "tripDate": " August 2023"
    },
    {
      "title": "My favorite Toronto hotel",
      "text": "I only discovered this hotel in the last year, but I wish I had sooner. Yes, it is old school with a small, discreet reception desk and limited room service, but there is so much about staying here that is old-school luxurious. The staff is genuinely friendly, kind and helpful.  The bathrooms are spacious and well appointed.  The bedrooms are certainly larger than your average European hotel room, though smaller than your average American hotel room. But the grounds are beautiful and peaceful. The underground parking garage is a welcome amenity. And you are within walking distance of a TTC stop and two lovely neighborhoods with great restaurants. Even the reading/sitting nooks in the hallways are peaceful and so comfortable. Finally, the Home Smith Pub, especially if you get Astrit behind the bar, is everything you hope for in a drinking and nibbling establishment.",
      "rate": 5.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Marvellous end to a Canadian Honeymoon...",
      "text": "When i was booking hotels for our honeymoon i wanted to end in style and the Old Mill certainly didn't disappoint! Due to a large function being held over the weekend we even got a room upgrade, which was wonderful.The staff were very friendly and helpful from the start and the room was wonderful. The bed was huge and the view out over the river was great. The bath was big and certainly help you relax after a day out in Toronto.we had a swedish Massage in the Spa and I can thoroughly recommend it! The staff are great and you can feel the knots being brkoen down during the massage, highly recommeded.The breakfasts were great and eating by the pond has to be a great way to start the day. It certainly feels like you are miles outside the city, its so quiet and restful. The afternoon teas are a delight and the waiter was very, very entertaining!The neighbourhood is great and the inn is very close to the underground and bus stations which is very helpful.Although it was expensive it certainly was worth every penny or should that be cent?! We would stay here again and have recommended it tou our friends...",
      "rate": 5.0,
      "tripDate": " June 2005"
    },
    {
      "title": "Wonderful",
      "text": "I loved the Old Mill. It was like being in the country, but having the convenience of the downtown being right there. The room was larged with king bed and jacuzzi in the bathroom. The service was wonderful. The best part was the spa. The warm stone massage was the best and the atmosphere there was really relaxing. I'd say you're wasting a trip if you miss out on the spa",
      "rate": 5.0,
      "tripDate": null
    },
    {
      "title": "Top marks for this beautiful hotel",
      "text": "I have to rave about this hotel!  We had recently stayed at the Park Hyatt and it didn't hold a candle to the Old Mill.  Our children booked us a room at the Old Mill for our 25th Anniversary.  What a stunning place!  The room was gorgeous with a two person jacuzzi tub, great stereo system ad an ultra comfortable bed.  The neighbourhood is lovely, we took a pleasant walk along the Humber River.  The next morning we had brunch in the dining room, it featured lobster, shrimp and lots of delicious goodies.  All and all it is a very luxurious place.",
      "rate": 5.0,
      "tripDate": null
    },
    {
      "title": "A Stunning Hotel",
      "text": "It is unfortunate that such a wonderful hotel would receive such a bad review from the previous writer. Maybe he is a disgruntled past employee. I would not have discredited his story if it had not been for the flat out lie about the neighborhood. I can tell you from experience that the part about the neighborhood is totally false. The neighborhood is beautiful, upscale and pleasant. I fell in love with the surrounding architecture and I saw many women walking their dogs alone with joyous personas. The Hotel seems to be for couples (there were so many weddings there during our stay), but we went with our two children and we all loved it. The hotel room was simply the best that we had ever experience. The only hotel room that comes close is the Jacuzzi suite at the Luxor in Las Vegas. We only book top-notch hotels everywhere we go and we are avid travelers, but I am usually able to find a good deal on an upsale Hotel. My only issue with the hotel is that it was expensive, but I guess you get what you pay for and they spared no expense with the décor of the place. I thought to myself that it had to cost a lot of money to build such a spectacular place. Although I had the experienced of being upgraded to a $1,000 room in South Beach Florida, because of a reservation mishap, I had never spent $400 for a room before. Nevertheless, all things are equal, because it was the best and biggest hotel room we had ever experienced by far.",
      "rate": 5.0,
      "tripDate": null
    },
    {
      "title": "Fantastic",
      "text": "Only had the pleasure of staying here for 1 night in January 2004 for a work function. Would return in a second. The rooms are spacious and very comfortable. The ensuite bathroom (very large) is wonderful with a 2 person jacuzzi tub. The complimentary products (shampoo, lotion, etc) are amazing. The meals were great. The bar is very classy. Loved the fact that the bar has a separate enclosed cigar lounge. Only thing that could be improved upon was the temperature of the boardrooms... it was either far too warm or too chilly. Can't wait to treat myself to a room at the Old Mill once again!",
      "rate": 5.0,
      "tripDate": null
    },
    {
      "title": "Beautiful inn, wonderful spa!",
      "text": "My husband and I found this gem while looking for a hotel near Toronto. It is a short drive from the city, but the subway station is just behind the inn. Every member of the staff was very friendly and helpful, and the inn itself is gorgeous. It looksand feels like an authentic 400 year old Englsh Tudor manor, but is only a year and a half old! Excellent restaurant and bar, generous continental breakfast buffet, and a wonderful spa (I tried the Swedish massage and a reflexology treatment- heaven). I look forward to returning and highly recommend the Old Mill- especially to Anglophiles like myself.",
      "rate": 5.0,
      "tripDate": null
    },
    {
      "title": "This gem is a little gettaway from the city, in the city",
      "text": "My wife and I were actually married at the Old Mill in summer of 2005, as many are (I jokingly referred to it as \"The Old Wedding Mill\"). Jokes aside, we were so happy with the setting, the service, the ammenities and laid back but refined atmosphere that we hosted a family Christmas party there a little later in the year, staying over an extra day to luxuriate. The short story is, if you're willing to spend a little more for room and board (food, spa and room are on the pricy side), and don't need to be near any specific area of town, I'd recommend the Old Mill 100%. The surrounding neighbourhood and lands are very nice, and as you've likely read the subway train is directly behind the hotel and spa area, a 2 minute walk. The hotel, conference rooms, spa and restaurant are all in ajoined buildings and walking around and looking at all these is very interesting, which you are free to do any time. Conference/Wedding rooms keep to the same period in style but are remarkably and differently decorated. As Toronto residents we've been back for dinner since our last visit and we'll stay there again in future, no doubt about it. It isn't the very finest food I've ever tasted, nor is it the very poshest place I've ever stayed but I galdly trade these for the character Old Mill has. Besides, everything's still quite good. The place \"feels\" great, even after you've logged some serious hours there over time.",
      "rate": 4.0,
      "tripDate": " November 2005"
    },
    {
      "title": "Exceeded all my expectations",
      "text": "I stayed at the Old Mill Inn and Spa for a Business Conference in June and upon arrival, it took my breath away.  It was an old building, all done in stone and the hallways lit up by Sconces on the wall.  It reminded me of an old castle as most of our meetings were on the third floor, however we could not actually get there from the 3rd floor, we had to go to the 1st floor and take a bunch of different passageways.The room was breathtaking.  There was a switch for my fireplace, underneath my big screen TV, which I could watch from my King Size bed.  The bathroom was the best feature in my opinion.  A two-person jetted tub, a glass shower - all amenities were provided.The staff was incredibly accomodating - treated their guests like loyalty.  You could tell what the standards are there.The grounds were kept beautifully.  What a great getaway, right in the heart of Toronto.  You feel like you're in old country Europe.The only disappointing thing was that I forgot something in my room upon check-out and by the time I flew back and realized it, it was gone.  This was my fault of course but I was promised a callback and never received one.  When I called again, the housekeeping department told me they saw nothing.  This clearly means it was stolen.  I guess that is what you get for being careless...",
      "rate": 5.0,
      "tripDate": " June 2006"
    },
    {
      "title": "Quiet, convenient and comfortable",
      "text": "Others have given lots of details, just wanted to add my recommendation. If you want something in the centre of the city, this is not for you - you'll have to go for a high-rise hotel with no personality instead.  But if you want a very comfortable and peaceful place with friendly staff and a subway station just around the corner, you can't do better than this!  Highly recommended.",
      "rate": 5.0,
      "tripDate": " August 2006"
    },
    {
      "title": "Amazing Wedding at the Old Mill",
      "text": "I just had my wedding ceremony and reception at The Old Mill and I couldn't have been happier with the way things turned out!The planning was made very easy for us, thanks to the excellent catering staff, especially Sonja Kulevska. We were able to choose a very nice five course Italian menu, which incuded antipasto, dinner, dessert and a late-night sweets table. Also a five-hour open bar was included, although we had to pay for an upgraded beer package for our guests who enjoy less common ales. There's ample free parking and coat-check service for $2/coat.The ceremony was performed by a charming non-denominational minister, Rev. J. Allan Logan, who made the service very personal even though we only met once before the big day. Music was provided by Raymond Gould, the organist, and it was lovely. The chapel at the Old Mill is beautiful by candelight, although a bit dark for photography, and since it's small (seating just about 100 people) it felt very cozy and intimate.The reception was held in the Garden Room, which has access to the photo-friendly grounds. The catering staff provided excellent French service for the meal and were very courteous. The food (what I managed to eat during all the excitement) was very good and our family and friends all raved about it.We stayed in one of the luxury suites on our wedding night, and got a 50% discount because our reception was there. The suite was enormous! There were separate dining and sitting rooms along with a huge bedroom and bathroom, all elegantly decorated.The Inn staff was kind enough to let us check in early and leave late, which was very much appreciated.If you're thinking of getting married at the Old Mill, I highly recommend it. If you're going to attend a function there, you're right to look forward to it!",
      "rate": 5.0,
      "tripDate": " November 2006"
    },
    {
      "title": "A real gem, outside of the downtown core",
      "text": "I recently stayed for two nights for a work event at the hotel and loved it. The hotel is beautiful and clean, while being a throw-back to a different era (like 1800s throwback). The room was large, clean, well appointed. The bar was great, with big comfortable chairs, exposed stone walls, and a welcoming atmosphere — and thank you Astrid for the great service and laughs. Would definitely stay again despite it not being downtown (but it’s right at a subway stop that takes you down the Bloor line, with lots of interesting places to hop off and explore).",
      "rate": 5.0,
      "tripDate": " February 2023"
    },
    {
      "title": "An escape during COVID",
      "text": "The Old Mill is a grand, rambling hotel with so much character and charm.  The grounds are beautiful, the decor is charming and the service is very friendly.  They are very strict in maintaining safe COVID protocols.When we were there recently, the place was mostly empty as many people are still not traveling much.  Unfortunately, the restaurant, the patio, the bar, etc. were all closed.  This was all understandable, but inconvenient.  And room service fees were sky high.  Still, we are looking forward to returning when things open up more.",
      "rate": 4.0,
      "tripDate": " July 2021"
    },
    {
      "title": "Charming hotel",
      "text": "The Old Mill Inn is a charming property with a lot of character. During our one night stayover, we appreciated the comfortable bed, the large bathroom and the coffee maker. Yes, the décor is a bit dated but its within what you'd expect from a heritage property. Check in was easy, parking in the underground across the street is a bit of a bother but, it is what it is, besides, parking anyplace in Toronto is a pain.",
      "rate": 4.0,
      "tripDate": " January 2023"
    },
    {
      "title": "Wonderful Spa and Sunday Brunch ",
      "text": "Have visited many times and never disappointed. The serene river ravine setting is peaceful and the historic inn is beautiful. The spa is a wonderful quiet escape for friends couples or solo day treat. The Sunday brunch has always been top quality... for families, couples or friends. Highly recommend.",
      "rate": 5.0,
      "tripDate": " March 2020"
    },
    {
      "title": "Dated and tired hotel",
      "text": "I stayed at the Old Mill hotel for 3 nights. The decor and furniture in the room were tired - it looked like it wasn’t updated since the 1980’s. The room smelled musty. Chairs and couch were uncomfortable. Very dim lighting. The room was dark even during the day. I was on the second floor and the trees were so dense outside my grimy windows that I couldn’t see anything. Bed was comfortable.",
      "rate": 2.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Energetic staff, tired property.",
      "text": "First off, the front desk staff was exceptional. Sasha (I think?) was terrific. ‘huff respect.However, the hotel itself is in major need of some TLC. The carpet, halls, elevators…all need to be refreshed. The rooms are equally as dated. Old TV, old carpet, terrible drapes, old shower head, hilarious whirlpool which was undoubtedly cool 30 years ago but is just a giant, tacky waste of space now.I won’t comment on the food options or menu - not their fault we are in a Covid world right now. If this place undergoes a major reno I’d try it again but until then it just didn’t work for us.",
      "rate": 3.0,
      "tripDate": " August 2021"
    },
    {
      "title": "Charming",
      "text": "Stayed here to visit my sister. Very cute hotel, lots of charm, felt very cozy. All of the staff were lovely. Pedro at the front desk was extremely helpful. Would recommend and will stay again if I am in town thank you",
      "rate": 5.0,
      "tripDate": " March 2020"
    },
    {
      "title": "Simple retreat",
      "text": "Recently stayed here for a few days on business. I really enjoyed the hospitality and the atmosphere available parking very clean rooms  very efficient. definitely recommend great for short stayss or long stays very close to all Toronto amenities.",
      "rate": 5.0,
      "tripDate": " June 2024"
    },
    {
      "title": "Classy",
      "text": "Very nice hotel. A group of us stayed one night, as we attended the annual Hungarian Helicon Ball. Our room was nice, rich in decor, and reflective of our expectations of this high quality hotel. Service was professional, attentive and friendly. The ballroom too was nice as was the tasty food served.",
      "rate": 5.0,
      "tripDate": " May 2024"
    },
    {
      "title": "Cute Room",
      "text": "We loved the room, with its relaxing tub and fireplace, and grounds! Be aware that the parking garage is far too small for a mid-sized truck; the front desk staff didn’t warn us and weren’t very sympathetic when we said we had to end up paying for parking somewhere else. Other than that, very pleasant stay!",
      "rate": 4.0,
      "tripDate": " May 2024"
    },
    {
      "title": "Simply Lovely",
      "text": "What a gem - I can only imagine even how much grander this beautiful location would be in “normal” times. The hospitality couldn’t be any better though. We highly recommend it for a local couples getaway or as a homebase for a longer visit to Toronto.",
      "rate": 5.0,
      "tripDate": " September 2020"
    },
    {
      "title": "The Best",
      "text": "Old Mill Hotel ReviewThe staff is incredibly  friendly and helpful. I was on a five day trip to Toronto with my family. It soon turned into a ten day trip when my wife became ill. The hotel staff was very accommodating and always asked about my wife with genuine concern. They were always ready to bend over backwards to accommodate us. On our last night at the hotel, after my wife was discharged from the hospital, the hotel employees sent us up a complimentary bottle of fine wine and chocolates.  The rooms are large and well furnished.  I can’t think of any reason why I would have to visit Toronto again bur, I’m going to find one so I can stay in this amazing hotel with its extraordinary staff.",
      "rate": 5.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Cozy hotel",
      "text": "Old Mill Toronto is a very cozy hotel. The atmosphere of the hotel is very nice. The rooms are nice and big (with a sitting area).Continental breakfast was included in our room rate but that was a disappointment. We received a tray in the room with some croissants. They had asked us the day before if we want coffee or tea, but we don't want that (we don't drink that). So we got no drink at all. An alternative (such as orange juice) would have been nice.The hotel is a little further from the center but Old Mill tube station is a 5-minute walk away. With the green metro line you can easily reach the center of the city.The hotel offers free covered parking. So that's definitely a plus.I would definitely stay here again.",
      "rate": 5.0,
      "tripDate": " August 2023"
    },
    {
      "title": "Tired but ok",
      "text": "Hotel is dated but comfortable. Gardens are beautiful. Meeting rooms are adequate but be advised, it’s a busy place with multiple events happening all the time. Restaurant needs improvement - food to service. Front desk is efficient. Location to Bloor and train is good. Value for money? I’m not sure - I think it’s overpriced but it was a lot better than the hotel I’d just come from in Ottawa so I was excited to have a comfortable bed and a quiet room",
      "rate": 4.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Charming Hotel",
      "text": "Spent a few days at a conference at this hotel. Room was large as was the bathroom. Bed was comfortable. Unfortunately food service was limited and breakfast was only by room service. The conference centre has several meeting rooms but it is a bit of a maze finding rooms. While the hotel is close to the river and walking path, there is not much nearby within walking distance. A car or transit is needed to get to most places. Popular place for weddings and banquets. Would not stay there on a personal trip as it was too far from the downtown core.",
      "rate": 4.0,
      "tripDate": " May 2023"
    },
    {
      "title": "Returned after 50 years!",
      "text": "We recently stayed at The Old Mill to celebrate our 50th wedding anniversary. 50 years ago we had our wedding reception there. We had a lovely room, it was very kind of Sasha to upgrade our room. The hotel is lovely, beds comfortable and enjoyed the large tub and bathroom. Thank you Sasha.We made a reservation at “The Patio” as the dining room was closed. The Patio is not owned by The Old Mill. We have to say this was disappointing, the service, the menu and the food was awful. We had checked the “open table” menu and it showed a full menu. It was a very limited bar menu. The explanation was that many guests had complained about the same thing. This was disappointing. However, no fault of “The Old Mill” Our experience there was first class.",
      "rate": 5.0,
      "tripDate": " August 2021"
    },
    {
      "title": "Nice decorations but missing amenities. ",
      "text": "Nice old lobby. Cozy rooms. Couldn't get fireplace working. Bathroom old. Plastic tub.  Workout area is a dedicated hotel room using the bedroom only. Small weight rack to 25lbs one bench and one bike.  Two people can have difficulty working out. No breakfast or coffee area. Only room service.Internet slow.  They block steaming apps",
      "rate": 2.0,
      "tripDate": " February 2023"
    },
    {
      "title": "Fabulous Inn in Bloor West",
      "text": "A charming inn in a lovely setting. Staff were helpful, and both check in and check out were efficient. Lovely, clean room.The bed was comfortable. We would have preferred a King bed, but there wasn't enough room for one. We would heartily recommend the Old Mill to anyone needing accommodation in Bloor West.",
      "rate": 5.0,
      "tripDate": " December 2023"
    },
    {
      "title": "Fabulous hotel",
      "text": "This hotel is a real hidden gem in Toronto. Super cozy, great rooms. I visited the old mi Toronto during a Valentine's Day dinner and spent the night there. Such an amazing atmosphere that catches your eyes and feelings",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "A great old-school hotel",
      "text": "This is becoming my favourite hotel to visit. Great setting, great large, high-ceiling rooms, quality of everything, service, location. Really nothing to nitpick here, and the price is reasonable, given the quality of accommodations offered. Will return every time I am in Toronto, assuming availability...",
      "rate": 5.0,
      "tripDate": " August 2021"
    }
  ]
}