{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Pan Pacific Toronto",
    "url": "/Hotel_Review-g155019-d183098-Reviews-Pan_Pacific_Toronto-Toronto_Ontario.html",
    "priceRange": "$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.0",
      "reviewCount": 186
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "900 York Mills Road",
      "addressLocality": "Toronto",
      "postalCode": "M3B 3H2",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2a/c6/5c/55/caption.jpg?w=500&h=-1&s=1"
  },
  "description": "Located in Northeast Toronto, Pan Pacific Toronto is a well-known landmark to residents in the prestigious neighborhood it calls home, with a warm and welcoming air throughout the 15 acres of scenic parkland it is nestled in. Magnificently tranquil, the hotel offers 409 generously sized guest rooms and suites, with many overlooking the lush greenery surrounding the hotel, and the cityscape beyond. Pan Pacific Toronto is close to the vibrancy of Toronto downtown, while just a 30-minute drive from Toronto Pearson International Airport. Three of Toronto's largest shopping malls, as well as the world-class Ontario Science Centre, are a 15-minute drive from the hotel. Within half an hour's drive are Canada's largest zoo and theme park - the Toronto Zoo and Canada's Wonderland. The business traveler will be minutes from their offices located in North York, Markham, Richmond Hill and the east side of Toronto. The hotel is known for its retreat-like facilities, extensive available parking and its restaurants and lounge. For relaxation, there is a seasonal outdoor pool, walking paths, a tennis court and a fitness centre. Pets are welcome too!",
  "featues": [
    "Paid private parking on-site",
    "Free High Speed Internet (WiFi)",
    "Pool",
    "Fitness Center with Gym / Workout Room",
    "Bar / lounge",
    "Badminton",
    "Tennis court",
    "Children's television networks",
    "Secured parking",
    "Wifi",
    "Paid wifi",
    "Pool / beach towels",
    "Swimming pool toys",
    "Outdoor pool",
    "Heated pool",
    "Shallow end in pool",
    "Fence around pool",
    "Fitness / spa locker rooms",
    "Sauna",
    "Coffee shop",
    "Restaurant",
    "Breakfast available",
    "Complimentary Instant Coffee",
    "Complimentary tea",
    "Kids' meals",
    "Wine / champagne",
    "Vending machine",
    "Patio",
    "Kids pool",
    "Highchairs available",
    "Pets Allowed ( Dog / Pet Friendly )",
    "Car hire",
    "Taxi service",
    "Conference facilities",
    "Banquet room",
    "Meeting rooms",
    "Facial treatments",
    "Foot bath",
    "Foot massage",
    "Full body massage",
    "Hand massage",
    "Manicure",
    "Massage",
    "Massage chair",
    "Pedicure",
    "Baggage storage",
    "Convenience store",
    "Gift shop",
    "Non-smoking hotel",
    "Outdoor fireplace",
    "Outdoor furniture",
    "Shops",
    "Sun deck",
    "Sun loungers / beach chairs",
    "Sun umbrellas",
    "ATM on site",
    "First aid kit",
    "24-hour front desk",
    "Express check-in / check-out",
    "Dry cleaning",
    "Laundry service",
    "Ironing service",
    "Allergy-free room",
    "Blackout curtains",
    "Air conditioning",
    "Desk",
    "Housekeeping",
    "Coffee / tea maker",
    "Flatscreen TV",
    "Walk-in shower",
    "Interconnected rooms available",
    "Safe",
    "Telephone",
    "Wardrobe / closet",
    "Bottled water",
    "Iron",
    "Private bathrooms",
    "Wake-up service / alarm clock",
    "Refrigerator",
    "Bath / shower",
    "Complimentary toiletries",
    "Hair dryer",
    "City view",
    "Pool view",
    "Non-smoking rooms",
    "Suites"
  ],
  "reviews": [
    {
      "title": "A little international flair in T.O.!",
      "text": "To be quite honest, I only booked a room at the Pan Pacific because of its close proximity to Sunnybrook Hospital where my wife was having surgery, and the reviews seemed pretty decent. However, “impressed” would be the word I would have to use to describe my stay here - walking into the lobby at Pan Pacific was very reminiscent of walking into some of the nicest high-end hotels in Asia.  Now, I realize that some previous reviewers have mentioned that this hotel is not up to the same standard as the previous chain that occupied the property, but one must also keep in mind that they are not paying the same price per night as they would have if it was still operated by said chain. Value for dollar, Pan Pacific is pretty hard to beat! The lobby is spectacular (if not a little eerily quiet because of COVID), the common areas are immaculate and well maintained, and the room I was given was likewise spacious, clean, and very quiet. The beds and bedding were excellent, as were the amenities in the room, even despite limitations due to COVID.  If I had to pick on anything, it would be that a few surfaces could have been more thoroughly cleaned (bathroom doors had fingerprints, desk under tv had rings from glasses of previous guest), however these were not glaring deficiencies, and I wouldn’t hesitate to book here again because of them.Long story short, if you’re looking for a nice comfortable and quiet place to stay in this very convenient neighbourhood for a reasonable price, Pan Pacific has what you’re looking for! One last word of thanks to the front desk for allowing me to check in early on the day of my wife’s surgery - those personal touches are what make this place so great.",
      "rate": 4.0,
      "tripDate": " November 2020"
    },
    {
      "title": "Hotel is ok but needs maintenance",
      "text": "The hotel looks lovely as you enter but the rooms need some TLC, like the windows needing a good clean and something to help them slide open and shut. Our TV and some electrical points weren’t working on arrival and I reported it to reception. The staff member told me to find a wall switch (unmarked and not explained at check in). Actually there was a socket fault and maintenance had to come up to fix it. Not an ideal way to spend the evening for something that should have been addressedAs others have said the lifts were slow and stopped at random floors - not helpful when you are trying to get downstairs to your taxi!We were on a room only rate so like others used the eateries just outside the hotel. The hotel is quite far out of town so its location is best for those who want to be in that area rather than downtown.",
      "rate": 3.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Services not available as advertised on website.",
      "text": "I flew into Toronto late Sunday evening after a long travel day and had selected the Pan Pacific Toronto due to location and the 24 hour room service advertised on their website.  I checked in to the hotel after 10 pm and was told they no longer offered room service and their restaurant was closed.  The only option for food was to get back into my rental car and go to the Tim Horton’s around the corner.  I understand there have been staffing issues and service cuts due to the pandemic, however there is no excuse for not keeping your website updated.  It’s not fair to your staff and it’s certainly not fair to your guests who are paying room rates that are similar to pre-pandemic rates but are not receiving services as advertised.  Room was clean and comfortable but in need of TLC.",
      "rate": 3.0,
      "tripDate": " May 2022"
    },
    {
      "title": "Amazing Experience",
      "text": "I was extremely impressed with my stay at the Pan Pacific in Toronto from the time I arrived to the time I left. When I checked in I asked if I could have a quiet room and I was upgraded to a room with a king sized bed on the 17th floor and it was indeed quiet and I had a lovely sleep on an excellent bed.  The room was clean and the bathroom was shining and spotless.  I noticed in the lobby that there was someone sweeping the carpets and checking to make sure everything was clean.  It was a most delightful stay that I had and I would highly recommend this place to anyone looking for a place to stay while in the area.",
      "rate": 5.0,
      "tripDate": " February 2023"
    },
    {
      "title": "Great customer service!",
      "text": "Flight cancelled late in the day and the guest service manager, Nathaly, helped me quickly find a room, and found a nearby laundromat to help me get my clothes washed for the next day. She helped me coordinate drop off and pick up, and ensured it was as convenient as possible for me. I will definitely return with this kind of customer service for busy business travelers.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Smoke and Mirrors",
      "text": "Upon checking in, which was extremely slow, we find out that there is a charge of 18 dollars a night for parking. We have no choice as there are no other places to park. Never advised before booking. The smoke-free hotel needs to have their noses checked as when we got to our room, it smelled like cigarettes. I am surprised that the smoke-free hotel would allot such a room to a guest. Switching rooms was not an option as the hotel was full. The TIFF was in town. Even the bellhop smelled it. The next day, at breakfast (in the hotel) I ordered poached eggs. They were prepared a new way with pieces of egg shells. After a terrible breakfast, we mentioned our gripe and said they would send a maid to our room while we were out. Upon returning with the smell still there but less, we noticed the maid never tucked in the sheets on the bed and didn't even clean the bathroom. I know this because the towels were still on the floor. The next day, I was not about to chance the breakfast even though it was included with the room rate. (at an extra cost). As days went on, the cigarette smell got weaker but that usually happens with any odor. Day of departure, I call for a bellhop to help with my bags and got the response that there were no bellhops working today. It's Monday and when I got downstairs, I saw the guy who brought my bags just standing around. Stay somewhere else and you will save 18 dollars (per night) on parking alone.",
      "rate": 1.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Not what I thought a Pan Pacific should be",
      "text": "They earned the 2 stars because the room was clean and the beds were comfortable. That's the only good thing I can say. The hotel is very old. I had a balcony that had the concrete falling apart. Most times only 1 of the 3 elevators worked. We were lined up in the lobby waiting for it. Didn't sleep well because of a loud noise that kept running on/off day and night. Woke up on our last morning to no water. The phone in the room didn't have a button for front desk or maintenance. I used my cellphone to call the front desk. We were told that maintenance wouldn't start their shift for another 30-60 minutes to look at the water issue. The whole hotel was out of water. They took 25% off the cost of one night.The luggage carts had signs on them telling us that due to covid-19, there would be hand sanitizer attached to them. There wasn't any.I won't be staying there again.",
      "rate": 2.0,
      "tripDate": " August 2020"
    },
    {
      "title": "Downhill...",
      "text": "I've stayed at this hotel a few dozen times for work over the last few years. The main draw is its proximity to our office and not necessarily its quality, but I can't say I have ever had any truly bad experiences until recently. I've stayed 4 times since the hotel became a \"Pan Pacific\" and the service has been worse each time. The first few times were just little things like lacking clean towels, the doorman refusing to call me a cab and a general lack of friendliness at the front desk. This stay it was something new... I had a long day and decided not to go out to eat. I spent 40 minutes trying to get hold of room service to order food and each time I called back the person who answered at the front desk didn't seem to think it was at all odd to have to keep putting me through even after I made it clear that nobody was answering at the other end. I also left two messages and they were not returned.",
      "rate": 2.0,
      "tripDate": " March 2020"
    },
    {
      "title": "Keyur Is The Man From The Pan!",
      "text": "I called in to inquire about a room and Mr. Keyur was kind enough to provide me with info on Pan Pacific that was enticing enough for me to be convinced that this was the perfect hotel. I was able to make my way to the hotel with no issues and went through room options to see what would best fit my accommodation needs. Mr. Keyur was very detailed in his description of the various rooms and services offered. I decided to go with his recommendation and booked a suite that was very luxurious with huge TV, comfy queen size bed, lots of work space and an awesome city view. The cleanliness and quality of the suite and the hotel's lobby makes Pan Pacific an easy choice for professionals like myself. Highly recommend. AAA+ Thank you again Mr. Keyur!",
      "rate": 5.0,
      "tripDate": " September 2020"
    },
    {
      "title": "Hossein",
      "text": "I was at Hotel in Sep/5/2020 I was very disappointed with the service and room bequest I got primer room. 1. Didn’t have any disposable cup in the room to able to drink the water not even a coffee maker not even cape covers for hair these are is minimum services each hotel has. I try to order Food services into my room for breakfast and I got very shocked 😳 they told me we don’t take orders from the phone and you have come to the lobby and request your order at dining room. Well, it doesn’t make any sense to me why why 4star hotel doesn’t have a room service very very disappointed and when I complained to the receptionist they told bequest Covid-19 we cut the services. But in my knowledge cut the services it just the excused bequest it’s NO regulation to cut those services because of the Covid-19 pandemic. Just week hotel management.Very very Disappointed 😔 #107574145",
      "rate": 2.0,
      "tripDate": " September 2020"
    },
    {
      "title": "Disappointing",
      "text": "I stayed here with my kids and husband and very disappointed. Although the rooms are clean and the location is great. The TV was not working we had a black screen for 4 days and they kept on saying working on it and pretended they would send someone yet no one came. Service staff seem like they don’t like their job and don’t care.  We paid for breakfast downstairs at Season’s and the food was expensive but meager. Strawberries looked and tasted soured over ripe perhaps left outside too long. For an  18 dollar pancake dish that comes with berries it’s not right to serve with bad soured berries. They also charge $18 per day for parking your car. Overall I’m disappointed this shouldn’t be a 4 star hotel.",
      "rate": 2.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Beautiful hotel",
      "text": "We stayed at the Pan Pacific with family for my father’s funeral.  This hotel was originally The Prince Hotel, which was a luxury hotel.  Pan Pacific which owns it now has maintained and updated the hotel to the same luxury standards.  I’ve seen negative reviews, I don’t what those people are talking about.  The lobby and the rooms are beautiful and look like they have been update.  The price is very reasonable for a 4 star hotel.  We were looking for a hotel late at night when we arrived in town, luckily the Pan Pacific had rooms available and we were greeted  by Keyur at the front desk.  He was very friendly and helpful in getting us a room and assisted us with any needs we had during our stay.  I would highly recommend the Pan Pacific if you are looking for a hotel in mid town Toronto.",
      "rate": 5.0,
      "tripDate": " March 2022"
    },
    {
      "title": "Never again!",
      "text": "I can't believe this is even a hotel to begin with. I was really thinking of giving this hotel a 5 star rating because the rooms are super updated and amazing but this hotel has so many other problems. 1st, I found hair at the bathroom. I guess it happens since maybe they don't have enough maids due to the pandemic. 2nd, One of the bathrooms lights kept flicking and was not working properly. Not a big deal. I still want to give a 5 star rating. 3rd, The floor has this major pink stain but overall my room was still super nice and I still wanted to give a 5 star rating for it's amazing size. 4th, There is no sanitation kit, Which was actually a shock because I believe every person should be provided one for everyone's safety due to covid but I still wanted to give a 5 star rating since front desk upgraded my room to a suite. The 5th and worse part of everything about this hotel is the fact I didn't get my food from my skipthedishes order. I was so hungry and they didn't let the delivery guy go up to my room or let me know in advance. I receive a call after my delivery guy already left the building. My phone was low battery and off so I wasn't sure when the delivery guy will come. This hotel used to be part of the Marriott brand and most of their hotels have no problem to let the delivery guy bring your food or they will call you to go down and pick up the food. The fact that this front desk agent calls me after my delivery guy left is the worse experience I have ever faced in this hotel. Do you not know how hungry I am. The front desk agent knew the delivery guy was waiting for over 30 minutes. Atleast call me before my delivery guy left so I could pick up the food at the lobby. This hotel is a complete joke and I will definitely not come back to this hotel after my horrible food delivery experience. Unbelievable!",
      "rate": 1.0,
      "tripDate": " August 2020"
    },
    {
      "title": "Very poor breakfast package",
      "text": "I purchased a package for a one night stay at the Pan Pacific Toronto.  I did this online through the reservation system.  In addition to the room, I purchased what was called “a buffet breakfast”, the cost of which was $100 for 3 adults.  However, on arriving for breakfast it was explained that they had no buffet.  Our breakfast package allowed each adult to order one breakfast entré and one drink choice (tea, coffee or juice).  This is not good value at all!  And is clearly false advertising.  I questioned it at the time, including a discussion with the manager, who told me that I would have to complain to headquarters since he was not in a position to help me.  And trying to complain to someone at Pan Pacific (headquartered in Singapore) is not possible unless I call during Singapore hours.  And the option to leave a voice mail message was not working.  For a large hotel chain I am surprised at the way my complaint is not being resolved.",
      "rate": 1.0,
      "tripDate": " November 2022"
    },
    {
      "title": "COVID 19, Toronto booking",
      "text": "Room was adequate, however, front desk treatment and subsequent breakfast fare were unacceptable. My wife and I, due to travel and stay restrictions, were anticipating a five star hotel experience.  Had to pay extra for parking, $18. Breakfast served in styrofoam containers, cold scrambled eggs, with dried out potatoes and toast and one coffee. No glasses or ice in room.I asked for a glass of juice; waiter stated it was $6. Unbelievable! When leaving manager told me that breakfast was being comped. Charged $23.21 for breakfast. complained to front desk day after stay and I was told MOD would call me back about over-charge. She did not. Waiting for credit at time of this report.",
      "rate": 2.0,
      "tripDate": " October 2020"
    },
    {
      "title": "Poor Customer service",
      "text": "I stayed at this hotel for the first time with my pattern as we just wanted a chill and relaxed night. check in was easy and the lobby was very modern. once we arrived into our room which was a standard suite. the room was spacious, modern and clean but I was extremely disappointed at the customer service. we tried using the television for Netflix and video and the internet was shockingly not working. we called the main lobby to assist us with this issue and he continsuouly repeated that the hotel does not have Internet for Netflix and YouTube which was terrible. we asked to be moved to a different room and hopefully the television there would work and he rudely refused. we ended up letting it be. next morning we had left over food and wanted to eat but did not have utensils so we called the main lobby asking if we could receive some utensils or if we could come down to get them I they were not able to bring it up and once again they bluntly refused giving us utensils which was strange.",
      "rate": 3.0,
      "tripDate": " December 2022"
    },
    {
      "title": "Don't stay here, choose somewhere else",
      "text": "Horrible experience.A huge hotel with over 200+ rooms and I had some patrons placed in the conjoined room beside me, there is no way that the hotel was full enough to warrant this.To top this all off this couple was so loud that they sounded like they were in my room when they were talking.Their cell phones went off throughout the night disrupting my sleep/rest and in the morning they were speaking so loud that I was abruptly woken from my sleep thinking the voices were coming from my room.I also went to get ice for my water bottle at about 11:50am -- 10 minutes before having to check check out to go back to my room and find out the key card had already been disabled.I had to go down to the front desk to get it reactivated and the employee working said this was company policy, well that's great, when it's a policy that impacts your guests you should likely inform them.The cherry on top of this bad experience was finding out I was also charged nearly $20 for parking, when you have rooms that are approx $200 per night why is it necessary to charge your overnight guests this 'extra' rate.Very bad stay and overall experience, do not stay here unless every other hotel/motel/hostel is booked in Toronto",
      "rate": 1.0,
      "tripDate": " October 2021"
    },
    {
      "title": "Excellent Property",
      "text": "I love the hotel and staff. I only wish the balcony opened all the way. Other than that, I loved the room. parking is $18/night, rooms on 3rd floor don't have access to their balcony. The location is absolutely perfect if you're driving but difficult for transit only. The building is a bit older but well maintained and has timeless interior design and furnishings/finishing.",
      "rate": 4.0,
      "tripDate": " January 2023"
    },
    {
      "title": "Comfortable Stay",
      "text": "Stayed at this hotel for 1 night for business.It’s located about 30 minutes away from Toronto airport in a relatively safe and quiet area.There are plenty of restaurants and shops within walking distance.Room was clean and comfortable and staff were friendly.Paid breakfast is available (no free).Parking is not free either as it cost $18 CAD per night.The room was spacious and was interesting in that it had a narrow walk-out balcony attached to it.  If you have kids, you should becareful.The interior of the bathroom looked new and had some nice tile, but the shower was poorly built and way too tight for an average sized person.  The room did come with a nice bathtub though, so it could be convenient for families with young kids.We chose this hotel because it was price competitively compared to other hotels in the area.  I would stay here again if I were to visit.",
      "rate": 5.0,
      "tripDate": " July 2023"
    },
    {
      "title": "Any time again",
      "text": "Very good value for dollars in all aspects. Just the bar closed too early with 23:00 in my opinion. Breakfast - I booked breakfast included - was excellent but stingy with only one drink, which in my case was coffee or orange juice.",
      "rate": 4.0,
      "tripDate": " March 2023"
    },
    {
      "title": "Under New Management & Maintenance is Slipping",
      "text": "This has been my \"go to\" hotel in Toronto for many years. Great rates, ample parking and proximity to family and friends have been the biggest selling points. Prior to the pandemic the hotel was generally well run and well maintained under the previous management, Starwood/Marriott, when it was called, Westin Prince. Since the transition to Pan Pacific I have noticed that maintenance has been slipping. I have stayed at the hotel twice since January 2022. The front automatic revolving door was barely working some of the time. For the most part, I had to manually push the very heavy door myself to get in. This problem has been clearly ongoing for at least 4 months. Hello! This is your FRONT DOOR, which is probably the first thing your guests encounter when they arrive at the hotel. Not a very good first impression.The rooms were also looking a bit sad, which is surprising because I'm pretty sure the hotel was fully renovated within the last 10 years. The drapes in my room were partially torn off the railing, so they didn't fully close at night. The toilet's flusher lever had completely fallen off the tank, making each flush of the toilet an engineering project. These are not big issues, but they are starkly visible. There is no reason why they couldn't be fixed before renting the room to a paying customer.Another thing I noticed about this management group is that they don't have an automated means of checking out of the room at the end of my stay (i.e. via the television menu or a smartphone app). We are in the 21st Century. I shouldn't have to wait in a long line in the hotel lobby to check out.I suspect that I will continue to stay at this hotel in the future, but I'm wary of the trend I have been seeing. Hopefully, the management wakes up and starts taking action on the reviews of late. Clearly I'm not the only person who has noticed the change.",
      "rate": 4.0,
      "tripDate": " May 2022"
    },
    {
      "title": "It was fine",
      "text": "This hotel was previously a Westin and this was my first time back since Covid. Not too much has changed, still just an average hotel, nothing special, just a new name. Restaurants and room service weren’t available which I’m guessing is due to low occupancy. Gym closed at 7pm! This hotel is the only one in the area so it gets a lot of business travelers. It was a ghost town compared to pre-covid. Other comments: Rooms are nice, they were renovated shortly before Marriott sold this property. Parking is expensive given the price of rooms and the area, Balcony’s are not available due to safety issues. They’ve been screwed shut for a few years now. Concrete is falling apart. Great location for those with business in the area.",
      "rate": 3.0,
      "tripDate": " November 2021"
    },
    {
      "title": "No Accommodation for for Walker",
      "text": "I needed a wheelchair accessible room, since I use a walker.I was told that, because of Covid-19, these rooms were not open to book. I was also told that  room with a walk in shower would suit my needs. Unfortunately that was not the case.There was a lip at the shower door, that I was unable to step over. Also, it took me 30 minutes to get up from the very low toilet. The bed was high and I had to work out a fix to be able to sleep. The situation was so unacceptable that I did not sleep in the hotel for the second night of my two night stay. I went to my daughters apartment and her husband slept on the couch, so that I could have his bed. I feel that there should have been a wheelchair accessible room available, since it is the law. The people who make the bookings, should not be recommending regular rooms, just to get a booking. The purpose of my stay was for a medical procedure. I did not need the extra stress of the hotel room.The hotel was clean and everything was shiny. The location was perfect for my needs. It is unfortunate that my review could not have been better.",
      "rate": 2.0,
      "tripDate": " September 2020"
    },
    {
      "title": "Gone downhill. Won’t be going back",
      "text": "I checked in to PP yesterday, hoping for a restful retreat from which to have my business meetings and then get some rest. The air conditioner was not working and the room was hot, muggy and very uncomfortable. The front desk staff switched me to another room, and the same thing happened. The staff explained that the air conditioner was not working because nobody had been in the hotel for 5 months. I’m not even sure if he meant that it was not working or that they had not switched it on. Several times he said “the whole hotel is like that.” However, they did not bother to inform us before we checked in.  We again switched to a different room, and the room was uncomfortable too. At this point we couldn’t leave and find a new hotel because we didn’t have time, and needed to be in this location. Needless to say, we slept terribly because the air was hot, and wasn’t moving. It’s also difficult to reach the front desk - when I called, I was transferred to a line that was not answered several times. I have been to this hotel several times and usually recommend it to friends. I definitely will not recommend it again and will tell people not to go there. I was planning to have a “staycation” in the near future, but now I’m disappointed that I paid money for this. I loved this place when it was the Westin and even hosted my mom’s birthday party there, but now you have definitely lost me as a customer.",
      "rate": 1.0,
      "tripDate": " July 2020"
    },
    {
      "title": "Covid no excuse",
      "text": "Very nice hotel, and they state they are in reopening stages, yet much is lacking after 3 weeks!  Automatic doors not working - too hard to push revolving door.  Not all elevators are running, therefore people are standing and waiting at lower floors as only four allowed in at a time - my 71 year old mother and I had to walk down 3 flights of stairs after waiting 20 minutes.  There was no ice bucket in room (asked twice), ice machine on 3rd floor broken \"check 11 or 16th floor!!  We only received one facecloth and wifi was horrible with only intermittent service.  Rooms and hotel were clean.  I needed somewhere close to Sunnybrook hospital.",
      "rate": 2.0,
      "tripDate": " September 2021"
    },
    {
      "title": "Pan Pacific - Toronto\r",
      "text": "We had to change room twice. When we arrived in our room, the TV screen was broken and the heater didn't work. During our stay, our other room's door lock ran out of battery so we had to change room again. We waited 45 minutes in pyjamas with our dog in the lobby before they realised we had to change rooms.A receptionist treated us like kids when we had problems and straight up lied to us to make us leave the lobby. The pools were all closed indefinetly and it wasn't advertised on the website.When we asked for our receipt at the check-out, they charged us 10% more instead of the 10% discount we were supposed to get. I did the math in front of the desk but the employee couldn't understand. Getting out of the parking was always tedious, we usually waited 5 - 10 minutes at the gate because they were always re-registrating our licence plate even though parking was included with our deal.",
      "rate": 2.0,
      "tripDate": " April 2022"
    },
    {
      "title": "Stay Away",
      "text": "Even though during the booking process we talked to the front desk we were never made aware the restaurant, bar, room service, gift shop, pool etc. were not open.  We were in Toronto for a family event and 6 rooms in total were rented for the family members, none of which knew that nothing was open until arrival.  We along with one other family flew in from BC and staying at the hotel, using restaurant, bar and pool was integral part for our children and ourselves.  We would never had booked had we known how we known there were no services at the hotel.  We know the property very well having grown up in the area and staying there multiple times over 30+ years.  Our stays being satisfactory in the past.  From the dirty windows, to the horrible state of the landscaping to the lack of services this hotel should clearly not be open at this time.  At the least it should be made abundantly clear as to what the hotel has to offer at time of booking.  When asked for compensation at time of checking out is was offered one free night of parking.  Totally unacceptable.  The stay at the Pan Pacific Toronto, ruined of family reunion, a much anticipated event being the first time together since the start of Covid.",
      "rate": 1.0,
      "tripDate": " September 2021"
    },
    {
      "title": "Awful Experience",
      "text": "Reno home,needed place to stay 2 weeks.Check in was rough,impatient,rush,aggressive, got a room without heater on  and smell like room never been used,requested for a new room,\"was told I get what I paid( long stay discounted).if you want higher floor you need to pay more money\". next day asked more water was told  don't waste his time because he is busy and has things to do.asked more shampoo and conditioners was told I can grab them with me on the way to dinner... Really!!! where is 4 star hotel qualification came from.. asking to talk to manager no where to find one.",
      "rate": 1.0,
      "tripDate": " March 2022"
    },
    {
      "title": "Great stay and excellent customer service",
      "text": "I arrived late from London, the first room didn’t have a walk in shower I called reception and Omar was quick to resolve my concerns and offered me a free upgrade into room 2005 (thanks Omar).  The layout was nice and a very comfortable room.   I could even see the CN Tower from my window.  Anytime I called reception they were quick and very responsive very good customer experience!  Both the doormen were courteous and positive.  Thank you for a great 4 days at your hotel.",
      "rate": 5.0,
      "tripDate": " March 2020"
    },
    {
      "title": "Will never return",
      "text": "I have stayed at this property many times in the last year but my last experience here was the one that will make me never return to this property. First off as a Platinum member here which clearly means nothing to this hotel by the way I was treated. The room next to me partied all night until the morning, I had a 3 PM check out but the front desk clerk didn’t note that so I got a phone call asking if I was staying another night ok no big deal, but I was charged a $250 smoking charge when my partner and I don’t smoke. I called the hotel and they told me they found ashes on the table then I spoke to the manager and said they had pictures and when I received the pictures it was a picture of a bunch of cigarette butts in a cup they said it smelt like cigarettes in my room which is false information and when I said to the manager that is not what I was told when I first called the hotel. It’s not the point in the charge I got it’s the fact I’ve stayed at this property many times and the management is very rude to loyal customers. I will never return to this property again. Think twice before booking this hotel, they accuse people of false accusations.",
      "rate": 1.0,
      "tripDate": " March 2023"
    }
  ]
}