{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Pantages Hotel Toronto Centre",
    "url": "/Hotel_Review-g155019-d296493-Reviews-Pantages_Hotel_Toronto_Centre-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.0",
      "reviewCount": 1374
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "200 Victoria Street",
      "addressLocality": "Toronto",
      "postalCode": "M5B 1V8",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/28/b3/14/62/pantages-bathroom.jpg?w=500&h=400&s=1"
  },
  "description": "Amid the best dining, shopping and entertainment Toronto has to offer, sits the Pantages Hotel. Designed by world-renowned architect Moshe Safdie, the personality of the hotel is inspired by the Theatre focused neighbourhood. When traveling for business or leisure, guests can find all the very best that Canada’s largest metropolis presents.",
  "featues": [
    "Paid public parking nearby",
    "Wifi",
    "Fitness Center with Gym / Workout Room",
    "Bar / lounge",
    "Pets Allowed ( Dog / Pet Friendly )",
    "Business Center with Internet Access",
    "Conference facilities",
    "Baggage storage",
    "Paid wifi",
    "Restaurant",
    "Breakfast available",
    "Vending machine",
    "Meeting rooms",
    "Concierge",
    "Non-smoking hotel",
    "ATM on site",
    "24-hour front desk",
    "Laundry service",
    "Blackout curtains",
    "Air conditioning",
    "Desk",
    "Housekeeping",
    "Room service",
    "Coffee / tea maker",
    "Cable / satellite TV",
    "Walk-in shower",
    "Telephone",
    "Iron",
    "Private bathrooms",
    "Wake-up service / alarm clock",
    "Refrigerator",
    "Flatscreen TV",
    "On-demand movies",
    "Complimentary toiletries",
    "Hair dryer",
    "Non-smoking rooms",
    "Suites"
  ],
  "reviews": [
    {
      "title": "Excellent Stay",
      "text": "We stayed for one night at the Pantages Hotel downtown Toronto. We specifically chose this hotel based on location to the Ed Mirvish Theatre (we saw Hamilton) and price (they do a generous discount if you are attending a ticketed event during your stay - theatre, sports, etc).I debated booking with hotels.com or another cheaper site, but for the minimal price difference it made more sense to book with the hotel directly. We got a full sized kitchen/king sized suite for the same price as a smaller room with two queens, plus a late checkout.Check in/Check out with Pella was wonderful and efficient. Very pleasant and personable. Our room was very spacious and clean. There was construction nearby but that’s Toronto. There’s always construction. But on the seventeenth floor the street noise was minimal and the construction was only during daylight hours.We attended dinner at nearby Scaddabush the night of our stay but had drinks at the hotel bar/lounge after. Attentive service from Julius who was very fun to chat with. Plus, they had my favourite beer I cannot get back home.Late checkout was very appreciated - lots of time to get ready for our matinee showing of Hamilton and we left our luggage with the staff.Came back to collect our things to head home and decided to eat at the hotel first because we had such a great time the night before. Great meal - a little pricey but that’s to be expected, again because Toronto.Thanks for helping to make our stay in Toronto so pleasant. Will definitely be back again.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Great stay",
      "text": "I stayed at this hotel in Nov 2019 for a couple days. Across the street is a outside parking for 35 bucks per day with person there 24/7 watching the parking lot and only a minute walk to the hotel or you can choose the underground parking beside it as well. Check in was smooth and the room was huge which included 2 tv's a washroom with big shower. There is a restaurant close called The Senator which is a bit pricy but it is Toronto downtown and there is Shoppers not far from this hotel as well. I found the room quiet when sleeping and did go for a walk one night in the evening and had no issues. Only downside is taxis here was 50 bucks for travelling only 20 mins and this was compared to two different companies. I do recommend this hotel.",
      "rate": 5.0,
      "tripDate": " November 2019"
    },
    {
      "title": "Great hotel and staff, terrible tech options",
      "text": "Pantages is an excellently located property in downtown Toronto. There is easy walking access to everything you can imagine. Farther off things can be had by taxi or public transit The suites are well appointed, quiet, and nice places to be in. the front desk staff are friendly, professional and helpful, and housekeeping routinely goes beyond the call of duty to make things nice for you.Our experience was marred by two things: The free wifi is so slow as to be unusable;e unless you pay for a speed upgrade. We  got around that using a hotspot. The other issue with the suite are the televisions. Guests are locked out of the HDMI ports very effectively,  bringing your own remote or downloading the manual for unlock codes was unsuccessful. This wasn't a very big issue, we didn't go to watch TV, but it's nice to review your photos or use your own streaming service at the end of the day.In spite of that, we will return.  (Maybe with a micro projector ;-) ) This is an excellent way to experience the city, especially if you enjoy cooking. Get a suite with a kitchen, hit the St Lawrence Market, and make an amazing dinner for yourself.",
      "rate": 4.0,
      "tripDate": " November 2021"
    },
    {
      "title": "Disappointing",
      "text": "Having stayed at the Pantages many times over the years, we were looking forward to another positive experience. Unfortunately, it had been about 3 years since our last stay, and things have gone downhill.We were disappointed to find out upon arrival that the hotel no longer offers any parking option, including valet parking. For a family with two small children, finding parking was a bit of a hassle that we were not counting on. There was parking somewhat nearby, which was fine, but again, disappointing that the hotel no longer offers this service to its guests.We arrived at dinner time on Sunday and were surprised to learn that the hotel restaurant (including room service) is closed on Sundays. Again, disappointing and inconvenient. Also surprising, considering most weekend travellers would expect this to be available. The room was fine, though a bit dated and showing signs of wear. It was also not as well stocked as we remembered. They do have ‘kitchen boxes’ available upon request. Housekeeping staff was very helpful in advising us of this and getting a box for us. Front desk staff were not helpful and seemed wholly uninterested in assisting guests. They were not rude, but were somewhat abrupt and unfriendly. For the amount they charge for rooms here, we expected a positive experience. Though it is a convenient location, I doubt we will stay again. For families looking for something with a kitchen, the downtown Residence Inn is a much better option. For business travellers looking for convenience, they are many other better options downtown.",
      "rate": 2.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Amazing service",
      "text": "Chose the hotel because of location. We were there for 1 night to go to a musical at the Ed Mirvish Theatre. It was even closer than what it looked on the map so location was perfect.  I felt safe coming into the hotel after along with my daughter. Something that doesn’t happen everywhere.  Staff service was above and beyond what we expected or experienced at other hotels.  We required bedding for the pull out bed and they came and made the bed up and brought extra towels as well for us. Would highly recommend this location and would stay again if we are in Toronto for anything downtown.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Great hotel, great location, will definitely return.",
      "text": "My friends took me to Toronto for an appointment at St. Michaels Hospital for an appointment and we booked at the Pantage, it's great for location being just across the street basically from the hospital so I had little distance to walk. The hotel staff are very friendly and helpful. The room is very comfortable and roomy, we booked a room with the kitchenette which is great with a full size fridge, stove, dishwasher, and microwave. We didn't need all these amenities, however, they are nice to have. The beds are comfortable and the room is a nice size. The only problem I have is the restaurant, food is good but expensive for their serving sizes, my friend referred to their dinner as a Michelinas frozen dinner size, tasty but very small portion, more like a child's portion. I will still continue to book at Pantages as their hotel is great, I just will eat at another establishment.",
      "rate": 5.0,
      "tripDate": " December 2022"
    },
    {
      "title": "Best Hospitality in the City and Extremely Sanitary",
      "text": "I don't know where to begin! I was extremely nervous staying in a hotel during these trying times but this hotel exceeded my expectations. Upon arrival, there was a machine for sanitization and UV disinfection for phones. Front desk Ken was an absolute pleasure and was extremely accommodating for our needs during our stay. The entire staff made my stay relaxing and stress-free. I would highly recommend the suite style rooms, extremely luxurious bathrooms and a beautiful view. Amazing job Pantages - I'll be back!",
      "rate": 5.0,
      "tripDate": " December 2020"
    },
    {
      "title": "Great hotel in the heart of Downtown Toronto",
      "text": "Located one block from Eaton Centre (Yonge Dundas Square), the hotel offered great value for money, especially given what the usual cost for a downtown hotel room is.  Fran's restaurant was next door.  Due to covid, some amenities and services were either not available or were only done on request.  I would definitely stay here again!",
      "rate": 5.0,
      "tripDate": " July 2021"
    },
    {
      "title": "Outstanding Hotel and Front Desk Staff - Pella and Sandra",
      "text": "In October/November I stayed at the Pantages Hotel in Toronto while my mother was a patient at St. Michael’s Hospital.  Pella and Sandra, Guest Service Representatives at the front desk were so friendly and helpful.  Pella and Sandra made me feel so welcome and never failed to ask how my mother was doing.  I felt very at home at the Pantages.  Pella and Sandra even helped me with directions to close amenities.  The Pantages is exceptionally clean.  I loved that there was a disinfecting station as you walked through the door - you could even disinfect your luggage.  The Pantages is so close to the hospital, shopping and restaurants.  I would recommend the Pantages Hotel in a heartbeat.  You won’t be disappointed and Pella and Sandra represent the hotel very professionally.  I would stay here again anytime.",
      "rate": 5.0,
      "tripDate": " December 2021"
    },
    {
      "title": "EXCELLENT SERVICE",
      "text": "We stayed 4 nights at the Pantages because of its proximity to St. Michael’s Hospital.  our mini apartment was comfortable, and included 1 bedroom with a queen bed, a spacious living room with 1 sofa,coffee table, a desk, a chair and an adequate television, 1 bathroom with a “rain” pulse shower head, a closet containing a washer and dryer,  2 spacious closets, and a kitchenette with a full sized fridge, microwave oven, cook top, dishwasher, sink and cupboards.  Cooking items are available on request.  While the suite was dated, it met our needs.  The best part of our experience at the Pantages was the front desk employees, Pella and My.  Both went above and beyond to ensure our comfort, and to meet our needs.  While professional, they were both friendly, courteous, charming, and solicitous.",
      "rate": 4.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Great hotel and great location",
      "text": "Just back from a trip to Canada & USA. Our first stop was Toronto where we stayed for 4 nights in the Pantages Hotel. We didn’t realise when we planned the trip that it was the Toronto film festival whilst we were there. We booked the hotel on Booking.com months in advance of our trip and got a great deal. Prices during the festival were really high. When we checked into the hotel the receptionist couldn’t believe the price we had paid saying what we had paid for 4 nights was what  they were currently charging for 1 night. The hotel and staff were great. The room was spacious and clean. The hotel is in a great location for walking to all the sights, especially the harbour area which was by far our favourite. This is generally where the CN Tower is located.I would definitely recommend this hotel and would stay here again.",
      "rate": 4.0,
      "tripDate": " September 2023"
    },
    {
      "title": "Very pleasant stay in the heart of the city",
      "text": "Very nice hotel, great location. Spacious king city view room on the 16th floor. Positives: spacious room, fluffy towels, attentive and helpful desk and hotel staff. A very well equipped fitness centre.  The kitchenette had a big fridge, good dishwasher, big sink, fan, and a cooktop (cooktop and pans were OK).  We appreciated very much the location. Blackout curtains were appreciated. There is no parking (we didn't have a car so that's OK) but there is parking close by, just a block away at Eaton's Centre. Like all big cities, there are unforunates on the streets near the hotel, so be aware of your surroundings.    One small suggestion would be for 2 chairs, not one, with the little table in the room. This was good value for the money.",
      "rate": 5.0,
      "tripDate": " May 2023"
    },
    {
      "title": "Great location and value",
      "text": "Next to Eaton Centre, easy transit connections, walking distance to lots of great pubs and restaurants. Very nice rooms, really clean bathrooms. Would recommend!! Staff is super friendly, location is close enough to all spots in downtown for short to medium length walks to see many top attractions, or grab a presto transit card and you can get anywhere downtown in under 20 minutes",
      "rate": 5.0,
      "tripDate": " September 2021"
    },
    {
      "title": "Wonderful, relaxing stay!",
      "text": "Staff were extremely accomodating, allowed us early access to our room to sleep after a 16 hour flight layover and extended luggage holding at the other end of our stay. Great location, a short walk to all of the things we had booked and wanted to see. Room was lovely and had all of the amenities that we required. We stayed for 4 nights and wished it was longer!Only negative was no onsite parking, and local parking was extremely expensive.",
      "rate": 5.0,
      "tripDate": " November 2022"
    },
    {
      "title": "Great, friendly stay. Very central.",
      "text": "Loved our stay at Pantages Hotel, it's stylish, very central and reasonably priced. Ron at the front desk was wonderful, very patient and helpful. Special props to the women that cleaned our room for being so flexible, I wish we knew their names so we could let management know what a great job they did and were very flexible.",
      "rate": 5.0,
      "tripDate": " May 2023"
    },
    {
      "title": "A very exceptional stay",
      "text": "My husband just had ankle replacement surgery at St. Michaels hospital so this was the perfect location to spend night after his surgery. Pella at the front desk is amazing at her job and so sweet and accommodating...she put us in a room with a small kitchenette so we could make Keurig coffee in the morning. I bought bagels she had a toaster delivered to our room. Also provided early check in which was so nice instead of waiting at hospital for 6 hours...the room was clean and comfortable...all the staff are great so helpful but Pella is outstanding she goes over and above",
      "rate": 5.0,
      "tripDate": " April 2024"
    },
    {
      "title": "Stunning rooms, amazing location. Recommend!!!!!",
      "text": "Visited here recently, group of 4- a booking of 2 double bedrooms.The rooms are massive and you have a beautiful view of the city. The bathrooms really big which comes with shampoo, conditioner and body wash. You can request a cleaner otherwise they leave you alone- they tell you this upon check in. WiFi is good connection throughout the whole trip. This is free. The gym is good sized, plenty of weights and enough other equipment such as the treadmill and cross trainer. The location was amazing, right around the corner from a food court with 100’s of options. Also right around the corner from City hall which has ice skating in the winter. The hotel is just surrounded by many shops, pubs, restaurants, cinema etc etc. I would stay here again and would recommend!",
      "rate": 5.0,
      "tripDate": " December 2022"
    },
    {
      "title": "lovely stay again, second time around",
      "text": "We had another lovely stay at pantages. this was our second visit and had a lovely renovated premiere queen suite. staff is quite lovely and accomodating. the bed was extremely comfortable and room nicely appointed. only quirks is that there is no full length mirror and only one mirror in the room, which is in the bathroom. Also, while there is a kitchen in this suite, there is nothing to facilitate cooking! no dishes, cutlery, pots/pans, not even a bottle opener! So not sure if hotel will provide if you ask for these items, but was rather odd. I also think the suite should have a small pullout couch rather than two chairs, especially to accomodate families. the hotel is steps from the eaton center, which makes for a great location. looking forward to the next time!",
      "rate": 4.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Excellent Customer Service /Hotel /Location",
      "text": "Stayed 5 nights at the Pantages hotel , booked a signature one bedroom  . Check in was smooth and quick . Hotel room was spacious , modern and had all the amenities from a full kitchen to washer dryer in the suite .  Service manager Pella and her team really went out of their way to ensure customers needs were met . Location of this hotel is so convenient to hop on transit and a minute walk to Eaton centre . I will re book again, should I ever have to stay in Toronto . Thanks again Pantages for making our family stay  in Toronto; a enjoyable one .",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Pantages wins while the Leafs fail",
      "text": "This is a very lovely hotel that has obviously had some updates. Like many of the hotels they took advantage of the reduced amount of guests during covid to tastefully update the hotel. They did a lovely job.   A long overdue sister's weekend was planned and the Pantages location was in the ideal spot, close to the venues we were attending.  Check in was a breeze and Ron and Paul  made us feel  comfortable and welcome.  Adie escorted us and our luggage to our room and after unloading the cart went to grab ice and the kitchen staples to stock our kitchen.  He made sure we had everything we needed before he left.  Our room was modern, and very comfortable. The beds were wonderful and comfortable beyond belief. You can tell that it is well taken care of..  There was a wall to wall window Not surprisingly had two windows in it that opened to allow for fresh a ir. We settled in We'd come to Toronto  to go see my sister's favourite band Kansas at Massey Hall. Pantages is mere steps from Massey Hall and less than a minute away.  I ove Honey a Big thank you for charging my phone because I forgot my charging cable. She was able to make sure it was charged before the concert so I could get some wonderful pictures. We decided to spend an additional night and purchase tickets to see Jesus Christ superstar at the Mervish. It was good choice.  Often when you extend your stay at the last minute you end up having to move rooms. We were lucky that they made some changes so that we did not have to do that. The next day during checkout we left our bags to go have breakfast and the staff took good care of everything. We really enjoyed our stay at Pantages and I'm planning our next one as I write this. All the staff that we came into contact with were wonderful. They were helpful, professional, and genuine. They are all huge assets to Pantages And I'm thankful for their help and their ability to answer our questions and make us feel welcome.",
      "rate": 5.0,
      "tripDate": " May 2024"
    },
    {
      "title": "Unclean Rooms",
      "text": "We stayed at Pantages for the first time because of an appointment at St. Michael’s Hospital. I liked that they offered a good discount for St. Michael’s patients and the location was very convenient. We found it to be very noisy though as Massey Hall is right across the street, a show finished up around 11pm and it was extremely loud in our room as we tried to get some sleep for an early morning. The worst part though is that we found a dirty bra under the nightstand, it was as if nobody tried to even really clean the room. When we told the front desk all we got was a “sorry.” The fitted sheet was also not put on the bed correctly and would not stay on. Overall, I will not stay here again for future appointments.",
      "rate": 2.0,
      "tripDate": " April 2022"
    },
    {
      "title": "Great location and excellent room — not much else.",
      "text": "The hotel is well located within a few minutes walk of the Eaton Centre. There aren’t really any public spaces and the lobby is little more than a corridor from the entrance to the reception desk. There were often lines to check in although my check in and checkout were hassle free. The small restaurant and bar in the lobby were closed for the entire week I stayed as was the fitness centre on the fourth floor. Both ostensibly because of COVID. My room was a renovated premium king and it was lovely for a week’s stay. Very roomy and the bathroom was extremely nice and well appointed. I didn’t have much interaction with staff but the women at reception were pleasant and the one time I had housekeeping tidy my room (housekeeping is by request) I found the housekeeper to be friendly and helpful. Having Fran’s diner a few feet away from the entrance was a great bonus as they’re open 24/7. I’d definitely stay again.",
      "rate": 4.0,
      "tripDate": " November 2021"
    },
    {
      "title": "Very enjoyable stay. ",
      "text": "We booked directly with the hotel for our dinner/theatre evening. We were very happy with our room and this location. We enjoyed one of the newly renovated rooms. It was beautiful.  Very bright, clean,comfortable and modern. Love the colour scheme. One of the best nights sleep I’ve ever bed in a hotel. We didn’t even hear any noise through the night at all. The bathroom was very roomy and bright. They’ve even installed soft motion lights for those middle of the night trips out of bed. Great touch. The staff was very knowledgeable and helpful for our excursions. We will definitely be back. Thank you to everyone.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Overall a good stay",
      "text": "Overall my wife and I had a good stay at the Pantages hotel and that was mainly due to a lady called Pella. Despite me sending 2 messages to the hotel requesting a quiet room on an high floor we were given a room on the 4th floor which was far from quiet because of noise from outside and mainly because the extractor fan in the bathroom couldn't be switched off therefore it was on all night ruining our first night at the hotel. As we were staying for 6 nights we complained to reception the first thing in the morning and Pella immediately recognised that we had a genuine complaint. She took all the stress out of the situation by acting quickly and agreeing to move us to an upgraded room on a floor towards the top of the hotel and arranged for our repacked luggage to be moved to our new room when it had been cleaned. I am pretty sure our reviews of this hotel would be completely different if it weren' t for Pella.After our initial poor start to our stay we found all of the staff very welcoming, the hotel was clean and in a good location.",
      "rate": 4.0,
      "tripDate": " June 2023"
    },
    {
      "title": "Great Location & Service",
      "text": "Recently stayed at the Pantages hotel downtown Toronto and it exceeded my expectations. The room I booked was called “Pantages Suite (newly renovated)” through the hotel website for a great price. The room was spacious, clean, and just so nice! One thing was that the bathroom door didn’t have a lock on it and the handle was broken, other than that no issues at all. The front desk staff were friendly and helpful too. Overall I really enjoyed it. Definitely would stay here again.",
      "rate": 5.0,
      "tripDate": " December 2020"
    },
    {
      "title": "Great Stay",
      "text": "Stayed here recently. Transfer from the airport via the express train and the Subway to  Yonge and Dundas was very straightforward and it was only a 5 minute walk from there. The room we booked was impressive with loads of room and the separate living space was perfect. It's a great location about a 25 minute walk from the Entertainment district but if you preferred the Subway two stations are about 5 mins away. Spectacular views of the city if your room is high enough also add to the attraction. I'd recommend this hotel and would definitely stay here again if I visited Toronto.",
      "rate": 5.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Horrible place, poor management, avoid.",
      "text": "This place is a disgrace to customer treatment. They charge your credit card before arrival. (The morning when you arrive in the evening) And charge the full amount the evening before you checkout in the morning. No other hotel on the world does that (unless you book via expedia). Bad front desk staff. They’ve no clue. Rooms are mediocre. Breakfast in adjacent restaurant is fine. There are better places in Toronto.",
      "rate": 2.0,
      "tripDate": " December 2019"
    },
    {
      "title": "Fantastic location and great value for money!",
      "text": "Great hotel, clean, spacious rooms and comfortable. A fantastic location as it’s very central and easy to get everywhere. Housekeeping can be requested however often you need it, and you can always get extra towels at reception. Check in was easy and Thom behind reception was friendly and helpful. As we were celebrating my husbands birthday they gave us a free drink at the bar and premium Wi-Fi which was a great touch. Our only criticism is that we didn’t like the pillows in the room, but ultimately that is personal preference.",
      "rate": 5.0,
      "tripDate": " February 2023"
    },
    {
      "title": "Hospital Stay.",
      "text": "My husband and I booked this hotel for two nights so he could have a medical procedure at St. Michael’s Hospital (their website advertises hospital rates). We checked in at 3PM for our two night stay and by 6PM, we received a notice that there would be no water between 9-5 ond both days of our stay. Completely unacceptable and unmanageable for anyone, especially a very ill person!  We had no choice but to check out after one night and make alternate arrangements for the second night. The worst experience of any hotel stay in all our years.",
      "rate": 1.0,
      "tripDate": " June 2021"
    },
    {
      "title": "Three weeks after checkout and we still have no deposit returned!",
      "text": "The hotel is in a pretty good location. Our room was a good size. Information about parking given to us was out of date and misleading. The bed was comfy. There were 2 TVs but they only seemed to work if you paid for channels. So no news or movies. The room was reasonably clean but there were quite a lot of hairs on the bathroom floor and behind the toilet was quite dirty. I cleaned the bathroom floor myself before using the bathroom using tissues. On check in we paid a $150 deposit refundable on check out. We still have not received the returned deposit despite emailing Pantages.",
      "rate": 2.0,
      "tripDate": " September 2022"
    }
  ]
}