{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Park Suites Toronto Blue Jay Way",
    "url": "/Hotel_Review-g155019-d5958279-Reviews-Park_Suites_Toronto_Blue_Jay_Way-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "2.5",
      "reviewCount": 28
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "20 Blue Jays Way",
      "addressLocality": "Toronto",
      "postalCode": "M5V 3W6",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0f/de/0f/86/park-suites-toronto-blue.jpg?w=500&h=400&s=1"
  },
  "description": null,
  "featues": [
    "Free High Speed Internet (WiFi)",
    "Wifi",
    "Fitness Center with Gym / Workout Room",
    "Pool",
    "Business Center with Internet Access",
    "Concierge",
    "Non-smoking hotel",
    "Self-serve laundry",
    "Air conditioning",
    "Kitchenette",
    "Refrigerator",
    "Flatscreen TV",
    "Non-smoking rooms"
  ],
  "reviews": [
    {
      "title": "Park Suites Toronto Blue Jays Way",
      "text": "The location was worth the money - hands down. How to get into the actual condo was a little suspect. Also...and this is a big warning... DO NOT GIVE THEM YOUR CREDIT CARD INFO! They require it for their 'cleaning fee', (which is NOT used to clean the suites... it was pretty dirty) Also, I used and paid for their services last August 2016, and in February of this year - 2017, I noticed a charge on my bank statement for over $200.00 from this company. I contacted Park Suites, and they graciously reimbursed my money. However, just today, I noticed another charge on my card from a different condo on Blue Jays Way. I did not authorize this. Be warned! Someone may be stealing your credit card information if you are in the market to rent a condo in downtown Toronto on Blue Jays Way.",
      "rate": 2.0,
      "tripDate": " August 2016"
    },
    {
      "title": "Location is not worth the hassle!",
      "text": "Good: Location, perfect spot downtown right near Roger's Center, fast access to the Go Train and restaurants/Shopping.Bad: Our suite was dirty, literally glitter and rhinestones in the bed and crumbs on the counters. The bed was truly terrible, you sank a foot or two in the middle and it was a double bed not a queen. The worst part of our stay was the check in/out process, I specifically emailed the company a few weeks out to check if there was a place to store our luggage after check out while we watched a ball game, no response back. Then the morning before our flight we got a call from the manager, giving us key info (including our room number, what to tell security..) AND I specifically asked if there is a place we could store our luggage, he says sure just ask security to watch it for you. Sure enough, last day we leave the keys in the room, go down to talk to security and his reply \"sorry, we actually get that all the time but we can't watch any luggage...\" Luckily, another nearby, actual hotel, was very kind and allowed us to store our luggage there. Be warned, this is not a hotel, nor is their any hospitality involved, location is excellent but the dirt, poor sleep, and hassle/lies are not worth it if your going for a vacation.",
      "rate": 2.0,
      "tripDate": " June 2016"
    },
    {
      "title": "Beware of false information on website",
      "text": "The apartment was in an excellent location for our needs. The price was good and it was clean and well appointed.  We did however have a great deal of trouble with the booking itself. We were sent an email confirmation which stated that a $500 deposit would be charged at check-in, and that we would pay nothing until arrival. However $500 was charged to my credit card as soon as the room was booked. So they had the deposit for 6 weeks prior to our arrival. They also charged the entire amount of the room to my card 2 weeks before our arrival. At the moment the $500 deposit has not be credited to my card although the rental company assures us that they have returned the deposit.  When we arrived to the apartment building no one there knew which unit we were to be staying in or had keys. We waited an hour and 20 minutes for someone to arrive to let us into the unit.  I have discussed the issues with both the rental company and Booking.com ( I booked the stay through them) and have had no satisfactory answer to my inquiries. Each blames the other for the error.",
      "rate": 2.0,
      "tripDate": " October 2016"
    },
    {
      "title": "FALSE ADVERTISMENT",
      "text": "Please do not book in this condo, as the Property manager of the condo, I am letting you know that this building is not a hotel, and it is false advertisement. Short term rental is not permitted in this building, and you will have no access to amenities or booking a suite as a hotel.Thank you,MP",
      "rate": 1.0,
      "tripDate": " December 2023"
    },
    {
      "title": "PLEASE, KEEP AHEAD!!! I have never booked them orbeen there but they used fradulently my credit card an stole me 200 CAD",
      "text": "I have never, NEVER! been there or booked any suite but they used fradulently my credit card an stole me 200 CAD. When I asked about the incorrect withdrawal, I still have no answer wich means something is very wrong with this firma.The date I used was just random because of  the system.",
      "rate": 1.0,
      "tripDate": " April 2019"
    },
    {
      "title": "Scam - Hotel will charge 100% upfront and not refund for cancellations!",
      "text": "I reserved a room 4 month before my stay.  The site says the hotel will charge at arrival and that the booking can be cancelled without penalty.  The hotel billed me 100% up front and then more than 3 months before my stay, I cancelled the booking and was confirmed by Travelocity that I'd get a full refund.  The hotel has refused to refund me for the 5 nights that they charged me.  I've been robbed almost $1000 by this hotel!",
      "rate": 1.0,
      "tripDate": " December 2014"
    },
    {
      "title": "Fraud",
      "text": "The place is not bad but when you arrive, you can't wait in the lobby and you must wait for your room in the street even though it's freezing or snowing.The worst part is that 3 months after I stayed in the hotel they started charging me with wrong monthly payments to my credit card. To be accurate, they did this 3 times in the last two months and after a lot of time, I am still waiting for the refunds. They don't take care of CC customers information. Customer services and the way they treat people suck.",
      "rate": 1.0,
      "tripDate": " November 2018"
    },
    {
      "title": "RIPOFF>>>>>SCAM",
      "text": "I booked a room with them for the weekend.  I then fly there, to a foreign country and arrive at their location only to have them tell me they have no record of me even though I clearly still have the receipt on my phone and was charged.  So I'm stuck in Toronto with no room and having being charged. A month later and still no refund. All they say is \"we will call you back\"",
      "rate": 1.0,
      "tripDate": " February 2016"
    },
    {
      "title": "Like McKayla Maroney - Not Impressed",
      "text": "Be careful if you are booking this place through a third party, like with points through your credit card company. When we arrived, they had no record of us. Apparently Park Suites' booking system is so advanced, it is still done entirely by fax, and these apparently get lost through the ether-nets quite frequently, according to the concierge in the condo building lobby where these suites are located. We had to stand at this guy's desk for two hours - YES, TWO HOURS - using his phone to get re-booked somewhere else.  I can't speak to the quality of the suites themselves, since I obviously didn't get to see one, but if you do decide to stay here, you'd better call Park Suites directly to re-confirm your booking. Great start to the vacation not to have a room.",
      "rate": 1.0,
      "tripDate": " August 2015"
    },
    {
      "title": "TERRIBLE experience",
      "text": "Do not book here unless you want an endless headache. I booked a last minute reservation with this \"company\" (when they charge your credit card a month later without authorization the charge will be under \"The element\" not park suites.)I booked at the last minute... however the \"customer services\" repeatedly called me and spoke to me as though I was an idiot for not yet reading their confirmation email ... (I was travelling for work and had not had time to look at the email yet).The reservation was under my bosses card but under my name, so we needed to send an authorization form and ID. I was so exhausted with the rudeness of the individual calling/texting me I wanted to just cancel the room... they wouldn't let me so I demanded proper customer service and I wanted the documents sent through email in a professional manner so I could track it (THEY ARE SKETCHY). The person on the phone told me I was a \"nightmare\". Communication in advance (they sent me someone else's confirmation email first) to check-out was awful, rude and annoying. They communicate poorly through text.Now a month later, they charged my bosses card 2X$300 out of nowhere, this is FRAUD. They sent receipts for the \"immediate refund\" however its been 9 days and still no refund. Now they have our ID and credit card and are charging it without permission. This scam has probably been done to so many people. Check your credit card statements if you've ever booked with this company.",
      "rate": 1.0,
      "tripDate": " December 2019"
    },
    {
      "title": "This is not a hotel",
      "text": "To obtain the apartment key I had to enter a combination number into a letter box in a darkened environment to clear the content. This was the main challenge but fortunately with a magnifying glass and torch I was able to complete the task. The apartment is badly in need of a refurbishment, it is very tired and not comfortable, particularly the sofa.The security people were helpful to some extent but certainly not over whelming. It was OK for my purpose but I would not take my family there",
      "rate": 3.0,
      "tripDate": " June 2017"
    },
    {
      "title": "Night out",
      "text": "Took a team to the blue Jays game. It was great  not cheap but great.  We stayed over so we could spend the time enjoying the city not the traffic. Most of the construction is done and it will be so nice then",
      "rate": 4.0,
      "tripDate": " June 2016"
    },
    {
      "title": "It is not perfect but affordable and great location",
      "text": "I stayed for a week.  It is not modern, it is not luxury.  The ironing board is on it's last legs, the furniture is mismatched but it is comfortable, has everything you will need and is a place to eat, sleep and work.  It has reliable Wifi, it is so perfect for town, right next to blue jays stadium.  Ideal for a tourist as you can walk everywhere.  It is secured by a concierge who is strict. I read dreadful reviews and I was super nervous but it was great.  It's dated but that did not bother me at all. Check out is pretty early at 10am.You have your own washer / dryer / dishwasher / microwave / coffee machine / kettle / iron / ironing board / hoover / fridge / freezer / hairdryer / mop / balcony with some old chairs / TV / great Gym upstairs with amazing views as it's on 22 floor / Games room.  Mirrors are away from light so not great for a girl getting ready. There are BBQ's up there you can use. huge terraced to sit out if you want a bigger space than your balcony.A lot of reviews had moans about keys.  I had no trouble picking them up at the address but I have maybe been lucky.",
      "rate": 4.0,
      "tripDate": " July 2016"
    },
    {
      "title": "Excellent suite",
      "text": "This is my 5th time booking with Parksuitestoronto.com I love the efficient booking procedureand the comforts of 'home away from home\"Kitchen facility was such an asset to my travel. Locations was the best in walking distance to my office. World class facility and beautiful furnished suite!",
      "rate": 5.0,
      "tripDate": " May 2015"
    },
    {
      "title": "just ok",
      "text": "I would have given this a higher rating but the lack of information from this property was a little frustrating.  We booked a room not noticing that it is really an apartment/condo.  We were given no instructions on how to get into the building in advance of our arrival.  Once we were buzzed in the desk personnel acted as if she was a bit confused when we asked to check in.  She found an envelope with our name on it which only had a couple sheets of instructions on how to clean the condo upon our exit and a list of fees we would be charged if additional cleaning was required.  The condo itself was fine however the advertising for this \"hotel\" was quite misleading in that it was no hotel at all.  Next time I will just stick with a hotel chain that I recognize.",
      "rate": 3.0,
      "tripDate": " June 2014"
    },
    {
      "title": "Customer service - not there specialty",
      "text": "Before even staying in the hotel we were over charged by $200, to clarify we were charged the hotel cost and then an additional $200 on a separate bill which didnt get resolved for multiple days. We were only told about the additional $70 cleaning fee on ebit was to late to cancel (because apparently cleaning isnt a part of your hotel cost anymore). They say the main language is English but upon calling is not and the environment is so unprofessional that you can barely here the people talking over the blasting music. Would not recommend this hotel to anyone.",
      "rate": 1.0,
      "tripDate": " April 2019"
    },
    {
      "title": "Great condo, great location",
      "text": "We visited Toronto in August and had a great time.  We rented a condo for three nights with Park Suites -- found it to be immaculate, convenient and very nice.  We drove and arrived during afternoon rush hour so had a difficult time navigating to the convenience store where you pick up the keys -- but once that hurdle was passed everything was great.  We were unaware that the key fob we got also allowed us to pass through the underground garage up into the condo building -- but we followed some other folks up and got in without using it.  Later we asked the concierge about it and he gave us the wrong information -- that we had to have some additional information-- but his colleague was listening and corrected that information.  The key fob is used for everything, including buzzing yourself into the building as well as unlocking the door to the room.  I had read some earlier reviews so I was a little concerned, plus never having rented a condo I was unsure about what this experience was like.  Remember, this is not a hotel so there will not really be anyone there to answer your questions onsite -- we just got lucky that this other guy at the desk overheard the conversation.Once all that was straightened out we couldn't have been more pleased with the condo.  We used the kitchen appliance to prepare breakfast and a few meals and we enjoyed the small balcony and the view of the CNN tower.  Would love to return.",
      "rate": 4.0,
      "tripDate": " August 2018"
    },
    {
      "title": "Not worth it",
      "text": "The fee per night stay was decent until you find out everything is extra that is added on like $30 dollars per day parking, $58 dollars to clean the room. The room we got was small and messy when we got there. It isnt at all like the pictures from the brochure. The door uses an old fashioned lock and key. You have to manually lock the door when you leave or when you are inside or else it will be unlocked and someone can just walk in. The pool? lol. Don't waste your time here. The only good thing about this place is the location. Everything is at walking distance to the CN tower, the Aquarium, stadium and the restaurants.",
      "rate": 1.0,
      "tripDate": " April 2017"
    },
    {
      "title": "My stay was great!",
      "text": "We stayed here for 3 nights me, my nephew, friend and her kid. When we got there the security guard buzzed us in and I just told him and he handed me my keys and told us how to get to our room. The place is pretty big and its really nice.Just take note that this place is more like a condo than a hotel. There was not room service or anything like that. But has everything an apartment would have.The key they give you have a button to open up the underground garage which I thought was cool seeing how we rented a car. There is a grocery stores 2 minutes away as well. You are within 500m of the CN Tower and Rogers centre.Great place, would stay here again. I don't know what is up with the other negative comments. Only reason I am not giving it a 5 out of 5 is because they double billed me. I called them 3 times about in the a month and they kept saying they would refund my credit card, they would always have an excuse. Finally after 45 days I called my bank to let them know what happened and they dealt with Park Suites, after 2 more weeks I finally got my money back.",
      "rate": 4.0,
      "tripDate": " September 2014"
    },
    {
      "title": "Think twice before staying at this place",
      "text": "In my opinion, the room was substandard compared to the price I paid.  Furthermore, the attitude of the customer service rep was rude and generally unpleasant.  The extra charge the company levied for cleaning was a rip off and a money making scheme for them because cleaning of the room is a general cost of doing business, but Park Suites charged me $50.00 additional dollars. Be aware that Park Suites is not a traditional suite chain such as an Embassy suite.  It is owned by a company that bought some suites within the Park Suites bldg. Therefore, services that one is accustomed to at a standard or traditional suite chain are not available.  There is no dedicated rep on site to assist with issues or concerns that might arise with the accommodations.  In order to resolve an issue, you contact the rep on the phone or go to the security desk in the lobby and a security person will call the rep.   NO PERSONAL INTERACTION.  Example – the first night staying at Park Suites, there was no phone, internet, or TV connection.  Went to the security desk in the lobby and had the security person call Park Suite rep.  The rep stated the rain caused the phone, internet, TV not to work.  Instead of having a standard cable box setup for customers to ensure that these services were available regardless of the weather, this company opted for the cheaper of option of a satellite dish.   Therefore, we did not get cable, phone and internet services until the next day after 12 noon when the weather cleared up.",
      "rate": 1.0,
      "tripDate": " June 2014"
    },
    {
      "title": "Handy location, good CONDO",
      "text": "I just got home from a fun visit to Toronto where we took in 3 Jays games and toured a bit of the city.  We were pleasantly surprised by this lodging as we chose it for its location and did not expect much.  Boy were we happy to discover a lovely place to stay right in the heart of the entertainment district.  Although there was some confusion about obtaining the key to our room, once we figured it out, we were impressed.  Our room was clean and comfy.  A nice new kitchen with all of the amenities so you can cook, do dishes, wash clothes etc.  And a lovely view of the tower and Rogers centre.  This place isn't a regular hotel but more like apartments or condos for rent but we are pleased with the experience.  Nice roof top patio with bbqs and plenty of lawn chairs and tables",
      "rate": 4.0,
      "tripDate": " August 2018"
    },
    {
      "title": "Stay over after a Jays vs Yankees game",
      "text": "Very convenient to be able to walk a few short steps from the game to a hotel. Located downtown also handy for exploring the city. The room was spacious #469 and very clean, well decorated yet minimal.  Kurig in the room.",
      "rate": 5.0,
      "tripDate": " July 2018"
    },
    {
      "title": "Great place to stay!",
      "text": "Location was perfect for our trip as we were there to see the season opener of the Blue Jays season...everything we needed or wanted to see was within walking distance.  Great views, apartment was clean and bright and bed was comfortable.  Would definitely stay there again...just wish the check out time was later than 10am.",
      "rate": 5.0,
      "tripDate": " March 2018"
    },
    {
      "title": "Excellent location",
      "text": "Park Suites Toronto is situated in the best location. Everything is within the walking distance especially if you are in Toronto for a game. It has all the ammenities you would require and one surprise feature was the theatre room. Staff kept the room in excellent condition. I would certainly recommend this place to anyone",
      "rate": 5.0,
      "tripDate": " March 2017"
    },
    {
      "title": "Location, Location, Location!",
      "text": "We needed to book this last minute to see a concert at the Roger's Centre.  There was a little confusion on how to get into the condo, but the security staff were friendly and helpful.  We found much cheaper parking than the $30.  It was fairly clean.  The only complaints we had were that the washer and dryer didn't work and there was a chair that was losing a leg.Would book again.",
      "rate": 4.0,
      "tripDate": " June 2017"
    }
  ]
}