{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Park Suites Toronto - Front St. West",
    "url": "/Hotel_Review-g155019-d2623412-Reviews-Park_Suites_Toronto_Front_St_West-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "1.5",
      "reviewCount": 13
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "373 Front St W",
      "addressLocality": "Toronto",
      "postalCode": "M5V 3R7",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/04/ba/0a/7b/bedroom.jpg?w=500&h=-1&s=1"
  },
  "description": null,
  "featues": [
    "Wifi",
    "Kitchenette"
  ],
  "reviews": [
    {
      "title": "I was duped",
      "text": "I booked with them for a 1 month stay - & talked to Mark – regarding the booking.I wrote emails to them repeatedly before checking in confirming about – free Wi-Fi, housekeeping schedules, & location of the suite. To which, I didn’t get any replies, & so I called them. On calling, I got the answer in affirmative from Mark, but on checking in – I found myself duped.I paid Damage Deposit of $1250, as a security, which was to be returned, after I checked out, instead, it was forfeited citing it as Wi-Fi rental – CAD$25 – per day. In 2013 – nowhere in the world in this class of rentals, is anyone charged $25/ day – mostly its free – which verbally Mark said it is (in North America especially – I ‘ve stayed with DElsuites, Corporate Suites – excellent services ) It’s a fine print in the contract, which I should have read before signing. I asked for a location facing the road, & Mark said – yes its facing the road, but it was on the backsideThe housekeeping Mark confirmed was weekly, but it was actually bi- weekly.The apartment was filthy, many things were broken, & it hadn’t been cleaned in ages – I’m posting pictures for the same, It wasn’t an executive rental at all. When I called them from India – I talked to another guy (probably Kevin), he was most discourteous, very discriminatory – told me this is not India, & even yelled at me & I had to tell him, to talk politely, All this -because they didn’t want to revert the money, that I paid as security - & they didn’t.I have all my emails – that I sent to them.Only thing is – I don’t have anything in writing from them, & I didn’t read the fine print on the contract, & that they know, that I am not from their part of the world, & I am not returning, so they got away with itBeware – they are Unscrupulous guys",
      "rate": 1.0,
      "tripDate": " August 2013"
    },
    {
      "title": "Homeless in Toronto!",
      "text": "We booked our holiday apartment from August 5th-August 12th, received the booking confirmation on April 10th and on the same day, April 10th sent the signed credit card chit back as requested.According to the information we received, we had to pick up the key in Mississauga near the airport. The key pick-up building in Mississauga was unfortunately shut because of a Canadian civic holiday. As we couldn’t reach anyone by phone, we decided to proceed, by coach, to our holiday apartment on Front Street in downtown Toronto in the hopes that some other arrangements had been made to get us in the apartment.We waited in the lobby of the apartment complex while Security phoned the 24-hour company hot line and left the company several messages saying that we were waiting in the building. By 6 p.m. it was clear that nothing was going to happen and so we took a room for the night at the nearby Hilton Garden Inn Hotel.Using the Hilton Wi-Fi, we sent Park Suites Toronto an email message explaining our predictiment and requesting that they get in touch by 10 a.m. the next morning. The next morning sometime after 9.00 a.m. we received a reply asking us to phone the company.The company representative, Mark, agreed to meet us at 11 a.m on August 6th at the apartment complex and for some reason had more paperwork to be signed.  At the meeting he informed us that the company had changed its policy months ago of having customers pick up their keys at their business offices near the airport to having a representative meet guests in the apartment complex itself. In fact, the company didn’t even have offices at the site mentioned in the information material that we received when we booked!At the end of the meeting, he gave us two sets of keys and told us that we could put our suitcases in the apartment, but that it still had to be cleaned. We reminded him that, as we had not been able to use the apartment on the previous day and had to pay for a hotel room, we would like payment for the first day subtracted from our bill.  He told us that it would be taken care of. He further informed us that the mix-up had been caused by not having received our email with the signed chit as an attachment. Of course, we then sent him a copy of our email which showed the day it had originally been sent. As of the writing of this review, we have still received no refund for the lost day. The representative did not show us the apartment, but sent us up to talk to the maid. When the apartment had been cleaned two hours later, we were finally able to settle into the penthouse apartment.The apartment had beautiful views and a very good Wi-Fi system. The washing-machine and dryer worked well. Sadly, the bathroom was very tiny, but on a positive note, we did receive one complimentary roll of toilet paper. The kitchen was ill-equipped with old cutlery and dishes that seem to have been bought at a garage sale.It took us several days to find the swimming-pool in a third adjoined building and found it to be less than luxurious with changing room lockers requiring private locks which we of course didn’t have with us. We also discovered, on our own, how to get rid of garbage. There was no information about any of this in the apartment. Needless to say, we were also not informed that the building was a construction site.The balconies were being refitted to bring them into line with new building regulations with all the noise necessary for that purpose.All in all, we didn't feel treated like customers and find the company’s information policies severely lacking. We definitely not recommend anyone booking a holiday apartment with this company.",
      "rate": 1.0,
      "tripDate": " August 2013"
    },
    {
      "title": "bad dream",
      "text": "The first red flag: you pick up the key from a different location and from some guys who have no clue where your place is. There are no maps or guides in the envelope you receive your key. You are on your own to find the flat and this information are not sent before you leave your country. There is no customer service or anyone physically present which takes me to the 2nd red flag. There was a constant humming noise from an unknown source in the flat. There were two numbers given in the envelope they handed me to call one before 5pm and one after 5 pm and both had answering machines on but no reply received. I left three messages about the noise and asked to change the room or refund and received no answer.  I decided to send them an email. After a few hours a guy called Mark wrote back and and with no apology did not do anything at all. He did not offer to investigate the problem either. I wrote back and told him that i am not happy with their hospitality and still nothing happened. Awful service. Imagine the agony of being jet lagged and not being able to have a descent sleep for a minute. Third red flag: I wish the misery had stopped there. Due to an administration error, our secretary had booked me one night short in this awful place. A day before my departure I received a very strange email from Mark asking me to return the key or my stuff will be out in less than an hour. I was at the conference and had to leave and rush back to the flat. My stuff was really at the door. This guy Mark who has no face or identity was on the phone speaking with the cleaner about my stuff. He was extremely rude; did not offer any alternative plan for one more night stay, did not even ask i would like to pay for one more night (paying was not an issue if he cared to ask), did not mention the noise and all the trouble I had with sleeping in that miserable flat and he did not let me speak. He constantly interrupted me and for one second did not allow me to explain the things. He was shouting on the phone and I felt disgusted by his attitude. I hung up on him with great joy and so happy to grab my luggage and leave that awful place for good. In matter of 10 minutes I found a a very pleasant place in downtown, and slept my last night in peace in Toronto. If I had not pay around $1100 which was NOT refundable (this is another RED FLAG), I would have left after the first night.If you want to enjoy your stay in Toronto, avoid this company like a plague. Your life is worth it and you are the only one who cares about you. These guys don't. If I were a resident in Canada and not someone on a conference trip, I would have sued this company. They take advantage of non resident travellers like me unfortunately and make lives miserable. Do not give them this opportunity.",
      "rate": 1.0,
      "tripDate": " September 2014"
    },
    {
      "title": "Sweet Park Suites?",
      "text": "This is not a B and B.POSITIVE: Fabulous location and reasonable rates. Comfortable apartment, tho we had to purchase washing detergent and toilet paper.NEGATIVE: Key pickup in Mississauga, 40 minutes drive away. Flying in from Australia and with no car, we did negotiate the landlord to meet us at the apartment and this was ultimately a mistake because he does not answer his phone. Security assisted us in getting in at about 10.30pm but we were without WIFI for 2 nights of a 4 night stay. Further difficulties in meeting to sign paperwork resulted in landlord entering the apartment unauthorised. We really would have said OK if he had phoned but he didn't bother and I had lots of knickers and other personal things around the apartment. Finally, he had a maid harrassing us when we were trying to leave to ensure we had signed the stupid papers. Of course we had but in my enthusiasm I signed another credit card slip so I hope we don't get charged twice! Stay Tuned...RECOMMENDATION: Great if you can handle the key pickup dramas.",
      "rate": 3.0,
      "tripDate": " May 2013"
    },
    {
      "title": "This is not a hotel",
      "text": "This is a condo, and someone is doing short term rentals pretending it is a hotel in contravention to the rules of the Condominium Corporation. Now the other reviews make sense - no wonder the person with the keys didn't know where the room was.",
      "rate": 1.0,
      "tripDate": " November 2015"
    },
    {
      "title": "Disgusting.",
      "text": "This is advertised as \"Executive Class Accommodations\" with \"Luxury furnishings and decor\". Take a look at the pictures I took and you be the judge. Initial superficial appearances seem to be adequate-see living room pic. Then I discovered torn inner shower curtain and ripped pillow case, a window that only closes when a chair is propped up against it, drawer with missing handle, 'questionable ' tub caulking, dirt in bathroom, broken light fixture-and the list goes on. Sent pics to management who would not even look at them. Told me \"I know what the suite looks like so I don't have to look at the pictures\". Not at all sympathetic or helpful. Just about anywhere would be better than here.",
      "rate": 1.0,
      "tripDate": " June 2017"
    },
    {
      "title": "Classy & Comfortable all wrapped into one with a ribbon on it!",
      "text": "I recently moved into this gorgeous waterfront suite and couldn't be any happier! After years of dealing with terrible condo staff and low budget repairs I am pleased to say I have found myself a real home. The suite offers such amazing facilities and the staff are so kind and helpful. I love using the gym during the morning hours and relaxing in the steam room late at night after a long day at work. The location is also a plus! All of Toronto is within walking distance.",
      "rate": 5.0,
      "tripDate": " August 2013"
    },
    {
      "title": "worst of the worst~",
      "text": "we reserved the room from 15th, May to 21th, May by bookings.com. and paid in advance. When we arrived at the hotel, we heard that there is no room because of overbooking. And they didn't pay attention. We were very, very angry, but didn't know how to do. So We reserved another hotel in a hurry. And yet we couldn't have a refund. Never go to the hotel!!! -Korean customer",
      "rate": 1.0,
      "tripDate": " May 2015"
    },
    {
      "title": "Terrible Option",
      "text": "Prior to arrival, we attempted to contact the business (not a hotel!) to find out where we get a key and parking information.  I left a message.  No response. Tried several more times with no success.  I booked with Expedia and told them my concerns.  They also attempted to contact the business with no success.  This was during TIFF and accommodation was impossible to find near the action. Expedia was able to re-book us in primo accommodation (>2x the cost of our original booking) and the problems ended.  STAY AWAY FROM THIS PLACE!!",
      "rate": 1.0,
      "tripDate": " September 2016"
    },
    {
      "title": "Not as advertised, but workable",
      "text": "When I booked this suite, the image on the web showed a completely different apartment and an address closer to my conference. The suite is Ok - clean and relatively centrally located, and probably great for a group or family who want to keep costs down, but pretty pricey for one person. Towels were threadbare and seemed to have mascara on them, sheets smell like someone else's skin and also are pretty threadbare,  shower curtains were half off the rings and were very very cheap and flimsy, and half the vertical blinds are missing. But amenities are very good - kitchen stuff if you need to cook, washer and dryer and laundry detergent.   everything else was spotless. Would definitely recommend these suites, but not for single person at$200 a night. Better to be in a hotel with the more luxurious amenities one would expect at this price.",
      "rate": 3.0,
      "tripDate": " May 2016"
    },
    {
      "title": "Be Careful - Get everything in writing !",
      "text": "We booked a single bedroom suite for 25 nights from Dubai atleast 3 months in advance. We authorised a credit card debit online. Within a few days our plans changed and we emailed the representative Mark about change in plans and while he did not reply in writing , when we called him he confirmed that he would refund the amount according to the dates. When we landed in Toronto, we had to sign an authorisation which said the contract was non-refundable. The rep who met us was evasive when we questioned the contract and insisted we sign it, even though he had all our emails. We contacted Mark again and he promised us that the refund would be given after we vacate the apartment. So we signed the contract with a note about the change in dates.After we moved out, when we contacted Park Suites we were told that all contracts were binding and no refund would be given. So be careful what you sign and don not believe anything the rep says ...get it in writing!",
      "rate": 1.0,
      "tripDate": " August 2013"
    }
  ]
}