{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Park Motel",
    "url": "/Hotel_Review-g155019-d1480650-Reviews-Park_Motel-Toronto_Ontario.html",
    "priceRange": "$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "2.0",
      "reviewCount": 24
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "3126 Kingston Rd",
      "addressLocality": "Toronto",
      "postalCode": "M1M 1P2",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-s/02/ec/cc/55/park-motel.jpg?w=500&h=-1&s=1"
  },
  "description": null,
  "featues": [
    "Free parking",
    "Free High Speed Internet (WiFi)",
    "Wifi",
    "Non-smoking hotel",
    "Air conditioning",
    "Telephone",
    "Wake-up service / alarm clock",
    "Kitchenette",
    "Microwave",
    "Refrigerator",
    "Complimentary toiletries",
    "Hair dryer",
    "Non-smoking rooms"
  ],
  "reviews": [
    {
      "title": "This place discrimates against same-sex couples",
      "text": "I can't believe that in this year and age, a discriminatory place like this still exists in Toronto. My boyfriend and I wanted to stay here for one night. My boyfriend called an hour before we checked in to make sure that there will be available rooms for a couple. The woman on the phone told him that there will be no problem on a weekday (it was a Thursday). We were there @4pm and my boyfriend went to check in. The woman was about to give him a room but then asked first to see the person he's sharing the room with. When she saw me, another guy, she suddenly looked disgusted and brusquely told us that there's no vacancy, waved us off, and turned around not wanting to hear whatever we had to say. We were so shocked and surprised that we were speechless. This place clearly has a policy of discriminating against same-sex couples and I wouldn't be surprised if they also judge customers based on race, age, or social status. We've never experienced such humiliation even from much better hotels that we stay in when we travel. I hope some braver gay couples could sue and report this establishment.",
      "rate": 1.0,
      "tripDate": " June 2014"
    },
    {
      "title": "1. Inadequate services as advertised on web site - TV had blurry spots that it hurts to watch it & no Internet as hard line was ",
      "text": "1. Inadequate services as advertised on web site - TV had blurry spots that it hurts to watch it & no Internet as hard line was broken & stuck behind the panel (not wireless either). 2. Room with jacuzzi, has the toilet out in the open with no walls and located nearby the bed. No bubbles for the jacuzzi. We even asked for & they provided soap. LoL! 3. Thin walls as you could hear noises from both the adjacent rooms and outside. 4. Both individuals (lady and gentleman) were unprofessional. Му experience...I called at 1pm to reserve the room w/ a  jacuzzi, but was told (by a lady) that they don't take any reservations?! Was told to be there w/ the people who'll also be staying in the room at 5pm. So I did just that, I booked the room w/ the jacuzzi w/ му girlfriend. First impression, the room was very spacious then it was downhill from there. First off, it was freezing in the room as the heat was turned off. Secondly, the toilet was out ίи the open (with no walls at all & unlike the shower area), aиd was a few feet away from the bed. Romantic setting was ruined, as it was really uncomfortable seeing the toilet area not enclosed. We immediately requested to switch to a room that has an enclosed toilet area (no more jacuzzi).Τhe night got worse... 1) We noticed the TV screen had blurry/static spots, which hurts your eyes from looking at the TV screen. 2) NOT WIRELESS and the hard line for the Internet connection (below cable connection) was non-existent. I called the front desk and she arrived to check it out. I was then told there was nothing that she could do about the TV, but in addition to that, she commented that she wouldn't mind watching the TV like that w/ the screen filled with spots/static lines. Told her it wasn't possible to watch TV without your eyes hurting and/or getting a headache, so I turned the TV off. I then asked about the internet connection aиd where to connect it. She found it was stuck inside the plug socket and unless the panel was removed, we could not connect to it. With no internet, and the TV not working properly, I asked for some kind of reimbursement as both services they claim to provide, were now unavailable. She said no, they don't do that. So I then asked to be moved to another room. She quickly replied and was told they were fully booked. I opened the door and checked outside and found the parking lot was half empty! She then said, but if you want to check out, you can check out now. We were already exhausted prior to getting there aиd just wanted to bear w/ it, relax & unwind. Then around 9-930pm, we heard our doorknob was rattling as someone was trying to get ίиto our room! I asked who it was through the door, to which he claimed \"he's the cleaner\"?! I looked out the window and saw a suspicious looking gentleмaи carrying what looked like a bucket of materials, not cleaning supplies. Since it was nighttime already aиd looked really suspicious, I told him we didn't call for one and to go away. It was really weird that he'd tried to get ίиto our room BEFORE knocking on our door. Immediately right after that, we heard footsteps around the back area of the washroom. Took a quick peek out the window, no one was outside but when I checked the window lock, I found it was broken! It could not be secured and noticed you can either push the window or lift it from outside with ease. We were already disappointed by the services NOT provided for us as advertised and we're now freaked out altogether by those events. Worried about our safety, I acted quickly and barricaded the door with chairs along w/ the TV dresser, just iи case he tries to get in again when were both asleep! I temporarily secured the bathroom window w/ the stick from the blinds to prevent the window from being lifted amd then leaned a painting on the window glass. The noise itself would've woken us up, ίи case they push the window open. After giving some much re-assuraиce to my girlfriend that we're safe being inside and that no outsiders is able to come ίиside. It was practically quiet from then on, other than the faint noises you can hear from the adjacent rooms aиd outside. At 1055am, we were woken up by this loud knocking on му door, saying it's 11 o'clock aиd it's checkout time! We quickly got dressed aиd packed our stuff aиd headed for τнe receptionist to return our key. Upon asking for our deposit, we were approached by a gentleman. He said there was a charge of $50 for checking out late! I addressed the inadequacies of their services - no TV aиd Internet along w/ the disturbances that night aиd finding the bathroom window lock was broken. They say they'll charge us for late check-out next time. I grabbed му $10 deposit aиd we both vowed to post our terrible experience in staying at Park Motel on Kingston Road. More importantly, to NEVER EVER come back here again!!!",
      "rate": 2.0,
      "tripDate": " January 2013"
    },
    {
      "title": "Terrible, Smokers Lounge!",
      "text": "Specifically told the lady that we wanted a non-smoking room, gave us a room with smoke filled smell. The sheets were dirty and some parts burned probably from a cigarette. The room was cold and remained cold throughout as heating was increased. The location was good, free parking was good as we parked right outside our door. Not worth the price we paid for an extra $20 we could have been well off in a nice hotel. The suite was very large though.",
      "rate": 1.0,
      "tripDate": " February 2011"
    },
    {
      "title": "nice place to stay, affordable rate for a self-employed traveler",
      "text": "I got a king-size beded  room for a week. Very affordable rate.Very quiet place, clean and warm room, electical heating with temperature adjusted...Free very fast cable internet, much reliable than wireless...Small motel, limited staff but very caring.I will come back for sure..",
      "rate": 4.0,
      "tripDate": " January 2010"
    },
    {
      "title": "Owners have no compassion!",
      "text": "Tried to get a room at this motel on Christmas Eve, when Toronto had a power outage.  We live down the street and our power was off for 3 days, and we were freezing to death.  They had a room available, but would not give it to us because we had a little 18-pound dog.  My husband even offered to pay them extra.  Talk about callous!  You'd think at a time like this, they could have bent their rules a little.  After all, people died in this outage!  We had to go back to our powerless house and freeze for another night until the next morning when we left the city.Too bad, owners, that you don't know the meaning of customer service or of just being good human beings!",
      "rate": 1.0,
      "tripDate": " December 2013"
    },
    {
      "title": "Dump",
      "text": "This place is a total dump. As you drive in you are greeted to an elderly man pulling food out of the garbage collected from the rooms and piling it up on top of a filthy dumpster so the seagulls and rats can congregate for a meal. The place is crawling with crackheads and hoodlums. In and out of their rooms. Yelling and screaming all day. Smoking by the enterance. The cleaning staff are nice and seem to be doing their best with what they are provided with.At night at least the area is quiet.",
      "rate": 1.0,
      "tripDate": " August 2019"
    },
    {
      "title": "Worst place ever!",
      "text": "The only reason that I booked a room at this motel was because every other place in the GTA right through to Durham region was full. What a mistake! It was by far the worst place I have ever stayed at. Very old and almost nothing worked. The \"office\" was a small cubicle and the girl working there was behind a one inch sheet of Plexiglas. I had to slide my info under a small opening on the bottom. And I needed a government issued photo ID!I could go on and on, but I think you get the general picture. NEVER again!!",
      "rate": 1.0,
      "tripDate": " July 2017"
    },
    {
      "title": "Not even worth 1 /5",
      "text": "This is the worst place Ive ever been to. When we were checking in a guy was renting a room for an hr to have some hocker over. The \"office\" had a very bad smell and the employee hardly spoke English. Then we get to the room. Walls paper thin, bad smell, toilet didnt work. And the icing on the cake......bugs. There were bugs crawling over the floor and on the beds. My 5 yr old freaked out and said she was not staying there.  Luckily my 3 month old was on laying on the bed.  When we asked for our money back they told us it was their policy no refunds. We booked through expidia. We got money back for one night but not both. We ended up paying $108 to see some ants in a hotel room. Never again will our family be using a non-chain hotel. I am all for supporting local businesses but after this experience, especially with 2 small children we will spend the extra to have the comfort knowing we arent going to end up at a place like that. They are very rude and uncompassionate! We ended up at the Best Western and they were amazing. Turned our trip around.",
      "rate": 1.0,
      "tripDate": " July 2017"
    },
    {
      "title": "DID NOT STAY HERE VERY RUDE",
      "text": "very rude & arrogant they do not know how to run a business, unorganized, disrespectful after confirming my reservations for 4 nights get there they only had 2 nights after sending them my dates i was going to be there and asking them to email me back confirming the reservations (which they did) luckily i found another place to stay nearby .... will never stay there",
      "rate": 1.0,
      "tripDate": " October 2013"
    },
    {
      "title": "dirty sheets with condoms in our room",
      "text": "Very dirty. We got dirty sheets with condoms in our room. Lots of hair on the pillows.Disgusting. The bath tub was full of dirt. It wasn't even rinsed with tub water! There is no Wi-Fi internet, so don't be tricked by the description of this motel!The worst experience ever! We got there about 11pm. We were told that nobody comes that late so the motel charged our card. I didn't want it on my card because of the card fees. I didn't see in a motel policy stating that if you come after 11pm your card will be charged. We got to the first room but after I saw  dirty sheets with condoms I asked for another room. It wasn't any better. Lots of hair on the pillows and in the bathroom. The bath tub was full of dirt. It wasn't even rinsed with tub water!Hardly any light in those rooms. Not all the light bulbs were working.The description on priceline is inaccurate. There is no Wi-Fi internet!",
      "rate": 1.0,
      "tripDate": " June 2013"
    },
    {
      "title": "Worst Service ever",
      "text": "I have never seen any place with such terrible service. (Check in Sat 11 May 2019). I asked for a smoke free room and unfortunately got one that was smelling. Thats not the worst part coz previous guests can do that. I called the Assistant Manager and without even coming to tok to me direct and seeing the room he told me that it was my fault coz i told him abt the error an hour later instead of immediately and would not even change my room. The manager wasnt in and so i had to sleep somewhere else coz i got hay fever. I was blamed for checking into a smelly room that was also dirty. Never again!!!",
      "rate": 1.0,
      "tripDate": " May 2019"
    },
    {
      "title": "Rude, Arrogant, Racist",
      "text": "My husband and I arrived at this motel 01/19/2013 at 3 pm.  I told the ignorant little man behind the window that I was a CAA member and he refused to give me the 10% discount and told me to go down the street as there were better motels than his.  Both my husband and I were present (interracial couple, both in our late 50's, not children by any means), there was only 2 cars in the parking lot, lots of empty rooms and he said that he might have reservations.  I told him what he was saying did not add up and asked if there was an issue he had with myself and my husband.  LORD ALMIGHTY, he flew off the handle and started yelling profoundly.  Pitiful sight, almost to the point of pathetic.  I am going to lodge a complaint with CAA in writing and will expect a reply from CAA regarding this matter.",
      "rate": 1.0,
      "tripDate": " January 2013"
    },
    {
      "title": "Didn't stay there!",
      "text": "I tried to make a reservation through their website 4 days prior to my arrival.  I waited 2 days without a response.  I called the hotel (their automated system stated press 0 for reservations), I spoke to someone (thick accent) who stated that they DO NOT do reservations over the phone and they only way to get one is online.  I re-did the online reservation (stating that it was my 2nd attempt as not to have 2 reservations). Still no response, so I called again and was once again told that they do not take reservations via the phone.  I explained that I had already tried twice without a response and was told someone would get back to my emails shortly.   The day before I was supposed to travel I received the following response.Thank You.... this is the first and only one email that we have received from you....!!! there is no room available (single double-bed) ....there is only queen-size bed room for $60 tax included a night....to hold on the room we will require your personal credit card information after the reservation confirmation... this is not a reservation confirmation.. sincerely Park MotelNOT IMPRESSED!  Stayed elsewhere!",
      "rate": 1.0,
      "tripDate": " July 2012"
    },
    {
      "title": "Wi-Fi is not working but they say high speed",
      "text": "I and my husband travel to Toronto. We stay there. But receptionist had communication issues. Could not converse in English. Room is standard clean. Room was not cool enough. Wi-Fi is not working. But they say high speed internet.",
      "rate": 2.0,
      "tripDate": " March 2016"
    },
    {
      "title": "Excellant hotel for the value",
      "text": "I travel to Toronto to work every week and have been staying here for over 1 year now.  Rooms are clean and very reasonably priced.  Staff are very friendly and very helpful. I would recommend staying here to all my friends",
      "rate": 3.0,
      "tripDate": " April 2015"
    },
    {
      "title": "Manageable only for a couple of Nights at the max",
      "text": "As the heading says book maximum for 1 or 2 nights not more. I had to book this Hotel due to the urgency of the visit and budget limitations. However this didn't appear to be decent enough even for the $75 before tax per night cost of this Motel. The location is far from Down-Town Toronto. If you are coming for work purpose to Toronto then best to spend a little extra and book a place near to office.And at $75 per night before tax this Motel isn't exactly cheap. The staff is good, co-operative and cleaning is decent, however Internet Connection is bad to worse.No wonder this should be avoided by tourist under all circumstances. People coming for work or driving through Toronto and know how to travel within GTA can select this option.",
      "rate": 2.0,
      "tripDate": " October 2017"
    },
    {
      "title": "ok but could be better",
      "text": "there was hairs in our bathub,credit card transaction wasn't working, reception could be renovate to get more space for customers(4 customers max can get squeezed in that litlle booth called receptionsize of room for the price was good though",
      "rate": 2.0,
      "tripDate": " September 2017"
    },
    {
      "title": "Okay for one night",
      "text": "My wife and I stayed for a night. The room was clean, the internet speed was decent (at least for check email and browse websites, but not for video streaming), the mini fridge was working and the desk staff were polite. I would say this motel is okay for one night.",
      "rate": 3.0,
      "tripDate": " August 2017"
    },
    {
      "title": "Don't waste your money here",
      "text": "Receptionist had communication issues. Could not converse in English. Reserved a room with queen bed, got double bed instead. Bathroom shower curtains had stains. The room Air conditioning was not effective, refrigerator had a bad smell. Room was not cool enough",
      "rate": 1.0,
      "tripDate": " September 2015"
    },
    {
      "title": "Great value for money",
      "text": "Great value for money compared to staying downtown and with no parking charges that saves you 30$ on a downtown hotel. Access to downtown via Bus and Tube was easy and cheap. I loved downtown Toronto but was great to come back to the Park Motel for peace and quiet.My room was great, king size bed, and wired internet access was great ( the lady gave me a cable to use) Free coffee in the mornings in reception. Excellent value for money, I would definitely stay here again",
      "rate": 4.0,
      "tripDate": " September 2012"
    },
    {
      "title": "Only If your desperate...",
      "text": "Mold all along the edge of tub I had to clean it with their towels before I could use it... The bed still had the plastic bag on it when new...... It was far from new. It had a throw carpet on the floor and It made my white socks brown..... The reception area should warn you right off... A 3 foot by 4 foot area with clerk behind 3/4 in bullet proof glass with a small slot he could push the credit card machine part way through but not all the way... Just enough for you to put in your pin code..... Not a single smile........ WiFi sucked  Air Conditioner was so loud and clunky had to shut if off in 30' C heat. to try to sleep.",
      "rate": 2.0,
      "tripDate": " July 2019"
    }
  ]
}