{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Park Hyatt Toronto",
    "url": "/Hotel_Review-g155019-d183076-Reviews-Park_Hyatt_Toronto-Toronto_Ontario.html",
    "priceRange": "$$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.5",
      "reviewCount": 2153
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "4 Avenue Rd",
      "addressLocality": "Toronto",
      "postalCode": "M5R 2E8",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/22/e4/36/ea/in-toronto-s-effervescent.jpg?w=500&h=-1&s=1"
  },
  "description": "A legacy, reborn. Anchoring an unparalleled corner of Toronto’s elite Yorkville neighbourhood, the iconic Park Hyatt offers a reimagined hotel experience with timeless sophistication rooted in Canadian heritage. A refined blend of art, architecture, and design thoughtfully energizes the space with dignified craftsmanship and quiet confidence. By combining themes of luxury, heritage, deco, and glamour with literature and the city’s rich Indigenous roots, steadfast pillars form a curatorial vision through which the signature art collection of Park Hyatt Toronto unfolds. Creativity knows no bounds at the Lobby restaurant, where originality and a fascination for flavour are the cornerstones of its exquisite culinary experience. Lasting memories continue in the 17th-floor cocktail bar, where reinvented classic libations that nod to literary legends are mixed table-side and pair harmoniously with unrivalled Toronto skyline views. The revered Spa redefines luxury with a collection of relaxation treatments and curative products powered to rejuvenate and restore. Through the profound evolution of Park Hyatt Toronto, deeply personalized service remains at the heart of its remarkable transformation.",
  "featues": [
    "Valet parking",
    "Free High Speed Internet (WiFi)",
    "Fitness Center with Gym / Workout Room",
    "Bar / lounge",
    "Bicycle rental",
    "Patio",
    "Pets Allowed ( Dog / Pet Friendly )",
    "Conference facilities",
    "Paid private parking nearby",
    "Wifi",
    "Fitness / spa locker rooms",
    "Sauna",
    "Restaurant",
    "Breakfast available",
    "Breakfast in the room",
    "Complimentary Instant Coffee",
    "Outdoor dining area",
    "Wine / champagne",
    "Rooftop bar",
    "Banquet room",
    "Meeting rooms",
    "Spa",
    "Couples massage",
    "Facial treatments",
    "Foot massage",
    "Full body massage",
    "Hand massage",
    "Head massage",
    "Manicure",
    "Massage",
    "Neck massage",
    "Pedicure",
    "Steam room",
    "Rooftop terrace",
    "24-hour security",
    "Baggage storage",
    "Concierge",
    "Non-smoking hotel",
    "Doorperson",
    "24-hour check-in",
    "24-hour front desk",
    "Express check-in / check-out",
    "Private check-in / check-out",
    "Dry cleaning",
    "Laundry service",
    "Ironing service",
    "Blackout curtains",
    "Bathrobes",
    "Air conditioning",
    "Housekeeping",
    "Room service",
    "Minibar",
    "Flatscreen TV",
    "Walk-in shower",
    "Safe",
    "Telephone",
    "Wardrobe / closet",
    "Iron",
    "Private bathrooms",
    "Radio",
    "Bath / shower",
    "Complimentary toiletries",
    "Hair dryer",
    "City view",
    "Landmark view",
    "Non-smoking rooms",
    "Suites"
  ],
  "reviews": [
    {
      "title": "Park Hyatt Toronto -- Getting there but a few 'teething' issues",
      "text": "Overall, a very good experience. Great guest room design and sleek, contemporary overall look for the hotel. Some room cleanliness issues were noted on arrival. I would also suggest that the complimentary plated 'goodies' left in the room for my arrival could have been removed after a day or so.    Staff were very attentive, responsive as well as proactive. Food quality was excellent, except for the coffee served at breakfast on my last day -- close to undrinkable it was so bitter. The view of downtown Toronto from the Writers (shouldn't there be an apostrophe??) Room bar on the 17th floor is hard to beat.Finally, while there isn't much that can be done about it at this stage, the window soundproofing in the meeting room was definitely sup-optimal.",
      "rate": 4.0,
      "tripDate": " November 2021"
    },
    {
      "title": "Five star",
      "text": "It’s hard to fault the Park Hyatt pretty much anywhere in the world and Toronto is no exception. My one issue for Mgmt is to reconsider the massive amount of plastic bottles. It think while recently revamping the hotel you should have brought purified water taps to all rooms, especially the suites. You must be throwing out 1000 plastic bottles a day at this hotel. Would be nice to see you get a lot more green here and less waste.",
      "rate": 5.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Beautiful Hotel",
      "text": "Recent renovations are fresh, modern and beautiful.  The shower was excellent as was the lighting (motion sensitive night lights under the bed, for example);  Numerous plugs to charge devices, outstanding bedding and pillows.   Room service was a little delayed but worth the wait as food was amazing and the gentleman who delivered it was lovely and uplifting.   Clean, safe, great location and friendly employees made this brief stay very pleasant.",
      "rate": 5.0,
      "tripDate": " May 2022"
    },
    {
      "title": "Disappointed",
      "text": "Beautiful hotel to look at. Client service however was terrible. Requests by phone for toilet paper, tissues etc routinely ignored by staff requiring multiple follow calls. Room service orders were nearly all wrong with missing or incorrect items. Most disappointing was the very poor sound isolation between room and corridor. Room 929 next to the elevator was incredibly noisy for such an expensive hotel.",
      "rate": 2.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Great Looking Hotel, Bad Service",
      "text": "Overall, my stay was poor due to the service. I do not think I could recommend this place to my friends or family based on my experience. As a Hyatt Explorist, I will stay at a different location if I ever visit Toronto again. This was my first time visiting Toronto, so it made my experience especially worse.First, Hyatt would not adjust the rate I paid when my flight was delayed. I do not attribute the delay to them at all but how they responded wasn't my expectations of how customer service should be at a Park Hyatt. My flight had been delayed 12 hours, so I wouldn't arrive until the next day, and the front desk was notified. They refused to adjust the rate or issue a single night refund, citing the \"buy 2, get 3rd night free\" promotion. While that is technically true, it is also false. Had I booked two nights instead of three, I would have paid far less. Even now, they're still running the promotion where 3 nights ($1,861.52) is still more expensive than just booking 2 ($1,517.37).Second, after we eventually arrived, I had asked the front desk if we were eligible for any upgrades since we booked via Virtuoso and my Explorist status. The person (I don't wish to identify anyone since I don't want any person to be singled out for punishment) told me that there were no upgrades available. Five minutes later in my room, I looked on Hyatt's website, and it showed that suites and high floor king deluxe rooms were still available. We were on a lower floor with the window facing a wall. I do not appreciate being lied to. Either tell me I don't qualify or tell me I do.Third, after my stay, I had called to inquire about some discrepancies on my bill. The front desk offered to notify the manager to call me and confirmed they had my contact information. It has been almost five days with no call or voicemail.Overall, this level of service is very low compared to other Park Hyatts I've stayed at and any of its rivals' equivalent properties. I don't believe I could recommend any of my friends or family to stay at this location.",
      "rate": 1.0,
      "tripDate": " September 2022"
    },
    {
      "title": "This hotel deserves all its stars",
      "text": "This is a beautiful looking hotel. The room I stayed in was very large, the temperature in the room was great, the meals during my business stay were creative and delicious, and the service from everyone I met was excellent. The bar on the 17th floor has a beautiful view of the city and an outdoor patio. Also, check in/out was a breeze - checked in early with no problems and check out is noon, which is a rare luxury these days. If you book a meeting room, make sure you get the Terrace room. You won't regret it. Again, the windows on 2/3 of the wall make for a great setting.A couple of minor things: heads up that the traffic right now in this area of Toronto can be pretty bad. Makes hailing a cab a slight hassle. Also, the boardrooms are in a different tower from the bedrooms. That just makes it slightly awkward if you have a meeting the morning you are checking out as you have go to the other tower to get your luggage. But it wasn't a problem.Great stay!",
      "rate": 5.0,
      "tripDate": " August 2023"
    },
    {
      "title": "Do not visit this hotel!",
      "text": "I, nor my friends will ever step a foot in this hotel again! The best part of our visit was the valet parking, where they were pleasant and professional, but sadly our experience went rapidly downhill once we entered the hotel itself. The staff in the Joni Restaurant were so rude, arrogant and slow that we gave up and left and proceeded to the Writer's Bar on the 17th floor. Once seated in a booth I politely asked for the table to be wiped down, since the table top was so filthy that my shirt sleeves were sticking to the table top.  This request was ignored and despite two of our party being guests at the hotel we received no service. I felt that I was being discriminated against and will never step inside this establishment again!",
      "rate": 1.0,
      "tripDate": " January 2023"
    },
    {
      "title": "Beautiful room and exceptional service",
      "text": "We had a standard room that exceeded expectation on every level starting with the layout which was not your standard set up.  The mini bar, Nespresso machine and drinks cabinet in the 'entrance lobby was a classy touch and the bathroom was beautifully designed and finished with a huge walk in rain shower.The good quality bluetooth speaker was another big plus as were the low lights that came on if you needed the bathroom in the middle of the night.Every member of staff was always polite and always helpful and went out of their way if you needed advice or directions on where to go in Toronto.Perfectly positioned for the Museum, Casa Loma and a really swish shopping district.  Jump on the Metro at Museum station and you can be at Union (for the CN Tower, Aquarium, Blue Jays Stadium etc.) in 15 mins.",
      "rate": 5.0,
      "tripDate": " May 2022"
    },
    {
      "title": "Exceptional hotel",
      "text": "The overall experience was exceptional. Rishi the concierge was super helpful in organising an emergency hair appointment for my wife near to the hotel and she was over the moon with the results, following a haircut-gone-wrong back home. All of the staff were amazingly friendly and helpful. Our room was well equipped, very comfortable and prepared to a high standard.Our choice of room was driven by the need for a bath for my wife who can’t have showers. This did make our room option quite expensive as they are only available in the higher rooms.We are used to this with city hotels but worth bearing in mind.",
      "rate": 5.0,
      "tripDate": " February 2023"
    },
    {
      "title": "Unbecoming of a Park Hyatt",
      "text": "I had heard that there were recent significant renovations in the facility was just reopened several months ago. That being said, our experience was very disappointing even though we were technically using “points.”  Upon multiple occasions including upon check-in and other interactions with staff it seemed that the staff did not coordinate previous requests. For instance I did not receive any response from an email to the concierge requesting afternoon tea service to be taken in our room and so I had to call the hotel a day later; while I was promised a response from the concierge to arrange both the tea service and airport transportation, I did not receive details until the next day. Moreover, the transportation service actually texted me in the middle of the night albeit a day early such that I had To contact the hotel again to ensure that they have the right details at which point I found that hotel staff had booked the wrong service for me. On the day of check-in the concierge did not seem to know anything about the afternoon tea request and I had to remind the staff and ruin the surprise for my wife. When we finally did get into our room, though I instructed the staff as to when we wanted to have tea, it arrived an hour late and staff seemed to forget about the bottle of champagne that I had also ordered (no champagne price was given to me ahead of time either) and champagne arrived 45 minutes later after we had nearly finished our tea. Moreover, when we asked the concierge about the house car/shuttle service within the city center, the concierge was completely unaware of the service even though it was clearly listed on the website and she actually googled the information in front of us and still could not help. Only the doorman were able to tell us that the service was available with extremely limited hours so we were unable to take a advantage of this.My wife and I were extremely disappointed by the service at the hotel and do not feel that the Park Hyatt Toronto reflects the standards of a Park Hyatt or frankly Grand Hyatt/Hyatt Regency level and I have received more attentive service in a Hyatt place. I do not believe that I received adequate value for my points and would be especially upset if I had paid for this visit.",
      "rate": 3.0,
      "tripDate": " July 2022"
    }
  ]
}