{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Pembroke Guest House",
    "url": "/Hotel_Review-g155019-d2336895-Reviews-Pembroke_Guest_House-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "2.0",
      "reviewCount": 6
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "117 Pembroke St",
      "addressLocality": "Toronto",
      "postalCode": "M5A 2N9",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-s/02/2c/8f/30/fancy-shower.jpg?w=500&h=400&s=1"
  },
  "description": null,
  "featues": [
    "Paid public parking on-site",
    "Free High Speed Internet (WiFi)",
    "Non-smoking hotel",
    "Outdoor furniture",
    "Dry cleaning",
    "Laundry service",
    "Air conditioning",
    "Additional bathroom",
    "Desk",
    "Sofa",
    "Coffee / tea maker",
    "Kitchenette",
    "Flatscreen TV",
    "Bath / shower",
    "Iron",
    "Microwave",
    "Refrigerator",
    "Kitchenware",
    "Complimentary toiletries",
    "Hair dryer",
    "Family rooms"
  ],
  "reviews": [
    {
      "title": "suspect staff that look at guests as if they are fugitives",
      "text": "Long dingy halls that go up and down, was a mansion that was long ago converted: bathrooms acceptable, room reasonable but current guests are a little sketchy. No parking. NO services, its a vending machine situation . Located in a part of town that may not appeal to all visitors",
      "rate": 1.0,
      "tripDate": " June 2021"
    },
    {
      "title": "The worst, overpriced hotel I've ever stayed in.",
      "text": "I stayed at this atrocity in Toronto because I had an international layover.  I was so tired from a day of traveling and would have picked up and refused to stay here if I wasn't. The Pembroke Inn states their rooms are meticulously designed. Mine was something out of a nightmare. And after paying $253 USD plus they put a $200 extra hold on your credit card for \"damages\". It was kind of ironic they did this, because the room was already tore up before we got there. I stayed in Room 119. The hallways were dark and dank. There's a homeless encampment about 200 ft from this hotel made up of tents. I felt that I was in a terribly unsafe part of town. Their website states - \"The well-appointed private bathrooms are designed to offer a spa-like experience. Step into the sleek, modern shower...\" Please look at my bathroom pictures and ask yourself if the shower looks \"spa-like.\" I encountered tons of mold and ceilings that looked like they may fall down. The shower did not drain properly and you stand in about an inch and a half of that moldy water. Then there was the rusty towel rack/toilet paper holder in the bathroom. Coming out of the bathroom and heading to bed, I stubbed my toe on a piece of laminate flooring that had peeled up (see floor picture). I booked this hotel because it was supposedly \"right near\" the Distillery District and I thought I'd see Toronto while I was on layover. The Distillery District turned out to be at least a 35 min walk through a shady part of town and I decided not to chance it and stayed in the room to rest until morning to leave. This hotel ruined my Toronto experience. To top it off, for the expensiveness of this filthy room, I'm sure there were about 100 other beautiful motels in safer areas I could have chosen. To the owner of this atrocity - have at least a little pride and get some work ethic and clean it up. Your prices should reflect what you are offering. The room I was in was worth no more than $40USD a night.",
      "rate": 1.0,
      "tripDate": " September 2023"
    },
    {
      "title": "Quiet and affordable place in downtown Toronto",
      "text": "I stayed at Pembroke House for my last four days in Canada and can just recommend it for people who are looking for a comfortable, quiet place close to the city (10 mins walk to the Eaton Centre (shops, subway) and just a block from the streetcars). Pembroke House has the best mattresses I experienced during all my travels and has the fanciest shower i ever enjoyed (see pic). There is air-conditioning, central heating, lockers and a TV in every room (even the dorms!!). In the communal area there is a guest PC for free use and you can also use the washing machine and dryer. The front door opens with a door code and you get your own room key.The kitchen is a bit small and the dorms could be more spacious but it all works out. Furthermore the cleanliness can be improved but Dennis, the owner, promised to do something about it. And I also stayed places which were a lot dirtier (like the Downtowners Inn which is close by), so overall this is a really nice place to stay at - especially after a long flight from overseas or for some days when you just want to relax.",
      "rate": 4.0,
      "tripDate": " October 2011"
    }
  ]
}