{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Pembroke Inn",
    "url": "/Hotel_Review-g155019-d567208-Reviews-Pembroke_Inn-Toronto_Ontario.html",
    "priceRange": "$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "2.5",
      "reviewCount": 318
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "117 Pembroke Street",
      "addressLocality": "Toronto",
      "postalCode": "M5A 2N9",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/1b/1a/ee/1f/you-can-book-us-at-wwwpembroke.jpg?w=500&h=-1&s=1"
  },
  "description": "Located in the heart of Downtown Toronto, this historic property offers the contrast of old town look with newly renovated rooms. Conveniently located, this property is mere five minutes walk from the Eaton Centre, Allan Gardens, Dundas Square and many other tourist attractions including award winning restaurants. It is one of the few hotels in Downtown which has survived the York period (Former Toronto). Hop onto a street car or Subway and you are at the Toronto Convention Centre, University of Toronto, CN Towers, Rogers Center, Hockey Hall of Fame, China town,American Embassy and Harbor front within ten minutes. At Knights Inn we are committed to making your stay as comfortable as possible. All our staff members are dedicated and will provide you with excellent service, making your stay memorable.Please note we do not have parking on site",
  "featues": [
    "Paid public parking nearby",
    "Free High Speed Internet (WiFi)",
    "Wifi",
    "Vending machine",
    "Taxi service",
    "Non-smoking hotel",
    "24-hour front desk",
    "Air conditioning",
    "Desk",
    "Iron",
    "Private bathrooms",
    "Cable / satellite TV",
    "Flatscreen TV",
    "Bath / shower",
    "Complimentary toiletries",
    "Wake-up service / alarm clock",
    "Hair dryer",
    "Non-smoking rooms"
  ],
  "reviews": [
    {
      "title": "Terrible value for the money",
      "text": "I’m in Toronto for my sons UofT first year and needed a place close to his dorm, via pics in Booking this seemed like a nice place by a park. Misleading! The park is close by however it’s residence to many homeless people so walking around just seemed dangerous. In the hotel rooms are tiny, no closet available and cleanliness is really bad. I had a spider today walking in the shower and the room was not made up as according to them I didn’t leave a card on the door (card that does exist!). Beds are ver uncomfortable as they don’t have normal pillows but rather cushions, and the AC unit is super loud. Being fair the staff is very nice and the place has some cool decor, a cute garden and complementary coffee.However for the daily rate I could have stayed more comfortably, clean and safe in the many hotels In the area.",
      "rate": 2.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Renovation in progress ",
      "text": "The staff was friendly and helpful, but I had to move twice within 9 days as my rooms were still not renovated and therefore not in good conditions. Most annoying were disrespectful other guest being extremely noisy well after midnight. Location is poor as well, min 25-30 min walk to center.",
      "rate": 2.0,
      "tripDate": " March 2020"
    },
    {
      "title": "Way overpriced",
      "text": "This cost us nearly £900 for 5 nights.  1st night at 04:40am the fire alarm went off. Someone apparently had vandalised the mechanism and set the bell off. We all evacuated but the staff did not have a clue. Not a single word or directive made. The fire fighters arrived and thankfully gave the all clear. When your neighbours (in any direction) shower is turned on, it sounds like you are walking under Niagara. Deafening. No wardrobe, just 3 hangers on a 5 inch rail. The bed sloped into the middle. The noises, bangs and creaks from other floors all night was unbearable. Just checked out and gasping for sleep. Terrible VFM.",
      "rate": 2.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Hidden costs everywhere.",
      "text": "Want to park at the hotel, costs you extra. Want to checkout late, costs you extra. Want some water, costs you extra. Want a room with air conditioning costs extra. Wifi that actually works, surprise need to pay more!The power went out 3 times in our trip. The staff were not capable of fixing the problem. People in the rooms next to us put extension cords out in the hallway so they could have power. The walls are so thin that when the room next to us has a shower we couldnt hear the TV. Do yourself a favour and stay anywhere else!!",
      "rate": 1.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Comfort at an affordable price with great service!",
      "text": "I stayed here for 4 nights over Canadian Thanksgiving Weekend and booked online around 6 months in advance. Trying to find somewhere affordable and easily accessible in central Toronto proved difficult and I was really pleased to find this place!Easily accessible from downtown on foot or by bus and tram, the hotel offers budget accommodation with small hints of comfort at no extra cost.I loved the cleanliness of the room and the bed was comfortable. Complimentary toiletries were a nice touch and a lovely big shower and gallons of nice hot water.Air con worked well and the huge TV in the room connected easily to my Netflix account for evening entertainment. Fast and reliable WiFi.The complimentary coffee in the morning was a really lovely touch and the staff were friendly and welcoming.Only thing that I can say that was a minor inconvenience was the noise of doors slamming and people in the room above me. It’s an old building and I had a room in the basement. It didn’t take away from my enjoyment though. I’d absolutely stay here again and highly recommend it to anyone travelling in the area!Thanks for a pleasant stay!!",
      "rate": 4.0,
      "tripDate": " October 2023"
    },
    {
      "title": "Looks can be decieving...",
      "text": "The Pembroke Inn looked reasonable from the street, and was walking distance to our daugter's place, so we thought we'd give it a try - but it turned out to be by far the worst hotel we've ever stayed in.  We got a basement room that smelled of sewage, with glass brick windows that obviously wouldn't open.  The bathroom featured a toilet that wasn't attached to the floor, taps that were loose. and a filthy shower with a drain cover that was not attached.  The baseboards showed signs of water damage, and the walls were in rough shape.  To top it off, there were all sorts of shady looking characters roaming around the property.  The front desk staff were pleasant enough, but this was hardly enough to compenste for the abysmal room.",
      "rate": 1.0,
      "tripDate": " September 2021"
    },
    {
      "title": "Absolutely horrible.",
      "text": "This was the worst stay of my life, although technically I didn't even stay! This property charged my despite needing to leave due to security issues. They house at-risk community for a fraction of what you pay and allow aggressive individuals to roam the hotel without masks. As a single, young female it was clear I could not stay here and when I confronted management about it they assured me they would refund me but their computers were down so I could go to my dinner reservation and they would take care of it when I returned. Once I returned, they informed me since my bags were in my room for a few hours they would charge me for the first night. I reminded them that I tried to leave immediately but was told their \"computers were down\" but they wouldn't budge. Absolutely dispicable! I hope Expedia removes them from their site as no one should have to stay under such conditions or pay for a room they didn't even use!",
      "rate": 1.0,
      "tripDate": " August 2021"
    },
    {
      "title": "Very nice place to stay at a very good price",
      "text": "I’ve stayed at this inn few days and I was not disappointed. The room was nice and the bedsheets very clean. There were very good soap bars available as well as shampoos and conditioners. The service was impeccable and the location was ideal. I recommend it without any hesitation.",
      "rate": 5.0,
      "tripDate": " August 2022"
    },
    {
      "title": "LauraH",
      "text": "Not a safe place for solo women travelers.  They keep the doors unlocked for customers \"convenience\" however with the number of homeless in the area, I would have felt safer if they locked them, after a frightening incident in the lobby. The management should  take into consideration who their guests are. And address their concerns and need.  Pay a little more and stay at one of the bigger hotels downtown.",
      "rate": 1.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Good value for my pocket",
      "text": "I was surprised at the value for money especially since it was labelled a 2 star hotel. The room was more spacious than expected with excellent lighting and modern amenities. The bed was very comfortable and the water was hot with great pressure! Staff was friendly, professional, and welcoming. The location, though in a shady neighbourhood, was ideal for accessing downtown Toronto. Great job, I will be back!",
      "rate": 4.0,
      "tripDate": " March 2020"
    },
    {
      "title": "dangerous neighbouhood",
      "text": "The staff is nothing but friendly. We had to ask everything since they weren't telling us anything about the services offered (check-in/check-out/wi-fi/parking/breakfast, etc.).On the top of that, this hôtel is situated right beside a brotel that brings many weirdos in the ward of the hôtel. I Personnaly had severe damage on my bike that was locked right beside the front door when crack-heads tryed to break the locks.",
      "rate": 1.0,
      "tripDate": " September 2012"
    },
    {
      "title": "No Parking on Site, Free breakfast",
      "text": "Could walk to all downtown attraction. No parking on site. They needed a $200 credit card/cash deposit on arrival. Rooms were super small but well clean. Friendly staff. Currently undergoing renovation ,from what it looks like. Overall, good value for money.",
      "rate": 4.0,
      "tripDate": " January 2017"
    },
    {
      "title": "Terrible doesn't do it justice",
      "text": "I can't speak for other people's opinions of this place, however I can say that I was in a taxi and at another hotel within 15 minutes of arriving.Driving through Downtown Toronto in the taxi from the airport, the quality of the location dipped rather sharply as we approached the Knight's Inn, to the point where I was getting worried about walking around at night. The type of people hanging on the streets no longer looked like urbane Canadians, but resembled more those kicked out of the bookies as it shuts its doors for the evening.Upon arrival we were greeted by a solid if unspectacular building, which is where the compliments end.We were allocated a small room in the basement. Need I go on? I shall...If the subterranean setting wasn't enough, upon entering the key into the lock was the discovery that neither the door, nor lock, worked correctly. The door in fact did not properly fit the frame. It was also decidedly shorter than a normal door - at least if your last name isn't Baggins - and I had to stoop some way to get in.Upon entry, which with an ill fitting door and wobbly lock was like throwing a greased pig through a tube, we were greeted by all sorts of delights. Too many in fact to include in a paragraph so I shall move to list form;- Holes in the walls- Unpainted patches of plaster from repairs- A small and untidy window, which like its cousin the door, didn't fitNo blinds/curtains on said window - more of a concern than normal due to the aforementioned location- Easy access to/through said window from the parking lot - with no bars in the window...which, not to labour the point that the area was not nice, was needed.- Exposed pipes/cabling underneath the window...this may sound picky, but were talking 6 inches of pipe and cabling between the skirting board and the wall- Office grade carpet- Extremely questionable stains on said carpet, one in particular was obviously poorly cleaned sick- Cracks in the wall and ceiling, again may seem picky, but they were larger than your normal cosmetic crack solved by a bit of fill and skim- Spiders webs in every corner, just a lack of attention/effort in cleaning that one- Rusty/dilapidated fixtures and fittingsI could go on, but in all honesty I'm still on holiday and haven't the time. I was just prompted by my travel agent to do so and thought I'd let others know not to make the mistake of booking here.Fortunately myself and my partner had the money to book another hotel, which we did as swiftly as possible upon arrival, but many others won't.Another tripadvisor review spoke in great detail about the location and mentioned an incident of being spat on whilst waiting for a bus, which is entirely believable. They also mentioned the fact a prostitute stayed in the room next to them and, shall we say, used the room as her \"office\". Which again, is entirely believable.I feel it said a great deal that the attendant of reception showed little or no surprise when we returned from the basement with our luggage, handed him our keys and asked him to call us a cab to go to another hotel.Worryingly, having asked to switch rooms prior to the drastic choice of booking another hotel (thanks god for free wifi) the guy in reception said the place was full and we couldn't move! Christ alive, those poor bast*rds...at least we got out.",
      "rate": 1.0,
      "tripDate": " April 2016"
    },
    {
      "title": "Affordable, Clean, Quite centrally located",
      "text": "Clean, comfortable rooms. Front desk guy jack was amazing. Free coffee in the morning . Old building, but maintained . Dundas street was not too okay, but walked through gerrard street. Harveys near by.",
      "rate": 5.0,
      "tripDate": " October 2015"
    },
    {
      "title": "SUPER NASTY-- DONT STAY THERE",
      "text": "Super nasty. Pictures are not even closer to the real hotel. Rooms were super small and super nasty!! Carpet was dirty, bathroom was nasty nasty nasty. Price was not fear for what I got. I would never ever stay there again, not even if it is for free.I went there with my whole family, we had 4 rooms, and all rooms were dirty !! The only good thing is the location.Parking is $15 per night and there is a public parking right accross the street for $5 per night.Not happy at all!! DO NOT STAY THERE.! I had a bad experiece, I hope you find something better",
      "rate": 1.0,
      "tripDate": " September 2013"
    },
    {
      "title": "BEWARE",
      "text": "My wife and I checked into this hotel Aug 27 at 3 pm room 105 and checked out Aug 28 at 8 am. We were in Toronto for a event at the ACC. My wife's jewelry  went missing from our locked room. Very up setting. When reported to Sam at the front deck on Aug 28,we were told he would check into it and please give him a call in one hour. Upon calling back was told by Sam we must call back the next morning. We  called the following day and spoke with Sam again who said no one entered our room. We asked to speak to the owner and was given an e-mail address supposedly for the owner. We immediately e-mailed the owner and after 2 days no response. We than e mailed Knights Inn from their website and again No response. Our attempts to inform the owner before contacting the police failed ??? We have now filed a report with the Metro Toronto Police. BEWARE OF THIS KNIGHTS INN.",
      "rate": 1.0,
      "tripDate": " August 2013"
    },
    {
      "title": "It's an uphill climb to 1 star",
      "text": "I first became wary when I saw all the cop cars parked on the street in the Google Street View for this address, but it was the only affordable availability in the neighborhood, so I gave it a try. It's clear that some elements are being renovated, but there's a long uphill climb to a 1 star rating. Be fair warned that if you are assigned an upstairs room, there are no elevators, only narrow stairways. My room has no furniture aside from the bed. There are 2 lamps, neither of which have a light bulb. There is a new TV mounted to the wall, but it's not wired to the cable jack in the wall. The shower is chipped and stained. There is no closet or anywhere to put any clothes, let alone an iron (I'm in town for a week long convention), nor do I expect any kind of laundry service from the delinquent attitude staff. None of the wall outlets have cover plates, and the window mounted A/C unit is plugged in with an extension cord draped across the bed. The light switch and ceiling fixture in the small bathroom have exposed electrical wiring. There is no hotel provided information concerning who to call with any questions, and the phone that sits on the floor is not marked to show how one would reach the front desk, or housekeeping etc.",
      "rate": 1.0,
      "tripDate": " July 2012"
    },
    {
      "title": "Worst place",
      "text": "I usually don't like to write reviews but I thought this place needed a review. I honestly have to say that this was the worst place I've ever stayed at in my entire life. I had to shower both days I had stayed with freezing cold water. It wasn't even close to being Luke warm. The towels were stained, hallways and ceiling just gross and it smelled bad. I would never ever come back to this place.",
      "rate": 1.0,
      "tripDate": " March 2018"
    },
    {
      "title": "No parking on Site",
      "text": "Good Hotel, Close to everything. No parking on site, 10 minutes walk to a near by public parking. You get a ticket after 3 PM on street, so one person has to wait in the car while checking in. Friendly Staff, Old building. Will definitely visit again.",
      "rate": 4.0,
      "tripDate": " May 2016"
    },
    {
      "title": "Skip if possible",
      "text": "We had reservations for 3 nights, when we arrived it was a little after 1 am. We could not find a place to park anywhere, we eventually found a spot on the street and parked there while we went it to find out where to mark, as parking for this hotel isnt marked. I ended  up getting a $30 ticket while i was in the lobby. The website said you couldnt book parking online but to book at hotel, the hotel told me no, i had to book online and he told me it was $20 but the website said $15. After that and the un-cleanliness of the lobby we decided to ask to see our room before we actually check in. Once we gotto the room, the door was wide open and we could also hear people from the room next door using the restroom. We decided to leave. They were respectful and didnt question us or charge us for that night.",
      "rate": 1.0,
      "tripDate": " October 2015"
    },
    {
      "title": "Walking distance To Ed Mirvish Hall",
      "text": "Stayed at this small property while seeing a play.  Our room was in the lower level.  It was clean.  Staff was friendly.  Bonus,  there was parking.  This is a very basic property, great for a short stay.  Walking distance to the Eaton's Center.",
      "rate": 3.0,
      "tripDate": " October 2022"
    },
    {
      "title": "Cute 2 star Inn. Thin walls though.",
      "text": "I stayed at the Pembroke Inn for 3 nights for work. Friendly front desk. Made an attempt to update the place. It's cute and clean. I liked the Nespresso machine in the room. Thin walls though. Seems to be ppl coming and going at all hours and since the Inn is a really old building, the walls are thin and you hear most things. I'm a heavy sleeper and got woken up alot. Bring ear plugs.Unfortunately, I wouldn't stay here again for that reason.",
      "rate": 3.0,
      "tripDate": " June 2024"
    },
    {
      "title": "Very happy with our stay. Such a great hotel ",
      "text": "Was pleasantly surprised what a cute boutique hotel . The room was clean and modern. Very comfortable bed. Really thought this place so unique and will definitely stay again. The staff is very friendly. The neighbourhood is very interesting with old huge heritage houses would love to know the history of this place",
      "rate": 5.0,
      "tripDate": " May 2023"
    },
    {
      "title": "Dungeon",
      "text": "Hotel rooms should not be located in dirty Toronto hotel basements.  A campground would have been more luxurious than staying in this hotel!! Room #50 in the basement is unbelievable!!  We paid for a queen bed and ended up with a double.  The tv cable and converter were missing so we couldn't watch tv.  There wasn't a single hook to hang anything on in the whole room. The only table in the room was taken up mostly by a tv.  The bathroom walls had black marks on them, the shower was mouldy, the ceiling leaked over the toilet so you got dripped on while going to the bathroom, there weren't any hooks to hang your clothes, the lightbulb was burned out, the door didn't fully shut, and the door frame was partially renovated.  We opened the blinds to reveal a vent instead of a window.  I am not sure how one would escape in a fire.I barely slept all night because I was afraid the door would get kicked in and we would get murdered in our sleep.  Also, the pipes made an unusual sound like a repetitive knocking sound.  Scary, dirty, and depressing experience!!",
      "rate": 1.0,
      "tripDate": " June 2013"
    },
    {
      "title": "Excellent value",
      "text": "We took our daughter to Toronto for her birthday to visit Ripley's Aquarium and the CN Tower. The Knight's Inn was just a few kilometres from both, and at a cost of just $90, I couldn't refuse!I will admit I was quite nervous. Having stayed in Toronto downtown many times for business, I knew $90 on a Friday night was unrealistically low. The photos online looked alright. My husband is a large guy. Deep breaths. \"We'll be fine\" I kept repeating, only a thousand times on the drive to T.O.What a great surprise! The hotel was perfectly clean, from the carpets to the walls to the bathroom sink! The linens were crisp and fresh. Yahoo! Check-in was a breeze, wifi worked like a charm, the shower was brand new! I mean, it wasn't the Delta, but it also wasn't $400. In fact, it turned out to be the least expensive part of our entire trip.  We will definitely be returning :)",
      "rate": 4.0,
      "tripDate": " September 2015"
    },
    {
      "title": "Avoid - Bedbugs present!",
      "text": "We stayed here one night in a double room, and this room didn't at all look like what was in the photos. The room was filthy, the tub was mouldy, and the radiator had fallen off the wall. The room is cramped - there is very little space around the bed, which takes up almost the entire room. When we first tried to get to sleep, it was freezing in the room, so I had to go to the front desk to ask for blankets, and the attendant said he 'would turn the heat on'. It's December! The walls are paper thin and I could hear a normal level conversation in the room next to us. Even this would all be worth putting up with considering how very cheap this hotel is. But when we woke up, we were covered in bites. Our luggage is currently outside our home, as we try to freeze the bugs out to make sure we don't bring them home ourselves.",
      "rate": 1.0,
      "tripDate": " December 2014"
    },
    {
      "title": "WE WALKED OUT......",
      "text": "We booked this hotel at the last minute as we were going to watch a Bruce Springsteen concert. What a mistake. It was by far the worst hotel experience we have ever encountered. Firstly, I parked on the street when we arrived to check in. I returned to my car 9 minutes later to find a $30 parking ticket. We had to enter the \"hotel\" through the back alley as the front was under renovations. When we entered the room, it was obvious we had made a mistake. The walls were full of holes that had been puttied over. The bed covering was at least 20 years old and when my wife pulled back the covers, she discovered stains and hair on the unchanged sheets. Although the entire hotel was old and our room was filthy, we rationalized that we would only be staying one night and we left for the concert. On our way out, my wife informed the receptionist that our sheets had not been changed and we only had one single towel. We were assured that someone would be by to correct the problem. During the concert, I hoped that nobody would be shot in or around the hotel while we were gone. We returned from the concert by subway, getting off at Yonge/College. We walked about 6 blocks, passing hookers and homeless people. We were approached 3 times for money on our short journey back to the hotel. We arrived at the hotel at midnight to find a single towel had been left on our still unchanged bed. I complained to the receptionist and asked for clean sheets. He provided two sheets and we changed the sheets ourselves. I then entered the bathroom only to find the entire bathroom, including floor, toilet and sink area, covered in water. Water was draining out of the ceiling fan from a water leak in the ceiling. I returned to Reception and asked the uninterested male to come to the room to see for himself. I told him that we were leaving and wanted our money back. He did not know how to credit my MasterCard so he called his boss. After speaking with the boss, he asked me if I could return the next day. When I told him that I lived 200 km away, he asked me if I could wait until the morning and his boss would have my credit card refunded. I again refused at which point he went to the back and returned with the cash equivalent for our room. We left the hotel by the back door to find a guy suspiciously hanging out behind the hotel. We drove 200 km home rather than stay one more minute in this old, badly renovated crack house.THIS PLACE SHOULD BE SHUT DOWN. DO NOT BOOK HERE.",
      "rate": 1.0,
      "tripDate": " August 2012"
    },
    {
      "title": "Fell like home",
      "text": "Lovely staff , the manager San was realy helpfull and nice, everything was realy clean,the room  look like the pictures. I recomend. I was there for 9 days and have nothing that i did not like it. Thanks from Brazil. Patricia.",
      "rate": 5.0,
      "tripDate": " January 2015"
    },
    {
      "title": "Beware of rodents!!!",
      "text": "As a traveler, I am normally on a tight budget and as such I believe in ensuring that I pick locations that are close to where I need to go and are clean.  They may not be the newest or grandest but once there is hot water, cable tv and air conditioning, then I can get by.I had seen some of the reviews of this place and they were not all that great, but I took a chance on it anyway, as I was only staying for 2 nights. I arrived and I was shown to room 110, its in the basement level, kind of a split level area just off the main floor.  Bed was nice and tidy, linens smelled and looked clean.  Bathroom was big and spacious and came with clean towels, soap and shampoo. There are no closets, but there is a hook thingy behind the door and a desk and chair.  I left the room and went out to see Toronto.  I got back late, say around 11 pm, and went to my room.  While I was outside the door, I hear some scrabbling sounds, figured it was coming from the room next door, so imagine my surprise when I opened the door, turned on the lights and saw a huge RAT scurrying behind the heating panel. WTH! Good thing I don't scare that easily. I reported this immediately to the night manager, who informed me that they had never encountered an incident like that before. I indicated that I wanted to move to a room on the upper floors, but they were none available.  I was shown room 47 and 50 in what is now the real basement.  It definitely is crappy on that floor.  I took room 47, which had really bad carpets, stained, no windows, a fridge that hadn't been defrosted in a while, where a previous guest's leftovers were still visible and no natural light.  The bed was clean and so were the linens.  Under the bed wasn't so clean.  I guess visibility is all that matters. I had a really bad night, as I slept with the lights on even though I was in another room.The next day I was moved to an upper floor, where the rooms are much better than those on the floors below.  I honestly tried to move to another place, but prices and availability was non-existent.",
      "rate": 1.0,
      "tripDate": " August 2013"
    },
    {
      "title": "Good for the price",
      "text": "Service, hotel and was fine.The staff was really helpful and nice.I could ask anything at the reception they would try to do their best to help me and giving good advice.Breakfast was nice and they try to improve everyday. (They have a wafle machine delicious)",
      "rate": 3.0,
      "tripDate": " September 2012"
    },
    {
      "title": "The owners made the stay",
      "text": "Very clean room, comfortable bed, good set up, clean bathroom. The hallway carpet is a bit old but that’s it. The location definitely isn’t great — I was worried about the location but the hotel staff made me feel very safe. The staff are really very kind and is the main reason I didn’t panic and go to another hotel the first night 😅.  It is a very quick drive to downtown core and centrally located to other cool parts of DT. Good place to stay if you don’t want to pay too much for accommodations (I’d rather spend my money on experiences).",
      "rate": 4.0,
      "tripDate": " May 2022"
    },
    {
      "title": "Better than expected. ",
      "text": "I booked this hotel for a night while in the city for a show.   After reading some of the reviews I was a little nervous but I was pleasantly surprised.   The hotel had a nice design and cool art work.   Yes there was a \"tent city\" in the park but that didn't bother me.   The exterior is well lit and has cameras so I wasn't worried about going outside at night to smoke.   The room was small but there was adequate storage space and it was clean.  The bed was comfortable and I had a great sleep.  I didn't see bugs of any kind as reported in some reviews. There was a fridge,  nice TV and coffee maker in the room.   There was also a lounge area that had coffee and tea, the staff had fresh coffee on at 5am which was great for an early bird like me.  The staff were friendly and helpful.  I was satisfied and would stay here again.",
      "rate": 4.0,
      "tripDate": " November 2023"
    },
    {
      "title": "Charming Inn at a Great Location",
      "text": "I've had multiple great stays at this quaint inn. While the basement room is not flashy,  the inn itself is charming and serves its purpose perfectly. The staff are always warm, friendly, and happy to help. The lobby is especially cozy and well decorated, and the downtown location is ideal for exploring. A simple gem with a welcoming vibe, thank you for everything!",
      "rate": 5.0,
      "tripDate": " December 2023"
    },
    {
      "title": "Good enough for one night and good value!",
      "text": "Nothing fancy, but the price reflects that in my opinion. Service was great-everyone I came in contact with was nice, friendly and helpful. Room was small, but clean and fairly renovated (at least the ones we were in). Bed was comfortable enough for us. AC was a little loud, but not a bad thing entirely in my opinion as it helps block out noise. Found that I could hear others in their rooms through vent in bathroom and of course in the hallway, but nothing bad or unexpected. We had a show at Massy Hall and it was well within walking distance. Coffee in little cafe area was fine; nice courtyard and indoor place to sit.Safety-it’s downtown Toronto-you will see homeless people, you will see people with mental health issues and you will see those who are on drugs, but I didn’t feel unsafe. We would consider staying again for a night if the price was right for sure!",
      "rate": 4.0,
      "tripDate": " May 2024"
    },
    {
      "title": "Beautiful and accesible",
      "text": "The hotel was beautiful and easily accessible. The downtown/ city is at walkable distance from the hotel. The reception has very good staff and can help with everything.They also have tea/ coffee available in the morning and a beautiful garden outside. We had great time there.",
      "rate": 5.0,
      "tripDate": " April 2023"
    },
    {
      "title": "Short visit to Toronto",
      "text": "The Pembroke Inn in the Cabbage Town area of Toronto may seem to be slightly off the beaten track -  but it is not. It is about a 30 to 40-minute slow walk to Queen's Park and the Museum.The Inn's friendly staff and the facilities meets up to its promises. The rooms, although small, are clean. The Wifi in the room was quite strongIt is a budget hotel that did as promised.",
      "rate": 4.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Excellent Service",
      "text": "I originally reserved for one night and decided to re-book for an additional three more nights. From start to finish to coming back the next day. The customer service was/is excellent. I would highly recommend this place.",
      "rate": 5.0,
      "tripDate": " March 2020"
    },
    {
      "title": "Definitely coming back soon!!",
      "text": "I take my time to write reviews when it’s worth it. And this is a great opportunity to talk abt how a hotel has improved. I checked several reviews before reserving, some where good some others not quite; but my personal experience was great. What do you need when coming to have a pleasant stay?  Convenient location, just 20 mins walking from Dundas square. Clean, fast wifi, helpful and polite staff. Common kitchen to take a bite before heading to the city; fair price .. all that you need to have a nice Toronto stay.",
      "rate": 4.0,
      "tripDate": " March 2023"
    },
    {
      "title": "Pembroke Inn is a lovely Hotel.",
      "text": "Pembroke Inn is a lovely Hotel. We booked months in advance and luckily we did not change our plans. Very close to Downtown Toronto, close to transport, restaurants and shopping. Nice, clean, comfortable room and the staff very friendly and professional. Very happy with our stay.",
      "rate": 5.0,
      "tripDate": " August 2023"
    },
    {
      "title": "Great spot. Clean. IGNORE bad reviews.",
      "text": "IGNORE the bad reviews. Quick check in. An issue with the AC and the guys at front desk moved me immediately. For the price this is very good. Quiet street and within easy walking of bars and restaurants. Clean room. Nice !",
      "rate": 5.0,
      "tripDate": " July 2023"
    }
  ]
}