{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Petryla Estates Furnished Apartments",
    "url": "/Hotel_Review-g155019-d653745-Reviews-Petryla_Estates_Furnished_Apartments-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.5",
      "reviewCount": 17
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "46 Waniska Ave",
      "addressLocality": "Toronto",
      "postalCode": "M8Y 1P9",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png"
  },
  "description": "Amazing Hotel Alternative. Quality Furnished Accommodations at an Amazing Value. Furnished 1, 2, and 3 bedroom Suites that include Full Kitchens and formal dining room that seats eight. We provide all furnishing, houseware, linens, 500+ channel Satellite HDTV/Radio (includes HBO, The Movie Network, and Sports package), wireless hi-speed Internet, utilities, suite controlled a/c & heating, parking, & complimentary local and North America phone calls as well as (optional) housekeeping services. Located just south of the Old Mill Subway Station in the prestigious Kingsway neighbourhood of Toronto. A very safe, quiet, upscale residential area.",
  "featues": [
    "Free parking",
    "Free High Speed Internet (WiFi)",
    "Hot tub",
    "Highchairs available",
    "Airport transportation",
    "Non-smoking hotel",
    "Outdoor furniture",
    "Clothes dryer",
    "Secured parking",
    "Wifi",
    "Washing machine",
    "Allergy-free room",
    "Soundproof rooms",
    "Desk",
    "Seating area",
    "Sofa",
    "Telephone",
    "Kitchenette",
    "Whirlpool bathtub",
    "Clothes rack",
    "Iron",
    "Wake-up service / alarm clock",
    "Dishwasher",
    "Microwave",
    "Refrigerator",
    "Kitchenware",
    "Bath / shower",
    "Hair dryer",
    "Suites",
    "Family rooms"
  ],
  "reviews": [
    {
      "title": "Good short term stay place",
      "text": "I stayed here with my family in August 2006 for three weeks. My husband stayed here for six weeks. We were there on a business and vacation trip. My kids had two weeks off from school, and they took leave of absence for two weeks extra. Our friend sent us the Petryla estate link by email, and we made the bookings online. First, the owner(Mr.Klaus Petryla) picks you up from the airport and drops you when you have to leave. He also takes you to the supermarket as soon as you get there to pick up your basic groceries. The apartments are really nice. We rented a two bedroom place. They had a separate laundry area where you have to put in coins for the wash and dryer.  There is some gym equipment for use but you can't call it a gym. The in-door pool was out of service. There is a grocery store within walking distance and the main expressway is a two minute drive away. You will have to rent a car to get around. The subway station is a good ten minute drive away. There is a pizza pizza, Can Trust Bank, Drycleaners, etc within walking distance. The place is clean. They have recycling for the garbage, which you have to empty out everyday. They tell you on arrival where to dispose of what. The place is beautifully furnished. Television has cable. You have to pay a little extra for the internet, he has wifi. We are booked to stay there again from July 21st this year for another month, in the new addition. They have a new gym and pool. Will let you know how it was!Overall, a great place!",
      "rate": 4.0,
      "tripDate": null
    },
    {
      "title": "Great appartments for a family",
      "text": "We rented a three-bedroom apartment for eight people over Christmas. The whole place was very clean. The kitchen had everything we needed, even a cheese grater which came very handy as I had forgotten ours at home. The bedrooms were fine and people slept well, only the living room sofa bed had a worn out mattress and was not functional, people found it more comfortable to sleep on the couches. There was also a problem connecting to the wifi internet but we used our smartphones. At first I was worried to see there was only one small bathroom in the apartment, but this ended up not being a problem.The location of the place is perfect, very close to QEW, 15 minutes from Sherway Gardens, about 30 minutes from Pearson Airport. The street is very quiet and the owners live in the building so any potential problem gets quickly fixed. I must add that Mr and Mrs. Petryla are willing to do everything they can to help and accommodate clients. We felt very well served.It was also very easy to shop for groceries, Costco is 2.5 km away (with a gas station at prices 6 cents below others!), Sobey's, Shoppers Drugs and the liquor store are almost across the street on the Queensway.We had three vehicles to park and were able to place them on the back of the building at no extra charge, which adds quite a bit of value to the stay.All being said, we were very pleased with our choice of this location.",
      "rate": 4.0,
      "tripDate": " December 2011"
    },
    {
      "title": "Home away from home..",
      "text": "I stayed in this place for a month, the place location is very convenient, 2 minutes walk to TTC bus, 5 minutes walk to street car, 1 minute to Library, 5 minutes to shopping complex. The neighbourhood is very nice and safe. The appartment is spacious, very well lit and lots of natural light, all utilities are there and all work perfectly, the house is furnished the way you would do it in your home. Very convenient and thought through. Folks are quite warm and helpful. The can pick you up, take you out for groceries on your first day / night, help you understand the TTC routes, help you with guidance / advise about what to do, where to visit, etc etc.",
      "rate": 4.0,
      "tripDate": " January 2010"
    },
    {
      "title": "Think again",
      "text": "Don't do it !!!  Stayed here with my family in August.The WORST place we ever stayed.Was certainely not what the website showed.  The outdoor hot tub is NOT private as stated.It sits in the back yard looking into a garage, in full view of the estate and neigthbour hood, it is shared within the complex. The water was dirty, we wouldn't use it.There was nothing to do, the aparment is Miles away from anything of interest, it took an hours journey between bus and metro to get to the city centre.The shower was old and slow, not what the picture on the website showed, the sink stopper was missing, the cooker didn't work. The filtered water was turned off. The washing machine and tumble dryer were not in the apartment but in the basement of the building, they were like old time laundrette machines and coin operated.Most of our stay the wifi wasn't working. When we said to the owners (who live on site and are always about, like in the garden or back yard working and making noise before 8.30 each morning) they laughed, and showed no interest in our displeasement, though two days later they arrived at our door with jugs of drinking water, a 2 ring electric hob, and did the washing.I definately would not recommend this place to anyone. It is way over priced for what you get.",
      "rate": 1.0,
      "tripDate": " August 2011"
    },
    {
      "title": "Stay Somewhere Else",
      "text": "I did not expect three star accommodation but I did expect a clean, adequately equipped three bedroom apartment with hot running water.   I arrived a day before the others were scheduled to arrive and paid an additional $1,200 to be allowed in.  I had already paid the $500 damage deposit.  There were numerous problems with the unit, including almost no hot water and a kitchen stove which I believed was unsafe to use.  I left the next morning and asked for a refund.  I have, to date, May 26, 2010, never received a refund of the accommodation charge nor the damage deposit.",
      "rate": 1.0,
      "tripDate": " May 2009"
    },
    {
      "title": "Great vaule and a homely atmosphere",
      "text": "Very near the awsome High Park, 24 hour supermarket and TTC lines. Huge comforatable rooms, premium cable and friendly service. Place is a little out from the downtown area but is in a quiet leafy area that has the 24 hour queen street tram service that can get you downtown in 25 mins. Klaus and Violeta are helpful onsite caretakers who have helped us out numerous times while we stayed there.",
      "rate": 5.0,
      "tripDate": " April 2011"
    },
    {
      "title": "\"Think Again\" Part 2",
      "text": "I echo the sentiments of \"Think Again\" .  Our experience was not postive.  As background, we knew the area very well (I can confirm that you will smell the sewage plant especially in the late summer months and that it isn't easy to use the TTC to get into town). But it is a relatively good neighborhood and is very quiet.  We have small children and weren’t looking for upscale. We stayed here in the summer and the owners \"forgot\" to turn on the air-conditioning during a heatwave (they try to keep costs at a minimum and we noticed no AC in the hallways). My baby cried through much of the night as she was very uncomfortable.  The owners were exceptionally rude when I brought this up and wrote me the most unprofessional email I have ever received from someone in the service industry.  One owner freely let herself in to begin changing the sheets while we were still packing and entitled to the apartment (8:00 am on departure day), which is also unprofessional in my opinion. Something to consider, is that they charge you a cleaning fee when you leave so it may not be the best value for money, especially for the short-term (of course in a hotel, they don’t charge you a fee to clean the room after you leave, so something to consider).   In short, the apartment isn't luxurious but it is clean and comfortable (as long as the AC works!). It's in a quiet neighborhood but not easily accessible by public transportation.  We liked that there was lots of space in the apartment The apartments was well equipped although many things are run down (a plus was that the bedding was brand-new). They did provide a high-chair and  I believe a crib (we brought our own) in case you have very small children.  In my opinion the owners are not service-industry oriented and are not helpful.  From a value standpoint,  it’s not the best value for money for a short-term rental especially  once you add one-time  cleaning costs. The apartments  may be better suited for longer-term stays",
      "rate": 2.0,
      "tripDate": " July 2012"
    },
    {
      "title": "Comfortable Home Away from Home!",
      "text": "Four friends rented a two bedroom apartment while we explored Toronto. Klovis and Violeta made us feel at home by showing us how to manage public transportation, find a grocery store, and find our way in downtown Toronto. Klovis took us to an amazing bakery and to a lookout point where we could see the city across the lake. The unit was very clean, well-stocked, and comfortable. We were glad to have an AC since it was hot while we were there. The trip by bus and subway takes under an hour and provided us with a nice view of neighborhoods and Torontonians. The neighborhood felt very safe even in the evening.We highly recommend!",
      "rate": 5.0,
      "tripDate": " May 2012"
    },
    {
      "title": "petryla estates",
      "text": "excellent place to stay near queen street west, toronto,good location very good host & hostess.very well looked after                            peter harrison",
      "rate": 5.0,
      "tripDate": null
    },
    {
      "title": "Excellent home away from home",
      "text": "My husband and I totally enjoyed this lovely venue close to Toronto city center.The apartment is huge, very well kept and has everything you need. From a fine equipped kitchen to a spacious bathroom with tub and a dining room.It's not only the apartment or location that makes it so wonderful to stay here, it's the landlord. After a rather late arrival, 9pm, he took the trouble to drive us to the supermarket for some shopping in order for us to have the necessary things for the first day. The next day he took us to some great places, don't miss out on the Cheese Boutique, and he was overall more than helpful.I wouldn't wanna stay anywhere else in Toronto and woud love to return.24/7 shopping at walking distance, as is public transportation that takes you dowtown in a little over 30 minutes. Nice and quiet green neighborhood, absolutely recommended!!",
      "rate": 5.0,
      "tripDate": " April 2013"
    },
    {
      "title": "Great Vacation Apartment",
      "text": "This was a great vacation Apartment. I would definitely recommend this property to stay. It was clean and had everything that was needed for sleeping, cooking, Internet etc.. was provided. The owner was very helpful and friendly. The location was perfect.  I would definitely rent here again, and all of my family and friends who came to visit during the week (we had a wedding in Toronto), couldn't believe we found this on-line. The owners were absolutely wonderful to work with. Violeta & Klaus - well done!",
      "rate": 5.0,
      "tripDate": " September 2012"
    },
    {
      "title": "Disappointing",
      "text": "The Petryla Estates were a huge disappointment.  I don’t recommend them for short term stays.The pros:  1) You have your own kitchen, which is well-equipped.  2) The apartment is clean.  3) There is a well-kept hot tub in the back. 4)  The supermarket is close by, and a couple restaurants.   The cons:  1) No air conditioning or fans.  The place was stifling.2)  In the 3-bedroom apartment, two out of the four beds were pull-out couches.  One of these was especially uncomfortable.3)  The shower ran out of hot water every day we were there.    4) Getting in to and out of the city by public transportation takes almost an hour – more, depending on where you’re going.  5) For 2 out of the 3 days the outside air smelled of industrial waste.  6) Decor leaves some to be desired – it’s like staying at grandma’s.  Lots of oranges and browns.  Nevertheless, the couches, etc, are comfortable. ***Important note:  Make sure you realize that the “total” given in email does not include a $100 cleaning fee – no matter how long you stay.  We stayed 3 nights, and were still charged this fee.  When we expressed our surprise and irritation at this, we were subjected to an awkward exchange in which the landlord basically suggested that he thought we were going to trash the place.  Customer service skills are lacking.",
      "rate": 2.0,
      "tripDate": " June 2008"
    },
    {
      "title": "Worst treatment ever",
      "text": "I rented a unit from the Petryla’s- two bedroom unit in Mississauga. When I left at the beginning of October, they did not isssue m my deposit back.  When I sent several e nails over several months, they made up excuses to deduct some of my deposit and said they would refund the balance, then kept saying they are on vacation etc. It’s March now, no refund, just rude treatment whenever I enquire. In my mind, they are defrauding people. I would not do business with them ever! Totally dishonest people",
      "rate": 1.0,
      "tripDate": " October 2017"
    },
    {
      "title": "clean decent not fancy",
      "text": "Location is about 15 min drive to downtown, quiet area and close to grocery. Subway is 10 min drive. Lakeshore is 10 min drive. Car is needed if you rent here. Apartment is large, comfortable and clean. Check in and out hours are not convenient- 5 pm check in, 10 am check out. Also a 6% tax if you pay with credit card, something we did not know- but everything is in the fine print as per Klaus, the owner. Overall no compaints, its a decent enough place that is convenient. Furnishings are from the 60s-70s but clean. If you book in advance, same price can get you condos in Yorkdale or in more centrally located areas",
      "rate": 3.0,
      "tripDate": " July 2014"
    },
    {
      "title": "Best hotel alternative",
      "text": "We stayed at this location for three nights with two couples, and loved every moment. Space is HUGE~ VERY clean and VERY tidy. Nothing special or fancy as you would expect in a 5 star hotel; but this was the perfect alternative. Rooms are spacious and open- unit comes with basic needs: coffee maker and pots, pans.. you need to bring own toiletrees and coffee grinder etc- stores are 10 min walk. We would stay again without a doubt- for the price and location.. can't beat it! Perfect for a weekend away with more space to relax than a hotel room",
      "rate": 4.0,
      "tripDate": " June 2014"
    },
    {
      "title": "Great quiet location and HUGE space",
      "text": "We were greeted at the door, and shown the apartment from head to toe. Even the channels on the tv etc! Not a 5 star place but VERY clean and comfortable! Very nice and quiet neighbourhood and grocery store etc a quick 10min walk away. Lots of space and nice little balconies to sit out in the evening and relax. Would recommend this place to anyone that likes a little bit of quiet in the city!",
      "rate": 5.0,
      "tripDate": " June 2014"
    },
    {
      "title": "Not Bad. Good for a short stay",
      "text": "I stayed here with my wife and child for 3 months.It is not bad. If staying for a while such as a few months it's decent. Not the most updated place but comfortable. Everything works fine and we had no problems for the entire period. Except for a leaky refrigerator.The owners Klaus and Violeta are very nice. They are very people oriented and easy to deal with.The apartments are about 45 minutes to the actual city, by bus and subway. However if you are for out of Canada note that it cost the same from one destination to another. You just have to ask for transfers at the subway station or from the bus driver. This allows you to go from the bus to the subway or subway to bus without paying more. This is however, for only one direction. By car commute is faster.The surrounding ares are beautiful. There is a nice path and historical paths called the \"shared path\" around. There is also a nice park. There is a Sobey's nearby but there are also cheaper groceries around. In addition there are restaurants nearby.It's a great place but not the most luxurious. So it depends on what you want.There is a sewer plant nearby. It was not a problem for us, but may be a problem in summer.",
      "rate": 4.0,
      "tripDate": " March 2013"
    }
  ]
}