{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Pimblett's Downtown Toronto B&B",
    "url": "/Hotel_Review-g155019-d290550-Reviews-Pimblett_s_Downtown_Toronto_B_B-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.5",
      "reviewCount": 110
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "242 Gerrard St E",
      "addressLocality": "Toronto",
      "postalCode": "M5A 2G2",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/08/6a/55/e4/pimblett-s-b-b-come-on.jpg?w=500&h=-1&s=1"
  },
  "description": "An Englishman's home where guest are welcome. Affordable downtown Toronto location. Parking available, fully cooked breakfast. Queen rooms, king beds, one room with a jacuzzi. Close to shops, restaurants, bars and all Toronto Downtown sites. Special tourist accommodation and business guests welcome. Wireless internet and internet desk provided.",
  "featues": [
    "Free parking",
    "Free High Speed Internet (WiFi)",
    "Wifi",
    "Free breakfast",
    "Baggage storage",
    "Non-smoking hotel",
    "Air conditioning",
    "Bridal suite",
    "Non-smoking rooms"
  ],
  "reviews": [
    {
      "title": "Convenient and Comfortable",
      "text": "I live outside of Toronto and have to goto the city for business sometimes. I prefer to stay at Pimblett's B&B over anything else I have tried. The rooms are comforable and private. The atmosphere is, well, eclectic. I get parking and a good deal.",
      "rate": 4.0,
      "tripDate": " October 2005"
    },
    {
      "title": "Breakfast of Champions",
      "text": "Finally a B & B that serves a hearty breakfast, English style with enough volume to keep you going all day!Fit, I might say, for a queen.Rooms comfortable and the proprietor a true English ecentric.Our second visit in a year.",
      "rate": 4.0,
      "tripDate": " October 2005"
    },
    {
      "title": "bewdley suite",
      "text": "Stayed in Pimbletts last year, great space in the Bewdley suite the jacuzzi could fit six in it, lovely little private deck just off the bathroom. Breakfasts were as big as you wanted them to be and accompanied by even bigger anacdotes from the proprieter. Definately a unique place to stay  ,but wouldn't be everyones cup of tea. Check out the web site before you decide.",
      "rate": 3.0,
      "tripDate": " June 2005"
    },
    {
      "title": "My Favorite Home Away from Home",
      "text": "Cozy, warm, and inviting are adjectives barely adequate to describe Pimblett's Bed and Breakfast in Toronto. Each room is charmingly appointed and exudes a unique character all its own.  The gracious host and innkeeper, Geoffrey Pimblett, always treats me like a cherished friend rather than just a returning business patron. I am happy to travel 1200 miles(2000 kilometers) round trip each time I visit, eagerly anticipating Geoffrey's delightful British humor and the heavenly aroma that wafts through the air each morning as he prepares a sumptuous English breakfast to please the palate of each individual guest. My only dilemma is that Geoffrey feeds me so well that I am rarely hungry enough later in the day to explore the endless array of pubs, restaurants, and cafes in the surrounding area.",
      "rate": 5.0,
      "tripDate": null
    },
    {
      "title": "a Victorian oasis",
      "text": "Pimblett's Bed and Breakfast is one of those gems one discovers and never forgets.  Located in the Cabbagetown district, this neighbourhood of Victorian rowhouses is a pleasant and charming place.  The proprietor, Geoffrey Pimblett, is an entertaining gentleman of English descent.  Upon entering his establishment, one marvels at the Victorian/Edwardian feel of the place.  All manner of antique china, pottery, silverware and Victorian ephemera populate the walls, nooks and crannies of this cozy, intimate place.  It's like being caught in a time warp back into the world of Jules Verne.  However, if you desire a more minimalist, corporate-type establishment, I suggest you look elsewhere.  There are plenty of those impersonal, box-like enclosures in Toronto and Pimblett's is definitely not one of those.",
      "rate": 5.0,
      "tripDate": " October 2005"
    },
    {
      "title": "We will be back to Pimblett's AGAIN",
      "text": "This is by far my Favorite B and B in Toronto. I have stayed there several times while I have been in town, and have always been treated like royalty. Mr Pimblett as usual went out of his way to ensure that we had a pleasant stay,a huge breakfast and a preview of some of his latest excentric antique aquisitions.  The thing that we enjoy is that this B and B is a museum of things Victorian and Edwardian giving me the feeling that I am not only staying in a guest house but also a museum.  If they ever did an \"Antiques Roadshow\" at Pimbletts the guests would be as thrilled as I was when I saw Pimblet's on TVs \"Loving Spoonfuls\" cooking show.",
      "rate": 5.0,
      "tripDate": " October 2005"
    },
    {
      "title": "Lots of Fun",
      "text": "Well we think that this is the best B&B in Toronto.I do not know about the last two unpleasant reviews, maybe they should stay at the Holiday Inn, sterile, no surprises and twice the price.We checked and found 25 bed and breakfast homes located in this area.Location, Location, Location, inexpensive and unpretentiousCabbagetown is the old Downtown Toronto residential area, steeped in history. Renovated and revitalized Victorian homes and cottages mostly gentrified a mix of high income and working class all add to the character.We walk to the local restaurants and pubs for a bite to eat and chat with the local residents.It is Geoffrey Pimblett's home where we stay full of the quirks and qualms of this eccentric Englishman and dog.Bertie the Doberman Pincer is a poodle in disguise that loves people.My wife and I stay at Pimblett's every time we visit Toronto Š.and love the placeIt's not every ones cup of tea, as you can see, but if you want something different, with no pretension at a reasonable price and convenient location, then this is the place.--",
      "rate": 5.0,
      "tripDate": " August 2005"
    },
    {
      "title": "Sorry to say, stay away!",
      "text": "Sadly that area of Toronto is not very safe right now. Time has caught up with at least that neighborhood!  The rooms are small, dark and dusty. The owner let guests know that even he would rather have gone out of the city for the summer.  Toronto has its good points, but for this price one might do much better and be in a more central pleasant area in a more upbeat establishment.",
      "rate": 2.0,
      "tripDate": " August 2005"
    },
    {
      "title": "We will be back!",
      "text": "We were charmed by all the \"extras\",the B&B was like a museum of treasures and antiquies from around the world. The room and bed were very cozy and we shall be back to enjoy a cup of tea at breakie, that our host, Mr Pimblette made for us.",
      "rate": 5.0,
      "tripDate": null
    },
    {
      "title": "Unpleasant surprise",
      "text": "I have nothing against Toronto, but this particular establisment and scarey district did not work for us at all. There is a reason the owner has a male doberman and it seems this b and b is not quite cut from a Trisha Romance painting.  I am not sure why there would be a b and b in that district.We both prefer a cleaner setting and more enthusiastic service. I don´t know why there were so many good reviews for this place in March. The rooms are smaller than normal.  The walls are thin.At least the weather was pleasant...",
      "rate": 1.0,
      "tripDate": " August 2005"
    },
    {
      "title": "Amazing experience...Geoffrey is a wonderful host!!",
      "text": "I felt like I was walking into a traditional English home, with so many lovely antiques and trinkets decorating the place! The house is absolutely gorgeous, with so many things to look at, and the top floor has it's own little patio that has a beautiful view of the city. The jacuzzi is huge and extremely relaxing also, and we had a very good sleep in the king- sized bed.Geoffrey is wonderful and we had a lot of fun talking with him in the morning on a variety of a subjects. He makes you feel right at home and cooks a fabulous (huge) English breakfast. Try the Yorkshire tea!! I will be recommending this place to all my friends for sure.",
      "rate": 5.0,
      "tripDate": " November 2010"
    },
    {
      "title": "Very disappointed",
      "text": "Having read the reviews of other travellers, I was quite prepared for Pimbletts to be an 'experience'  - unfortunately it was an experience I would rather forget.  Cabbagetown had some lovely old houses, but the general area was rundown.  The house itself was so cluttered and - while this may be fun to look at - it was not fun to live in, not having been dusted in months.  The bedding in the room was clean and adequate but nothing matched.  The biggest problem was the creaking floors.  Obviously this could not be avoided because of the age of the property.  Unfortunately, we were unable to sleep at all on our last night.  The people 'using' the room above were going up and down the stairs, in and out of the front door all night, pacing the floor and doing 'other things'  that were clearly audible to us. We felt very intimidated and couldn't wait to leave at first light. Although Mr. Pimblett and his cook were friendly, I certainly could not recommend this area or this establishment to anyone.",
      "rate": 2.0,
      "tripDate": " September 2010"
    },
    {
      "title": "Charming and oozing with character (not just the b & b)...",
      "text": "I highly recommend Albert Pimblett's downtown Bed and Breakfast as it oozes charm and character.  The rooms are spacious, comfortable and very good value for money.  Geoffrey and his 'man servant' aka John (who serves scrumptious breakfasts) make a comic duo and are really the highlight of the b & b.  They also have a dog, Brewster, who is only too eager to welcome you to the house!The location is perfect, being located in Cabbagetown (old area), only a few blocks away from a subway station (10-15mins walk) and Church Street (gay area).We thoroughly enjoyed our stay and were very sad to leave.",
      "rate": 5.0,
      "tripDate": " September 2009"
    },
    {
      "title": "Victorian Splendor? Grubby more like!",
      "text": "If you are looking for me to sum this up in one word - 'Grubby' would be the one.As soon as the door opened the greeting from John worried us. He stood there in his stained t-shirt and allowed us to move our cases into the very cluttered 'lounge' whilst they prepared our room.We walked into Toronto wondering what to do next and on the way back we checked if the local hotel had any rooms which they had at around the same price but that would have meant losing our deposit according to Pimblett's terms so we decided that we could just about manage to stay 2 nights and tried to laugh it off. We would look back in years to come and remember our stay in Toronto!The hallway was grubby and the skirting boards needed a good scrub. We inched our way up to our bedroom and I tried to remember the photos from the website - they really don't do the place justice - it's truly awful and trades description comes to mind.At least the bathroom was clean!My wife just couldn't get the smell out of her mind and she was most upset at the thought of eating breakfast here.Breakfast was served by John - in the same t-shirt - and we had to endure the smell of the cooking as the dining room is only available if you walk through the kitchen. In fact you feel like you are eating in the kitchen. Victorian splendor? My wife had a cup of tea the first morning and stayed upstairs the second. I just about managed some toast and some fruit juice but gave the cooked breakfast a wide birth. To be fair my friend's wife ate it and enjoyed it - much to our surprise!The dog is a softy but has a gas problem (I thought it was my mate and he thought it was me) and the cat is also cute but gets everywhere (including under your bed).The area is pretty run down but we did find a nice bar and restaurant around the corner - The Ben Wicks on Parliament Street. Nice staff and good food. You can walk downtown in around 15 mins.Advice - go elsewhere - it isn't that cheap at Pimblett's and you will get much better value for your hard earned cash.This was the fourth part of our trip around the USA and Canada and Pimblett's did not compare in any way to the other three places we stayed.",
      "rate": 1.0,
      "tripDate": " October 2008"
    },
    {
      "title": "Great place for the lover of the eccentric.",
      "text": "Kitschy, funky, fun. Wonderful owner and very central to the public transportation. Very gay friendly, as well.",
      "rate": 5.0,
      "tripDate": " May 2008"
    },
    {
      "title": "Noise was a problem",
      "text": "I booked here because of great reviews but was disappointed.  The positives were location in a great area (cabbagetown), roughly equidistant from downtown, yorkville and the market, and a friendly host.  But the room was very small.  There was no room service even to empty wastebaskets during our 4-night stay.  The place is rather run down although the bathroom had been updated.  The walls are thin and provide no barrier to noise transmission.Overall, sorry to say, I would not recommend this B&B and would not return.",
      "rate": 2.0,
      "tripDate": " October 2007"
    },
    {
      "title": "Close to City Centre, Clean and Quirky Accommodation!",
      "text": "We had a pleasant stay at Pimblett's Downtown Toronto B&B earlier this month.The accommodation was very clean and the breakfast was lovely, although is served from 9 til 11 in the morning, so if you need to be out early you might miss out! It was worth sleeping late for though, with coffee, tea, juice, bacon, eggs, sausage, pancakes and potatoes presented as well as toast with condiments. John the cook was lovely to talk with too, as were the other guests.We only met Mr Pimblett once but he was very friendly. We also liked the dog and cat!We found the B&B was in a great location for walking, it only took 10 to 15 minutes to get to the centre of the city to explore. While at first glance the area looked a bit dodgy, we actually felt very safe, even at night. It was well lit and there were people around at most times.We really liked the decor, but I can see that it may not be to everyone's taste, as it was quirky and eccentric. But it was interesting and a bit different to where we usually stay so it was good.The only real issue we had was that when we arrived we did not have a phone to contact the reception, so we had to wait until the cook let us in. It was lucky that he was still there. We collected our key but then on our return had to wait until someone let us in to tell us which room we were in. It all worked out well, and it was a good place to stay, but just be mindful that there may not be someone to let you in if you don't arrange a check in time.I would stay there again and would recommend it for travellers.",
      "rate": 4.0,
      "tripDate": " May 2018"
    },
    {
      "title": "Our first choice for Toronto",
      "text": "We stayed here twice on our recent 30 day trip to Canada, once at the beginning, and again at the end.We have now stayed here three times.The house is charming, there is now a guest area where you can make a drink, or prepare a light meal.Breakfasts are huge and freshly cooked.The rooms are comfortable, great wifi and really good beds.Plenty of hot water, and the owner is charming and we were allowed to leave our luggage there till our flight was due.So close to downtown, in an up and coming area.",
      "rate": 5.0,
      "tripDate": " July 2017"
    },
    {
      "title": "Didn't even get the chance",
      "text": "Weeks ago I booked to a 4 night stay here over the Canada Day Weekend, only for them to cancel my reservation ON THE DAY of check-in!!! I have tried to get in contact with the hotel them to ask why, but they won't reply. BEWARE!",
      "rate": 1.0,
      "tripDate": " June 2017"
    },
    {
      "title": "Cozy old world B&B",
      "text": "We had a delightful time at Pimblett's. It was definitely in the tradition of the old world pubs of the UK. If you are looking for modern and elegant, this isn't it. This is cozy, stuffed with kitsch and with a great, hearty Full English breakfast on order. The owner is a retired chef, and it shows in his kitchen. He's chatty, friendly, and has friendly pets to cuddle with.",
      "rate": 4.0,
      "tripDate": " March 2016"
    },
    {
      "title": "Run away!",
      "text": "When I got to this B&B and went inside, I was shocked.  Actually, I didn't even need to go inside.  The doorknob on the front door didn't even work.  It was just hanging in the hole.  To lock the door, you have to juggle the door so the deadbolt will fit into its slot.  Upon entering, you're greeted with a hallway full of crap.  Some reviews found it charming.  I found it scary.  Right at the entrance is a side table with board games.  The boxes looked like they'd been chewed bare by rats.  The room I had reserved wasn't available, even though I'd e-mailed requesting a particular room, got the confirmation for a different room, e-mailed back and received a confirmation for that room.  Instead, he was going to put us in a tiny room.  He did give us a better room in the end.  \"Better\" being a relative term.The room itself wasn't too bad compared to the rest of the house.  The place was just filthy, full of things like stuffed animal heads with years of dirt and dust on them.  Our room was slightly cleaner.  The electrical outlets didn't have covers on them.  The bathroom was clean, but the wallpaper was falling off the walls.  In the morning, we woke up to our bed shaking.  We never figured out why, but it didn't help our confidence in the stability of the place.  It's the quintessential fire trap.  Very scary.It was supposed to have wifi, but I was never able to access it.   I think they actually had it turned off most of the time.  As for the location, it seemed to be in a seedy area.  We walked down some side streets, and there were nice homes and we saw people who looked like they were headed towards professional jobs.  On the other hand, there were plenty of homeless people and panhandler in doorways.  The host and the cook seemed like very nice people, but that can't make up for a dirty, overcrowded place with bare wires hanging on the walls.   I would NOT go back, and the people we met there had the same opinions.",
      "rate": 1.0,
      "tripDate": " August 2010"
    },
    {
      "title": "I'm baffled by all the good reviews...",
      "text": "I'll start with the good things:-The place is 'charmingly' decorated, which will appeal to people into quirky, shabby chic kind of interiors.-The hosts were friendly and accommodating.-The price was a steal.The bad things:-The 'charming' decorations were a bit much for my taste; every spare inch of the place was filled with a $2 thrift store painting or an ugly piece of china.-The food was greasy.  The eggs were watery, the bacon looked like a slab of fat, the pancakes tasted mysteriously the same as the sausage, the jelly and butter stayed out on the table 24 hours a day, and (this is not a joke) the host served the same pieces of toast for three days in a row.  If it didn't get eaten, he'd just leave it in a Pyrex dish until it all disappeared.-The place was filthy.  The host set the tables at night so that they'd be ready for the morning, leaving plates outside on the patio where insects and pigeons could have their way with them.  The silverware was spotty, my juice glass had dried food on it, the entire place was covered in an inch of dust, and I swear I witnessed the host place his gigantic key ring on a breakfast plate, then pick the keys up 10 minutes later, leaving the filthy dish for the next unsuspecting guest.  There was a huge basket of soaps in the hallway, a nice gesture, except for the fact that they were all obviously old soaps from Holiday Inns, wrapped in yellowing, soiled packaging.  The sheets were old and stained, and the blankets were musty and shabby.-Pimblett's is ironically adding more rooms so it can pile guests in while ignoring the older parts of the building that are in disrepair.  Our bed sagged in the front, the door wouldn't stay shut unless locked, the sink wobbled, and there were at least 5 loose tiles in the bathroom that no one had bothered to glue back in.-Worst of all, this was my honeymoon, and it was the HARDEST bed I have ever had to sleep in.  My wife and I woke up each morning with neck/backaches.In other words,  you get what you pay for.",
      "rate": 2.0,
      "tripDate": " June 2007"
    },
    {
      "title": "Charming and full of character",
      "text": "Don't stay here if you want a sterile motel environment.  Despite arriving very late at night and with no prior warning that this would be the case we were made very welcome.  Breakfasts were well above average.  Room was comfortable if somewhat small and  cluttered but very clean .  Albert is such an interesting and charming host  who  originates not a million miles from us.  Location is ideal for discovering Toronto if you don't mind a little walking. The local restaurant/bar, House on Parliament, is a must for those who appreciate a vibrant, reasonably priced hostelry.",
      "rate": 4.0,
      "tripDate": " May 2007"
    },
    {
      "title": "Victorian Charm, delicious breakfast, wonderful hosts!",
      "text": "While looking for a place to spend our anniversary, my boyfriend and I were trying to find a B&B within our own city, and we very luckily happened upon Pimblett's.  Everything, from the decorations to the breakfast to Alfred Pimblett himself, was above and beyond our expectations.  Firstly the price was very reasonable, especially considering it included food, cable, and the room had a private bathroom.  The room itself was beautiful, comfortable and very charming.  The breakfast the next morning was delicious and served in a lovely sunroom where we had our own table and were offered pretty much anything we desired.  The hosts do a wonderful job of acting kindly and interested towards all their guests, but also knowing when to give guests privacy.  Overall it was a very enjoyable experience and we barely wanted to leave - we're planning on returning next year!Our only complaint was that the bed was not great - it was quite noisy and not extremely comfortable - but it wasn't uncomfortable, so don't let that scare you away from this gem!",
      "rate": 5.0,
      "tripDate": " December 2006"
    },
    {
      "title": "Terrible B&B",
      "text": "The room that we stayed in did not look like the ones in the photos. No windows. No air. The owner had all his old furniture plus 4 wall clocks plus 800 books stuffed in our room. My husband and I couldn't move at the same time. As the room had no windows it was stinky.",
      "rate": 1.0,
      "tripDate": " July 2017"
    },
    {
      "title": "I swear it was the worst experience in my life .",
      "text": "The place is a HOUSE not a Hotel. Big diffrence and the owner of the place is the most unfriendly person in toronto. The place is too small and the stairs are narrow so dont have high hopes on getting your luggage up easily . The neighbourhood is not safe at all, located on the worst part of gerrard street, the breakfast is even worse and the owners dog took a dump in the House sevral times it was disgusting.  I stayed in other places in toronto which is way better for the same price .",
      "rate": 1.0,
      "tripDate": " October 2015"
    },
    {
      "title": "Misleading accommodation presentation !!!",
      "text": "Being world wide travellers from the UK and having stayed at numerous B & B`s throughout  the world we can honestly say how  extremely disappointed we were in this overpriced accommodation.  We were in the supposedly \"honeymoon suite\" which was cramped due to the extra bed !!, heating was uncontrollable and uncomfortably hot. Decoration and the general condition of the property was poor (unlike the pictures shown on the website). The only positive comment we can make is Geoffrey was pleasant and the linen was clean. We expected some eccentricity but feel it warrents a NOT TO BE RECOMMENDED review.",
      "rate": 1.0,
      "tripDate": " March 2013"
    },
    {
      "title": "Comfortable and eccentric. Not for everyone but I loved it.",
      "text": "This was my third stay at this casual B&B in a rambling brick Victorian in Cabbagetown. I keep coming back because I love the eccentric decor, the casual atmosphere, and the quiet off-the-beaten-path location. As other reviewers have noted, this place is not for everyone. Don't stay here if you expect turndown service, new linens every day, or cookie-cutter accommodations. Do stay here if you like random oddity and unique character, huge English breakfasts, animals (a dog and a cat are in residence), and a relaxed and casual atmosphere. It's like being a guest in your eccentric uncle's mansion. Geoffrey is an excellent host, and the breakfast is cooked to order. The streetcar is a short block away and the ride to downtown takes just minutes. My one complaint is that my bed was a little too firm, but I wouldn't stay anywhere else, considering the value and unique experience provided by Pimblett's.",
      "rate": 5.0,
      "tripDate": " November 2011"
    },
    {
      "title": "Not for everyone",
      "text": "My husband I stayed here in September 2011 for 4 days.  The B&B was the worse B&B we have stayed in.  It was dirty, very very cluttered and not your typical B&B.  We asked for some coffee or tea in the afternoon and was told it is only served at breakfast.  They offered nothing to us.  The host was not the most helpful, but John the cook in the morning was very pleasant.  Breakfast was so so, buffet style in a very small and cluttered kitchen.  It felt more like a boarding room and not a B&B.  Just not our type of B&B.  The common room was so small and cluttered.  We had a private deck but the screen door was torn so we couldn't keep it opened because of bugs coming into the room, and the glass door was so hard to shut.  With them knowing when would be arriving you would think the furniture would be clean but it was dirty.  The bathroom was new but no place to put your toilettres.  We had to use the floor.  Would not recommend if you are looking for a clean, romantic place.",
      "rate": 2.0,
      "tripDate": " September 2011"
    },
    {
      "title": "I loved this place",
      "text": "I travel a lot for work and decided to try something different so I stayed at Pimbletts for 4 days.  If you want cozy friendly affordable place (that is a little bit zany) then this is the place for you.  I stayed in the bulter's room, it was at the back of the house and nice and quiet. Be warned that it's not a [place for everyone.  If you want a sterile hotel room with no character then it may not be the best place for you.  Howevery, for me the price was great compared to the hotels downtown and and the breakfast was delicious.",
      "rate": 5.0,
      "tripDate": " November 2010"
    },
    {
      "title": "Are you worthy of Pimblett`s?",
      "text": "Sorry that the staff seemed to be inconvenienced by our humble presence.  While there is interesting brick a brack brought back by the owner  from Iran, I don`t know why one wouldstay at Pimblett`s. We won`t any more.Perhaps the service is hot and cold.  Last fall was oneperiod when suddenly this little B and B received many compliments.  But there are long periodsin between, when there are none. Very odd...Sorry, I don`t see anything specialabout the breakfast, rooms or service.The location is not the best. There are morepleasant areas near downtown Toronto.",
      "rate": 1.0,
      "tripDate": " May 2006"
    },
    {
      "title": "What a lovely place - this is a gem",
      "text": "The house is a charming jumble filled with bric-a-brac - my bed was comfy and the ensuite bathroom was very nice. The location is quiet and charming, very accessible by public transport. However, the best thing about this place is the genuine friendliness of the innkeepers - can't wait to go back. It feels like visiting your favorite relatives.",
      "rate": 5.0,
      "tripDate": null
    },
    {
      "title": "The best",
      "text": "This is the best B&B we ever experienced in Toronto.   Clean, comfortable, and very reasonably priced.   No hidden charges and free safe parking.The neighborhood is nice and deserves some touring time.  Geoffery is an excellent host.   Very attentive to your comfort.  He is also a hoot!  We shall return,Chuck and Theresa",
      "rate": 5.0,
      "tripDate": " May 2006"
    },
    {
      "title": "an experience we will fondly remember !",
      "text": "what a truly unique place ! Mr. Pimblett was so pleasant that before we even entered our room (which was delightful) we knew we were going to love it. If you want to enjoy Toronto's historic Cabbagetown while staying in an absolutely stunning Victorian then we recommend Pimbletts ! the Carter-MacLean's",
      "rate": 5.0,
      "tripDate": " June 2006"
    },
    {
      "title": "Not an modern, impersonal box",
      "text": "I saw the reviews on TripAdvisor only after I had booked a week’s stay at Pimblett’s. Given one or two of the reviews, I didn’t know whether I was going to regret my choice.I had looked at three or four guest houses in Toronto and finally chose Pimblett’s because of all the guest houses charging around $85 a room, only Pimblett’s had rooms with a bath as opposed to only a shower and all had private facilities: no sharing.Being British, I wasn’t attracted by the Royal Family aspect of the rooms or the British breakfast (in Canada) and expected the owner to be the common or garden nutcase or eccentric which are two a penny in Britain and perfectly normal.The house is crammed with junk or antiques: take your pick. I’m sure that much of it is dusty as the cleaning would have to be non-stop to get on top of the dust. My room was all that I wanted: comfortable and clean. However, being surrounded by kitsch I did once or twice wish for an modern, square soulless box.The area is about 10 minutes walk from the centre of town: you don’t need to take a taxi, metro or bus unless you can’t walk. There are a number of small supermarkets, cafes and restaurants within a few minutes walk so that all your practical needs are taken care of on the doorstep. I didn’t find the area scary at all: I walked everywhere for eight days and walked home each night late and not only did I not have any trouble but usually I didn’t see anyone at all. This is the most scary thing for Europeans: the complete absence of people on the streets. Yes, occasionally I came across the homeless, drunk or mentally ill, but the largest number I saw was not locally but in the heart of downtown Toronto at 9am in the morning. That’s how it’s done in North America.During my stay, a guest’s BMW was broken into overnight but all the other cars parked there weren’t. This can happen anywhere, even in a controlled car park. Geoffrey was on hand with the necessary telephone numbers and things were sorted out quickly and smoothly. Isn’t that why we take out insurance?The breakfast was huge, too much really if you can’t control what you eat and too much rich food to eat eight days on the trot. I would only have a Pimblett-type breakfast as a very special treat at home.Geoffrey and the staff were there when you wanted them to be and met every request for assistance and advice.The guests were a mixture of Canadians, Europeans and Americans and when everyone came down to breakfast at the same time, it was a tight squeeze and I had to remember not to hit my head against the Victorian lights in the kitchen, but it did make for good conversation.But, as I’ve said, there are times when you want to stay in a modern, impersonal box right on top of the centre of town. Pimblett’s isn’t this.I’d have no qualms about going back.",
      "rate": 4.0,
      "tripDate": " October 2006"
    },
    {
      "title": "Unusual",
      "text": "OK, don't go if you like standard square rooms with those identikit could-be-anywhere pictures on the walls. This is not a place for those who like minimalist decor or large spaces. It is also not a place for those who are allergic to dogs, or who want decaff-sugar-free-skinny-withouteverything-breakfasts. If in doubt, check out the website first, it'll give you a good guide as to whether you'll cope.Now onto the good stuff. Convenient location, walkable to all attractions. Local shops for the things you forgot to take with you. Some nice restaurants close by. Felt perfectly safe at night, didn't see anything dodgy going on. A few shady looking characters at intervals, but that's par for the course in any city, I would think. I wouldn't have walked through the small park nearby at night, but there again, I wouldn't walk through my local park at home at night, alone. Standard looking house from the outside, nicely kept.Unique decor inside - lots and lots of tat, bric-a-brac, kitsch/jumble sale objects, and a few really nice antique pieces. Unusual, interesting, and slightly mad, a bit like Geoffrey himself. Rooms are not huge, but reasonably sized. Bathrooms good, Everything clean. (Unless you really want to stand on a pile of books and wipe your fingers across a picture rail, in which case I would suspect there might be a few flecks of dust, just like in your own home.....) Comfortable beds, plenty of hot water for showers/baths. Quiet at night. Very large dog, a bit off-putting if you're not keen, but it was extremely well-behaved and kept out of the way mostly. Geoffrey lovely, helpful, friendly, and a fab cook. Breakfasts HUGE and extremely well made. Lots of home made jams, sauces, cakes etc, crockery like I haven't seen since my great-gran died, all very comforting, like going back to your childhood. We loved it, much more interesting than staying in a hotel box, and the price and the location were spot on.",
      "rate": 4.0,
      "tripDate": " August 2006"
    },
    {
      "title": "Terrible!!!",
      "text": "I don't even know where to begin?!?! The photos of the B&B are charming, the owner sounds like a pleasant British gentleman on the phone and the location appears to be convenient.  However, the place is a run down, smelly, hole in the wall surround by what appears to be drug dealers and prostitutes.   The place was so packed with junk that it was nearly impossible to make our way through the place with just a suitcase and carry-on.  The owner came out in dirty, grundgy, torn clothing and proceeded to yell at people who randomly parked near his B&B.  The owner has a huge dog of at least 100 lbs. who persisted in circling me as I was trying to walk to the office.  When I told Geoffry the dog was making me uncomfortable by constantly following me and to ask the dog to heel so that I could pass he proceeded to yell that he cannot help me and I must leave immediately and then slammed the office door in my face.  The good thing is that he did agree to refund our deposit.  The great thing is that we had our notebook computer and were able to book the Intercontinental Hotel (4 1/2 stars) in the best part of Toronto on Hotwire.com for a great price!  Pimbletts looked so terrible that we were willing to leave and loose the deposit before he even threw us out.   One more thing about the dog, he shed's a great deal, there was hair all over the place including the kitchen and dining room area.  You couldn't pay me enough money to eat breakfast there.   I usually love B&B's and this is the first bad experience I have had!  Run, don't walk, away from this place!!!",
      "rate": 1.0,
      "tripDate": " June 2008"
    },
    {
      "title": "Friendly, functional but really disappointing, grubby and highly overrated",
      "text": "We picked this B&B based on the great reviews and high ratings, but till we arrived and left we were still confused how this place got such good ratings.    Geoffrey is a nice older English escentric was very welcoming, we liked bricker brack (to a point) but from a business point of view he should concentrate on clearing his kitchen, updating the rooms and still retain the quaintness.  Floor boards did nothing but squeek, bed was creeky, jacuzzi was really old, you got the feeling things werent clean, there were no mattress protectors used between the bed and sheet which didnt make you feel clean on a hot clammy night.   Breakfast was a case of help yourself in the kitchen, no clue as to what was clean or not since every surface was filled with everything from plates to junk and brickerbrack.  Couldnt find any clean glasses, even though food was ok we decided after 2 days to get breakfast elsewhere.  The B&B is obviously in the gay area which has some lovely pubs and a brilliant little restaurant called the Parliament, but walk down the wrong street things could be a bit dodgy with homeless centres.  It certainly isnt the greatest place to book if you want to be close to downtown.  His dog Bertie is massive but very friendly.  My partner found it quite claustaphobic and wished we booked a hotel like the cosmopolitan we stayed in next which was like night and day in comfort and cleaniness.",
      "rate": 1.0,
      "tripDate": " August 2007"
    },
    {
      "title": "TERRIBLE, UNSAFE still waiting for the REFUND",
      "text": "It was central enough to walk to another more appropriate Hotel accommodation a few blocks away the next morning after cancelling the next 3 nights. The first night was enough. The bed was comfortable but with all the clutter, dust and cobwebs and exposed electrical work, no air conditioning couldnt sleep for wondering if the place would go up in flames during the night. A picture of a young Queen of England and Duke of Edinburgh over looking the bed while you sleep didnt give much comfort either other than a reminder that your in a time warp.No refund was forthcoming (30 days waiting) or response from owner to emails and texts about refunding the 3 nights accommodation he said he would refund. (dishonest practices), on phone call he did mention to refund but so far nothing.House very old and in bad state of disrepair, front porch floor boards rotten, poor plumbing, toilet leaked and not flush properly. Stay at your own risk, it just not safe with the electrical sockets piggy backed, one spark and up it goes.The key to bedroom kept jamming, hard to open, bathroom is down corridor and locks with a cupboard latch, no soap provided. Shower mechanism hard to manage with weak hot water. No lift so use of narrow creaky stairwell to bedrooms. Unable to control heat to room other than use a large size book from the shelves to cover the vent.  Neighbourhood is a little dodgy with homeless people about. Cannot recommend, stay at your own risk.",
      "rate": 1.0,
      "tripDate": " May 2019"
    },
    {
      "title": "Terrible review for a terrible place",
      "text": "We booked this B&B because it did sound wonderful. It was anything but that! It was dark, cramped, very dusty, and smelled of cooking grease. If it were not for jet lag we would have left as soon as we were greeted at the door.  There was no air conditioning and the room was stifling.  The window was held open with a book!  The television reception was fuzzy and barely watchable. The only positives were clean bedding clean towels. However, they were never changed!We were confused by the great reviews this place received but after closer inspection came to realise that these reviews were made by locals whose only reviews were of this particular establishment and no others.I have travelled the world and never felt let down and so disgusted by a place. In fact our taxi driver warned us about staying in this area (never mind the B&B) due to the prostitutes, drug addicts and other vagrants.",
      "rate": 1.0,
      "tripDate": " June 2014"
    }
  ]
}