{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Pinnacle Suites - Trendy 2-Story Loft",
    "url": "/Hotel_Review-g155019-d12827139-Reviews-Pinnacle_Suites_Trendy_2_Story_Loft-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "1.0",
      "reviewCount": 3
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "5 Hanna Avenue,",
      "addressLocality": "Toronto",
      "postalCode": "M6K 3E7",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/10/a8/27/61/pinnacle-suites-trendy.jpg?w=500&h=400&s=1"
  },
  "description": null,
  "featues": [
    "Parking",
    "Clothes dryer",
    "Laundry service",
    "Washing machine",
    "Iron",
    "Coffee / tea maker",
    "Dishwasher",
    "Complimentary toiletries",
    "Hair dryer"
  ],
  "reviews": [
    {
      "title": "TERRIBLE! Do not book this place!",
      "text": "Terrible experience and terrible customer service by Irene Botchway. Do not book here. They cancel your reservation last minute, leave you stranded outside the building with all you bags, and have you call them to figure out your the room you booked has a \"problem\"---- only AFTER I confirm with them twice before getting there. I will add the room was booked 2 month in advance. They do not care and provide zero support. They will not even provide a refund.... save yourself the trouble and book somewhere else.",
      "rate": 1.0,
      "tripDate": " November 2018"
    },
    {
      "title": "Just a rip off with absent owners stay away",
      "text": "Just a word of warning this place is a private residence not a hotel. I booked this place three months ago for a night with my wife as we were attending a concert near by. Although I paid in full three months in advance I spent a full week before the day I was to check in trying to get a hold of anyone to tell me how to do so. The site states they will contact you a week before arrival to tell you how and where to check in. There is no phone number only a message text system. I tried everyday for a week to reach anyone, I had booked through Hotels.com and they could not get a hold of anyone either. I get thigs happen but once I was with 24 hours of my stay I had to book another property. My other option would be to stand outside of this apartment building with my luggage asking people at random if I had rented from them. Even Hotels.com could not reach the property, Now any type of refund has been refused thankfully amex has opened an investigation on my behalf and I saved on my emails, phone calls and screen shots of me basically begging to know where to go. Hotels.com has simple washed there hands of the matter and the property has simple hidden themselves and refused to even give back a single nickel of my payment No one needs this type of aggravation, book a real hotel with someone at a front desk and proper policies on cancelations and check inhttps://www.tripadvisor.ca/ShowUserReviews-g155019-d2180062-r512585192-Hotel_Ocho-Toronto_Ontario.html#",
      "rate": 1.0,
      "tripDate": " August 2017"
    },
    {
      "title": "Carpets and bed sheets reminded me of my college dorm room",
      "text": "As the Toronto film festival was on we were forced to find a place just outside of downtown due to inflated prices.  I thought we found a great loft 4km's from downtown.  When we got there the bedroom upstairs was absolutely disgusting , full of stains , the bed  sheets looked like my college sheets and the place looked like a weekend warrior did all the paint and finishing.  So we ended up paying $700 for 2 nights at a place I wouldn't want to pay 100/night.",
      "rate": 1.0,
      "tripDate": " September 2017"
    }
  ]
}