{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Planet Traveler Hostel",
    "url": "/Hotel_Review-g155019-d658290-Reviews-Planet_Traveler_Hostel-Toronto_Ontario.html",
    "priceRange": "$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.5",
      "reviewCount": 452
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "357 College St",
      "addressLocality": "Toronto",
      "postalCode": "M5T 1S5",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/12/bf/e8/81/common-aera.jpg?w=500&h=-1&s=1"
  },
  "description": "Youth Hostel downtown Toronto. Free and unlimited breakfast until 1PM. The hostel have a width rooftop with a view over the Toronto",
  "featues": [
    "Paid private parking nearby",
    "Free internet",
    "Free breakfast",
    "Evening entertainment",
    "Board games / puzzles",
    "Rooftop terrace",
    "Baggage storage",
    "Laundry service",
    "Wifi",
    "Rooftop bar",
    "Breakfast buffet",
    "Non-smoking hotel",
    "Shared bathroom",
    "Shared kitchen",
    "Shared lounge / TV area",
    "Sun terrace",
    "Self-serve laundry",
    "Air conditioning",
    "Safe",
    "Coffee / tea maker",
    "Refrigerator",
    "Kitchenware",
    "Non-smoking rooms"
  ],
  "reviews": [
    {
      "title": "Perfect!",
      "text": "Best hostel I've stayed at in years. Julie who checked me in was lovely, also had a great time chatting to Anthony the owner at (free) breakfast in the morning. Comfy, clean, friendly. Enough space that you can chill by yourself if you need to but also the perfect place to meet people. Rooftop bar/social area! Reception area with a fireplace, comfy couches and a TV, always people to chat to. Big kitchen, plenty of seating. Wish I could've stayed longer than one night! I'll be back again one day.",
      "rate": 5.0,
      "tripDate": " March 2020"
    },
    {
      "title": "A Cozy Retreat in the Heart of the City: Planet Traveler Hostel Review",
      "text": "During my recent stay at Planet Traveler Hostel, I discovered a welcoming haven with a few noteworthy aspects to share with fellow travelers. Overall, my experience was delightful, although there are some considerations to keep in mind.The hostel's interior is impeccably maintained, offering a comfortable and inviting ambiance. It's important to be aware, however, that rooms on the top floor require ascending three flights of stairs. While this may pose a challenge for some, the tranquility of the top floor compensates for the climb.The hostel staff were a standout highlight, providing excellent assistance and guidance throughout my stay. Their warm and helpful attitude contributed significantly to the positive vibe of the hostel.Situated in the heart of the city, Planet Traveler Hostel provides easy access to daily events, enhancing the overall experience for those looking to immerse themselves in the local scene.One aspect worth noting is the presence of a dog on the premises. While some guests may find this endearing, it's essential information for those who may have concerns or preferences regarding animals.The hostel's heating system is commendable, ensuring a cozy and comfortable environment, especially during colder seasons. Additionally, the well-kept kitchen facilities offer a range of breakfast options.In conclusion, Planet Traveler Hostel stands out as a comfortable and enjoyable retreat, with a few considerations to bear in mind. If you seek a centrally located hostel with friendly staff and inviting amenities, this could be the perfect choice for your next travel escapade.Wishing you happy and memorable travels",
      "rate": 5.0,
      "tripDate": " February 2024"
    },
    {
      "title": "Worth the money",
      "text": "Stayed for the weekend at the beginning of May.  I was in a six bed female dorm and it was lovely, clean and quiet.  There was plenty of space for storage with lockers for each person.  The bathrooms were very clean and stocked well.  Breakfast was free every morning with much variety, plus free coffee.  There is a dog on the premises and he is lovely - he did seem to bark quite often though so a word of warning to those who might be scared of barking or loud noises in particular!  Staff were very friendly and helpful.  Will definitely stay again.",
      "rate": 5.0,
      "tripDate": " May 2024"
    },
    {
      "title": "Overrated",
      "text": "Having just stayed at amazing hostel this one was sadly a letdown especially with all the talk up it had online.Firstly all is up and down stairs, no lift. One bathroom per room and no additional showers on other floors etc. so mad line ups in the morning.No usb charging ports in the room, plug required!Beds old and creaky.Bathroom very dated and lots of hair in drain etc.Reception is not covered 24/7 and there is no call out number during in-maned times.",
      "rate": 3.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Inflexible policy -",
      "text": "So I stayed here in 2018 and it was OK. However in 2022 I tried to book for one night but was informed that they have a two night policy . I contacted the property because even if I wanted to stay two nights or at least booked for two nights just to secure the only night I need housing I would not be able to because they are fully book the second day . The policy is really dumb / it is dumb so to not bend the rules in this case due to the fact that they actually have an empty bed that they’re not making money on simply because of their policy. It’s really not smart at all .",
      "rate": 1.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Arrogant male staff member ",
      "text": "Our whole experience was mainly tarnished by the behaviour and attitude of a male staff member (Robin). He was friendly at our check-in, but then his attitude completely changed. The first day he barged inside our room, a only Female dorm, while he was vacuuming without even knocking. Me and my friends were shocked since we were changing but thought we did not hear the knock and tried forgetting about it.He did the same the next day and when we confronted him he was arrogant and did not care at all. As a female I did not feel safe in the room and expected to have that male staff member barge in at any time, which is unfortunate since we made sure to pick an all female dorm. it is also located next to a church where there is a camp of homeless people and during the night there is a lot of noise just so you know. I really would have left a better review if did not have the experience i had with that male staff member. He does not reflect well on the hostel at all.",
      "rate": 2.0,
      "tripDate": " August 2023"
    },
    {
      "title": "I wouldn't recommend it",
      "text": "I stayed in this hostel for 2 weeks and it was the worst experience in Canada so far !there was a lot of mold in the shower, the shower head didn't work properly, and there was no possibility to shower not hot at all. People left alot of stuff in the bathroom, like used mugs etc. which the staff didn't seem to bother.The ventilation system in my room was not working properly and tended to be really loud.The beds were not good at all. They were really loud and unstable. The rooms were too small for the amount of beds. I couldn't even walk without stepping in someones luggage and backpack.But worst of all was my experience with one australian staff member. Let's call him H. H always went into my room without knocking.",
      "rate": 1.0,
      "tripDate": " May 2023"
    },
    {
      "title": "Great experience",
      "text": "The hostel is amazing! I was there for two nights, of which one night was christmas eve. There was a christmas dinner and the next morning there was a present for every guest under the christmas tree. Very nice touch! Overall ambience is very friendly. The staff is very friendly and helpful!",
      "rate": 5.0,
      "tripDate": " December 2023"
    },
    {
      "title": "A totally solid place to stay",
      "text": "Totally solid hostel im an interesting area. Comfy beds, nice bathrooms, good kitchen and an awesome roof deck make it solidly worth the money. Kensington Market is a really cool neighborhood that offers superb access to the rest of Toronto, though the drug addicts encamped a block away don't help. Fortunately, Toronto junkies are surprisingly harmless. One sticking point is the dog, who's adorable but a little disruptive when he won't stop barking. All in all though, it's great and I'd stay there again.",
      "rate": 4.0,
      "tripDate": " April 2024"
    },
    {
      "title": "AMAZING",
      "text": "Safe, friendly, comfortable, clean.... spent a wonderful time here. Beds are large and comfy, showers great. The whole place has a lovely, chilled vibe. Staff are really friendly and happy to help in any way they can. The whole place is cleaned daily. Spacious communal areas and their roof top is amazing. Really reasonable price, oh and breakfast included and available till 2pm!!! Recommend 1000%. 🙂",
      "rate": 5.0,
      "tripDate": " September 2021"
    },
    {
      "title": "Overall rating",
      "text": "This is one cool hostel in China Town Toronto.It has very friendly vibes.The rooms are small,but comfortable, washrooms are ok.Lobby is the most happening place,staff is superb and always ready to help in whatever way they can.It is very well connected with public transport from both international as well as domestic airport.location excellent, downside no lifts in hostel, breakfast is just average.Overall excellent hostel.",
      "rate": 4.0,
      "tripDate": " August 2019"
    },
    {
      "title": "One of the best hostels I’ve ever stayed at",
      "text": "Planet Traveller is one of the best hostels I have ever stayed at. The staff try very hard to make you feel welcome and get you involved in all of the events and activities going on in the hostel. There is a different event on every night - quizzes, bingo, fitness, karaoke - which is a great way to meet new people if you’re a solo traveller like I was. The hostel itself was very clean, modern and was a great place to hang out at in general. The view from the top of the building is fantastic and is a great space to spend the evening in. I stayed in a private room, which was very spacious and good value for money. If you’re in Toronto I would definitely recommend staying here.",
      "rate": 5.0,
      "tripDate": " May 2019"
    },
    {
      "title": "Amazing stay!",
      "text": "I love love LOVED my stay at this hostel!It was my first ever hostel stay and I do not regret it. The breakfast is good, and served until late (well... you 'cook' it yourself). The rooms were nice, and it was great to have a full sized locker and a 'private' bathroom for the room you were staying in. Also the single toilets along the corridor were useful for the times when someone was showering!The activities offered were popular and fun. My only 'issue' (and this is purely to do with me) is I would prefer it to be in a central location. I like to walk everywhere and it was a good 35/40 minutes to get to the entertainment district. But that is my personal preference; it is near a lot of different transport options!Printing was free, and the staff were always down for a chat/to offer advice. Also the luggage storage was great - I stayed over in Niagara for a night and came back late the following day, and the staff were welcoming/did not charge at all for luggage storage.I am coming back to Toronto at the end of the month and will probably stay here again!",
      "rate": 5.0,
      "tripDate": " October 2018"
    },
    {
      "title": "Great stay in modern hostel",
      "text": "I really enjoyed my stay at Planet Traveler. I paid extra for a private room which was nice, a decent sized space and comfy bed – sharing a bathroom with other private rooms. It had a big window and a full length mirror, as well as complimentary towels and bottled water which were a plus.The breakfast was great, unlimited bagels/bread/spreads/cereal/tea and coffee from 7am-1pm – the wide duration for breakfast meant the kitchen area was never too packed as nobody was rushed to eat at a certain time. There’s also free tea/coffee and popcorn available throughout the day, and you’re able to use the fridge to store your own food and cooking utensils to cook for yourself.The staff are friendly and helpful and on hand to assist with any issues you might have. They’ll also do things like print travel documents for you and give you local recommendations if you ask. I also heard they will book day trips to places like Niagara Falls on your behalf. There are activities every night if you don’t know anyone and want to make friends, bingo was actually more fun than expected!The hostel itself is clean and modern with nice common areas – the roof terrace being the highlight. There’s a great view of the Toronto skyline. Location-wise it’s very close to the trendy Kensington Market and you can walk to most places downtown within 30-40 mins, or get the subway/streetcars. The location means you’re next to ‘real’ neighborhoods, as some parts of downtown can seem a bit sterile/band with all the skyscrapers and similar buildings. Also close proximity to places like Chinatown mean there is a range of affordable, good food nearby.Only slight downsides is there are no staff between 12-7am so if there was an issue in the night you’d have to wait until morning. If you lose your keycard after midnight you won’t be able to get back in the building, so keep it safe if you have a few late night beers!Also the common areas are locked overnight so you can’t get up in the middle of the night to get a glass of water etc. Additionally I was on the 1st floor and the music from the bars/clubs in the local Kensington Market area was quite loud from the positioning of my room, I could hear the bass which went on until the early hours. This wasn’t a huge issue for me as I am a nightowl and was out most evenings myself, but if you want a quiet night this might be worth keeping in mind.Also my room had air conditioning but it wasn’t possible to open the window, so it could feel a bit stuffy at times, however I understand this is most likely a security precaution as the room is at street level.Overall I had a great time in Toronto and Planet Traveler was a big part of that!",
      "rate": 5.0,
      "tripDate": " June 2018"
    },
    {
      "title": "Great hostel",
      "text": "Great hostel just NW of Downtown area of Toronto with a downstairs common area, three floors of rooms and a rooftop \"bar\" (no alcohol is sold). Prices are relatively cheap and breakfast is included (toast, cereal, bananas) as well as tea, coffee and hot chocolate any time you want. Staff are friendly and helpful, as are all the patrons I met. Rooms are small but clean and comfortable. There's no reason to avoid other people but if you really want to be alone you won't have much space. It is also incredibly green if that matters to you.",
      "rate": 5.0,
      "tripDate": " February 2017"
    },
    {
      "title": "Amazing ",
      "text": "It was amazing one of the best hostel Ive ever visited super clean almost like a hotel and the area where it is more than perfect you have everything near and for the breakfast you have lot of cereal options and bagels besides the staff is friendly and always helpful i totally recommend this hostel",
      "rate": 5.0,
      "tripDate": " January 2017"
    },
    {
      "title": "Extremely clean and great location ",
      "text": "We stayed in a double room with a shared bathroom.. this place is an absolute bargain for the price we paid! Very clean, rooms are a little on the small side but that doesn't matter as your never there! The roof is absolutely incredible.. by far the best part about it! A great view of Toronto sky line.. unfortunately it was very cold when we visited but I can imagine it is amazing for bbqs and beers on the roof in summer!",
      "rate": 5.0,
      "tripDate": " October 2016"
    },
    {
      "title": "Believe the hype...it is that good",
      "text": "Often when I read so many positive reviews and get myself hyped about staying at a place, I find myself underwhelmed.  Not so with Planet Traveler.  First off, location.  It's perfect.  Literally around the corner from Kensington Market with its alternative cafes and bars.  20 minute walk will get you to King St West and half an hour to the harbourside (alternatively get the street car from a block away).  The hostel itself is spotless, well laid out, comfortable rooms with en suite shower rooms (in a small hallway so not off the room, if that makes sense).  Ground floor common area and kitchen, with breakfast included (plenty of cereals, bagels, toast, fruit) good for meeting people, as is the amazing roof terrace with stunning views of the city.  There's something on every night so you'll have no problem meeting fellow travellers (BBQ night is amazing, and free!)WiFi throughout, and the staff were incredibly helpful and friendly.  Can't fault it.  No surprise it's head and shoulders above the competition in the review stakes.",
      "rate": 5.0,
      "tripDate": " September 2016"
    },
    {
      "title": "Smart, impeccable design",
      "text": "Pros: - I am a huge fan of the small little considerations they put into this place. The walkway from room entrance to beds provides such an intelligent buffer taking away some of the awkwardness of getting ready in the morning while others are sleeping. The lockers in the walkway have outlets inside so you could keep your devices locked up while charging - Great modern design everywhere- Rooftop views are great!- Great amenities: breakfast, 3 Mac computers, communal TV in the lobby where I caught some Premier League matches and the latest Game of Thrones episode - Laundry seems cheap enough, though I didn't use it Cons: - It's a good but not GREAT location. Still a ~10 minute walk to the nearest subway station - This is a bit of a minor quibble, but not having access to a fridge between 12 Am - 7 AM was a bit inconvenient. I had some food products I wanted to travel with that needed to be refrigerated, but since I was checking out at 6 AM I had to take them out the night before. Maybe have a fridge on the rooftop with 24 hour access? I have no qualms about this being voted as one of the best hostels in North America. Very much recommended.",
      "rate": 5.0,
      "tripDate": " May 2016"
    },
    {
      "title": "Clean and Friendly ",
      "text": "Staff were friendly and helpful and rooms are clean but room 13 that I stayed in was very small. 5 beds and no room to swing a cat but if that is how they keep prices low then that's fine by me. There was small entrance area outside the room which was useful to get ready in without waking people up - impossible inside as room so small. Bathroom inside room was a bonus. I didn't get involved with the hostel evening events as I was out exploring late but from what I heard everyone was having a good time!",
      "rate": 3.0,
      "tripDate": " April 2016"
    },
    {
      "title": "Fantastic Hostel Near the Vibrant Kensington Market Neighbourhood in Toronto!",
      "text": "I stayed at The Planet Traveler for three nights at the end of April 2016 as a solo female traveler and had an amazing experience there. The hostel is situated inside a restored historic building and it is extremely eco-friendly with modern yet simple decor. The hostel is centrally located in a FANTASTIC neighbourhood on College Street and is within short walking distance (5 minutes) from the quirky, vibrant and diverse Kensington Market and Chinatown neighbourhoods where you will find lots of unique shops and a variety of ethnic restaurants. The hostel is also very close to Little Italy. You can get from the hostel to Toronto's downtown core area by foot (20-25 minute walk) or via a quick 10-minute streetcar ride (the streetcar stop for downtown is only a 5 minute walk from the hostel). Public transport is abundant and easy to find and two subway stations are also situated nearby (Bathurst and Spadina). The staff that I interacted with during my stay at Planet Traveler were so friendly and helpful and they always appeared to be in positive moods. They were very knowledgeable about the city and its attractions and neighbourhoods and how to get around from place to place. I liked that I was provided with a detailed tour of the building upon my arrival, which was great. I stayed in the 6-bed female dorm and although it was a small room and a little tight for six people, it was incredibly clean, the metal bunk beds were new and sturdy, and the mattresses and pillows were super comfortable. My bed was pre-made when I checked in which was a nice touch, and towels were provided. Each bed had two power outlets and a reading lamp, which made charging my phone in the nighttime very convenient. There were individual metal lockers located in a separate foyer area before entering the dorm (locks were provided as well) and the dorm had its own ensuite washroom with a shower. It was great to have a washroom so close-by! The common areas in the basement of the hostel were really comfortable and cozy, with lots of couches and wooden tree stump stools and a flat screen TV. There were MAC computers for guests to use and the fully equipped kitchen was spacious and new. The complimentary breakfast was served from 7 AM to 1 PM and it was tasty and satisfying enough for me. It consisted of bananas, a wide assortment of cold cereals with milk, bagels with jam and butter and coffee and tea. There were a couple of wooden picnic tables for seating. The Wi-Fi connection was very fast and strong everywhere in the building, which was great. The rooftop patio was one of my favourite parts about this hostel. There was an indoor portion with seating and a self-serve bar area and an outdoor area with wooden tables, potted plants, and couches. I loved sitting on the rooftop in the early mornings and evenings while admiring the beautiful panoramic views of Toronto's downtown cityscape and skyscraper buildings along with the CN Tower. There were also great views of College Street and the Little Italy neighbourhood from the other side of the patio. During most evenings, the hostel staff organized group activities for all of the guests on the rooftop patio. I participated in the trivia night and it was so much fun and it provided me with the opportunity to meet some cool new friends as well. Other amenities that the hostel offers include: laundry room (with a washer and dryer for a small fee); bicycle rentals for a fee; free and secure luggage storage room; and free local calls. I especially loved the relaxed, casual and laid-back atmosphere at the hostel and the friendly, social and welcoming vibe. This is not a party hostel and I enjoyed the fact that I could get a good night's sleep. I have nothing negative to say about my stay here and would highly recommend this hostel to anyone who is traveling to Toronto, and especially for independent and budget travelers!",
      "rate": 5.0,
      "tripDate": " April 2016"
    },
    {
      "title": "Staff member tried to fight me",
      "text": "Ben, I believe his name was. He manages events with the Hostel. He got drunk and tried to fight me. I'm 18, he's in his mid-late 20s. When I disengaged his threat he walked around and talked trash about me to everyone he could find. I doubt anything will happen to him since hostels are usually fairly close-knit and his coworkers would likely believe whatever story he made up to defend his actions.Otherwise good hostel, but I couldn't enjoy a stay where I had a staff member display that much animosity for such little reason.",
      "rate": 1.0,
      "tripDate": " August 2015"
    },
    {
      "title": "Disappointed in Toronto",
      "text": "We chose this hostel for its location, green features and enthusiastic reviews.  We booked a private double with a shared bathroom, planning to stay four nights.  We stayed only one night, but secured a credit on our Visa card for the remainder.  The problems were: the room itself was at the end of a dark and narrow corridor, off which were the small bathroom, and two other rooms.  The room had only a double bed and a floor lamp; there was no chair, no table, no dresser, no place to hang towels or clothes other than two pegs on the back of the door.  A wide window ledge did not make an adequate substitute.  The staff and manager were great about releasing us from the other three nights.",
      "rate": 2.0,
      "tripDate": " July 2015"
    },
    {
      "title": "Excellent hostel - but don't expect to be able to sleep",
      "text": "I recently stayed at Planet Traveller, and in comparison to other hostels I have stayed around the world, this one ranks very very high.Amazing location, close to plenty of bars and restaurants, public transport at your doorstop, very friendly and accommodating staff, clean, the list could go on.This is well worth staying the stay if you're looking for a hostel in Toronto.Only downside is if you're looking to get some sleep. Next door to a fire station, on a main road and it has a bar below it. Walls are paper thin so you can hear everything that's going on.All in all, great place to stay if your a traveller.",
      "rate": 4.0,
      "tripDate": " June 2014"
    },
    {
      "title": "Clean, Great Atmosphere, Good Location",
      "text": "One of the best hostel experiences I have ever had. Hostel rooms are clean, especially the bathrooms which are cleaned every day. Had a great atmosphere with nice guests and staffs who are engaging. Rooftop was an awesome place to hang out and they have BBQ's on Saturdays for everyone. Close to Chinatown, Kensington, and a good 15-20 minute walk to downtown. Would definitely stay here again.",
      "rate": 5.0,
      "tripDate": " May 2014"
    },
    {
      "title": "Love it, love it, love it",
      "text": "This is literally the best hostel I've ever stayed in - the staff (especially Carl, worlds nicest man) are so friendly and helpful, everybody is warm and welcoming and the common areas are delightful. It is worth paying $40 a night just for the incredible roof top view - and both the pub crawl and BBQ are highlights of the week. I stayed here 6 weeks and loved very second, making life long friends and getting the stability and home I needed. What an absolute pleasure!",
      "rate": 5.0,
      "tripDate": " May 2014"
    },
    {
      "title": "Clean & Friendly!",
      "text": "Planet Traveler is an awesome hostel. Immaculately clean, very new and beautiful facilities; however the rooms are very small! Most of the staff are really lovely and give you a great tour when you arrive, but I found one of the girls to be a bit rude.They organise a lot of activities, when I arrived (Saturday night) they had a free bbq on the rooftop, and I went on a pub crawl on Wednesday night which was so much fun and a great way to meet other people! They also have a good selection for breakfast.The only downside is the location. To get to the centre of Toronto/waterfront it is a hike, and the subway system doesn't cater to the area the hostel is in. However, if you don't mind a bit of walking, it is fine.Overall a great place to stay!",
      "rate": 4.0,
      "tripDate": " November 2012"
    },
    {
      "title": "A cut above the usual hostel",
      "text": "I stayed in a private room at Planet Traveller while in Toronto for work. The room was basic, as is to be expected at a hostel (bed, mirror and lamp only), but was clean and the bed very comfortable. I shared a bathroom with guests in two or three other private rooms, which was always well stocked and clean. In fact, the staff seemed to be constantly walking around cleaning!The free bagels and coffee for breakfast was a definite bonus and I wasn't bothered by the rooftop music at all - I could only hear it while on the stairwell. Kensington Market is a vibrant and interesting part of town - a 25-30 minute walk or short ride to the downtown area - but noise from a bar nearby did get a bit loud on a weekend night. The only other negative point was the shared fridge, which should have come with a health warning! This was not the fault of the staff, but the many people using it.I'd stay here again without hesitation.",
      "rate": 4.0,
      "tripDate": " September 2012"
    },
    {
      "title": "Great Stay",
      "text": "I had a really good stay here. The staff were helpful, common area and rooms clean, breakfast options amazing and the rooftop space was out of this world awesome. I also really liked the location- easily within walking or transit distance of a lot of great Toronto sights. And just a heads up for my 5 ft 10+ friends, you won't fit in the top bunk ;)",
      "rate": 5.0,
      "tripDate": " October 2019"
    },
    {
      "title": "Friendly hostel",
      "text": "Had an enjoyable 3 night stay. Room was clean and tidy, shared bathroom was well maintained - although 1 between 4 rooms didn’t really seem enough in the mornings and an extra toilet accessible on each floor would have been good. Great rooftop views. Plentiful breakfast to set you up for the day. Make sure to book a parking space before you arrive - we had and had no trouble but there weren’t that many spaces available so best to book to avoid disappointment",
      "rate": 5.0,
      "tripDate": " August 2019"
    },
    {
      "title": "Fab and friendly",
      "text": "Great experience. Staff lovely and friendly. They hosted socials every evening. Greats quiz night and an amazing car crawl. Breakfast supplies provide in the am. Great location easy to get to everything. Public transport route right outside",
      "rate": 5.0,
      "tripDate": " April 2022"
    },
    {
      "title": "They Will Cancel Your Stay If They Don't Like You",
      "text": "On the morning that I was checking out, one of the employees (Robin) proceeded to have a very aggressive argument with me over a check out procedure. I simply forgot to bring the duvet cover and my towel down from my third floor dorm. I was annoyed and said \"oh man, that's f***ing annoying, I have to go back up to the third floor\" all to myself, under my breath. He then accused me of treating him with \"disrespect\" saying he didn't have to put up with that kind of language directed at him, threatened to cancel my future booking with the hostel. I think this was racially motivated, especially after noticing the fact that all the guests who stayed there were white.Not wanting to further escalate the issue, I went back upstairs and got the duvet cover and towel. I came back down and tried to restart the conversation on a better foot, tried to shake his hand. He continued to act aggressively towards me, wouldn't shake my hand or even put the incident in a better perspective. I tried everything I could to make the situation better. He even tried to deny me the breakfast that was included in my stay, tried to kick me out right at that point after I brought down the duvet cover and towel. He then proceeded to cancel my future reservation...after I complied with all his demands. I was taken aback with the heat and aggression he decided to use in the conversation, tried several times to explain that I didn't direct what I said at him, to not take it personally. He continued to escalate the situation, talking over me, cutting me off mid-sentence, bullying me in front of other guests and even at one point put them in the position of a public jury as he called out over to where they were sitting and told them to give their opinion over the interaction. Needless to say, this was shocking, embarrassing and completely unnecessary. I literally went to my car shaking and started crying when I got in the car. I've never experienced such an incident with a hostel in my life.",
      "rate": 1.0,
      "tripDate": " June 2018"
    },
    {
      "title": "Don't go!",
      "text": "I joined the pub crawl on a Wednesday and our guy (Robin) got so drunk that he threw up in the middle of the last bar. He didn't even made it to the washroom. When I told him a couple times that he should not let the bartenders' dog eat his vomit he got aggressive, came to our table and slapped me in the face (with the hand he just threw up into) after what we got in a little fight. Personally that messed up my Toronto experience and I wish I would have chosen a different place to stay. Other than that the place has potential to be a good hostel and the rest of the stuff seems nice.",
      "rate": 1.0,
      "tripDate": " January 2016"
    },
    {
      "title": "Such a waste...",
      "text": "This hostel could have been on of the best hostels I have even been to. I loved most of the staff and the atmosphere was amazing. However, Ben, an Australian that helps coordinate events and stays at the hostel, created a disastrous experience for me. He behaved in appropriately and got really pushed when he was intoxicated. To say in the least he should be removed from the hostel.",
      "rate": 1.0,
      "tripDate": " November 2015"
    },
    {
      "title": "It went from good to bad!",
      "text": "We arrived in May and pre booked our private room until July 2nd which we were told it was ok at the time. One Saturday we were out and our friend moved out of our room for an email saying could we report to the reception we may need to be moved around. So myself and my partner went back to the hostel to find out the problem. They had double booked our room and told is they didn't have us in the system booked in until July and that we had not paid for 11 days (which is a load of crap) we paid on time every Tuesday and its quite expensive too. We were asked to show our receipts that we had paid so my partner went up to the room to get the receipts off the window sill to find that all our stuff had been packed up and put into the hall! He was horrified that they has touched our belongings. In the mean time I had found 2 receipts from the last two payments made. The staff were unable to accommodate us and told us to pack our bags and leave. We were told to pack our bags in the hall in front of everyone staying there which was so embarrassing making is out to have done something wrong! I've never been so humiliated. I only had great things to say about the hostel until the way we were treated that day. Overall the hostel is very clean. Rooms are very small and over priced.Out of principal I would not stay here again",
      "rate": 3.0,
      "tripDate": " May 2013"
    },
    {
      "title": "You're paying a lot for a bunch of things you don't need",
      "text": "This hostel is modern and quite new, clean and spacious, however it is very expensive, the staff are very excited to greet you to the point of wanting to be your best friend which was annoying when you just came in on a long flight and just wanted to go to sleep.  There's free wi-fi and nice modern kitchen but the dishwashers, free internet Mac terminals, free-call phone booths and modern climate control just all add to the cost of your stay which is embedded in the price.  There are plenty of travelers who don't need to make calls, don't need to use the computer for more than a couple of minutes at a time, don't use dishwashers, and don't stay in the room and yet they are paying for all these extra services.  Also the bar at the rooftop has music going till late that makes it hard for anyone below to sleep unless your room is at the back of building.All in all it's an OK place, they try pretty hard to make it communal and lots of travelers who are otherwise more inclined to not socialize will find this a great place, but really those who just want a cheap place to stay and are social to begin with, will find the extra costs associated with all the modern appliances quite annoying.Lastly, the room doesn't have any hooks, chairs, tables, no trash bin and nowhere but the floor to put your backpack/suitcase.  Hostel is also not close to TTC/train stations.",
      "rate": 2.0,
      "tripDate": " April 2011"
    },
    {
      "title": "RUN! DO NOT STAY HERE",
      "text": "What started out as a pleasant first day, quickly turned.I was in a mixed dorm of 6, in a room that had no heat whatsoever. The staff were absolutely vapid and actually made me cry due to how unwelcomed I felt.Be wary of shared dorms, as you will be charged extra if someone in your room stiffs them.This hostel should have been a great experience, due to the lovely building, however the staff was incredibly prejudice as well as many of the other guests made me feel as if I didnt belong, and was not good enough for the hostel. The \"rules\" changed on a case to case basis, as they flat out refused a fellow guest to extend, when others had been there for months.All in all I left and moved to a more friendly hostel in the neighbourhood.Unless you are a really cool hipster and instantly click with the staff, they will make your stay entirely uncomfortable and will condescend every move you make.I give this -100 as a rating, and will pass this on to everyone else I know looking to travel in Toronto.",
      "rate": 1.0,
      "tripDate": " January 2016"
    },
    {
      "title": "Nice place, terrible owner / bom lugar com um péssimo dono.",
      "text": "The place is ok, the dorms are small, but you can survive. However the employees are not nice at all, specially the owner of the place, what was enough for me give just one star.They made a barbecue for the guests and the owner told me that he will not serve me because I was using my cellphone, if I want to get something hang up the call and come back. What was stupid, I was talk with someone in Brazil, I did not have other time to talk. The biggest rude guy I've ever met in my life, I will never come back to this place just because this guy!",
      "rate": 1.0,
      "tripDate": " July 2014"
    },
    {
      "title": "Very stress free stay",
      "text": "I've never stayed in a hostel... this place was clean, modern, and well located, right the Augusta entrance for the Kensington Market (Which is Toronto's cool hip open market.) The hotel is located on College avenue, near a convenient store that is open 24HR. the nearest intersection is Spadina a few blocks east..The staff here is very friendly and although they didn't have the room we have requested ( Private Room with a bunk bed) they immediately arranged to switched us... in the basement there is a public relax area with computers, kitchen, sofas, tables and chairs... very trendy and modern ( Ikea) They serve breakfast every morning ( lots and lots of cereals, bagels and bananas) there is laundry (free detergent) free local calls, etc, etc.... I really like here, the bunk beds are little noise, and the rooms don't have fresh air (meaning there is not windows that open) just an opening vent high above the door.. The private rooms share one bathroom which is again modern and well maintained. My first stay, I have to say was very pleasant. Not major complains. Thanks for the nice stay!!",
      "rate": 4.0,
      "tripDate": " November 2012"
    },
    {
      "title": "nice clean hostel",
      "text": "Good hostel, very nice staff, bathrooms are clean and functional in the the 6 beds dorm. The only problem I had with the bed is that as I'm tall, the bed was short to me and when seating in the lower bed my head touches the upper one.nice location with view from the rooftop.",
      "rate": 4.0,
      "tripDate": " August 2019"
    }
  ]
}