{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Radisson Blu Toronto Downtown",
    "url": "/Hotel_Review-g155019-d183080-Reviews-Radisson_Blu_Toronto_Downtown-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.5",
      "reviewCount": 2656
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "249 Queen's Quay West",
      "addressLocality": "Toronto",
      "postalCode": "M5J 2N5",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2c/91/2f/7c/outdoor-poolcourtyard.jpg?w=500&h=-1&s=1"
  },
  "description": "At the Radisson Blu Toronto Downtown, you're at the centre of the city! Our hotel puts you within steps of the Entertainment District and attractions like the CN Tower, Rogers Centre, St. Lawrence Market, Metro Toronto Convention Centre, Union Station, Billy Bishop Toronto City Airport and Centre Island - just to name a few. Start your day right with a scrumptious breakfast at The View, our breakfast restaurant. When you're done exploring the sights, relax under the sun at Lakeview Pool Lounge, our rooftop pool with the best view of the CN Tower!",
  "featues": [
    "Electric vehicle charging station",
    "Free High Speed Internet (WiFi)",
    "Pool",
    "Fitness Center with Gym / Workout Room",
    "Bar / lounge",
    "Taxi service",
    "Business Center with Internet Access",
    "Conference facilities",
    "Paid private parking on-site",
    "Parking garage",
    "Wifi",
    "Pool / beach towels",
    "Rooftop pool",
    "Pool with view",
    "Outdoor pool",
    "Restaurant",
    "Breakfast available",
    "Breakfast buffet",
    "Complimentary Instant Coffee",
    "Banquet room",
    "Meeting rooms",
    "Rooftop terrace",
    "24-hour security",
    "Baggage storage",
    "Non-smoking hotel",
    "Sun deck",
    "Sun loungers / beach chairs",
    "ATM on site",
    "Umbrella",
    "24-hour check-in",
    "24-hour front desk",
    "Express check-in / check-out",
    "Dry cleaning",
    "Laundry service",
    "Air conditioning",
    "Housekeeping",
    "Room service",
    "Safe",
    "Refrigerator",
    "Cable / satellite TV",
    "Flatscreen TV",
    "Walk-in shower",
    "Iron",
    "Wake-up service / alarm clock",
    "On-demand movies",
    "Bath / shower",
    "Complimentary toiletries",
    "Hair dryer",
    "City view",
    "Non-smoking rooms",
    "Suites"
  ],
  "reviews": [
    {
      "title": "Will definitely stay here again",
      "text": "Everything from start to finish was so easy and so pleasant. The staff were polite, friendly and helpful, the room was large and very comfortable, the bed was great and the view from our room was amazing. It’s in a great location and there is a street car stop literally out the front of the hotel. I can’t fault anything with our stay.",
      "rate": 5.0,
      "tripDate": " November 2022"
    },
    {
      "title": "Excellent short stay",
      "text": "We stayed at the Radisson Admiral for 3 nights at the end of our round the world trip. We arrived at 7am after flying in from Chile. Simone managed our check in and arranged for a room to be available for us within 2 hours. Our luggage was stored safely to enable us to freshen up, have breakfast and explore the city without hindrance. The staff in the restaurant were friendly and attentive. I had overnight oats and my husband had a corned beef hash, on reflection I would have preferred porridge as it was freezing outside. Our room was spacious and clean with a marina view. The bed was the most comfortable of all throughout our entire trip and the sleep quality was excellent. We were not disturbed by any noise at night.The shower room was also large with a good supply of luxurious towels. The in-room magazines were informative with useful tips for sightseeing. The hotel is in a lovely location, close to good restaurants and cafes and easy walking distance to many tourist attractions.",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Great Stay",
      "text": "Just returned home after a 5 night stay here. Lovely hotel, just starting to undergo some improvements. New chairs were being installed into the rooms as we were leaving and I believe the corridors are being updated too. We were given a larger room as we were there for 5 nights. It was fab, corner room seating area with large TV and fireplace. Huge bed and large bathroom with walk in shower. Nespresso coffee machine and a fridge in the room too. Coffee pods and bottles of water were replaced daily. Loved our stay, couldn't fault it at all. Would return in a heartbeat. If you're wanting to stay on the harbourfront, this is ideal. Only 5 min walk to the CN Tower.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Disappointing Hotel",
      "text": "It was disappointing. The reviews when we booked were good, so we thought it was a smart choice to book at the Radisson Blu. We were very wrong. To start off, our “city view” room faced the warehouse building beside. We had called beforehand and asked about our room, and we’re told we had a city view. A warehouse does not qualify as a city view. All of the rooms that actually faced  the city and the CN tower on our floor were blocked off for employees. A set of lights and the fan in the bathroom did not work. The closet doors didn’t close properly and ended up slamming shut when you tried to close them. The shower ceiling had mold, and the actual shower had no door. We requested housekeeping on only one day, they tried to enter our room about 20 minutes after we checked in. They called and tried to come on the second day, we kindly said no. They showed up anyway. They then did not show up on the day we had requested. Our phone originally didn’t work. The TV was locked out and no inputs could be plugged in, we had wanted to use our Nintendo switch on the dock but couldn’t. We asked about being able to and they said they couldn’t change it. The TV channels that we had to use were very limited. There was no ice machine or vending machine anywhere (usually standard on every floor). There was supposed to be water bottles offered in the room, we got 1 despite the booking being for 2 people for 3 nights, we did not receive more after housekeeping showed up. Parking also cost much more than what we were told when we called ahead as well. Overall, the hotel was a disaster, but luckily the rest of our trip was great despite it. Would not recommend to others and would definitely not stay there again.",
      "rate": 1.0,
      "tripDate": " March 2022"
    },
    {
      "title": "Take off two stars",
      "text": "The Interior designer who decided that black-out curtains are not required on the windows of an urban hotel is probably an exhibitionist and/or a sadist.  The rooms ARE otherwise well laid out and the hotel is in a fabulous location with access to venues and transportation.HOWEVER, with urban light flooding the room through the sheers you will not have a restful sleep.  Bring your own sleep mask. The curtains that are there are only for show; nice touch but useless. That aforementioned designer should have their eyelids taped open for 72 hours to experience what sleeping in an ocean of white light does to  -in their case- the “little gray cells”.The sheers will also not provide you with any privacy at night....SO exhibit away!Another minor detail:  don’t put courtesy coffee cups with the Keurig machine that are TOO big for the water reservoir and also will not fit under the spout; there is a “hack” but at 5am and poor quality sleep it takes a while.Positives: good location, friendly staff even to a late arrival, hardwood floors ( walk across any hotel carpet in clean white socks to see what I mean), spotlessly  clean and a huge TV that could be repositioned in the window to block light, provide privacy and let you see the city while watching,AND,                            BEST FOR LAST,The most comfortable bed ever, that I’ve not been able to sleep in!",
      "rate": 2.0,
      "tripDate": " March 2020"
    },
    {
      "title": "Too expensive for bad service",
      "text": "We checked in for one night to have a staycation on the long weekend. When booking and at check in there was no mention that room service was not running. No one ever answered the phone during the 18 hrs we were there, we had to leave our room and go to the front desk to get a question answered. Wait staff at the pool bar were overworked, and doing their best but i was delivered the worn drink 4 times. The room had a used coffee pod in the machine, no paper cups at all, and the toilet paper roll was almost empty. During covid I kind of expected a fresh roll of toilet paper per checkin.  Allowances can be made for certain things during this time, but I have a problem paying the same price i would normally during other times when it's obvious that they have little to no staff and nothing open within the hotel.",
      "rate": 2.0,
      "tripDate": " August 2020"
    },
    {
      "title": "Hotel of misinformation",
      "text": "The five star rating is for the location of the hotel and the great pool area. We had a discount on the hotel from hotels.com which was great but if had to pay full price may have given 4 stars. The hotel is one of the older hotels around and we found the air conditioning a bit outdated and a faulty plug in bathroom that did not allow filling basin. Apart from that we were accommodation only but a small cafe beside reception provided nice coffee and pastries that you take to the pool area to enjoy.The pool area is superbly located on the 5th floor with plenty to observe on the lake and a great view of the CN tower.To explain the title, we contacted the hotel before travel about storage and shower facilities when checking out. Storage was confirmed but no shower facilities available. On arrival at the hotel there are shower facilities to the rear of the pool area. Then when asking about use of the pool area after checkout we were told we could not use but that was at the discretion of pool staff depending on attendance level.On checkout I met Nathalie, General manager, when storing luggage. After a quick chat and that we were not due for airport pickup until 7pm, she told us to use pool area and enjoy....and we did. We stayed there all day, ran up a bill and used showers etc before leaving. It was a great way to prepare ourselves before travelling back home Overall, yes 5 star rating.",
      "rate": 5.0,
      "tripDate": " July 2022"
    },
    {
      "title": "The Best Online Rate Guarantee is a lie",
      "text": "I am extremely disappointment with Radisson and how the company conducts business. The Best Online Rate Guarantee is a lie.I sent in a claim on Wed Aug 19 2020 around 12pm for the “Best Online Rate Guarantee” to Match an Expedia amount that was significantly less and another for Hotwire.Radisson replied to on Aug 21, 2020, at 7:09AM stating the cancellation date was different by 1 day so they weren’t able to match. It was still with in the 24 hour period of booking so I found 2 other offers from Hotels.com and Booking.com with the same cancellation date and all the information was the same so sent it in Aug 20, 2020 just after 10am.I replied to their email from the denial of the Expedia.com asking about 3 other claims I sent in. I received replies on 1.\tAug 21, 2020, at 7:09 2.\tAug 24, 2020, at 6:21 – Stating they are waiting for the Claims3.\tAug 25, 2020, at 7:10 – Stating Emails that we received are being distributed randomly and we are just responding to which email comes in.4.\tAug 26, 2020, at 7:21 - Stating they only received the booking.com and expedia.com claim5.\tAug 27, 2020, at 7:29 – Stating Please be advised that we are responding to emails in the order it was received.6.\tAug 28, 2020, at 8:05 – Stating We will further review the claims we have received, and we will reach out to you the soonest, for updates and resolution.Finally, I receive an email Sept 3, 2020 at 6:50am stating the price was higher then when I originally booked or what the claim was for. Well of course it is because Radisson waited 2 weeks to reply or look into the claim knowing the price would go up when it would have been approved if they replied in the same time frame as the Expedia.com claim. No hotel pricing with stay the same over a 2-week period.Why did the Expedia claim take 1 day to decline but booking.com didn’t come back for 2 weeks? They also said they reply to emails as they come in. Well a different person from Radisson replied each time so obviously it is in the same Email Que and I received 7 emails over a period of 2 weeks before my claim was even looked into.THIS IS A LIE AND A SCAM! I am glad I was able to cancel the reservation and will never stay with Radisson again.",
      "rate": 2.0,
      "tripDate": " September 2020"
    },
    {
      "title": "A real disappointment",
      "text": "I recently stayed two nights at the Radisson Blu while attending a conference at the Metro Convention Centre. The experience was not at all what I expected. To begin,I arrived and parked only to find that the elevator from the parking garage is out of service.  My welcome to the hotel was carrying my suitcase up three flights of a dark, grimy stairwell.  It was night and I was travelling alone.  It did not feel safe at all.  This was a frustration but once inside the desk clerk was friendly and the service quick.  However, I was then informed that the restaurant is closed \"for maintenance\" and there is no room service available either. There is a small coffee shop in the lobby with some grab and go items, but the options are quite limited and it is only open in the mornings.  None of this information was communicated prior to arrival.  Why not send an email  to let guests know ahead of time?  The room itself was clean and fairly spacious.  It had clearly had a recent face lift, with new paint, tiles, etc.  It was just as clear that this work had been done quickly and cheaply, without any careful finishing.  There was a big gap between the new tiles and the bottom of the bathroom mirror.  The shower head would only point straight down, and turning it on or off pulled the fixture out a good inch or so from the wall.  The door to the room was not fitted properly, and it would stick once unlocked, requiring a firm hip check to get it all the way open or all the way closed.  My biggest issue though was that there is absolutely no sound proofing of any kind.  I was on the third floor, overlooking the entrance.  I could follow conversations taking place on the street below.  I woke up each morning at 5:15am because that's when the alarm in the room next door went off.  Several other rooms also had sticky doors judging by the thudding and banging that went on in the hallway.I stayed at the Radisson because of the special conference rate that was arranged.  It was an extremely good value, especially given how hotel prices in Toronto have jumped since the pandemic.  The location is great, and the staff I interacted with were all friendly and eager to please.  However, if I had it to do over again I would think seriously about spending several hundred dollars more just to receive decent service and get a good night's sleep.",
      "rate": 2.0,
      "tripDate": " November 2022"
    },
    {
      "title": "Great stay",
      "text": "Smaller hotel, but wonderfully updated and right on the waterfront. Stayed for 1 night and went to the Jays game. Check in was a breeze and the outdoor pool was very well heated in early June. Parking was $28 + tax on top of the rate but we were able to park hours before check-in and its good til 6pm the next day. Super close to Rogers Center, Ripleys Aquarium and many other sights within walking distance. The harbour front it a neat walk, watching the planes land and take off on the island. I would stay here during our next visit if the rate is within our budget.",
      "rate": 5.0,
      "tripDate": " June 2022"
    },
    {
      "title": "A great place to stay",
      "text": "Very satisfied. The hotel staff were amazing and extremely helpful with any request we had, even though they were kept quite busy with check- ins. The hotel room was very clean and beautifully appointed. We especially enjoyed the comfortable beds and the cleanliness of the bamboo flooring.The hotel was situated in a great area of Toronto.",
      "rate": 5.0,
      "tripDate": " April 2022"
    },
    {
      "title": "Radisson Bleu Toronto DT",
      "text": "It is a nice hotel right next to the harbour.  The route to get to the hotel is not very clear due to the existing street setup. The room is clean although if we need any services ie requesting clean linens it needs 24 hrs  advance notice. I kind miss the old way of cleaning guest room on a daily basis  Overall we are happy with the staying.",
      "rate": 4.0,
      "tripDate": " March 2022"
    },
    {
      "title": "Cons outweigh pros",
      "text": "Check in was problematic because they didn’t have keys that worked to our room. Someone led us there and told us they would bring us keys shortly. After an hour, we went to the front desk and were given keys only after inquiring.Pros:Location! Right on the harbor near parks, many good restaurants within 5 minute walk, the double decker tour bus picks up next to the hotelParking - on site with in and out privilegesThe rooftop pool is amazing! Very warm and great view of CN Tower. Has drink service at the pool. Just know that it is also used by nearby condo residents.Cons:Older building - there were buckets in the hall catching water and plasterHallways were dirty and needed vacuumedRoom cleanliness was so so. I killed a spider and gnat within the first 5 minutes of being in the room, one of the towels looked like it had toothpaste on it. Otherwise, it was satisfactorily cleanNowhere in the room to hang towels or wet bathing suitsThe lamp and phone did not work in our room. Discovered they were not plugged in. Once plugged in, the phone still didn’t work. We reported the issue but nothing was done.Overall, unless an amazing pool is a priority, I would choose to stay elsewhere next time.",
      "rate": 3.0,
      "tripDate": " July 2023"
    },
    {
      "title": "Great location",
      "text": "I stayed here while I was at a conference.  I loved the hotel.  You have secure unground parking, the rooms are large and clean and you are walking distance to many popular attractions; CN tower, Roger’s Centre and Ripley’s Aquarium.  You are right on the waterfront and the street car runs right in front of the hotel.  There are many restaurants/dining options on site and within walking distance.  I had one little issue with my room and they were quick to find the issue and found another room right of way for me.  The front desk staff were so kind and helpful.  I would highly recommend this location.",
      "rate": 5.0,
      "tripDate": " January 2024"
    },
    {
      "title": "Fantastic Stay",
      "text": "Can't recommend this hotel enough, staff were amazing providing an early check-in with a room being available, the location is central to the waterfront but is also a quick 5-minute stroll to top attractions like CN Tower. Even in winter this hotel provided warmth throughout the cold days. Will definitely be recommending this hotel for people travelling to Toronto.",
      "rate": 5.0,
      "tripDate": " January 2023"
    },
    {
      "title": "Double charged deposit and then failed to refund",
      "text": "What a shame I am leaving this poor review. Had a pleasant stay at this hotel but completely marred by a shambles regarding the incidental deposit. I was informed on arrival that they would pre-authorise a $100 incidentals deposit on my card. Fine, we had this at a number of hotels in Canada. On checkout we had a small bill for drinks and they told me they would take this from the deposit and refund the difference. On my return home I checked my balance only to find they hadn’t returned the deposit and had taken a second payment of $100 at check out. Now despite admitting fault they have advised I need to contact my bank to seek a reversal of payment rather than issuing a refund. They are now ignoring my emails and I am left to pursue this via my bank. Sure, mistakes like this happen, but my expectation is that once highlighted they should be corrected immediately. I am bitterly disappointed with Radisson Blu TO’s failure in this regard. Shocked to see that I am not the only reviewer here that has had issues with the incidentals deposit.",
      "rate": 1.0,
      "tripDate": " October 2022"
    },
    {
      "title": "Great pool but lacking in service",
      "text": "Things to consider if you want to book here with a family.  I took my kids (4 and 7) here for a last minute get away before school started in August 2022 and were not aware of any of these points.  No one informed us at check in either.1. There is no restaurant at this location.  They have a pool-side bar that opens at 11:30 am and closes at 5 pm.  We went for dinner at 5:15 pm and were turned away.2. They do not offer room service due to Covid protocols.  3. There is no breakfast included your stay.  They do have a coffee bar in the lobby that you can pay for fruit/yogurt/sandwiches.4. Check and see if a Jays Game is happening the day you're staying here.  There was no available parking in the hotels underground lot due to this and the surrounding restaurants were full with over an hour long wait list. 4. There are no parental controls on the tv's.  We were charged for 4 rental movies that I wasn't aware my children selected @ $25/each.   They agreed to deduct 2 from my bill at check out. As a family, the food situation was a big deal.  We were tired when we arrived and didn't want to wonder far from the hotel.  It was very busy and we managed but we were looking forward to a stress-free, relaxing stay and better food availability on site would have helped with this goal.  I wish the staff at check-in would have informed us of these Covid specific changes.If you want a great pool with a great view, this hotel was awesome for that.  We spent many hours in the pool.  Best time to go is in the morning or evening.  We also chose this hotel because we were going to the Aquarium which was only a 5 minute walk north so this was another positive; it was close to amenities.  The room was clean and the bed was comfortable, no problems there.",
      "rate": 2.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Harbour view suite",
      "text": "1 night stay Very warm welcome by Samenthya.  Self indoor public Parking 28$/day with easy access elevator.  Check in was a breeze.Our room was a corner suite with a nice view.  Not for late sleeper since there are only shutters to block daylight.  It was fun to watch the boats and planes.  Spacious room with corner view.  Nice ,big tv with an electric fireplace.  Laminated light floors, no carpeting. Toilet was squeezed behind door and in a very cramped space.  Very Loud fan in bathroom.The hotel restaurant was closed, pool water was warm but the weather was pretty chilly",
      "rate": 5.0,
      "tripDate": " September 2020"
    },
    {
      "title": "Lack of Comfort: Noise Disturbances and Service Shortcomings",
      "text": "The room was satisfactory, but several issues marred my experience. The lack of soundproofing made it easy to hear neighbors, particularly disruptive at night. As there were no blackout curtains in the room, the glaring city lights outside were unavoidable, which interfered with the sleep quality as well. There was a general lack of concern for guest comfort, as my request for room changes or other minor needs were consistently denied. The housekeeping started knocking my room thirty minutes before the official check-out time. I do understand that they wanted me to free the room as soon as possible, so they could clean, but the room was paid for till a certain hour, and bothering guests before that time was rude. Still, no one seems to care, as they didn't even asked me how was my stay during check-out. And the request to print my bill was rejected as well - the receptionist said that I should contact Expedia for that.",
      "rate": 3.0,
      "tripDate": " January 2024"
    },
    {
      "title": "Disappointed",
      "text": "You'll get more bang for your buck staying in a city centre hotel. When I booked online, I booked with a governement discount. I saw my bill and was charged full price. When I asked, the staff had to check with the manager. The manager didn't take the time to tell me herself, she hid behind her staff. Apparently, they only apply the government discount during certain times even though other hotels that we stayed at, that were nicer, applied the discount hassle free. The experience felt unorganized, I felt cheated out of money. I booked 2 queen beds but they only had a king room available (more$$) and I slept on a cot so my teenage son could sleep in the bed. The staff were great, they did their best, but had to ask their manager for simple questions. My impression was good staff, poor management. My experience is not one I would recommend.",
      "rate": 2.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Great Location and Room, but overall the reception really lets it down",
      "text": "Booked 5 nights at this hotel, based on reviews and location.First impressions -Actually pretty poor. The reception looks nothing like the photos and is oddly tatty and ‘untidy’. The exterior of the building is also looking a bit tired. We actually panicked a little when we arrived expecting something a bit higher end.However, the check in was swift, efficient and friendly - as were all the staff. They all were helpful when required and always greeted us as we walked past. I was a bit concerned when it transpired that the included breakfast was actually vouchers for use in the ‘cafe’ in reception. More on that later.We had paid more for a corner suite overlooking the lake and its fair to say the corridors and the room itself made up for the slightly tatty reception. The corridors are modern and clean and the room was just short of fantastic. It was spacious with a brilliant shuttered floor to ceiling wraparound view of the city and lake. We were very impressed. There were, it turned out, some defects. The fire surround was falling apart and the plumbing in the bathroom made an odd high pitched whine when the lavatory was flushed. The coffee machine also made the smallest coffee shots I’ve ever seen in my life and I couldn’t work out how to make them use more water.The bed was amazingly comfortable. One of the best we’ve had in any hotel.After the initial disappointment of getting ‘vouchers’ for breakfast, it actually turned out a bit of a highlight. The cafe opens each morning with a full selection of sandwiches, pastries, sweets, fruit, juices and coffees. We loved it. Was actually better than a sit down restaurant style. All breakfasts can be sit in or to go.The location of the hotel is good, on the waterfront within 10 minutes of the financial district, CN tower, etc.So - after a poor first impression I’m happy to give this 4 stars. Maybe time to spruce up and refurb the reception folks?",
      "rate": 4.0,
      "tripDate": " May 2022"
    },
    {
      "title": "Two nights stayed",
      "text": "The location is a great area with many food and drink options within walking distsnce or a short drive. The staff were all friendly and helpful. A few small hiccups when we arrived but all and all a good place.",
      "rate": 4.0,
      "tripDate": " July 2020"
    },
    {
      "title": "Toronto Boat Show stay",
      "text": "We stayed one night here to be able to take in the Boat Show over 2 days. Easily accessible from Union Station and they happily stored our overnight bags before check in and after checkout so we could enjoy 2 full days at the Boat Show.Staff very.friendly and helpful with great restaurant recommendations. Genuinely kind people working here who made us feel welcome.Room was comfortable, mini fridge, complimentary tea, coffee and water. We were even offered a free bottle of water for our walk to the show. Great location for walking downtown even though our last day was in a bit of a snowstorm. We’d happily return to this lovely gem on the water. Golden Eggs restaurant directly across the street had an impressive breakfast menu with huge portions of food. .",
      "rate": 5.0,
      "tripDate": " January 2023"
    },
    {
      "title": "Excellent place to stay, a little off the downtown beaten path.",
      "text": "This is now our 4th time here and this property I think is under-rated and is a great alternative to the hotels closer to Scotiabank Arena and downtown Toronto in general. 1st off the parking is very reasonable, $28 a night with in/out anytime + it's underground and heated. Most charge $50 & up. Somina ! Somina ! Somina ! Get her to check you in, yes the others at the front desk are excellent but we've been VERY well taken care of by Somina thru the luck of the draw for the 2nd time in a row. We got an excellent upgrade and we're just normal, regular tier Radisson members since most our points are with Hilton Honors. Hotel is quiet, there's an excellent Shoeless Joe's next door for bar fun. The city TSC tram is steps away. We'll be back.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Not great",
      "text": "I will not be staying at a Radisson Blu hotel again. I stayed here by myself for a few nights for a concert because the location was close to the venue. When I checked-in to the hotel, the staff were very impatient and unfriendly. While waiting, I was chatting with another guest at the hotel and the person at the desk practically yelled “excuse me” to get my attention. I would understand (and would feel really bad) if there was a large lineup behind me, but I was the only one in line, and I did not appreciate being spoken to that way. There are kinder ways to get someone’s attention. When I asked the staff member to repeat herself during the check-in process, she seemed quite irritated and sighed at me. Each time I entered or left the hotel during my stay, the staff at the front desk never made eye contact or acknowledged me, they just stared at their computer and didn’t say anything. During my stay, I did not feel very welcome, and felt more like a nuisance. The room was clean enough, but the walls were peeling, the TV had very poor reception and kept cutting out, some outlets didn’t work, the room was very dark, the curtains didn’t close all the way, and the hairdryer was broken. The room was just not worth the money. As for the few good things about the hotel, the cleaning staff were so friendly and always smiled and made small talk with me. The location is within walking distance of many attractions, and is close to the train. Overall, I did not enjoy this hotel. It was not worth the money and I wish I had stayed somewhere else. I will not be recommending this hotel to anyone I know.",
      "rate": 2.0,
      "tripDate": " December 2022"
    },
    {
      "title": "Location, location, location",
      "text": "Excellent location for getting to anywhere in Toronto. Restaurants nearby, Union Station a 15 minute walk, streetcars right in front, right on the lakefront, so quick access to walking paths along the lakeshore. Rooms are spacious and amenities in the room are very good. I would like a handheld shower.  The stairways are beautiful for a walk inside the hotel. I was disappointed that there is no place to sit and look at the lake. The cafe in the lobby is very convenient for a breakfast or snack.  I would have liked a warmer lobby and for our room to be warmer when we enter. In particular, the big window is quite cold. Staff is friendly and generally helpful, although it would have been nice to hear some recommendations for sightseeing besides the tower, aquarium and convention centre. We have seen those. Parking in the underground parking is wonderfully convenient. I would stay there again.",
      "rate": 4.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Super good !",
      "text": "Spent 4 nights at the Radisson in July and highly recommend it. The positives:  only hotel in downtown Toronto that has such a nice exterior sunny pool deck, location-location-location on beautiful Queens Quay and a 7 minutes walk to the CN Tower, friendly staff who are a bit stretched due to Covid 19 but do all they can to make your stay pleasant, large rooms well sound proofed with brand new beds and a refreshed decor, parking underneath at an ok rate for Toronto, you can rent bikes at the shop downstairs and take the water taxi for an amazing ride in the beautiful Toronto Islands, etc. I am turned off by people who complain and should have taken the time to understand that given the fact that tourism is currently at a very low point, the limited staff are working very hard. The room was not spotless and, we too suffered upon arrival from a towel shortage but, this is a historically unique pandemic !  What luck we had to be able to have a vacation !  Thanks Scott and the rest of the team at the pool deck ! Again, this is a super deal of a hotel !  You should book it without any worry.",
      "rate": 5.0,
      "tripDate": " July 2020"
    },
    {
      "title": "Great Location",
      "text": "The hotel was in a great location with a view out of our bedroom window of the CN Tower which was lit up each night with different colours. The staff on the reception were really friendly and helpful, even phoning a restaurant for us to book a table. It is in the centre of things so you can walk to many places as the traffic is horrendous. We were upgraded to a suite which was really big but had a buzzing noise. They provided us with earplugs. The only negative thing is if you have a later flight and need to get out of your room, the changing room by the pool is the toilets.",
      "rate": 4.0,
      "tripDate": " May 2023"
    },
    {
      "title": "Great location and fab pool with views.",
      "text": "Great location on the waterfront and central to downtown area . Five minutes walk to CN tower and Rogers centre and easy to access  ferry or water taxis over to the islands. Room was clean with a great view over the lake . Pool was great too , really warm , excellent opening hours and a fantastic view of the CN tower . Breakfast can be purchased from the small shop in the lobby or there is a Tim Horton’s around the corner The only thing that I could criticise was the inconsistency with housekeeping. We were asked when we checked in if we wanted daily housekeeping which we said yes to but on two of our days we received none . This was addressed at checkout and we were given some compensation. All in all though we enjoyed our stay here.",
      "rate": 4.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Great location close to ferry harbour",
      "text": "I stayed 2 nights at this hotel. Very spacious bright room nice and clean , washroom is spacious too . Comfortable bed, hardwood floor, fridge. I was given a room on 3rd floor, face to bus stop, wish for the higher floor. Swimming pool is located at 5th floor with beautiful view of CN Tower. It’s a bonus for this view, beautiful at night time as well. Friendly staff at the front desk, housekeeping is at request which I did.  I like to have clean washroom during stay, especially for the price I paid (expensive).Walking distance to ferries and harbour front.  Love walking along the harbour, watching beautiful sunset .Walking distance to Union station, that’s a bonus.Lot of restaurants nearby, love the Tim’s Horton is at the corner, we went there for breakfast because it’s so Disappointed that no complementary breakfast for guests for almost $350 a night. No complementary coffee or water at the lobby either, another disappointment! Only provided one bottle of water in the room for 2 persons. I had to ask for the 2nd bottle of water, no problem then. Thanks!Hope the hotel will consider some changes for providing free coffee / a jug of lemon water at the lobby and a free breakfast for guests in the future.",
      "rate": 4.0,
      "tripDate": " September 2022"
    }
  ]
}