{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Radisson Hotel Toronto East",
    "url": "/Hotel_Review-g155019-d184104-Reviews-Radisson_Hotel_Toronto_East-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.5",
      "reviewCount": 958
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "55 Hallcrown Pl",
      "addressLocality": "Toronto",
      "postalCode": "M2J 4R1",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/05/5d/22/84/radisson-hotel-toronto.jpg?w=500&h=-1&s=1"
  },
  "description": "This place is temporarily closed. Perfect for your upcoming business trip or vacation, the newly renovated Radisson Hotel Toronto East offers a wide range of premium services and amenities, as well as proximity to some of the best attractions and activities in Toronto. The hotel's ideal location places you close to the Ontario Science Centre, Toronto Zoo, home of the Giant Pandas, major shopping centres, and minutes from top dining and corporate destinations. Additionally, the hotel is only 15 km from downtown Toronto attractions like the Air Canada Centre, CN Tower, Rogers Centre and the Entertainment District. The Don Mills subway station is only 3 km away, making it easy for you to explore the city. During your stay at the Radisson Hotel Toronto East, take advantage of numerous conveniences, including complimentary Wi-Fi, Fitness Centre, Le Cafe Restaurant and Lounge and 7,500 square feet of event space that is ideal for meetings, conferences and social events. Make your reservation online today and discover why the Radisson Hotel Toronto East stands as one of the area's top hotels.",
  "featues": [
    "Paid private parking on-site",
    "Free High Speed Internet (WiFi)",
    "Fitness Center with Gym / Workout Room",
    "Pool",
    "Bar / lounge",
    "Business Center with Internet Access",
    "Conference facilities",
    "Concierge",
    "Parking",
    "Wifi",
    "Indoor pool",
    "Heated pool",
    "Restaurant",
    "Breakfast buffet",
    "Vending machine",
    "Banquet room",
    "Meeting rooms",
    "Currency exchange",
    "Newspaper",
    "Non-smoking hotel",
    "ATM on site",
    "24-hour front desk",
    "Express check-in / check-out",
    "Dry cleaning",
    "Laundry service",
    "Ironing service",
    "Air conditioning",
    "Housekeeping",
    "Room service",
    "Microwave",
    "Flatscreen TV",
    "Non-smoking rooms"
  ],
  "reviews": [
    {
      "title": "Hotel with Refugees - this is a good thing!",
      "text": "I have stayed at this property on several occasions due to business needs nearby.  The hotel is busy with refugee families who are awaiting placement in communities.  This humanitarian gesture is a good thing.There are lots of kids running and playing in this hotel - as kids should do - and for this time the hotel is their home and i am the guest for 2 daysMy room was quiet, comfortable but would benefit from some upgrades.  One drawer would not stay closed. The fixtures in the shower/bath need upgrading and better stabilization.I enjoyed the buffet breakfast of the past better than the menu breakfast of this most recent visit.  The room was sound proof which was great given the location next to a busy highway.  The bed was very comfortable.",
      "rate": 3.0,
      "tripDate": " August 2018"
    },
    {
      "title": "Great service but hectic due to children",
      "text": "Hotel staff are excellent. Rates very good. Lots of ammenities in walking distance. Hotel is a place of accommodation for refugees. Very hectic and busy as the children are seldom supervised and this does make the stay less than relaxing. We were there for medical issues so the hectic environment was not an issue but if we were vacationing, I don’t think I would stay there at this time.",
      "rate": 4.0,
      "tripDate": " October 2018"
    },
    {
      "title": "Not the best and certainly not the worse",
      "text": "So, I struggle to write this review because while the bed was comfortable, the hotel in general does not fare so well. So, first and foremost, the hotel is not great, but it's not horrible either.  On a five point scale, I give it a 2.5 to 3. Why?  First and foremost, the hotel was not as clean as it looks in the pictures.  Also, it can stand, I mean really stand to be upgraded. The furniture is old, the sofa in my room looked dirty and the cushions were worn.  The bathroom was completely outdated and simply did not look clean. To be completely honest, I didn't want to take my shoes off in my room. Now, to be fair, there were a lot of children running around that were not supervised well.  Also, I believe there are several families actually living in the hotel, which could also be the reason.  Whatever the case, the hotel could use a good cleaning. In all honesty, I didn't want to sit on the furniture in the lobby or touch anything.    On another note, the hotel staff were kind, responsive, and helpful. The rooms are large; larger than most hotels I've stayed in. And, my king bed was very comfortable.  I did check for bed bugs and it was all clear.  The TV was a nice size also.The restaurant in the hotel was not impressive.  The food, I'd give a 2 or 3. Spend the time to go outside the hotel as I believe there are several restaurants to chose from.  And, Starbucks is in walking distance.  Less that 1 mile away.  The average person should be able to walk there in 15-20 minutes.So, again, it's not the best and it's certainly not the worst. I've stayed in worse and this is not it.  Would I go back, probably not until they renovated it.  I was disappointed that this was a Radisson because I've stayed at some really beautiful Radisson Hotels and this hotel is not reflective of what I've experienced in the past.Now, if you are the kind of person who doesn't care about staying in a nicely renovated, clean, comfortable hotel, and you just want someplace to sleep after being out and about all day. This is the place for you. It's reasonable, the rooms are large, and staff are kind.",
      "rate": 3.0,
      "tripDate": " June 2018"
    },
    {
      "title": "Radisson Stay",
      "text": "Hotel was hot. Air conditioning was blowing loud but not cold. The hotel seems like its falling apart. I ask the front desk to look at the A/C no one came to fix it. The alarm clock wasnt working. I didnt pay to stay at a refugee center.",
      "rate": 1.0,
      "tripDate": " August 2018"
    },
    {
      "title": "Raddison Toronto east (worst hotel I have ever stayed at)",
      "text": "Absolutely disgusting at this hotel.  They are housing refugees and it was a mad house with kids running wild in the lobby and no respect for other people trying to use the elevators.  My family were book to stay for 2 nights and left a night ealry due to the condition and atmosphere in the hotel",
      "rate": 1.0,
      "tripDate": " July 2018"
    },
    {
      "title": "Agonizingly bad!",
      "text": "Booked long in advance for two nights. The room was on the top floor corner - totally non functioning air conditioning, one tiny window. When we complained there was no other room so they gave us one ten inch fan and promised to service the air next day. Did not happen, asked for and sometime later a second fan was delivered. There was a charge of eight dollars a day for parking in a broken asphalt lot! Only redeeming value was Walter the breakfast waiter. At checkout, we were offered a 10% discount, negotiated up to 15% but ought to have been free according to their customer satisfaction guarantee in the room book. Never again! Oh, and the government had filled probably ninety percent of the building with the 'refugees'.",
      "rate": 1.0,
      "tripDate": " July 2018"
    },
    {
      "title": "Great to terrible (stay elsewhere)",
      "text": "I have stayed at this hotel off and on, for over 16 years.  It used to be a great hotel.  All that has changed since it has become a refugee holding center.  I'm sorry but it's dirty, loud the AC barely works.  There are kids running the hallways, messing with elevators.  People are actually living in this hotel, one employee some people have lived there for over one year.  This is NOT a place to stay for a business traveler or anyone else for that matter.  Go elsewhere.",
      "rate": 1.0,
      "tripDate": " July 2018"
    },
    {
      "title": "Don’t do it",
      "text": "My cousin booked this hotel after reading and seeing great reviews. We were so excited to stay here and couldn’t wait. However let me just say don’t do it. When we arrived we pull up and outside there’s a bunch of people playing soccer in the parking lot. We almost hit some guy as he runs in front of the car and start yelling at us. We felt horrible and thought nothing of it and apologized like crazy to him. Inside the maintenance and front desk start screaming at kids who honestly were disrespectful and yelling in the lobby. Only two elevators were working and it legit took us 40 minutes to go up with our stuff as a lot of people pushed us and our luggage out of the way. Ok we think nothing of it it’s a travel week people are just tired from driving. We get to the room finally and it is HOT. Not warm. But HOT. We start sweating in a couple minutes. The bath won’t drain so we can’t even shower. After ten minutes of waiting for the air to turn on we call maintenance and they send someone up. They tell the other room we have that they will bring two fans up and we can deal with it. They come into our room and the guy basically starts yelling at me. He says the air is on and I should shut up because he brought fans. My husband who works in air quality and inspects air conditioning units says he can tell it’s not on. But can they at least switch us to a room with an opening window so we can get a breeze. The guy then yells at me, my husband, my cousin and his wife saying “wtf do you expect it’s a hotel full of refugees. Shut your mouths and be happy they even tired”. Screw that within 45 minutes of being there we checked out and went to the nearby delta hotel who were awesome. I legit understand that yes they were upset with other guests who were staying there. But as a paying guest they should never scream at someone because you are upset. We aren’t idiots. We understand the situation but the guy took a crappy situation and turns it into a worse situation. To top it off as he’s leaving he makes the comment” you better hope they don’t break in here or your car to steal your valuables” WOW just like WOW. Go somewhere else I’m telling you. The staff doesn’t care",
      "rate": 1.0,
      "tripDate": " July 2018"
    },
    {
      "title": "Business",
      "text": "Don’t stay here if you are expecting a Radisson experience. Instead, you will be staying in a poor quality hotel in need of renovations and updates. The positives: the staff who are kind and accommodating; the comfortable bed in which I slept soundly; the Keurig and complimentary water in the room; a decent meal in the cafe. But so many negatives. Old, worn and outdated. A drawer that won’t stay closed in the dresser. 9th floor is reserved for the ‘real’ hotel guests but getting to and from the 9th floor can be a challenge. Only one of the 3 elevators will take you there. (One is out of order and the other goes only to 8.) Early morning, you need to ask the front desk to ‘release’ the elevator to come to 9 so you can go down! The rest of the hotel seems to be housing Syrian refugee families. That’s great for them but I would not have booked this hotel had I known this. Read some of the other reviews about how this affects your experience (kids running around, etc.) For what I am getting, it’s not worth what I am paying. I’m also pretty sure this review will get the standard response.",
      "rate": 2.0,
      "tripDate": " September 2018"
    },
    {
      "title": "THIS IS NOT A HOTEL! IT´S A DIRTY HOLE! SCAM!",
      "text": "the hotel is everywhere dirty and old. elevators are not working and the worst is, that the hotel is full of refugees. they live there, so you will have a lot of crying children everywhere, blocked elevators (if you are lucky and they are working) breakfast buffet is not offered, room service is not offered. But as I said, dirty everywhere!I will do my best to send the healt office and the press there. They will check undercover whats going on.",
      "rate": 1.0,
      "tripDate": " May 2018"
    },
    {
      "title": "Stolen wallet.",
      "text": "Very bad experience. Please beware of pickpockets. In excessively crowded elevator someone took my wallet. The lady in front desk said \"impossible in our hotel\". I will avoid Radisson chain like a plaque.",
      "rate": 1.0,
      "tripDate": " November 2018"
    },
    {
      "title": "never again",
      "text": "title says it all went over to vist with friends that where staying there ,and the lobby was like a kinder garden you could hardly hear yourself ,the noise, was a constant 1 elevator not working and the 1 that was working was being used as a toyby the kids pushing all the buttons ,and good luck complaining to the front desk",
      "rate": 1.0,
      "tripDate": " October 2018"
    },
    {
      "title": "Stay away",
      "text": "A friend and I made a reservation for two families weekend getaway several weeks ago and when I heard what has been happening at this hotel, I decided to visit the hotel, all the comments about how bad this hotel became are true. Slow elevators, noise everywhere. What is interesting is every time a guest provide feedback, the Hotel respond with a very generic answer not addressing the real concern.",
      "rate": 1.0,
      "tripDate": " August 2018"
    },
    {
      "title": "Stay back",
      "text": "Tripadvisor says... there is shuttle...There is none...Below is pasted from my google review...At 9.20 pm you call to order food... they say there is no one... the menu card says 5-10. I was told it is wrong information or old... hate to go out with no car for food... never again thought it is convenient to work... Earlier requested a tooth paste as i forgot packing and didn’t had time to grab... provided with one expired 08/17. When informed , was told that the date they have in everything so nothing can be done ... Needless to say a loud ac blower... can’t keep it , can’t off it... toggling wake up & sleep all night around.... Never again, Not going to recommend anyone... Added: no hot water this morning.. Not sure, expect front desk no other service phones answered.... Taking up with their management... worst of all i hv see for a 3-star",
      "rate": 1.0,
      "tripDate": " April 2018"
    },
    {
      "title": "very odd experience",
      "text": "Hotel was not clean, very noisy and a very high amount of families staying at the facility which was very odd for the time of my stay.  It didn't feel like the families were there on vacation.  Could not control the temperature in my room.  The environment didn't feel safe.",
      "rate": 2.0,
      "tripDate": " December 2017"
    },
    {
      "title": "Not a great place for the cost",
      "text": "This hotel has gone from ok to absolutely horrible.  One elevator was completely down leaving 2 more.  The hotel is inundated with \"permanent\" residents with a complete plethora of undisciplined children - and neither the staff or parents care.  It is virtually impossible to get an elevator and there are running and screaming kids everywhere.  One of the working elevators had chunks missing out of the tile floor.  Breakfast is $13 for not very much and the lounge is only open after 5:00 pm and very frequently (twice in one week) they run out of certain liquors. The room I was in had a \"Sleep Comfort\" bed that was broken.  Couldn't really connect to the Internet either.",
      "rate": 1.0,
      "tripDate": " December 2017"
    },
    {
      "title": "The Hotel Has Seen Better Days",
      "text": "I had a function at the hotel back in January.  Just seeing some recent news brought back some bad memories.  The  hotel needs some updating soon but I don't think that will happen in the very near future.  It is full of refugees.  Made the function at the hotel very uncomfortable and undesirable.  Needless to say I will never come back.",
      "rate": 1.0,
      "tripDate": " January 2018"
    },
    {
      "title": "Family",
      "text": "I was called twice the day I was to arrive about the credit card I used to reserve the room, I explained I would be using a different card when I arrived. I believe they should not have been using my card before I arrived, In my opinion they were trying to double book my room because they said they were full,",
      "rate": 2.0,
      "tripDate": " August 2018"
    },
    {
      "title": "Terrible experience dirty hotel  the room was dirty smelling smoke with stain every where on the floor noisy",
      "text": "Noisy dirty hotel in a bad location without any attention to the customer The moquette in my room 1129 was dirty with stain , a terrible smell of sigarette in the room and the corridor as wellBreakfast poor and expensive The bed sheet where broken One of my worst experience I will not recommend to anyone",
      "rate": 1.0,
      "tripDate": " November 2017"
    },
    {
      "title": "Horrible Hotel",
      "text": "This hotel is old and dark. People are living there long term. They use it like a appointment. It's worce than a low end apartment. Not worth the money at all. Even the elevator was falling apart. So much noise and kids and adults talking with each others doors open. Felt like I rented a room in a sold out apartment",
      "rate": 1.0,
      "tripDate": " October 2017"
    },
    {
      "title": "All reviews are correct",
      "text": "Stayed at this property and it was horrible. I can´t understand why Radisson chain is accepting these conditions to their valuable customers.It´s old, it´s dirty, it´s full of homeless people and then you must pay for parking.  Worst hotel I´ve every stayed. Could not recommend to stay here. Shameful for the Radisson group",
      "rate": 1.0,
      "tripDate": " September 2018"
    },
    {
      "title": "Could have been better place, good for short stay.",
      "text": "I was hesitating after read so many bad reviews about this hotel but decided to go myself with my family. Good pints:The reception staff greeted us very kindly& check in was very quick. He even go to the extend recommended interesting places to go in Toronto. The room was reasonably spacious & the bed was reasonably big enough for 2 adult with 1 teenager & 1 child. The bed was a bit worn out as when we sleep on it, we sank in. Pillows was comfortable & soft. Despite is that, we slept well. No safety deposit safe in the room so we can’t leave our passport or valuables behind. We didn’t eat at the property’s restaurants for any meals so I can’t comment on it. Lots of refugees in the hotel, good thing is the management put us, tourists guests on the same level & put the refugees all in the same level. This way the noises that they made didn’t bother us.Parking is available at the property but on the open space & not free. Parking spot can be found easily. There is Asian grocery supermarket nearby about 4 min drive. If you don’t have car, it’ll take longer to go there as walking is a bit scary in the neighbourhood now.In the same complex as the grocery supermarket, there is Chinese restaurant which has very nice food with reasonable price. Close by, there is Tim Horton cafe & Wendy’s to get your meals.Bad points:Toilet was blocked but fixed right away. A/c was not cold at all & fixed right away also. However, TV wasn’t working so we didn’t bother to ring for the 3rd time to ask them to fix it.As we heard from the locals, the hotel has contract with government & as the result they are accomodating the refugees in the hotel. Lots of children running around in the hotel lobby, on the driveway to the lobby or on the corridors of the hotel rooms. Unfortunately, this has gives image of the hotel gone down from 4 stars to 2 or 3 stars. I don’t have any prejudice on refugees, the hotel management choose to do it this way to give to community.",
      "rate": 2.0,
      "tripDate": " September 2018"
    },
    {
      "title": "Do not stay here!!! Avoid at all costs",
      "text": "When we arrived there were several children playing and riding their bikes in the parking lot. This hotel is in an industrial area. Upon check in there was one elevator non functional. Numerous people waiting for the other two. It appeared to be like we were in an apartment building instead of a hotel. Upon entering the room we found damage to the stand and the ceiling was disgusting. They had a sleep adjustable bed but it didn’t work and had a big lump in the middle. When asked where the ice machines where we were advised floors 8,6 and 4. But don’t go to 8 because it never has any ice.  Went to 6 barely got a bucket and had to walk back up 3 flights of stairs because people were now stuck in the elevator if which of the three one was only working. The one that was being repaired already has it’s doors opened so anyone could fall in its shaft. There were several people doing their laundry and lounging within the laundry room while their laundry was being done. Called down to the front desk at least 10x with no answer. When leaving in the morning the elevator had parents with their children taking them to school. This is not a place to go for a relaxing evening by any stretch of the means. Giving it a 1* rating was generous. It would appear this is one of the hotels the Government uses to house newcomers to Canada. If you children running up and down the halls as well as people coming and going constantly is what your looking for then this hotel is for you. This is clearly not reflective of the Radisson brand and standards you come to expect.",
      "rate": 1.0,
      "tripDate": " May 2018"
    },
    {
      "title": "Very, very dark, dingy, full time residents make for crowded stay...",
      "text": "On the positive side -  the hotel staff are polite, courteous and efficient.... I'm sorry I cannot find one high note with the facility or the management of the place... On arrival - was shocked that there were seemingly dozens of children running around the lobby and crowding the elevator ( took over a half hour to reach to reach the 6th floor as they are playing \"hit every button\" so stopped at every single floor and are slow to begin with. ) It was surreal - I finally asked \" Are there people living here?\" because so many families seemed to be walking around in very casual form - was told by a staff member that the Radisson is actually Refugee Housing... Glad that we are providing  much needed facilities but for a weary traveller - an awful experience. The place was packed and utterly chaotic. You could not pay me enough - ever - to stay here again. The halls are dimly lit  - had to go down to the desk twice to have the door card replaced - not working... hardly slept all night due to slamming doors and noise level... a WOW - and not in a good way...",
      "rate": 1.0,
      "tripDate": " February 2018"
    },
    {
      "title": "getting worse",
      "text": "Where do I start first we have been at this hotel with my husbands work in the past .And in the past our issues where the internet is terrible.The sleep number beds do not work and are not comfortable,The elevator is out of service.The amount of people living there kids running around.Plus is the swimming pool and restaurant.We figured 2 years have past it must have gotten better big mistake.The beds still are awful.The same elevator is still broke there is more people and kids there so the wait is crazy for the elevator.The internet is so slow we gave up.Oh part of the restaurant flooded so only a small part of it is open so no buffet.We tried calling the front desk several times no answer.So that is the last time  we stay there.No more chances.",
      "rate": 1.0,
      "tripDate": " May 2018"
    },
    {
      "title": "Old and stinky",
      "text": "This hotel is old and the beds are terrible old sleep number bed that do not adjust.  There are hundreds of families living full time in the hotel. The Elevator is in very poor condition. So many kids living at this property it is very noisy.",
      "rate": 1.0,
      "tripDate": " April 2018"
    },
    {
      "title": "No security cameras",
      "text": "I have stayed several times at this hotel but not in the past 3 or 4 years.  It is convenient to the 401 so is the reason I stay there.  This trip was an eye opener.  The room, while clean, show obvious signs of aging.  Chipped counters, worn doors, etc.  Ate ate the restaurant for supper.  Good food and excellent service.  There were a lot of families and kids around .My complaint is the lack of security cameras in parking lot  My car was hit and vandalized during the night.  Whoever hit my car, of course, did not take responsibility and leave a note... obviously because they also kicked in my door... and as a result o am responsible for repairing my vehicle to the tune of over $3000.  If there would have been video, I would not have had to pay the insurance deductible.  If I do not do the insurance route I pay the full $3000.  Either way I'm out over $1000.  Not ever going back.",
      "rate": 1.0,
      "tripDate": " February 2018"
    },
    {
      "title": "My recent 4 night 5 day stay",
      "text": "Trust me if I had had any other choice I would never have stayed here after the first night, simply awful, I understand that the people have to stay somewhere, there is no supervision of any kind by the parents of these young and older children they roam the halls at all hours of the night and day everywhere, playing on the computers even when told not to, now before anyone says they don't understand the language let me inform you they and rudely will tell they can do what they want to. The food as guests we were offered was awful, they also roamed the hotel halls playing loud music etc on their cell phones which most of the children we saw had.........We felt so sorry for the staff who were great trying so hard to do their jobs",
      "rate": 1.0,
      "tripDate": " March 2018"
    },
    {
      "title": "NOT FOR FAMILIES NOR SINGLE TRAVELERS STAY AWAY",
      "text": "Do not be fooled by the Radisson Toronto East name.  Stay away. This hotel is not up to the Radisson standards.  Yes they may have had a fire, but that speaks to the idea that the hotel is being poorly maintained.  Ceilings are peeling or bubbling, tiles are chipped away, there is a musty, odour in hallways and rooms. The hotel needs lots of upgrades.  The hotel is housing many people long term who calls this place home.  Yet it lacks room as a home so children are forced to play in hallways and elevators, families congregate in lobby and out front to smoke and be together.   Long term stays are not business oriented; they are community housing needs.  This site has received mixed reviews but when looking back the negative family comments are consistent to my family's experience in the hotel.  The staff are outstanding, pleasant and very professional.  The location can not be beat.  Too bad the hotel property does not reflect this.",
      "rate": 1.0,
      "tripDate": " April 2018"
    },
    {
      "title": "Extremely Overpriced for 1 Night",
      "text": "Stayed here overnight for work due to an emergency. Literally over $200 for a night and the place has a busted elevator, tile is chipped and broken everywhere, the AC would never drop below I'd say 22 Celsius despite setting it as low as 15 celcius just to get it to move, and not even a continental breakfast was included. Oh and IF I had a car, it would be $8 on top per day just to park in the massive parking lot the monstrosity lies upon.",
      "rate": 2.0,
      "tripDate": " July 2018"
    },
    {
      "title": "DO NOT GO THERE! HORRIBLE AND DIRTY",
      "text": "I would like to make it short.Dirty in the whole property and nobody cares, loud, no service, hundres of refugees, unfriendly stuff, still no breakfast buffet, still not working elevators, one of the filthiest pool areas I´ve ever seen. (got plantar wards from it) hairs in the shower, you must pay for parking, although it´s an industrie area with a lot of space.It´s a shame for radisson, that this property can use their brand name!Dear Management,don´t give your apologizes here! You did it a hundred times and nothing changed!I will tell the whole internet and especially the travel industrie what´s going on here!Close your doors. To sleep in a tent is better, cleaner and more friendly!",
      "rate": 1.0,
      "tripDate": " May 2018"
    },
    {
      "title": "Disappointed",
      "text": "As I said in my review that TripAdvisor said needed to be rewritten. \"We don’t allow content that we feel is irrelevant or unhelpful.\" So here is my second attempt. The mixing of refugee applicants and guests isn't working well and I felt ripped off spending $1350 for 3 rooms for 2 nights. It was shelter, not a holiday. That is not irrelevant. Had I understood the situation at the hotel, I may have stayed elsewhere.  Elevator not working is an issue since the hotel is at capacity. I can't stress this enough and you see it in other reviews. We were on the top floor which was very quiet. We had an adjoining room with our toddler grandson and his parents and with the doors shut couldn't hear anything in that room. Nor were we disturbed by the other guests. I answered \"not sure\" to survey question \"Is it a quiet hotel.\" The room was quiet but the a/c unit, which worked, was extremely noisy or if the window is open, you have the highway noise. I don't think that is what the question is asking, and being on the top floor, we did not hear other guests.That said, I rated the hotel as Loud because of the A/C and the common areas were almost always full and bustling. It is not an oasis in the city. No breakfast buffet during the week (not enough demand for it anymore, the regular guests have changed to other hotels, the refugees are fed separately by the catering department.)Fridge, microwave and opening windows plus great location explain my stars. Had this been a regular hotel, it would have been 4 stars even with the elevator out of service.",
      "rate": 2.0,
      "tripDate": " June 2018"
    },
    {
      "title": "Stay from August 3-6",
      "text": "The worst hotel we have stayed at. Very dated and could be cleaner. We were in Toronto for a wedding during a long weekend and had booked 6 months ago only to arrive to hear that our booking had been cancelled and they didn’t know why. The hotel AC did not work well, the room smelled musty, the mattress was terrible, we requested a 2 bed room as we were 4 adults and got a king with a pull out. We were promised a cot upon arrival and did not get it until the next day. On top of it all, we learned that the hotel was doubling as a residence for refugees. They were very polite but it added to the noise level and the demand on the 2 functioning elevators. Would not go back nor recommend it to anyone!",
      "rate": 1.0,
      "tripDate": " August 2018"
    },
    {
      "title": "Worst experience at a hotel!",
      "text": "As soon as you walk in there are a lot of people lingering the lobby outside, turns out they are refugees. Only 2 working elevators. The refugees move from floor to floor to get ice, do laundry, etc. The refugees will cut in front of you while getting on the elevator. Some of them are rude. We got to 9th floor, there was a strong smell of ethnic food ( oils, garlic, spices).At 10:30 pm we hear drilling, hammering very loudly in the floor below us. The maintenance man comes to tell us the room below us flooded (tells you what crappy place this is). My baby couldn't sleep. I wrote to the manager, he gave me 9000 radisson reward points (which doesn't get you much). My parents were in the room next to us, he refused to give them the same compensate my parents because he accused them of writing a bad review(it was my husband). Lack of ownership on their poor service.",
      "rate": 1.0,
      "tripDate": " June 2018"
    },
    {
      "title": "Worse than a nightmare!",
      "text": "This hotel was recommended to us by the Delta Toronto East, after they had a water main break, and could not have travelers stay there.When we pulled up to the Radisson, we could tell that something was wrong immediately!  Curtains in the windows are all crooked, tons of people loitering around every nook of the hotel, and other guests were completely uncivilized towards us, pushing past us to cram into an elevator, yelling to each other, kids laying down in the hallways, etc.We did a search on this hotel over dinner and turns out the Canadian government is using this Radisson to house hundreds of refugees there, since they ran out of room at their refugee shelters.  If you want to use the hotel as a refugee shelter, great, but you should not be advertising it for personal and business travelers too!We felt very unsafe based on the interactions we already had with the other \"guests\", and immediately checked out.",
      "rate": 1.0,
      "tripDate": " June 2018"
    },
    {
      "title": "Book elswere",
      "text": "This was in the past, a good hotel. It is long overdue for an upgrade. I believe it is only a few years away from the wrecking ball.One elevator has been \"out of service\" for over one year.The hotel is clean on the surface but grubby underneath.They are currently housing, on an extended term basis, 17 refugee familys.I have no issue with refugees .... but ..... with approx. 35 children playing in the halls & elevators, it does not bode well for business or vacation stays.If you fancy living in a bounce house, this is it.The good news is ...... the location is great & hopefully another chain will build a new hotel on this site.",
      "rate": 1.0,
      "tripDate": " July 2018"
    },
    {
      "title": "Never Again",
      "text": "All the bad reviews. Bang on. Check in was great fast and friendly. 10 ft to the elevator and it all goes down hill. About 20 refugee families packing in to elevators. 1 elevator broken. 10 min later finally get on one. Packed in with about 15kids. Made sure to touch every button. Get to the room check and no bugs so thats good. Oops shampoo is used and soap. Gross. Then it finally gets better. The fire alarm goes off. Have to walk down 9 flights because some kid pulled the alarm. 30 min later dont even think about an elevator. Walk up 9 stories. Ridiculous. Nice welcome to canada a free room at the Radisson. My parents landed in the 60s and had to find a place to live and find a job immediately. Make this a hostel. Not a Radisson.",
      "rate": 1.0,
      "tripDate": " June 2018"
    },
    {
      "title": "Stay elsewhere",
      "text": "Radisson is typically associated with a certain level of standard. However, here that is not the case. Very worn down. No breakfast included. Only one cup of complimentary coffee per room as default - not even one per person staying in the room. Tried to charge us for parking even though there are a handful of adjacent parking lots where you could stay for free. Staff has just given up, no hospitality whatsoever. You're better off booking another hotel for your stay in Toronto.",
      "rate": 1.0,
      "tripDate": " July 2018"
    },
    {
      "title": "Honeymoon stop",
      "text": "Don't go here, not worth the money. We stayed farther out from downtown to save money but should have just spent the extra money. Room was dirty, didn't feel safe and none of the elevators worked. It was a hassle.",
      "rate": 1.0,
      "tripDate": " June 2018"
    },
    {
      "title": "If you have kids DO NOT STAY HERE!",
      "text": "I would seriously not recommend staying here with your family whatsoever. I try not to see the worst in everything but this place was brutal. We stayed here out of necessity due to the ice storm stranding us.The room rate was not great, but I can understand that due to it being last minute, however my experience in that place was absolutely terrible and scary at times for my children. I will not sugar coat this whatsoever! This hotel houses long term refugees in the building. I have no issue with that, however the behavior of a few of these residents is why I am currently writing this. I will start with the worst thing that happened, we were on a packed elevator shoulder to shoulder with people. There were two mid teen residents of the hotel there. They were constantly staring at my 7 year old daughter and her friend who was 6. They looked them up and down and then turned to each other and said something. They then turned to my daughter and said you look very good, very pretty girl here (oh did I mention she was in her bathing suit). Completely unacceptable conduct. Encounters like these continued to the point I kept the girls in the room and didn't want them walking around with the hotel with me. these encounters were completely unavoidable as this place had one elevator working for the entire building, we were located on the 9th floor and waited up to 15 minutes for an elevator at times, due to being literally shoved out of the way by \"residents\" staying there long term.  Some of the children staying there would ride the only elevator up and down hitting all the floors buttons so it stopped constantly creating further delays.Our room windows had mold all along the top and leaked with water all over the floor. I would NOT recommend you stay here with children at all!",
      "rate": 1.0,
      "tripDate": " April 2018"
    }
  ]
}