{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Residence & Conference Centre - Toronto Downtown",
    "url": "/Hotel_Review-g155019-d12540851-Reviews-Residence_Conference_Centre_Toronto_Downtown-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.0",
      "reviewCount": 42
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "80 Cooperage St",
      "addressLocality": "Toronto",
      "postalCode": "M5A 0J3",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/1b/1f/95/25/residence-conference.jpg?w=500&h=-1&s=1"
  },
  "description": null,
  "featues": [
    "Free High Speed Internet (WiFi)",
    "Wifi",
    "Business Center with Internet Access",
    "Conference facilities",
    "Meeting rooms",
    "Concierge",
    "Non-smoking hotel",
    "Self-serve laundry",
    "Air conditioning",
    "Desk",
    "Telephone",
    "Kitchenette",
    "Microwave",
    "Extra long beds",
    "Bath / shower",
    "Complimentary toiletries",
    "Refrigerator",
    "Non-smoking rooms",
    "Suites"
  ],
  "reviews": [
    {
      "title": "Family trip to Toronto",
      "text": "This was a great place to stay for our trip to Toronto. With the prices of hotels in downtown, this was very affordable. The staff at the front desk were friendly and helpful, the room was clean, the beds were comfortable and it was conveniently located with the brewery district a 10 minute all away. We love to walk and we’re able to walk most places, and the street car comes very close to the residence.",
      "rate": 5.0,
      "tripDate": " May 2024"
    },
    {
      "title": "Economic but basic.",
      "text": "Good location.  Clean. Spartan.  Definately like student accommodation., which is what it is really!   Nice receptionists.  No coffee machine in room.  vending machines nearly always played up in some way so bring water/ snacks with you.  Very good value though. A couple of nice restaurants nearby.",
      "rate": 3.0,
      "tripDate": " June 2024"
    },
    {
      "title": "Good basic accommodation",
      "text": "Reasonably priced 2 room accommodation which was perfect for our family. Facilities are basic but if you plan on eating out all the time then it’s fine. About a 25 minute  walk to town centre. Staff are pleasant and reception is available to sort out any problems.",
      "rate": 4.0,
      "tripDate": " June 2024"
    },
    {
      "title": "Worst experience ever",
      "text": "If you want to have a nightmare visit to Toronto, this is the right place to stay.  Common areas are dirty, the elevators are simply disgusting with stains on the doors an garbage. The rooms are ugly and the walls dirty too. And the worst are the bathrooms...And to have more of a disaster the check-in can last a good half hour to find your reservation an to prepare your room in 15 min after a guest leave the property.Be aware and make your smart choice 👌",
      "rate": 1.0,
      "tripDate": " June 2022"
    },
    {
      "title": "It did the job",
      "text": "Front desk staff were very friendly during check in, and also helpful.The room was clean enough, the blanket stains on it, but the sheets appeared clean. Stayed with another couple for 3 nights, so it was nice having two separate rooms. The air conditioning was very very weak, and the bed was incredibly uncomfortable.The keycard for the room was a bit confusing, but the staff made the effort the explain how to use it properly.Overall, the price was right and it was a place to sleep while we were in Toronto, but I probably wouldn't stay here again.",
      "rate": 3.0,
      "tripDate": " June 2019"
    },
    {
      "title": "New and very clean university residence centrally located.",
      "text": "Clean, basic place to stay very centrally located. It is a new university residence that changes to a hotel during the summer. Very clean and new but resonates as lots of cement and sparse decor to absorb sound but this was explained on booking site so no surprises. Step up from a hostel but an option better than a cheap hotel because it was super clean. Ignore the kitchen in the picture as there is nothing to use for cooking or dining. We paid too much as price came down substantially but was after cancellation date.",
      "rate": 4.0,
      "tripDate": " June 2019"
    },
    {
      "title": "Scam and a Sham - DO NOT BOOK",
      "text": "Do not make the same mistake I did. I booked hotel and flight deal on Expedia. After reading the reviews it's not a hotel. It's a college dorm!!! This 'hotel' has no manager and tried to cancel for 2 days. Finally someone answered and refused to cancel the booking. Expedia were no help at all told me I should have read all the reviews before booking. They offered a 100 USD discount if I booked another hotel with them but couldn't refund this one. This is misleading as most people will not read every single review. I won't be staying here and I hope no one else does.",
      "rate": 1.0,
      "tripDate": " August 2018"
    },
    {
      "title": "Good as long as you understand what you’re getting ",
      "text": "Our family of three just returned from a 3 night stay at the RCC. I had read all the reviews on the accommodations, so we knew we were staying at a no frills “hotel”. My only concern before arriving was the cleanliness of the site. I was pleased when we arrived that both the common areas and our room were very clean. The staff was friendly, but don’t expect the full service you would receive at a hotel. The pictures of the residence are fairly accurate except the “fitness center” is just a room with a few machines— no weights. We heeded the warning of others and brought our own towels. The towels provided are similar to ones you would get at a gym— smaller and not soft. They provided toiletries, but did not refill them everyday. I suppose we could have asked for more, but we did not need any. They also do not have any hangers in the room, but there’s plenty of drawer and shelf space. The location was safe. We walked 15 minutes to St. Lawrence market and took the streetcar all around town. It’s not central, but it’s not in the outskirts either. We used the parking garage below the residences and refilled our “meter” through an app, so we did not have to run back before our time expired. There are several eateries nearby. The Middle Eastern place down the street was excellent and El Catrin in the Distillery District was fun and delicious. I would return to this accommodation on our next trip. A great value!",
      "rate": 4.0,
      "tripDate": " July 2018"
    },
    {
      "title": "DO NOT BOOK!!!",
      "text": "Save your money and book elsewhere.  Horrible place along with horrible customer service not to mention the rude manager.  Tried to cancel but refused to refund my money.  Have never had such a poor experience! Stay away!",
      "rate": 1.0,
      "tripDate": " May 2019"
    },
    {
      "title": "Short stay in Toronto ",
      "text": "Hotel is about 30min by walk from the center. Hotel is a bit far from any shop or any activities except jogging. When you arrive don't try to search for Residence & Conference Center hotel, there is no such sign. Hotel is called George. Rooms are clean and comfortable enough for short stay, but not as comfortable for long stay (unless you are single). For budget stay I would say 4*, but with quiet place it is 3*. You will hear nearly everything what is going arround you. Hotel doesn't offer any breakfast which is a bit stupid...Anyway hotel is very clean and elevators are big enough to fit with big luggages. Near to the hotel there is one coffee shop which offers reasonable breakfast. As explained by receptionist it is more as college house rather than hotel. Still recommend it for short stay.",
      "rate": 3.0,
      "tripDate": " August 2018"
    },
    {
      "title": "Location can't be beat!  Accomodation - Good but could be easily better!",
      "text": "The location, near the distillery district, with underground parking was wonderful.  Staff are very friendly, and check in and out was very fast and simple.  The kitchen/bath and two separate bedrooms was perfect.  A/C was great and controllable once one figured it out (instructions would help!) Stunning views of the rooftop garden and the CN Tower too, along with the lake made it very visually wonderful for the price point!  The Price Point is the selling feature.  Coffee shop at the corner was great, as was the very friendly YMCA next door, which offered free trial memberships! Knowing I can bring some things and make it work better would have me booking this spot again anytime!Towels although provided were shabby and small (bring your own). Having a kitchenette was great but it was literally empty (no cutlery, plates or cups even - they provided little plastic throw-away cups only in the bathroom.  The place needed a thorough dusting and floors needed cleaning in the bathroom! The shower required one to dance around to get wet. One elevator was out of order and in three days saw no attention which was annoying.As a teacher a little thing: have signs proof read!  A simple sign in the elevator had 4 grammatical/sp. errors!  :-)",
      "rate": 4.0,
      "tripDate": " July 2017"
    },
    {
      "title": "Read the Fine Print",
      "text": "The location of this place is near the distillery district where we went to dine out, but amenities at the george Brown college are terrible. The key locks are confusing with a high risk of leaving your room open. The rooms come with a fridge and nothing else. No forks, knives, or cups. The microwave works, but the air conditioning works barley and is very loud. The showers are uncomfortable for anyone around  6ft  tall and most importantly they don't have free parking. There is a third party entity that has a large nearby and the cost is 21 CAD a day, but keep in mind you have to know when you'll be coming back, it's not where you pay at the end, it's pay upfront style.",
      "rate": 3.0,
      "tripDate": " July 2017"
    },
    {
      "title": "1 day holiday 2023",
      "text": "Gorgeous😍Apartment in a nice modern neighborhood with kitchen and two comfortable bedrooms we had a view of Toronto.Very honest price for having an apartment all to ourselves. Clean and bathroom not too big but comfortable.Parking right under the building so very convenient.Excellent quality and price",
      "rate": 5.0,
      "tripDate": " August 2023"
    },
    {
      "title": "Convenient. Clean.",
      "text": "Such a friendly reception staff welcomed us.  Convenient parking garage next door as well as very close to downtown Distillary District and 20 minutes from downtown. Also close to waterfront. We loved walking into town for meals, shopping and touring.  Our family of four enjoyed the 2 bedrooms that each had a big screen tv.  Nice to have treadmills on the 8th floor, but we took advantage of YMCA next door.  The beds were pretty small, but we managed.  Highly recommend.  Lena at front desk was awesome!",
      "rate": 5.0,
      "tripDate": " July 2018"
    },
    {
      "title": "Student Dorm hotel.",
      "text": "First of all,front desk when I did finally find it was very friendly and courteous!I just had a few cons and pros with this hotel!Pros are great location if you don’t want the crazy madness of the Center of Toronto and still have some cool places to eat,like the mill street brewery which is cozy with its old school stone walkway and outside patios!Its a must if you stay at this hotel!Parking is available right next store and reasonable for 24 hrs,15bucks!Suite was clean and had two separate rooms,pros end there!Suites have a fridge and microwave but no cutlery,plates, nothing! Room is basically a student dorm with no decor,,that’s cool if that your thing,I’m just used too a little ambience!This place was heard to find too,,its actually called The George something and there in no official roll up entrance!The shower is really small,,like a dorm and the shower head is a dribbler!Having said all this if you don’t mind cons this place is for you!",
      "rate": 3.0,
      "tripDate": " July 2018"
    },
    {
      "title": "Felt like home!",
      "text": "First time at this hotel and not the last! These residences were close to downtown and at a walking distance from the distillery district. We were warmly welcomed by the staff and the rooms were remarkably clean. Should you think to cook, bring your pots and plates as they are not supplied by the hotel. We will come back.",
      "rate": 5.0,
      "tripDate": " July 2018"
    },
    {
      "title": "Great Location and great price!",
      "text": "My husband and I stayed here while on a business trip and were not disappointed.The building is or used to be a student residence for the George Brown College so at first I was a bit doubtful but that changed pretty quickly when we walked into the clean and spacious room(s).We actually had two rooms, each with a double bed, a little kitchen area with table and chairs, a fridge, a sink and a microwave. And a bathroom with only a shower (no bathtub).Everything was clean and we had a great view of downtown with the CN tower. There is a rooftop garden on top of the YMCA next door so you have a view of that as well which was pretty nice.I liked that the windows open and you can regulate the A/C in the room as well.All this for about half the price of staying downtown.We didn't have any problems with the locking system...all you gotta do is lock the deadbolt from the inside when you are in and hold the card in front of the lock to lock it from the outside when you leave...easy peasy.All the staff was very friendly and always there to help or call a cab etc. There is a little coffee shop right next door where you can have breakfast or lunch which was great.Also the hotel is one block from the historical distillery district which is totally worth checking out. We stole some time away from our busy schedule and went for breakfast there once.We also walked to the convention centre once, which took us about 30 min.So for an active person, it's no problem to walk everywhere...its still pretty close to downtown and you get to see things you normally wouldn't. All in all it was a great experience and we would definitely stay here again.",
      "rate": 5.0,
      "tripDate": " June 2018"
    },
    {
      "title": "Great stay",
      "text": "We really enjoyed our stay here. This hotel is a dorm during the school year, so it's a little different than a standard hotel. There are two seperate bedrooms, which we loved. Each bedroom has a TV, dresser, desk with phone and open closet with shelving. The beds aren't huge, but my husband and I were comfortable. The common area in the room isn't large, but we pulled the small table out from the wall and were able to play board games with four people in the main area. The view from our room was great! The shower head was really short. My six-foot husband had to do squats to be able to wash his hair. There's a game room on the second floor we really enjoyed with foosball and a pool table. The people at the front were nice and helpful. My biggest complaint was the heat. It was only in the 70s while we were there, but the room would not cool down very much. I opened the window in the evening to try and help, and the window broke. They came and fixed it immediately and said it happened alot, but I didn't want to open it again after that.The location is great too. The Distillery District with lots of shops and food options is a short walk from the hotel and worth a visit. There are also a few restuarants in the other direction as well as a little market. If you have kids, there is a park with a splash pad just down the street as well. We will definately stay here again if we return to Toronto. For the price, this place can't be beat.",
      "rate": 5.0,
      "tripDate": " June 2018"
    },
    {
      "title": "Great Location",
      "text": "We didn’t realize that we were going to be staying at a George Brown College residence. We loved the price and the location a 5 minute walk to the Distillery District. The suite was clean and quiet. The beds are doubles but comfortable. I borrowed a hair dryer from reception as they weren’t in the rooms. We parked fairly cheaply underground. We will return happily.",
      "rate": 4.0,
      "tripDate": " June 2018"
    },
    {
      "title": "The better choice at Toronto",
      "text": "I would definitively recommend it.We easelly walked from the Union Station to the Residence & Conference Centre Toronto Downtown and that took us just 20 minutes. So we did it everyday to get to all the Toronto´s attractions.The staff couldn´t be more helpful, gave us all the information we needed and we really concerned on providing us a perfect stay.The apartments we´re spotless with two rooms, a bathroom and a kitchen.As nothing is perfect, the housekeeping wasn´t any good and the elevators we´re a real problem since it´s not possible to get to the apartments using the stairs.It can  also be considered a symbol of the Canadian development, since the it was build to the pans, it is used as student accommodations and on the holidays you can stay there as a hotel.",
      "rate": 4.0,
      "tripDate": " August 2017"
    },
    {
      "title": "Discount accomodation",
      "text": "If all you need is a bed, then this accomodation is an option. Theres is very few facilities, and no breakfeast available. It is more like a dormitory room than anything else. The location is in the edge of the city centre, although it is close to the very nice distilery district (lot's of good food to be found there).",
      "rate": 2.0,
      "tripDate": " July 2017"
    },
    {
      "title": "Well worth it!",
      "text": "Stayed here for two nights on my way to Niagara in the Lake for a wedding.It is obviously an accommodation facility for students or academic conference participants, and I enjoyed staying there very much. The rooms are simple but functional, beds are comfortable and it is the hotel is quiet.For travellers who don't need swimming pools, mini bars and all the luxury, this is a great place for a safe, comfortable place to sleep. Have to say the bath towels were a bit rough though.I got one of those seld contained units that have irs own pantry, a bathroom and then two individual rooms. Great for two friends travelling together or maybe a family of three.Shower pressure was fine, and hot water is always available. I think this olace is foe those who have graduated from hostel life.It is a 20 minute walk to Union Station so not too far, but it isn't that close to any tube stations.There were switching the door locks to electronic when I was there so some issues with the cards not working. Another I noticed was that the door didn't automatically lock when I left the room and had to tap the card from the outside to lock it. Not sure if it is still the same by the time people read this.",
      "rate": 5.0,
      "tripDate": " August 2017"
    },
    {
      "title": "Super Location with Super Service",
      "text": "I just loved staying at The George. As previously mentioned this is a Uni dorm, not a real hotel. It is staffed by Uni students. If you're expecting utensils and luscious towels, stop at the dollar store and buy plastic utensils and bring your own towels. (In fact I think next time I'll bring my own towels as they're fairly small). That's the \"bad\". However, I just LOVED the separate rooms as we were friends travelling together not a couple. Both rooms had TV's. There's parking underground that costs $21/ 24 hours. We asked for a hairdryer when we booked in and one was given to us no problem. The staff were very good at answering our questions and giving suggestions. If I ever come back to TO I'll certainly stay here if it's during summer break!",
      "rate": 5.0,
      "tripDate": " August 2017"
    },
    {
      "title": "Interesting Place",
      "text": "We needed a room in Toronto and this was very reasonably priced. It’s a college dorm that converts to a hotel in the summer so basically you’re getting an undecorated dorm room. It was clean, easy parking right next to the building and the Dark Horse coffee shop next door is awesome! Easy streetcar access right outside and close to Distillery District. We were so busy touring we only slept there so it worked for us. It was easy to get around to sites and front desk staff were friendly and helpful. If you need an economical place to sleep this is fine as long as you don’t expect full “hotel” amenities.-",
      "rate": 4.0,
      "tripDate": " August 2018"
    },
    {
      "title": "Crazy Affordable",
      "text": "We stayed here overnight while attending a wedding in downtown Toronto.Location is perfect if you are going to the Brewery District in Toronto The staff are very friendly.The room had 2 bedrooms, bathroom, seating are with table and 4 chairs and a kitchenette with large fridge, microwave and sink. Very clean, new, modern building.Now pay attention to this next fact...Parking in downtown Toronto..Usually at least $40-$50/night and don't go past noon or you pay more. We have paid $83 for one night because we went past 12:00noon and were charged for an additional day!!The Green P at this location has a maximum price of $15 for 24 hours.If you check in at 3:00pm, you only pay $15 right through to 3:00pm the next day. Overcharges are minimal.Try this placd. Low cost for 2 couples, incredible location and cheap parking....",
      "rate": 5.0,
      "tripDate": " July 2018"
    },
    {
      "title": "Amazing location, unbeatable price",
      "text": "I almost didn't want to write this review because I want to keep this place to myself!  As the prices at hotels gets crazier and crazier I was hunting for an alternative for a mid-week event in the city.  The George was a perfect solution.  The location was ideal for dinner at the Distillery and then a short walk to the ACC for a concert.  Parking in that area was relatively easy to find much to my surprise.The staff (many of them students I assume) extremely pleasant and the room well appointed (much better than the dorm rooms I remember!).  As one other review noted - the only tiny flaw was the quality of the towels.  Absolutely not a big deal - I will just bring my own next time!",
      "rate": 4.0,
      "tripDate": " June 2018"
    },
    {
      "title": "Convenient location, great price.",
      "text": "I really wasn't sure what to expect with this place given the price but it's fantastic. We got a small two room apartment that had a small kitchen (fridge and microwave, no utensils), a tv in each room, small table with chairs in the main area and a full bathroom with a big shower. The towels weren't that great but not that much of a problem given price and location. The internet worked perfectly. These are dorm rooms they rent out when not occupied. The location is perfect. It's just up the street from the Distillery District and a block from the 514 street car stop. Dark Horse coffee shop is right on the corner and is a great place for a good cup of coffee and tasty treat. There are two bike stations close by so there is easy access to hop on one and ride through the city. St Lawrence market is a bit farther from the Distillery District by just a few blocks, still a good walking distance.",
      "rate": 5.0,
      "tripDate": " May 2018"
    },
    {
      "title": "Great choice.",
      "text": "With Toronto Hotel costs so high, this is a great alternative. Excellent idea to rent out student accommodation for tourists. Friendly and welcoming staff on reception, clean units we were in a two bedroom, spacious apartment. Super fast WiFi. Location Excellent for tramstop and a few restaurants. Don't expect a hotel and you'll be pleasantly surprised. Recommended.",
      "rate": 4.0,
      "tripDate": " August 2023"
    },
    {
      "title": "Clean and close to downtown with a great price and staff!",
      "text": "Clean and close to downtown with a great price and staff!Our family (2A2C) were on a quick Toronto trip and needed a place to stay that was near downtown and didn't break the bank. Other places were up to $1000/night...not here.With kids you need a place that is clean and you feel good to have your kids roaming about in...this place is great.We needed to have access to downtown close at hand...we were an 8 min drive or a 25 min walk away.You always want to stay in a place that is staff friendly...this place shines in that category!  Johnathan was so super helpful it was incredible, even going so far as to lend me a plate from his own residence to use in the room's microwave! Over and above from an awesome guy!You want to have a place to save a buck or two to offset travel costs and with kids especially to have some basics on hand...this place had a kitchenette.The only reason for a 4 star not 5 was the toilet paper holder was not really attached to the wall which was a pain, and the smoking area/benches was directly in front of the entrance which meant that our kids and us had to walk through a cloud of smoke and sometimes marijuana smoke to enter the place.FYI paid parking in the basement is $18/24hrs but there is no inside access to the residence.Great place and worth it!",
      "rate": 4.0,
      "tripDate": " July 2023"
    },
    {
      "title": "BEWARE: POORLY TRAINED, UN-EMPOWERED, DISMISSIVE  STAFF MAKE FOR A BAD \"BARGAIN.\"",
      "text": "The price looks good in comparison with \"normal\" hotels. But for close to $100 per night, the serious drawbacks in facility and service quality make this a loser. Not all is bad: the Mini-market on the property is well-stocked with healthy \"microwave\" food options and other convenience items, if at expectedly high prices. But to eat, you'll need to buy utensils, plates, cups, paper towels, and other necessities - ZERO is provided in the room. It is STRIPPED BARE. The Subway sandwich outlet, also on the premises, makes the standard fare and is fast and convenient. That's pretty much where the \"positives\" end. The location is  an hour outside of the city center by public transportation. The facility is a college dorm, sold as hotel rooms during the summer. There is no housekeeping service. There are no phones, and no way to connect to the front desk, even in an emergency. You get one towel when you check in. No one picks up trash or brings fresh towels. While the rooms are clean, there is one infinitesimally small chip of soap provided - essentially, enough for one shower, and no one to bring you more. There is no heat - it is turned off for the duration, throughout the building, even the the rooms are exceptionally cold. I begged for more blankets - eventually, I was able to get more sheets instead: worthless. Meanwhile, full air conditioning is turned on throughout the hallways, making it nearly frigid. The televisions in the room do not work because they are disconnected (there is no cable connection for any channels at all). Worst, and the only truly inexcusable shortcoming, is that the staff is poorly trained, un-empowered and egregiously under supported. Not one person was able to take personal responsibility for the simplest of requests. In fact, the ONLY person who runs the front desk in the evening is egregiously slow in dealing with a long line of people waiting to check in. One could reasonably expect the young staff (possibly students) would have at least a chimpanzee's understanding of customer service, yet ultimately, the fault lies not so much with them but the with management, who collectively offer the worst possible \"teaching moment\" to their hapless, underpaid (if, indeed they are paid at all) employees. Not worth the hassles.",
      "rate": 2.0,
      "tripDate": " May 2023"
    },
    {
      "title": "Great Location",
      "text": "Friendly staff, very easy and quick check in. Close to transportation for heading into downtown. Very clean and bright. Beds were small doubles but very clean and comfortable.  Great price, $115.00 plus tax for the night.",
      "rate": 4.0,
      "tripDate": " August 2018"
    },
    {
      "title": "the location of this residence is excellent for going anywhere  in downtown Toronto",
      "text": "I give this place 4 stars because of location and unbelievable low price for downtown T.O. This place is almost brand new and the services aren't what you get in a luxury hotel but neither is the price. I paid $120 CDN+tax per night!!!King streetcar is 100m away will take you to all the action, runs frequentlyThe room was actually a 2 bedroom (student residence) apartment with a kitchen with no utensils of any kind ( Wise to get some plastic knives forks and spoons ) but if you're a pair of girls or guys save big by sharing with your own bedroom w/desk phone plenty of storage and a nice widescreenlearn how to use the A/C it's a bit confusinggood for families on a budget.Clean as a whistle and great views from my 9th floor apt I highly recommend this place",
      "rate": 4.0,
      "tripDate": " July 2018"
    },
    {
      "title": "Brilliant",
      "text": "Great place to stay & very affordable.....beds aren't x-large doubles though...they are a standard size double, staff very helpful, it's got air-con, very clean, go to distillery district only 5 minutes walk",
      "rate": 5.0,
      "tripDate": " July 2018"
    }
  ]
}