{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Residence & Conference Centre - Toronto",
    "url": "/Hotel_Review-g155019-d644535-Reviews-Residence_Conference_Centre_Toronto-Toronto_Ontario.html",
    "priceRange": "$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.0",
      "reviewCount": 53
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "Seneca Residence/Conf Centre 1760 Finch Ave E (Located inside Seneca College Newnham Campus)",
      "addressLocality": "Toronto",
      "postalCode": "M2J 5G3",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0d/d6/3b/12/two-bedroom-suite-private.jpg?w=500&h=-1&s=1"
  },
  "description": "Residence & Conference Centre - Toronto is a short term and extended stay hotel alternative, located on the Seneca College Newnham Campus. All units offer 2 separate bedrooms a kitchenette and private bathroom. Our modern facilities host students throughout the academic year (September - April) and are made available to the general public as an affordable, alternative accommodation provider during the summer months (May -August). Conveniently located 20 minutes from Downtown Toronto with easy access to both Hwy # 401 and Hwy # 404. Attractions nearby include the Ontario Science Centre and Fairview Mall. Making your way around the city is a breeze – we are located on a main bus route and a short distance to the Finch subway station. As an extended stay hotel alternative with affordable rates and amenities, we are ideal for those planning a longer trip to Toronto, coming with a group (religious group, school group, sports team, etc.), or planning a business meeting.",
  "featues": [
    "Electric vehicle charging station",
    "Free High Speed Internet (WiFi)",
    "Fitness Center with Gym / Workout Room",
    "Bar / lounge",
    "Game room",
    "Billiards",
    "Conference facilities",
    "Banquet room",
    "Paid public parking on-site",
    "Parking",
    "Wifi",
    "Coffee shop",
    "Restaurant",
    "Breakfast available",
    "Complimentary Instant Coffee",
    "Complimentary tea",
    "Meeting rooms",
    "Convenience store",
    "Non-smoking hotel",
    "Shared kitchen",
    "Shared lounge / TV area",
    "ATM on site",
    "24-hour check-in",
    "24-hour front desk",
    "Laundry service",
    "Self-serve laundry",
    "Blackout curtains",
    "Air conditioning",
    "Housekeeping",
    "Kitchenette",
    "Microwave",
    "Refrigerator",
    "Cable / satellite TV",
    "Complimentary toiletries",
    "Non-smoking rooms",
    "Suites",
    "Family rooms"
  ],
  "reviews": [
    {
      "title": "Not worth the money",
      "text": "Stayed at the Residence and Conference Centre in Toronto for a week while on a business trip in Toronto. The check in agents weren't friendly at all and everything seemed a hastle. The hallways leading to the rooms smelled of urine and the carpets were extremely stained. The rooms weren't bad except for the fact that there was a hole in our wall and no coffee maker. The beds were extremely hard and the pillows way too flimsy. The continental breakfast consisted of Bagels, Bread, Cereal, Fruit Juice, Coffee and Fruit. Compared to other Continental Breakfasts I've had this one was terrible. Would not recommend this hotel to anyone, I understand it is a college residence, but if the building is in this state, why even allow non-students to stay here? Drive five minutes further down the 404 and get off at Steeles Avenue, there's a Holiday Inn.",
      "rate": 2.0,
      "tripDate": " August 2007"
    },
    {
      "title": "Nice size fridge/ freezer",
      "text": "We were looking for a place in this area that had a freezer (as we wanted to freeze a bunch of stuff to take back to the US). This \"hotel\" had a full size fridge/ freezer, and the rate was incredibly good.Pros:Cheap: incredible rateBig (2 rooms + kitchenette and small living room)Fast free wifiQuietBeds fairly comfortableCons:Not walkable (you need car)... It's pretty far from the entrance to the Seneca college. And there's no restaurants within walking distance. There is bus service thoughTowels are tiny and definitely old/ wornBeds on small sideScratches/ scuffs on wallParking is not free (but only $5)... You do need to get it validated at the front desk each timeIt seems more like a long time housing for the students. Quite a few students staying there",
      "rate": 3.0,
      "tripDate": " July 2017"
    },
    {
      "title": "Great Rates - Apartment-style Suites",
      "text": "Stayed at the Seneca College Residence with the family recently.  It was clean, comfortabe and the rooms were like mini-apartments.  The location was very convenient to a main highway (404) and there was easy access to other main roads (Hwy 401, Finch Ave, etc.).  The campus was very quiet and we felt very safe there.  The rooms were a bit spartan in decor (no alarm clocks or coffe makers) but they did have a very nice continental breakfast and a convenience store!  The kids loved that in the evening.  They even had free games available like foosball and ping pong.Overall, a nice stay, pleasant staff, with a convenient location for us (20 minutes to downtown, 20 minutes to airport, 20 minutes to Newmarket), and a GREAT price.",
      "rate": 4.0,
      "tripDate": " May 2007"
    },
    {
      "title": "complete crap",
      "text": "4th yr ive been living here and only reason is how close it is to my school.i am DISGUSTED with the cleaning service and how this building treats its guests. they are TERRIBLE and do not care about the people occupying the rooms. they just want money from you and NO it is not cheap, you can find many other places to stay that are way cheaper and dont make you feel like youre living in hell.you try to talk to someone and they BLOW YOU OFF. ive tried numerous times. all this place cares about is stealing money because no ones here long enough to complain about the conditions so they just stay like that b/c people will keep coming back no matter what because its a residence. trust me, you really dont want to get service from these people who know absolutely nothing about proper service. i think most of them just WANT to do their jobs terribly b/c theyre so uptight about having to work in a residence and watch all these other people who are half their age and are going to do things in their life that they will never even come close to doing. stuck-up because we're smarter and are going to go further.terrible way to look at things. this place sucks and i cant wait to leave this hell hole. worst part about college guaranteed. STAY AWAY FROM THIS PLACE! i beg you.BTW expect cleaning ladies to literally barge into your room whenever the f they want and leave the place worse than when they came in. & they all have attitudes.the picture is immediately after the cleaning lady left i cleaned the floor again with some wipes and that was the result. ALSO before i could do this the floor was literally covered in water it was like we had a flood. so it was just a bunch of dirty water that they threw on the floor to let dry. i found that out after i swiped my finger on the floor (just one spot, first spot i tried). ALSO the toilet was covered in this same water. the same dirty water that was all over the floor is now all over the seat where i place my bare bottom. thank you soooooo much you pricks.another tip to remember- these cleaning ladies are super stubborn. ive gotten in arguments where ive been literally yelling at them while showing them how they should properly do their jobs. of course i always still got the same result.the service here has made my cry its so upsetting. granted, i have been trapped here for the past four years.. stay away",
      "rate": 1.0,
      "tripDate": " March 2013"
    },
    {
      "title": "WORST PLACE FOR STUDENTS",
      "text": "I am an international student who has been living here for 3 semesters. I would not advise any students to live here. It is like a prison with the amount of rules they have here. Please read my story. Students pay $700+ a month, plus an extra $300 in between semesters. The residence staff is horrible. 70% of them are rude and do not know much about how to handle a student residence. All they care about is money. If you forget your room key in your room, you have to buy a new one. That's how most things go around here. At the start of the current semester, I volunteered to help move the new students into the building. Other volunteers and I successfully helped move in new students. All the other building staff did was push us around like slaves that day to do their work for them. They did not even let us take a break to get a small snack. I honestly can't believe the way they treated both my room mate and I today after we had even volunteered that day and after how polite we have been to them despite their ridiculous prices and rude staff.My room mate borrowed my portable speaker and was using it at noon while having a shower today. The residence staff came to my room saying it was too loud and confiscated my speaker saying we could never use it in this building again and that we have to keep it elsewhere. This is a small portable speaker we take everywhere. It cost $60 and probably weighs around 3 pounds. Volume wasn't even half full. Also take into account that this was on a Monday at noon in the middle of the day! It clearly states in part 10 of the noise and quiet hour rules of this building that quiet hours are in the night from 11pm - 8am. It also states \"The following items are prohibited: large musical instruments (i.e. drum sets), surround sound systems or noise producing devices such as subwoofers and PA systems\". I don't understand how a 3 pound portable speaker fits into that category.This building has had multiple issues to start with like power outages where they don't fix anything fast and none of the elevators work for people. When students have to go in and out for classes from the 15th floor and take the staircase because there is no elevator acces. There are multiple times when there is no hot water or even running water at times. It's horrible. All of this with them building a new campus building next door. So much construction going on around and a lot of dust. Take into account that they were supposed to finish this project earlier this year and it's still not done yet. This clearly means they are low on funds. They aren't putting any funds into this residence building. Where is all the student money from payments going? They can't even afford to give the rooms enough sound proofing for a small portable speaker. Nobody should have to deal with this after a long week of class on their day off with their friends while still following the rules of the building, There are much better options around the area for housing for much cheaper. Where you won't have to deal with these kind of people. Trust me, these are the worst kind of people and the worst kind of rules that don't have to be dealt with. This is just an advertising scheme that's run to make money. Please trust me and look for other off campus housing as this is the worst. I have been to the residence at Seneca King campus and it is a lot better than this one. I will deal with this nuisance for another month until the end of this semester and then will be moving out of here and never coming back! I don't even think it's worth the stay for the shuttle bus transport between campuses. Everything is just so bad. I want everyone to know how bad the staff is here before I leave. I 100% would not want anyone elses day to get ruined like this. Please find somewhere else to live for your sake!",
      "rate": 1.0,
      "tripDate": " November 2018"
    },
    {
      "title": "would you like to deal with a staff member pounding at your door demanding for payments?!?",
      "text": "I unfortunately stayed here, with my husband and 2 young children (4 year old, and 2 month old).  I am absolutely disgusted as to how the admin treat not only the guests living here but the students there as well. Upon our check in, we were present when one of the \"accounts manager\" started yelling and acting obscene towards a few international students. It was quite obvious right from the get go that our stay would be interesting.On our third day, the same \"accounts manager\" started pounding at our door demanding a payment.( First of all, we paid in full the first 15 days!)  He not only scared my 2 girls, but he did not have the decency to apologize for his behavior when I had confronted him! Instead told me to show him some \"respect\". We had an absolutely terrible experience and I most definitely would not want anyone to have the unfortunate experience that we encountered.",
      "rate": 1.0,
      "tripDate": " May 2010"
    },
    {
      "title": "Incompetent staff and terrible customer service",
      "text": "The faucet and showerhead in the room's washroom were not working properly. My request for a new room was denied. I was given the option of a temporary room switch which is an absolute inconvenience. All rooms have the same layout and offer the same amenities. Where is the logic in denying my request for a new room when the option offered to me was for a temporary room switch? Absolutely terrible service!!!",
      "rate": 1.0,
      "tripDate": " May 2017"
    },
    {
      "title": "Great find, excellent location, exceeded our expectations",
      "text": "Last minute find for a night stay. Didn't know what to expect, but what a great find! From front desk staff to a fresh smelling and spacious room, 2 bedroom with double beds, a kitchenette with fridge and microwave. However, one should be aware that cutleries or any kitchen pots/pans and utensils are non existence. However, I am always equipped with disposable plates, cups and cutleries when taking a road trip. Fresh bed linens, And towels, though it's not the 5 star hotel quality one would expect. But...even though I am very particular with linens and towels, I didn't mind it. As long as it's washed and cleaned. The suite is spacious and CLEAN compare to even a more upscale motels/hotels we have stayed in, seriously! Why pay more for unsatisfying branded motel/hotel  if you will still complain about something? I assume this caters to Seneca college students or other conference guests, and probably open to public during off school months or low school season, there is no shortage of places to get food - M&M shop, Subway, Tim Hortons in the building,  Starbucks and other food stall in the school campus. In addition, a few minutes drive takes you to the nearby Fairview mall. Convenient location, lots of restaurants nearby, mall, coffee shops. I was really surprised of is find. My husband and I have been driving for years back and forth to Chicago and always made it a point to stay overnight around Mississauga/Toronto on our way back to,Ottawa. I have never stumble on this accommodation. I would have preferred to stay in this kind of accommodation. I sure will look for a similar accommodation in our next road trip. What a pleasant night!",
      "rate": 5.0,
      "tripDate": " August 2017"
    },
    {
      "title": "Best In Cheap ",
      "text": "I was there with family of 3 for 3 nights. Room was nice and quit. Got nice view of highway. Everthing was parfect, we checked in at 3:00am and welcomed by 2 nice reception. Not so far from the center, specially we had event at Danforth Avenue. We liked the place exxept one thing 'Pillow'! Wasn't that much good pillow we had for night. No Breakfast in the morning but would be great if included! Best place to live with family or solo for it's price. Will visiting next month again.",
      "rate": 4.0,
      "tripDate": " May 2017"
    },
    {
      "title": "Average Stay At Seneca Residences",
      "text": "We arrived with a 2 Bus load tour group. Tour operator booked these rooms after our original Hotel in Niagara Falls cancelled all of our rooms with only a few days prior to arrival due to water damage so they stated. Limited vacancy in mid simmer last minute to accommodate 2 busloads of families at any other hotel so this is what they found. Location is not the best as it is out of the way from any attractions but it actually worked out to be centrally located for the attractions that we had arranged for us to attend. Rooms are not fancy and beds are on the small side but the room did the trick as a place to sleep after a busy day. There is a light continental breakfast in the morning at the kitchen area on main floor. Each room that I seen had a washroom, 2 bedrooms with T.V's and Double beds, a small kitchenette with microwave and fridge. Transit Bus access a few yards away as well as Subway access a short Bus rideor good walk away. Not sure what the operator paid as far as rates but there were many other families utilizing the Dorms for their summer stays. Housekeeping does not go into rooms every day for a typical hotel clean as you would expect.",
      "rate": 3.0,
      "tripDate": " August 2016"
    },
    {
      "title": "College residences provide a nice place to stay",
      "text": "Forget all that “Residence & Conference Centre” stuff, because they call this place “The George” because it’s part of George Brown College. These are unused college dormitory rooms they rent out to travelers.  The rooms are small and sparse,  but they’re clean and the high rise they’re in affords a nice view of Toronto from the edge of the downtown area. With three people in our party, we got a suite on the ninth floor with two adjoining rooms which shared a common area with a restroom and a kitchen that included a fridge, microwave, and table. There’s a few quirky things to deal with, such as you have to insert a room key into a slot in the wall in order to operate the room lights! My only regret was that we didn’t reserve this place for both nights we were in Toronto, instead of just the first. We stayed our second night in a place we didn’t like nearly as well. From the hotel, it’s about a 1.6 mile walk down Front Street to the CN Tower, and along the way, you’ll pass the St. Lawrence Market, the dog fountain in Berczy Park, and Union Station. It really is a nice location. Parking is in a lot beneath the building and the cost is $2 per hour or $15 max per day, which is better than you’ll find in the downtown lots. We would definitely do this again if we had the chance.",
      "rate": 4.0,
      "tripDate": " August 2017"
    },
    {
      "title": "Downtown Toronto wedding",
      "text": "Where do I begin.  My husband and I travel frequently.  This was , without a doubt, the most disgusting place I have ever been to.  The rooms are college dorms.  There were more stains on the rugs and floors than you could imagine. The doors to the cabinets were rolling off.  We left right away.  I would prefer to sleep in my car that to stay in this filthy place.  Run do not walk!The charge for the room was  $106.00.  We went to the Hilton for fifty dollars more.  You do not want to stay here!!!",
      "rate": 1.0,
      "tripDate": " July 2017"
    },
    {
      "title": "Nice place ",
      "text": "The room and bathroom were clean. They could do with a bit of a paint job in and out of the room,  but nothing too bad. Lots of construction happening around it but never heard any of it during the night we were there. Might be possible to walk to the subway or bus but didn't. Instead we drove and parked by finch station (20 cad). So you may want to look into that before you go.",
      "rate": 4.0,
      "tripDate": " July 2017"
    },
    {
      "title": "Awful filthy place a long way outside Toronto",
      "text": "The wifi was fast and reliable.  Otherwise this place was terrible.  Small beds and filthy rooms.  Room was filthy when we moved in and not cleaned in 3 days.  Stains on the walls and sticky floors.  Small towel to be used for the 3 days.  It is a $15 cab ride to the last subway stop.  This means you a long long way from Toronto.  There is a bus to the metro albeit much better service Monday-Friday than on weekends.  The Toronto subway is excellent.      It is staffed by students who don't know or care.  It is mainly used for cheap conferences and is accessible by car.  The Canadian army were there when we were there and brought their own catering.",
      "rate": 1.0,
      "tripDate": " August 2016"
    },
    {
      "title": "Leaving the dream",
      "text": "No towels. No ice machine. No where to sit outside. Big nasty stain that looks like puke on the floor. and also no pool or even access to a pool next door... oh ya. pay for parking daily while, we are paying daily to stay... but the beers where good",
      "rate": 1.0,
      "tripDate": " July 2016"
    },
    {
      "title": "Two rooms for the price of one",
      "text": "This was a great place to stay, had no high expectations, but it did exceed any expectations, beds were comfy, internet was great, more than enough toiletries.I enjoyed the staff, everyone was pretty much helpful and polite. Will definitely be coming back next year. Although I was charged twice at the end of my stay (was told by an employee at the front desk, and this was fixed instantly), and the microwave wasn't cleaned out before arrival (This is the reason for 4 points on cleanliness), everything else was spotless. I still want to come back to this establishment.PS*** Not sure if this was a random event going on, but there was a lot of teens on our floor and had them hanging out in the hallways and playing around, but they weren't disruptive during the night, I was not bothered at all by this therefore it will not add any negative points to my score.",
      "rate": 5.0,
      "tripDate": " June 2016"
    },
    {
      "title": "Excellent stay for families",
      "text": "We are 3 families staying at this place. We hired 3 rooms and having a great stay here right now. We will stay until next few days. Before this, we were staying in a hotel which was expensive and had other relevant expenses as well like dinning out, conveyance etc. However, with lots of facilities available within this apartment, we are having lots of ease and convenience. There are few utensils, microwave, fridge, electric equipment like iron, cooking equipment in the room which is a great facility. We can easily cook food inside and have a flavor of home cooked food which not only tasty but also cost saving as well. There is a bus stop just 3-5 min walk to connect to any part of Toronto which is also a great facility. So overall we all 3 families are enjoying this stay. The staff is extra cooperative and responsive as well.",
      "rate": 5.0,
      "tripDate": " June 2016"
    },
    {
      "title": "Wonderful and clean",
      "text": "This was a nice find in Toronto, next to Seneca College.  Well positioned near several restaurants and clean.  Great value for money with a good breakfast option.  Overall, would give this place two thumbs up!",
      "rate": 5.0,
      "tripDate": " August 2015"
    },
    {
      "title": "Good value for what you get",
      "text": "My son and i stayed here for 1 night before meeting his camp bus in markham. the rooms were clean, the bathroom was clean free wifi, and the bedding was comfortable and had fresh towels.If you are taking a city bus around that area on sunday beware as it doesn't start till 8.45 am. the was the only bad thing. There is a double bed in each room the rooms are quite spacious.The view from our room was good it has a little convenience store and subway, the crappy thing is the subway closes early sat night was not happy about.",
      "rate": 5.0,
      "tripDate": " August 2015"
    },
    {
      "title": "Great stay for our Team",
      "text": "If you are looking for a place to stay in the center of the GTA I would highly recommend this residence for club teams or family stays.. Conveniently located off HWY 404 North. Clean and friendly staff made the stay very enjoyable.",
      "rate": 5.0,
      "tripDate": " June 2015"
    },
    {
      "title": "Love the little kitchen and with fridge...",
      "text": "Room is great but one bed is full of hair,but they came and clean right away. washroom  a bit dusty. love the kitchen clean; nice and great with the family and students. .Parking is reasonable. Less than 1 hour before the breakfast kitchen close but mostly the breads are gone and creamier for the coffee is gone and have no choice,  we have to eat cereal. ...",
      "rate": 3.0,
      "tripDate": " September 2016"
    },
    {
      "title": "Is this an accommodation provider or a detention centre?",
      "text": "Firstly. The condition of the rooms leaves a lot to be desired. The cleaning staff do a horrible job and will actually take your own cleaning supplies when they leave. Omg.  The plugs only half work and the circuit breakers often trip which is a huge fire and safety hazard. As for visitors visiting students they make them sign in and wear an ID badge like they're in a restricted access area at an airport.The staff are rude and unhelpful and security guard (especially the touque wearing goatee guy Patrick) staff berate you and are incredibly rude. AVOID",
      "rate": 1.0,
      "tripDate": " April 2016"
    },
    {
      "title": "What you pay what you get!",
      "text": "Fair value of the accommodation for what we have paid. The front desk staffs are very friendly. The Lobby and room are all clean and tidy. However the room  service is not so good as the towers on the floor are not replaced and the bed is not made up during our 2-night stay. The breakfast is just so-so with long line to get pieces of bread and bagels.",
      "rate": 3.0,
      "tripDate": " August 2015"
    },
    {
      "title": "Exceptional value for money. Extraordinary complimentary hot buffet breakfast",
      "text": "Check in was super fast and efficient. To be perfect? The room could have had a TV. It was very spacious, incredible views, excellent air conditioning. Elevators were spacious and fast. Everything was clean. There was no daily maid service. Views were great. There was a common lounge at the top which offered free Wi-Fi and panoramic views of the City. I used my cell phone as a hot spot for Wi-Fi so no issues.Breakfast was something else beyond my expectations. Loads of fresh fruits, must have had 6 different types, milks, lactose free drinks, various types of milk, honey, jams, many types of bread and muffins and croissants and Danishes. Boiled eggs, beef and poultry sausages, bacon, potato dishes, hot oatmeal cereal. Other than offering smoked salmon I can't think of what else they could have offered for breakfast.I would never have thought of staying at a student residence type facility had not the downtown core been blocked with PRIDE and hotel rooms running almost $500 a night.This had been a hotel converted to a student residence and rented during the summer to both students and non students.The hotel had a Laundromat and fitness center.  The supper meal at $14.99 +/- including taxes was borderline fine dining.The bathroom was spacious and the water boiling hot. The few negatives?Not many electrical outlets, so bring an extension cord with sundry to take care of cell phone, computer, camera, whatever.Nightlights were weak but the room faces south so there was ample lighting. Blackout drapes when needed for a quick nap.An information desk would have been great. They have security guards. These positions should be replaced with an information desk and information officers. Two jobs taken care of at the same cost!!!!!!!!!!Some of the guests took advantage and I noticed people filling purses and nap snacks with enough food for a small family.",
      "rate": 5.0,
      "tripDate": " June 2015"
    },
    {
      "title": "Great Value",
      "text": "for the price you cannot beat this place. The rooms are basic but very clean and the linen is changed every 3/4 days. The bins etc. are emptied daily.Bus stops are close by and there are shops, Supermarket and Banks  and places to eat a couple of minutes walk away.location wise you are around a 20 minute drive to the City Centre.Our only moan is why do they not supply a kettle or mugs in the kitchenette we bought some and left hopefully for the next guests to enjoy.Breakfast is an all you can eat buffet style and there is always the subway on site.the laundry was useful and very cheap to use.at around £40 a night for two of us this takes some beating.",
      "rate": 4.0,
      "tripDate": " August 2014"
    },
    {
      "title": "Best value during the summer",
      "text": "At just over $60/night for a dorm suite with two bedrooms and kitchenette, you won't find a better deal in Toronto during the summer. Cleaner than many hotels I have stayed in.  The complementary cold breakfast is meager but there is a Subway right there for something more.  Located a couple km off the 401 and just off the 404 it is easy to find and is close to many attractions in east and Toronto.  Staff were friendly.  Anytime I need to be in Toronto during the summer I will be staying here.",
      "rate": 4.0,
      "tripDate": " August 2014"
    },
    {
      "title": "This is not a hotel",
      "text": "Gross! No AC, no TV, and no internet. This building is for the college residences, and should not be offering accommodations to the general public. Blood on the wall in one room and blood on the sheets. So bad I had to leave and booked another hotel.",
      "rate": 1.0,
      "tripDate": " May 2014"
    },
    {
      "title": "Dirty and Disturbing",
      "text": "This is a terrible place to stay. The rooms are dirty, the hallways smell, the staff are all extremely rude and the security is a joke. This is a student residence, first and foremost, which means that it is loud and I couldn't get a good night's sleep even with ear plugs in. The convenience of the highway is not worth half of what you would pay to stay here.",
      "rate": 1.0,
      "tripDate": " January 2013"
    },
    {
      "title": "Better than expected",
      "text": "The suites have been recently renovated to our surprises. I have been at Seneca College Newnham campus many times in the past 15 years while visiting Toronto during the summers. The beds were all right not the most comfortable, linens were cleaned but not hotel quality, loved the full sized fridge, overall it was a decent cleaned place for $100/ night before HST. Parking was $5/day and your parking stub needs to be validated everytime you leave the parking lot.  There is complimentary coffee, tea and fresh whole fruits (oranges & red delicious apples). I ordered some tickets online on my Tablet and needed a printer to print them out. The front staff printed them for me right away. We were a family of four stayed for 3 nights in August 2018. The suites do not supply an iron nor hair blow dryer. The location is very convenient located right by the 404. One day, we drove to Fairview mall (one highway exist) and took the subway downtown (arrived in 45 mins to Union station).  I highly recommend staying at Newnham Campus.",
      "rate": 4.0,
      "tripDate": " August 2018"
    },
    {
      "title": "Great",
      "text": "I stayed here as part of our annual Grade 8 Trip to Toronto (I am a teacher).The rooms were clean, the staff are friendly. The cost for school groups is very reasonable. It is close to Wonderland and to different restaurants.",
      "rate": 5.0,
      "tripDate": " June 2018"
    },
    {
      "title": "Huge Room for Cheap",
      "text": "This place is great. For less than the cost of a hotel room you get two bedrooms and a kitchen. Couldn't ask for more space. The room has a full sized fridge and a kitchen table, which is cool. Rooms are very clean and comfortable. Don't be afraid to book here, it is very nice.",
      "rate": 5.0,
      "tripDate": " August 2014"
    },
    {
      "title": "Good, but could be cleaner",
      "text": "The facility is good but could be cleaner.The hallway floor is littered with small garbage, (things like gum wrappers and small pieces of paper) that have been there for at least the 2 days I've been here.There are small bits of dirt and garbage on the floor of the bedrooms too. I don't think the area around the door stop to my bedroom has been vacuumed in a while, No one bothered to pull the hose off the vacuum to get close to the stop and dust can be seen all around it. See the pic.The first thing I found when I pulled back the sheets to go to bed was a long (3-4 inches) dark hair. (My hair is short and red)There is one garbage can in the bathroom, no garbage cans in the bedrooms or kitchen, no blue box at all.Sheets were pretty well just laid on the bed, barely tucked in.No toilet paper holder in the bathroom, the roll just sits on the counterOn the plus side, the bed is comfy. Air conditioning works well. Breakfast is included. Elevator is quick. Grounds are nice.",
      "rate": 3.0,
      "tripDate": " July 2015"
    },
    {
      "title": "Disgusting",
      "text": "This is one of the worst places you could possibly stay with regard to a student residence. I would avoid this at all possible cost's. It is worth your time, effort and energy to find someplace nearby to stay. Rooms are old and disgusting, as the mattress is beyond soft and filled with many unknown stains. The carpeting is also stained and should have been replaced years ago. The provided chairs are torn with the padding coming out, and there is an inadequate amount of room lighting. Furthermore, you cannot lock individual rooms and you are susceptible to your drunken roommates buddies walking in while you are trying to sleep. Furthermore, none of the staff have any comprehension of customer service. For instance, most of the front desk staff are rude and not happy when come to get your key card reactivated as it will stop working on a weekly basis. The residence staff also have no ability to communicate efficiently or effectively.  As an example, they will prevent you from entering the residence without any reason. In one particular instance, they will stand at the doors and will aggressively prevent you from entering without any explanation or reason. I should not have to ask for information as to why! (This circumstance related to one of the many false fire alarms. These will often leave you sleepless on many nights) Also, I was never provided a working key for my mail box in which I could not pick up my mail until two months into my program. Additionally, when picking up larger parcels at the desk, a regular desk staff member would continually not look for the package and claimed  that it had not arrived. It was not until I had to show my delivery notification she would actually look for the package and find it. Would it be too much to ask to have staff take a half day course on customer service!? With regard to communication the residence is also terrible. The move in was not organized especially, when enter from the wrong entrance. Not only do staff not show you the location of your room, nor do the go through your room with regard to the damage and condition documentation. Also, the number of room provided was not in location you would expect and you are left confused and wondering why you cannot find it. It is as though they messed up the sequential numbering of the rooms. Also, the documentation leaves only a few lines with regard to room condition. I could have exceeded this amount greatly had the space been available. Furthermore, you have no idea whether you have a room until about two weeks before the semester starts. Additionally, customer service is a real hit and miss in the convenience store. For instance, one individual refuses to make eye contact with customers and will ring your transaction through without any word of acknowledgement. Even thanking him for processing my transaction yields no response. Although, I do appreciate the fact prices for some merchandise is not significantly higher than what you would find located at the nearby no frills.  Roommates also appear too be randomly selected with no consideration to the required roommate selection forum. A person would think, that you would be paired with someone who does not drink or smoke, especially, if you have selected these options.  While, I cannot comment to much on the cafeteria food it is crazy expensive and has no taste. Considering, the cost of a meal I would expect to actually be eating with proper cutlery and real plates. If you choose not to endure the cafeteria food you are not left with many options to eat as you not allowed hotplates in your room. Basically, you are stuck heating all you food in the rusted out microwave provided. The only good thing about the residence is that it's close to campus and I have not had to deal with any pest issues. Overall, if the residence worked on it's customer service abilities and communication skills, it would not be a terrible place to stay. However, the fact they provide less than 24 hours after your last exam is inexcusable.",
      "rate": 1.0,
      "tripDate": " March 2015"
    },
    {
      "title": "Budget Hotel with great transport links",
      "text": "This Hotel would not suit everyone as it is 'beyond budget' but it met our needs very well.  Check in staff were very friendly and helpful and parking is only $5 per day which is unheard of in Toronto.  The rooms are student rooms in term time and very sparse but we did have free wifi, air con and a TV.  There is also a small kitchen area with a fridge.  The whole place was spotlessly clean and we were given a steady supply of towels.  Bins were emptied and towels changed daily.  The Hotel is just off the 404 giving good driving links but it's absolute selling point is it's proximity to transport links into Toronto.  Right at the gate it is possible to buy a $3 ticket on the bus to Finch Subway station where you can use the same ticket to board the subway right into the heart of the city.  The whole journey takes approx 40 minutes and is much less stressful than trying to drive in the gridlocked city centre.  There is a free continental breakfast as good as any you would get in any budget hotel and a Subway sandwich bar in the building open until late at night.  We would definitely stay here again and felt the price was reasonable for what we got.",
      "rate": 4.0,
      "tripDate": " June 2014"
    },
    {
      "title": "Good place to stay for the price. ",
      "text": "I went here for a conference during the summer and stayed with a friend. The room has two bedrooms, which was great.  There is also a bathroom and small kitchen. It worked good for us.  I liked that there is a subway and convenience store on the main floor. Overall I would definitely recommend this place to stay!  The only issue I had was that my key card stopped working three different times during my stay.  It was fixed each time after I went to the main desk.",
      "rate": 4.0,
      "tripDate": " June 2019"
    },
    {
      "title": "Good place to stay if you don’t mind the noise",
      "text": "Stayed there for 5 nights with my brother & his girlfriend.The room has 2 bedrooms. Each bedroom has a double bed, desk, small tv. Common area is the bathroom, kitchen (no stove, just microwave & a standard fridge) & dining area with 2 chairs.The room was sufficient for our needs. There is a Subway restaurant on the main floor & a mini convenient store.Parking is nearby & cost 5$/day which you may leave as many time you want in a day (you just need to validate the parking stub at the front desk before heading to your vehicle).I went there at the end of June 2018. Place was a bit noisy as there was a soccer group (kids) but that didn’t bothered us. AC worked just fine. Maybe not cool enough as it was very hot during our stay.I picked this place due to its low rate compared to other hotels & wasn’t too fussy about the service.",
      "rate": 4.0,
      "tripDate": " June 2018"
    },
    {
      "title": "Noisy room. Filthy linen",
      "text": "Stayed there for 1 week in June. The blacks were place in rooms with the worst view. Where there was construction. The whites were given the best rooms with best views. The linen smell awful as it was not washed properly. There air condition was off most times. Horrible customer service!!",
      "rate": 1.0,
      "tripDate": " June 2017"
    },
    {
      "title": "Awesome room for the price",
      "text": "Had issues with checking in, but Vanessa handled it like a champ. The parking kinda stinks because it is quite a hike and it's paid parking, but you can get validated and pay a small fee upfront. The beds were ok, bathroom was clean, as was the kitchen area. TV's were small but we really were not in the room that much. But to be honest this was an excellent deal for a 2 room suite. Only offered during the summer while the students are mostly gone. There is a Tim's & Subway on site. Had issues with our room keys but I think they were getting demagnetized in my phone wallet.All in all great price for a simple 2 room suite",
      "rate": 4.0,
      "tripDate": " June 2017"
    },
    {
      "title": "Comfortably priced & located",
      "text": "we spent 2 nights at \"the George\" to accommodate college tours of U of T and York University and to sightsee in downtown Toronto. Can be difficult to get through to main lobby but staff was courteous & very helpful. They respond to emails promptly. We stayed in double room - modern / college dorm aesthetic but comfortable with kitchenette. Refrigerator had food from previous tenant & microwave was dirty but rest of the place was clean. Hotel is in a perfect location with accesible paid parking (not owned by hotel so make sure you pay in timely manner as penalty fees are outrageous!); New 514 streetcar has a stop within walking distance (less than a block on corner of Cherry St. & Front St.) that takes you directly downtown. Keep in mind it doesn't run late.",
      "rate": 4.0,
      "tripDate": " June 2017"
    },
    {
      "title": "Does the job but please ... Turn on the A/C !",
      "text": "If you are looking for basic accomodation whitin Toronto, it's good choice, suite with 2 double beds, each one with a TV with a lot of tv channel choice, Wifi Is fast, bed are not that confortable. A fridge, microwave and a small bathroom with shower is includedHowever, what not included in may is the A/C, had a couple hot days during my stay and the building had becore very hot and no way to make to room cooler. They only turn ON the A/C at the end of the month. Turn it on sooner !",
      "rate": 3.0,
      "tripDate": " May 2017"
    }
  ]
}