{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Revery Toronto Downtown, Curio Collection by Hilton",
    "url": "/Hotel_Review-g155019-d1176198-Reviews-Revery_Toronto_Downtown_Curio_Collection_by_Hilton-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.0",
      "reviewCount": 4
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "92 Peter Street",
      "addressLocality": "Toronto",
      "postalCode": "M5V 2G5",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2c/7d/2e/0e/standard-king.jpg?w=500&h=-1&s=1"
  },
  "description": "The Revery Toronto Downtown hotel is the ideal launching point for experiencing the best Toronto, Ontario has to offer - whether traveling on business or pleasure. Located in Toronto's Vibrant Entertainment District, the Revery Toronto Downtown, Curio Collection by Hilton hotel is only steps away from the Business, Financial and Shopping Districts and is surrounded by Toronto, Ontario's top venues, theatres, restaurants and attractions, including the CN Tower, the Rogers Centre, Air Canada Centre, Metro Toronto Convention Centre and Chinatown to name a few.",
  "featues": [
    "Valet parking",
    "Free High Speed Internet (WiFi)",
    "Fitness Center with Gym / Workout Room",
    "Bar / lounge",
    "Evening entertainment",
    "Nightclub / DJ",
    "Business Center with Internet Access",
    "Conference facilities",
    "Paid private parking on-site",
    "Wifi",
    "Paid internet",
    "Restaurant",
    "Breakfast available",
    "Banquet room",
    "Meeting rooms",
    "Baggage storage",
    "Concierge",
    "Non-smoking hotel",
    "Shops",
    "ATM on site",
    "24-hour front desk",
    "Express check-in / check-out",
    "Dry cleaning",
    "Laundry service",
    "Air conditioning",
    "Desk",
    "Interconnected rooms available",
    "Room service",
    "Safe",
    "Cable / satellite TV",
    "Flatscreen TV",
    "Bath / shower",
    "Seating area",
    "Telephone",
    "Wake-up service / alarm clock",
    "City view",
    "Non-smoking rooms",
    "Suites"
  ],
  "reviews": [
    {
      "title": "Great Hotel in Toronto",
      "text": "This hotel was perfect! The room was large, very clean and comfortable. Every member of staff we encountered was friendly, helpful and kind. They went above and beyond to make sure we were comfortable. The hotel is also in a great location for walking to many activities and restaurants. We would definitely stay at this hotel again with or without kids.",
      "rate": 5.0,
      "tripDate": " June 2024"
    },
    {
      "title": "Excellent hotel and stay",
      "text": "Currently writing this on the second night of our stay (couple and two young kids). This hotel is frankly wonderful. The staff are kind, friendly, and helpful. The hotel itself is recently refurbished and looks beautiful. The rooms are spotless, large (for a city), and well designed with nice touches all around. The beds are very comfortable . Housekeeping is excellent. Overall, I could not say anything bad about our stay, and I would recommend this place to anyone.",
      "rate": 5.0,
      "tripDate": " June 2024"
    },
    {
      "title": "Beautiful new boutique hotel in Toronto Downtown",
      "text": "Very good location, I was able to explore downtown very well on foot. It was ideal for my business trip, a morning walk (a leisurely 20-30 minutes) and I was at the Enercare Center.The hotel is fairly new and it is very well opened and the rooms are also very nicely furnished, I slept very well in bed.Staff were friendly and accommodating!The hallway is a bit noisy, you can hear all the activities in the hallway, but after staying 4 nights I got used to it. What bothered me a bit was that the drain was apparently a bit clogged and the water only drained very slowly - a bit disgusting.In the end I would probably check in here again, as the location and price were very fair at the time I was there.",
      "rate": 4.0,
      "tripDate": " May 2024"
    },
    {
      "title": "“NOW OPEN”… but not ready!",
      "text": "Made a last minute reservation for one night as we were going to a show downtown.  Looks like this property used to be a Hilton Garden Inn and has gone though a major revamp and rebranding.  When we arrived at the hotel, there was a large road side “NOW OPEN” sign at the entrance.  At first glance, everything looks pretty cool.  The theatre-vintage vibe of the bar and checkin area was pretty cool.  And the rooms as well are very nicely decorated.  That is where the good ends.  As a Hilton member I took advantage of checking in the day prior via the Hilton app and selecting my room.  I was offered a complimentary status upgrade as well.  So I selected a high floor corner suite.  Upon arriving at the hotel @345pm (checkin time is 3pm)  I noticed I did not yet have my digital room key so went to the checkin desk.  I was informed the room I selected was “not available”??  Unfortunately moving from the 10th floor to the 5th floor seems like a reverse upgrade. But nonetheless it was still an upgrade to a suite.  Upon entering the room, the first thing we noticed was it was warm and muggy.  I went to the thermostat, and the room was at 24.5degC but the thermostat was set for 20.  I made sure the system was set to cool, and then tried to increase the fan speed, but the only would only run on ‘low’, which represented next to no air flow coming out of the HVAC unit vent.  The next thing we noticed was the bathroom door was missing the door handles on both sides.  Overlooked in the reno??The next thing we noticed was the lighting in the room was controlled by an array of bedside buttons.   We were getting ready to leave, so I decided to “shut the lights off”… should be simple right?   Nope.  Using the buttons, the large accent lighted wall unit around the TV/desk/mirror would not shut off. Neither with the button labelled for it nor the “master switch”.  So, I knew there was an employee working in the linen room out in the hall, and I decided to ask for help. A very nice gentlemen tried to assist but could not figure it out either, so he contacted the maintenance team straight away.  Two very nice gentlemen from the maintenance team arrived quite promptly and also could not get them to shut off.  So they had to move the desk and get behind the wall mounted tv to unplug the whole module/unit.  Good job by the working team there to resolve this small but quite annoying issue (I did not want to get back at midnight and try to get to sleep with the lighting stick on in our room!!).  Next up, I needed to use the washroom.  I ended up stubbing my toe on a hunk (approx 1”) of white tile grout (which was hard to see against the white tile) just sitting in the middle of a tile between the toilet and shower.   Took my nail clippers and scraped it off the floor because I really didn’t want to request maintenance to come back. So, away we went to head to our dinner and show.  We stopped in the lobby bar and had a couple of drinks.  Marcus took great care of us and also provided great conversation too! Thank you Marcus.Upon returning from our show quite late, we noticed that the HVAC was continuing to struggle.  It had been running none stop from our 345 arrival too our midnight return and the room had only got from 24.5 to 23 degC.  I decided to take a shower before bed as we were at an outdoor show and it was really hot out.  Within 10 seconds of turning on the shower, the shower stall floor began flooding.  Unfortunately I wasn’t going to call the front desk or maintenance at midnight.  I proceeded with taking my shower and standing in a couple inches of water and soap scum.   I gave my wife a warning that she’d be in for a special surprise in the morning… lol.  Next up… getting a good nights sleep.  I actually slept pretty good… bed and pillows very comfy.  That was until the room phone rang once just after 6am and then stopped.  Pretty tough to fall back asleep at 6am!!!To end this stay off, upon checking my emailed bill, my complimentary food and beverage credit was not applied to my bill either. Upon calling the hotel, I was informed the Hilton food and beverage credit doesn’t apply for drinks at the bar… yet upon checking in, we were encouraged to use our food and beverage credit either for breakfast or at the bar for a drink before our show.All in all, I visit a lot of Hilton hotel properties in my travels… and this property seems to have potential… I just think the opening was rushed, and there were very poor quality checks done on all the rooms before guests started staying in the them.  Sorry Hilton, this property shouldn’t be “Now Open”.",
      "rate": 2.0,
      "tripDate": " June 2024"
    }
  ]
}