{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Royal Oak Inn",
    "url": "/Hotel_Review-g155019-d5281421-Reviews-Royal_Oak_Inn-Toronto_Ontario.html",
    "priceRange": "$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.0",
      "reviewCount": 206
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "376 Dundas St E",
      "addressLocality": "Toronto",
      "postalCode": "M5A 2A5",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/1a/f2/71/08/royal-oak-inn.jpg?w=500&h=-1&s=1"
  },
  "description": "The Royal Oak Inn boasts 25 stylish and modern rooms, nicely decorated in warm tones, laminate floors and equipped with modern amenities. Completely renovated in 2013, all the rooms at The Royal Oak Inn offer access to modern amenities such as flat screen LCD TV, free WIFI Internet access, and many more. The Royal Oak Inn offers guests a complimentary continental breakfast and coffee service, and the convenience of a 24 hour reception area. All 25 guest rooms feature free high speed wireless internet access, cable TV, alarm clock radio and air conditioning.",
  "featues": [
    "Paid private parking on-site",
    "Parking",
    "Free High Speed Internet (WiFi)",
    "Wifi",
    "Free breakfast",
    "Non-smoking hotel",
    "24-hour front desk",
    "Air conditioning",
    "Flatscreen TV",
    "Non-smoking rooms"
  ],
  "reviews": [
    {
      "title": "Disappointing and unfortunate.",
      "text": "It was unfortunate from the moment we walked in.  First was the lack of accessible parking; front desk staff had to move a vehicle to allow us a space.  For the record, for 20+ rooms, there were 3 or 4 spots.  Next was the state of the room, which was neither clean nor remotely resembling the online images.  We went straight downstairs to request an immediate refund, simply that the room was not acceptable, especially at that price point. No problem, and told that reversal of charges would be 24-48 hrs. Almost four days later, still no reversal.  Considering a report to the Better Business Bureau to expedite the reversal of over $250.  Give careful consideration when booking this venue.",
      "rate": 2.0,
      "tripDate": " September 2023"
    },
    {
      "title": "A good stay",
      "text": "The hotel is good for medium class business travellers for short visit very good breakfast the boss good and so the staff my stay was very comfortable.though it was very cold outside and it was my first trip to toronto. very good location with nearby restaurants and shopping centres.",
      "rate": 3.0,
      "tripDate": " March 2019"
    },
    {
      "title": "Hair, mold and mouse",
      "text": "As a 21 years old girl traveling alone, I was not looking for something luxurious. I just wanted something clean. I stayed 3 nights and every day I found black hairs in the sheets (I’m blonde). The first morning, I had the unpleasant surprise to see mold all over the shower curtain. I said nothing, thinking « it’s no big deal » until I discovered there was actually a mouse (or several who knows???) in my bedroom. The receptionist didn’t seemed surprise and only proposed me an another room. So he gave me an upgraded room but still, there were hairs everywhere in both beds.",
      "rate": 2.0,
      "tripDate": " February 2020"
    },
    {
      "title": "False advertising with free breakfast",
      "text": "This hotel advertises breakfast included but there is not. Only coffee available at the front desk. Our room was dirty and there were people smoking in the next room.  Eventually the smell came into our room. I wouldn’t recommend this hotel.",
      "rate": 1.0,
      "tripDate": " June 2023"
    },
    {
      "title": "Small unique boutique hotel",
      "text": "We booked a night at Royal Oak for a concert. Reception was fine .  Called twice to the clarify the parking. The room was small but clean and comfortable. Are these the best hotel rooms? No but they certainly are worth the money.",
      "rate": 4.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Amazing stay don't  believe the other reviews  experience it yourself!",
      "text": "Amazing staff  thought  after  reading  the reviews, but  believe me, what I experienced completely the opposite! I just  checked out  left something in the room. Amazing staff  ashamed and all the staff  very good. I just  got back from Canada to New York.  I  will be back love the staff  very cool peoples all of them!",
      "rate": 5.0,
      "tripDate": " April 2024"
    },
    {
      "title": "Not recommended",
      "text": "Other then the bed being comfortable, it was not the cleanest and it was very noisy the whole night through. Pretty sketchy area. Not comforting for a girl travelling solo. I’m an experienced traveller and not scared easily. This one night stay wasn’t pleasant at all.",
      "rate": 1.0,
      "tripDate": " October 2023"
    },
    {
      "title": "Was incredible value for the money",
      "text": "After reading many reviews of this place, and considering all the pros and cons and price I decided to book this place.  When I arrived, I was really surprised.  Unlike the Google Maps street view the building is freshly painted and remodeled.  It looks clean and modern from the outside.  It has a nice charm on the inside, and is very clean.I am staying for 10 days 8/13-8/23 and today is 8/21.  So far everything has been amazing, and there have been no problems.  The breakfast is satisfactory and pleasant considering the price - coffee, orange juice, cereal, toast, and tea.  There's a vending machine in the breakfast area too, which is just next to the check in counter. The staff here are always asking how is your trip and if there is anything they can do.  I've never stayed anywhere that seemed to be so concerned.  Considering this hotel has only 25 rooms, it feels intimate and cozy.  The WiFi is really good, however if you're in room 101 the WiFi will be spotty unless you have a powerful WiFi antennae.  I got by generally but when I needed it I just sat in the kitchen eating area and used it, where it's crazy fast.  I caught up with my VICE news etc. doing that. The single rooms are pretty small but really big if you're not planning on spending your trip inside a room.  The beds are comfy, the sheets and bed spreads are about as white as white gets ( that's comforting, I remember staying at Circus Circus in Vegas and not really wanting to even touch the sheets ).   The bathroom is small and there is a half sink with a hair dryer.  That's fine with me! It's pretty cute actually.  The shower is stand up and is just big enough to bend over comfortably when soaping your feet and stuff.  The only complaint about that would be to have something to put some soap or your items on there with.  I just used the floor which has been fine ( of the shower ). The windows have dual blackout blinds that are pretty nice.  The first one blocks view and the second blacks out the room for the most part.  This has worked fine when sleeping in as the room stays dark.The room I had and it seems most probably do have this is the heater on the bottom of the room and a nice new AC unit thingy at the top.  It's kinda fun to play with the air direction.. it has a little lip thing that moves around based on what you do with the remote to guide the air.  Haha!  Better than a wall unit AC that sticks out the back of the window.  It looks like mostly / only the first floor has these new ACs ( I can see the other type on the outside of the other floors ). Each floor also seems to have their own WiFi router and access point.  That being said I wouldn't mind staying in the upper floors, elevator or not ( there is none, but really what are you bringing you cannot lug up a flight of stairs? There's rarely elevators in Paris ).  Things around the area.LAUNDRYThere's a laundromat about a 2 minute walk from the door of the hotel, it has Jumbo washing machines for $6.25 CAD a load and normal ones for $3 CAD.  Drying is $0.25 CAD for 4 minutes, so save them quarters haha.  The machines take $0.25, $1.00 and $2.00 CAD coins, nothing else.  The machine will give change but it will take $0.25 CAD per use, which means $1 turns to $0.75 and $2 turns to $1.75 so again save your coins.  To get detergent I suggest when walking out of the hotel to walk to the left, EAST on DUNDAS the first block you get to is a FRESHCO, but a $5 tide detergent from there that has the balls or whatever.  I found that easy.  You slide open these trays in the laundromat and drop one of those suckers in and you're set.The washing machines take about 30 minutes and I dried two loads of laundry in one machine for 34 minutes and that was enough to dry all the jeans out and what not.  Awesome.  I used a FRESHCO bag to haul my laundry back and forth.COFFEE and STUFF lolAfter breakfast ends at 10 am there's still coffee generally available, at least until the pot is out ( not sure if they refill it when it's out after breakfast but either way you can't complain =) ), you can hit up the Tim Hortons that is adjacent to the FRESHCO.  This particular one has a ton of sandwiches you can buy most are about $5 and pretty good.  At the FRESHCO I would get my  Red Bulls at $2 each not bad.  Also got some snacks and stuff for my room.FOODThe Ontario Restaurant across the street from the hotel is wicked.  The people there are really friendly, especially this older guy who is the cook.  He likes to give you a hard time in a friendly way =).  My girlfriend ordered some Steak and Eggs from there and I had a BLT.  Hers came out to $12 and mine $5.  You really cannot beat that.  The food was really good.  The only sad thing is that they closed on 8/16 for two weeks for a vacation / holiday ( the older gentleman told me about this ).  If it weren't for that I would have eaten there every day.Great stay, HIGHLY RECOMMENDED.  From California. -MatthewPS:  The neighborhood is awesome.  Yes, there are a few dingy people but there's way more downtown you cannot every get away from them.  Thankfully they just keep to themselves.  Had no problems.  Even went to Fillmores and came back and went out again and came back by the time we were in the room again it was 3 30 AM and we have NO problems at all.  Yes we saw a guy wearing only shorts when it's freezing cold out mumbling to himself, but he was harmless.  Besides one good punch and he'd explode it looked like, all the shady people are just high off heroin and tending to themselves.  It seems theres a help center close by they drop into.  If you let that deter you from staying here, you're just simply wasting money as most of the other hotels are really close by anyways.",
      "rate": 5.0,
      "tripDate": " August 2014"
    },
    {
      "title": "Comfortable and clean room",
      "text": "We stayed one night here. The room was nice and comfortable and the staff was helpful. Breakfast is included in the price but don't expect too much. They only have sweet stuff, like toast and jam, woffels, donuts,  cereals, juice, coffe, tea. It has a good location and low  rates.",
      "rate": 4.0,
      "tripDate": " January 2015"
    },
    {
      "title": "Best Kept Secret Downtown....Hands Down.",
      "text": "Let me start off by unequivocally stating that when it comes to rooms with great rates, proximity to City Center, cleanliness, and friendliness; M-Star Royal Oak Inn is simultaneously a historic community staple and a hidden gem in Toronto East. \"Brother Sam\" (as I call him) is the most complaisant, efficacious, and most gracious host , while not only maintaining, but upgrading and completely revamping a hotel which has been essentially operating since 1935. FREE Wi-Fi, Art Deco-styled rooms, modernized \"touch/tap\" Key Card Systems ( a plus for those of you who may be enjoying your stay a bit too much and can't find the slots of those ancient room-key setups after-hours, if you know what I mean :), \"Green\"/Ecologically Correct, with the family-oriented environment of a Hostel, the early morning environment of a B&B, and the modern amenities without the typical snobbish front desk drones who can't wait for you to sneeze to loud so they can keep that security deposit from your credit card. The place is immaculately clean, quiet, and completely safe. I read some of the other reviews going on and on about the \"ghostly dismisses and bad area\", and yes it is near an area where many of the Community Services which aid those of us who are less fortunate are located, but I simply take that as yet another opportunity to count my blessings, not pass judgement on others. Having said that, Royal Oak Inn is indeed \"Best Kept Secret Downtown....Hands Down.\"",
      "rate": 5.0,
      "tripDate": " March 2015"
    },
    {
      "title": "Good Place to go",
      "text": "OK, I will definitely go back to this place again. Not just because the price was reasonable and it was in down town area and pretty close to every fun things you could find in Toronto, but because it was greatly clean. And why it was clean? because it is opened recently and we were one of the first costumers of this Inn.",
      "rate": 5.0,
      "tripDate": " December 2013"
    },
    {
      "title": "It was a great and cheap hotel!!!",
      "text": "I really recommend this hotel for those who do not want to pay a lot for accommodation. It was a new hotel and every thing was so so clean, the blankets, cover sheets, etc were all so clean!!! We we were so surprised because it was so cheap and we did not expect to see such a great and clean rooms. The people at front desk were always available and they were very friendly and so nice. The rooms were very clean and they had new air conditioners. There was a street car stop in front of hotel so we could easily go to any where...We really enjoyed our stay in this hotel and we recommend it!!!",
      "rate": 5.0,
      "tripDate": " December 2013"
    },
    {
      "title": "Cheap, OK, VERY limited parking.",
      "text": "Although listed as having parking, it is incredibly limited (maybe 4 spaces) and they're not reservable. The room was ok. For the price and proximity to the centre its hard to beat. Breakfast was pretty poor.",
      "rate": 3.0,
      "tripDate": " October 2019"
    },
    {
      "title": "Okay hotel in a sketchy area",
      "text": "The first thing you should be aware of is the area where this hotel is, it’s very sketchy with lots of people hanging around the streets, I would not want to walk around there by myself. The actual hotel inside was quite nice, everything seemed quite modern and we had no problems with our room. The complimentary breakfast was excellent, there’s a choice of cereal, toast, chocolate muffins, bananas and cook your own waffles. The only thing is they only have plastic cutlery and styrofoam plates and cups for breakfast, the amount of plastic the hotel will be going through a day is so bad for the environment, I’m not sure why they can’t set out reusable utensils for breakfast.",
      "rate": 3.0,
      "tripDate": " July 2019"
    },
    {
      "title": "Tuesday night in Toronto ",
      "text": "This was one of the lowest quality experience in hospitality industry . I’m wondering how do they have a license to operate in Toronto. I booked a room with queen bed using Expedia. At the hotel desk they wanted to give me a room with double bed. I refused as I booked and paid in advance for a room with queen bed. I was offered an “ upgrade for a suit “. Don’t ever book this “ suit “. First of all you need to walk outside hotel to an apartment 100m far . Very tasteless decorated , very old and dirty furniture . You can’t get to connect to Internet , you don’t have cable TV . You have YouTube but you cannot chose what to watch . Just avoid this place as is not worth a penny.",
      "rate": 1.0,
      "tripDate": " October 2018"
    },
    {
      "title": "Absolutely horrible!",
      "text": "The room was absolutely disgusting! The shower was completely dirty maybe not cleaned during the past decade. The area is really sketchy and dangerous. Someone tried to break into my car while I was stopped at the traffic light. They might tell you you will have a parking spot but you won’t. I had to park not very far but at night in this area it’s not safe at all. The breakfast was really poor as well. Will never go again.",
      "rate": 1.0,
      "tripDate": " July 2018"
    },
    {
      "title": "Stay away if you are with your right mind!",
      "text": "If you are with your right mind, then avoid this place by any means!Reasons:1.\tLocated at the center of Toronto’s broken neighborhood.2.\t24/7 scary and annoying noise from the countless homeless folks just outside of the rooms.3.\tVehicle noise just outside of the rooms.4.\tUnbelievably tiny rooms, almost impossible to use the restroom and even wash your face!5.\tNo fridge, old and unclean windows, unhealthy air condition due to bad AC.6.\tNo parking at all, and the closest public parking is about half a mile away if you are lucky. And if you are from the state, then things even get worse as your vehicle is the target of local homeless thieves. (~ $20 for overnight parking)7.\tThe hotel’s strict refund policy alone tells you about them, I had to get a new hotel for a whole new expense!Just stay away!Could be a cheap alternative if you are a single dude staying for few hours every night.",
      "rate": 1.0,
      "tripDate": " May 2018"
    },
    {
      "title": "Royal Oak Inn ",
      "text": "The price is low $80 however is not worth. Smell of old building, tasteless carpet , small room with a view in a brick wall.In a positive side the room was clean. A 2 am some people were knocking in next door , making loud noice and no receptionist care to intervene . I do not recommend it.I would rather chose AirBNB for 80 bucks than this place.",
      "rate": 2.0,
      "tripDate": " January 2018"
    },
    {
      "title": "You get what you pay for!",
      "text": "Stayed here for 1 night for a show we were seeing nearby. Requested a room with 2 beds and were given a double & a single. Pictures are deceiving, our room had peeling furnishings and was very poorly maintained. There were spiderwebs EVERYWHERE and a couple of spiders to go along with them. Dirt piled up in corners and a filthy shower floor. Pulled back the sheets of the single bed to find it full of hair that didn’t come from someone’s head (hint) The manager brought new sheets and was very apologetic. Breakfast consisted of bananas and a loaf of sliced bread. Would not stay here again or recommend.FYI, Hotel also puts a $100 deposit on your credit card at the time of booking even if it’s through a website that says your card will not be charged. Spend the extra $50 and stay somewhere else.",
      "rate": 1.0,
      "tripDate": " December 2017"
    },
    {
      "title": "Vile hotel & not worth the money.",
      "text": "The corridors were all very dirty - they looked as though they hadn’t been hoovered in months. The room itself was VERY worn out & basic with mould in the shower & the feel/look of a very cheap hostel. This hotel was not worth the price per night. I didn’t get very good value for money at all. I would never stay here again.The only positive is that it’s only a 15/20 minute walk from Yonge-Dundas Square.",
      "rate": 1.0,
      "tripDate": " October 2017"
    },
    {
      "title": "Good place for the price, better than expected, convenient location.",
      "text": "This place isn't for everyone if you are picky, but I would recommend to anyone traveling on a budget looking for a decent place to stay.  I've stayed in hotels more expensive that were way lower quality, so this one is pretty good and better than I thought it would be.  Staff were friendly, called the room to ask if things were ok when we checked in.  Housekeeping was good, the room was fairly clean.  There is a $100 damage deposit fee so just make sure you are able to provide that at check in.  There was no problems with that, after we left and the hotel voided the transaction.    We stayed in a room with two twin beds, which I didn't think was too small, though I don't care too much about what size a room is anyway as long as it is decent.  If you are tall or large it may not be as comfortable as the beds are short.  There was a small table to sit at, and the TV worked fine.  Bring earplugs if you are not a heavy sleeper, or you will probably wake up a lot from traffic/sirens/construction/hotel noises.  Yes, there are a lot of people in the area who are homeless/drug dealers/etc., but never had a problem with any of them, never talked to us or asked us for anything at least whenever we walked by them, which was several times in between the hours of 10 a.m. and 11 p.m. the days we were there.  There are also a lot of older people, people biking, jogging, doing normal things; it's just a neighbourhood, no one seems to be that bothered by whatever else is going on.  Be street smart and it's probably better if you are traveling with another person if you are going to be walking around a lot at night.You can easily get to Dundas Square/the mall/wherever else downtown by taking the streetcar, or if you like walking; it's not that far.There is a grocery store a five minute walk east of the hotel, which was convenient if you are looking to buy some produce or snacks or anything non-refrigerated (there is no fridge in your room).  Also there is a Tim Horton's right beside it.I would say it was a good experience staying at this hotel.",
      "rate": 4.0,
      "tripDate": " January 2016"
    },
    {
      "title": "Horrible",
      "text": "My boyfriend and I booked this hotel through hotwire and only realized we were staying here until after we paid. We wanted to give the hotel a fair chance and didn't read any reviews online before going, however, bad choice on our part.First of, this hotel is in a very unsafe area of town. I felt uncomfortable just parking my car outside. It is a block away from the \"Toronto Drop in Center\" so there are many homeless people around. We felt very unsafe within the hotel and the area as a whole. The room itself was very smell. We were only 2 people and we could hardly walk in the room. The bathroom sink is about the size of a cereal box, if not smaller. Our bedsheets were dirty, we did not receive clean towels unless we asked either. And when we asked, they would give us towels the size of a dish rag.Overall, I would NOT recommend this hotel. To top off our stay at this hotel, the worker at the front desk tried to charge us twice for the parking. I paid the first night when we got there and was told i did not need a receipt and that he would write it in his book. As my boyfriend was checking out on the sunday, he attempted to charge him for parking. As i returned to the checkout desk and my boyfriend asked me if we paid for parking and i said yes, the worker quickly \"remembered\" that i paid him the night we arrived. Sounds like he was trying to pocket the extra 25$ if you ask me. I hate to leave bad reviews for places as i believe all hotels have good qualities, however, not this hotel. I would pay the extra cash and stay in a neighbourhood that is safe and a hotel that is clean.",
      "rate": 1.0,
      "tripDate": " January 2016"
    },
    {
      "title": "Good value, clean, area little sketchy",
      "text": "I thought this place was great value. Place was clean, rooms are ok size with air con, flat screen TV. Looks like it's just been refurbished. Bathroom was nice, showeres were warm, could have been hotter. You have to walk past some sketchy people to get to it but had no bother from them. Breakfast was good, donuts, waffle maker etc. overall a very good value clean place",
      "rate": 4.0,
      "tripDate": " July 2015"
    },
    {
      "title": "Sweet Camo Carpet Makes Stairs Invisible",
      "text": "The staff was very friendly. This is a great place to drop off your stuff and go out into Toronto. You wouldn't want to spend the day in the small room, but why come to Toronto to do that. The neighborhood is not the greatest, so if you are paranoid, you may feel weird about that. It is also a six minute walk from the Hilton, so don't think that is going to get you a \"better neighborhood.\" I had no problems, besides being asked for cigarettes or money, but that occurs no matter where you are in Toronto. Be careful when returning at night, the camouflage carpet is tricky. You can never be truly sure that the step is actually there or not. It will also bring a nice sense of home for any Americans missing seeing camouflage in settings where it doesn't belong.",
      "rate": 4.0,
      "tripDate": " July 2015"
    },
    {
      "title": "Okay room problematic area",
      "text": "The hotel is close to the city center and only 15 minutes walk away from Eaton Center. The room was a bit small but freshly renovated with all the equipment needed. The free breakfast is very limited but ok and there is free wifi internet.The only problem is the area surrounding the hotel. It is rather run down and it takes 3-4 street blocks until the area gets a bit better. There is a streetcar stop infront of the hotel which esepcially at night can be helpful e.g. for single female travelers.",
      "rate": 3.0,
      "tripDate": " June 2015"
    },
    {
      "title": "Only if on a tight budget ",
      "text": "Clean, but a room for two has no room for two!!! No night table for one bed, no closets, just 5 hooks on a wall to hang clothes, just one chair, a tiny basin in a tiny bathroom. Basic breakfast, good service.Only choose it if on a tight budget, but be aware.",
      "rate": 3.0,
      "tripDate": " March 2015"
    },
    {
      "title": "Don't go here",
      "text": "One of the worst place ever seen. The hotel is in a very run-down part of Dundas st, with prostitute, homeless and junkies. The rooms are dirty, i can't take a shower in 2 days because it was too much dirty. And the parking is not a real parking: you have to leave your car in the street and maybe someone who works for the hotel take a look at it during the night. This \"service\" have a price of 11 dollars/night. I suggest to look for something else to sleep in Toronto.",
      "rate": 1.0,
      "tripDate": " April 2014"
    },
    {
      "title": "Disappointed?",
      "text": "Due to repeated visits to Toronto, I stayed at this place few times. The location is about 4 stops away from Eaton centre using transportationI stayed in a the two beds room and the single beds room. If you are staying more than one night go for the large room even if you are only one person as the tiny space may get to you with time. The one bedroom through is as good, however I would add at least a chair to the decor.Clean space.Towels, and toilet paper are supplied. Generally friendly reception and management. The breakfast consist of toast,jam, butter, coffee, donuts. If you are not interested there is a place across the street that start serving breakfast at 7 am . I tried dinner there and was good value for money.Despite the good value for money for this location, I will not book it again. I booked at this facility during valentine week through booking.com and on arrival I was told they are over booked (10pm) and they would take me to another facility ( I was not contacted about being overbooked and the management figured that as long as there is a cheap or free alternative offered the client should be fine). Both the assumption, not being contacted, and the time factor was really disappointing",
      "rate": 2.0,
      "tripDate": " February 2014"
    },
    {
      "title": "Clean, Affordable, Great Location!",
      "text": "I was surprised how nice it was for the affordable price. The sheets and covers were SO COMFORTABLE and clean and the cleaning lady came by everyday we stayed and left the room perfectly spotless.The rooms were bright (but also had shades so you could sleep in late) and cheerful, so it was a lovely stay. Nice TV and good sized private bathroom. They aren't that big, but the cleanliness and comfortable bed made up for that. It's a perfect place to stay for just a night or a couple nights.The breakfast isn't the best (coffee, tea, toast, waffles, toast), but for the location, it didn't matter. You can walk to any nearby cafe for food and the bus stops right by it. The location is perfect for exploring the city whether it is on foot or by bus.One problem was parking. My boyfriend and I couldn't find a safe-looking place to park. Also, beware of all the ONE WAYS while searching for a parking lot. There are cops everywhere that will ticket you.",
      "rate": 5.0,
      "tripDate": " January 2014"
    },
    {
      "title": "Affordable, good location, very clean, friendly and helpful staff",
      "text": "If you are looking for an affordable, clean hotel in a good location in downtown of Toronto and with helpful staff I definitely recommend that you go to this place. Street car stops are in front of the hotel. The rooms are very clean with TV, private bathroom, working desk and new air conditioner. The front desk staff directed me to get a day pass from the nearby subway station which is just about 10 minute walk from the hotel. Since I was going to a business meeting and I did not want to take my baggage with me, I checked out at 9:30 AM (check out time is 11:00 AM), left my baggage at the front desk and then returned at 12 PM and got my baggage from the front desk. Then I stayed in the lobby for one more hour and used the internet free of charge. I will definitely go back if I return to Toronto. I thought that there is a fridge in my room, but it was not. It is understandable, because it will increase the cost. Next time, I will not bring a food that needs a fridge.",
      "rate": 5.0,
      "tripDate": " January 2014"
    },
    {
      "title": "Simple, cost-effective",
      "text": "Chose this hotel because I could see that management responded to every concern posted in other reviews - so you can see they are diligent.It's fine. Safe, clean place to stay. Inexpensive. Close to public transit. Staff was very friendly, helpful.It's an old, quaint building. Not luxury. But, you get a good room for a very reasonable price. Clean bathroom.",
      "rate": 4.0,
      "tripDate": " January 2015"
    },
    {
      "title": "Perfect stay in downtown",
      "text": "First and foremost thing about this hotel is the front desk staff - very helpful and cooperative. Fortunately i stayed for eight days and this opinion is based out of that experience. The hotel rooms are good though small in size, my recommendation would be to go for 2nd or 3rd level and road facing. Other amenities like breakfast choice is limited. Connectivity to downtown and other parts is very good. I am especially thankful to Mr. Sam, Viren and Pushpinder for making my stay homely and wonderful. Love to back again!",
      "rate": 4.0,
      "tripDate": " March 2019"
    },
    {
      "title": "Standard hotel for the price",
      "text": "For a cheap hotel it's what we expected. The rooms were fairly clean but we did find a few hairs in the beds. Internet worked great, you do only receive 48 hours though. Hotel is within walking distance to Dundas Square however do NOT walk around the hotel area at night. We had two separate taxi men advising us to not do so. From the airport, it cost us $58 so you are best getting an uber for $22 or getting the train and a bus/airport expressway. Breakfast was basic and hotel has no lift. For the price though we were happy with this stay. Guy on reception was helpful too. Cheap and cheerful :)",
      "rate": 3.0,
      "tripDate": " September 2017"
    },
    {
      "title": "Tiny but served its purpose ",
      "text": "During my visit to Toronto I had to stay at a hotel for two days and after searching for a place in the heart of it all but affordable, Royal Oak Inn won out. I didn't need frills, just a place to lay my head.This is about as minimalist as a hotel can get. There's a television, A/C and tables with lamps. The rooms are tiny and the bathroom is too. I'm 5 feet four and a quarter inches tall (yes, every bit matters!) and the bed lengthwise was almost too small for me. That being said, the room was clean and bug free! The staff was helpful too when I arrived.The neighborhood this place is in isn't run down but you know it's working class. It's pretty diverse in every way and you're going to have city noise too (traffic, sirens, music) so if you're a light sleeper bring earplugs. I went walking around the neighborhood by myself at night to grab food and didn't feel unsafe once. I actually mention this because people may be put off by the location but I live in an urban area of a major American city and Toronto's urban area didn't raise any alarms for me. If you're looking to lay your head down on the cheap while visiting Toronto then this is the spot. It's centrally located and I saw several bus and Streetcar stops while I stayed there. (Parking here, I was told, is $10 CAD per night, by the way.)",
      "rate": 3.0,
      "tripDate": " April 2017"
    },
    {
      "title": "Cloister-like accommodations downtown ",
      "text": "Cheap. Clean. Small. Sparse. Simple. (with single/twin beds)If you are elfin in size and don't mind spartan lodgings you might enjoy staying at this place.You may need to perform various contortions in the bathroom in order to fulfil your basic functions.Turn the heater/air conditioner on at night in order to cancel out some of the street noise.They offer somewhat of a breakfast in the mornings. (get there before items run out)They also offer free parking. (even though you might have to wedge your car in, it is downtown Toronto and the parking cost is worth the price of the hotel room alone).At night the location looks scarier than it really is. Areas very nearby and all around the hotel are being gentrified.Overall, it is very reasonably priced, run by nice accommodating people, walking distance to many amenities,  free parking and designed specifically for cheap lilliputians with spartan tastes.",
      "rate": 3.0,
      "tripDate": " April 2017"
    },
    {
      "title": "Not fair",
      "text": "Hotel canceled reservations at the last minute. I had reservations for 2 nights and upon arrival to the hotel late in the evening it turned out the hotel canceled the booking without reason. Staff said that he sent a confirmation by email. But it was less than 24 hours before our arrival. I was on my way to Toronto, and I had no chance to check e-mail. It was not fair. There were no free rooms at this hotel so staff offered us accommodation in the friendly hotel \"Central Hotel\". Horrible and dirty place. Fortunately, the next day were already out place for us at the Royal Oak Inn. The hotel is ok. Pretty good location. Breakfasts were ok although a little small selection. Clean and daily cleaning.",
      "rate": 3.0,
      "tripDate": " November 2016"
    },
    {
      "title": "DO NOT STAY HERE BUGS AND DIRTY",
      "text": "wife and I woke up the next morning with bites all over us. Very itchy, my wife had to go to the hospital cause they were so bad. The place was crazy small like I slept in a closet. The bathrooms so dirty could see poo marks from past guest. I looked under the bed and omg hair and pubes and so many insects the place was never cleaned. I don't know if it was bed bugs but front desk said they have had many bed bug problems before but not in this room. Would not even give us a discount. Do not bring your kids or stay at this hotel. Worst stay ever dirty dirty dirtyUnless u like bed bug or whatever is there DO NOT STAY AT THIS HOTEL",
      "rate": 1.0,
      "tripDate": " July 2016"
    },
    {
      "title": "Horrible",
      "text": "Nothing good to say about it, service, smell, area, parking, rooms..name it, we ended up not staying, rather lose money, no way in hell i'd stay there.  We had book with hotwire, and that's what came up....",
      "rate": 1.0,
      "tripDate": " April 2016"
    },
    {
      "title": "Needs to be cleaner and don't forget shower flipflops!",
      "text": "After getting this hotel on Hotwire and reading the reviews, I started to panic. People were saying the neighbourhood was sketchy and the rooms were not clean. I wasn't looking forward to spending three nights here. Someone mentionned in another review to reserve one of 6 parking spots for 10$ a day. We did that soon after booking and when we arrived, a spot was available for us. We used the TTC and it was really convenient! We installed the app on our phone and purchased our day pass to make things easier. Streetcar 505 passes right at the door and then we took the Line 1 subway to the CN Tower, aquarium and Casa Loma. I must agree, our room on the third floor was small and needed a good cleaning. Hairs were found on bed and floor. The vacuum and a steam mop needs to be passed thoroughly in the corners and in between vanity. The tv in our room would become fuzzy after 20 minutes of watching. They had lots of channels to choose from. Another reviewer said to bring shower flipflops and earplugs and I'm so glad I did! The shower tiles were disgusting and the shower walls had pink mildew. They have a soap and shampoo dispenser in shower but no bar of soap for the sink. Since it's downtown, you hear sirens and traffic go by. Light sleepers might have a harder time. As for the neighbourhood, I didn't find it sketchy and I didn't see a lot of homeless people around the hotel. We tried the breakfast once and the waffle batter was not really good. They had bananas, toast, cereal, donuts and orange juice. Will I stay here again? The answer is no since I prefer the higher brand name hotels.",
      "rate": 1.0,
      "tripDate": " March 2016"
    },
    {
      "title": "Good location for our purpose",
      "text": "The room was tiny & clean with a 3 piece bath.  Wi-fi worked well.  Breakfast was the standard \"continental\" serve yourself - adequate.  If you're looking for luxury, look elsewhere.  This is utilitarian, inexpensive, well-located & served our purpose.  The desk clerk was personable & helped us promptly when our room card malfunctioned.",
      "rate": 3.0,
      "tripDate": " January 2016"
    }
  ]
}