{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Royal Stays Suites - Blue Jays Way",
    "url": "/Hotel_Review-g155019-d6717256-Reviews-Royal_Stays_Suites_Blue_Jays_Way-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.0",
      "reviewCount": 17
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "250 Wellington St W",
      "addressLocality": "Toronto",
      "postalCode": "M5V 3P6",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0f/29/04/c9/20170501-184406-largejpg.jpg?w=500&h=-1&s=1"
  },
  "description": null,
  "featues": [
    "Clothes dryer",
    "Washing machine",
    "Seating area",
    "Sofa",
    "Telephone",
    "Iron",
    "Wake-up service / alarm clock",
    "Coffee / tea maker",
    "Kitchenette",
    "Hair dryer",
    "Dishwasher",
    "Microwave",
    "Refrigerator",
    "Kitchenware"
  ],
  "reviews": [
    {
      "title": "Handy spacious apartment",
      "text": "This was our first time renting an apartment we normally use hotels. We will definitely use this form of accommodation in the future it was excellent. The location was right in the entertainment district across from the CN tower. We bought a weekly transport ticket and explored everywhere with it.The apartment block itself is lovely there is a sauna and huge jacuzzi pool on the top floor. We were a little disappointed we didn't realise it was there until the last day we would have used this daily to ease the sore feet! An information sheet was emailed to us by the letting agency but this information wasn't supplied. The apartment was spacious and was big enough for us 3 adults. It would suit a family of 2 adults and 2 children too.The décor was a little dark but everything you could need for a home away from home. Washing machine, dishwasher, microwave, oven etc. We would certainly use this apartment again and would certainly recommend it to other travellers.",
      "rate": 4.0,
      "tripDate": " August 2014"
    },
    {
      "title": "Vigilance needed!",
      "text": "That was my first trip to Toronto with family . The location of the place is nothing less than prerfect. You have access to main attractions of this beautiful city ( CN tower, blue jay stadium, quay to islands china town ...)on foot in less than half an hour and subway station in within 10 minutes of walking distance. The suit itself was good and well equipped , a nearby nightclub could have been a nuisance but sound isolation made it tolerable. Security was responsible but a little moody , anyway you don't have much to do with them during your stay. A small but very practical grocery store is about 30 meters from the site. Gym was amazing with brand new equipment very clean and with a beautiful view of the neighborhood. The pool is nothing but a small pond but I am not a regular swimmer after all. While I recommend the place itself, strongly advice you to be very smart about the manager of the apartment. He called me And requested an extra charge of 150 $ for what he claimed was tax that he had forgotton to charge us and said he would come and get the money in person. A trustful person by nature I agreed and asked him for a receipt and he never showed up to get the money! That was just a robbery I think and I recommend a investigation by the owner company so such irresponsible persons don't taint the fame of such a great place.",
      "rate": 4.0,
      "tripDate": " June 2015"
    },
    {
      "title": "Great Location - average apartment",
      "text": "We booked the Royal Stays based on location and a \"reasonable\" price for our first trip to Toronto.The building is great with 24 hour security and on site parking was a plus. The apartment itself - 202 was basic with a double bedroom and bedsettee. Unfortunately the bed settee was really uncomfortable for our daugther and when we mentioned this we were told it was only supposed to be used for one night - our booking was 4 nights so dissappointed this was not mentioned at booking, a single \"floor\" matress was provided which was not ideal, the lounge blind fell apart as soon as we touched it and the bath and sink plugs did not retain water to be able to have a bath. This all a shame as the building and location gave us high hopes.We were assured the issues would be sorted for the following travellers!",
      "rate": 3.0,
      "tripDate": " October 2015"
    },
    {
      "title": "Worst stay EVER!",
      "text": "We stayed here for 3 nights, it was booked for 3 adults and booking stated sofa bed. We were given all the wi-fi details and everything else we needed before via an email. When we arrived at the apartment the bedroom had no door on and had glass style wall which was open to corridor right by front door. We then tried to put sofa bed up!! There was no proper bed, only a small child like mattress which my mum had to sleep on! This had to be put on floor! After we had pulled out sofa we found crumbs, dust and half a biscuit! DISGUSTING!! We sent email to royal stays to ask to be moved, they said they could move us next night. We never got moved as they sent back email at 10:30pm! I wouldn't recommend this to anyone unless your a couple who don't mind dirt!",
      "rate": 1.0,
      "tripDate": " September 2014"
    },
    {
      "title": "Prepayment Charged n not credited back after 1.5 months",
      "text": "I had booked this apartment for a short stay in March 2019 through bookings.comI cancelled on dec 20th in free cancellation period. They charged my card for 589 dollars as prepayment and still after so many emails and messages have not credited the amount back to my card. I have contacted bookings.com but they are also not doing anything.AVOID THIS PLACE !!",
      "rate": 1.0,
      "tripDate": " December 2018"
    },
    {
      "title": "Avoid!",
      "text": "The apartment is sold as luxury apartment but is no such thing. Everything in the apartment from the furniture and kitchen appliances to the towels and bedding were worn out and covered in stains. it is very clear there has never been any effort to clean place. When I compliant about the condition of the apartment, I as ignored even I phoned twice and sent three emails, only when I left was a email responsed to where the said that all my concerns were address and that I was offered a full refund if I wanted to leave on the first day, no such offered was ever made because no one ever responsed to compliants. They take $300 as soon as book so become trapped because they know the poor condition their apartments are in. This is the worst place I ever stayed in the whole world, even worst than one star accommodationsituated. Avoid at all cost.",
      "rate": 1.0,
      "tripDate": " September 2015"
    },
    {
      "title": "Filthy, Dirty Place! Stay Away",
      "text": "We stayed in room 1131, the minute we walked in we seen the dirty stains on the carpet all up the stairs, marks on the walls and doors, filthy dirty shower curtain, fire alarm hanging from the ceiling wires exposed, dirty bed sheets, stains on the carpet in both bedrooms, towel rail about to fall off the wall.We went straight down to reception to complain and the security man told us to ring number on envelope which I did, and was told by the Manager that I could check out, but I would not be getting any of my money refunded, I told him I would like to be up graded, everything was booked. They got the apartment cleaned we got clean bedsheets. I had to wash the shower curtain. The towel rail was on the floor under the sink when we got back, I got the maintenance man to fix the fire alarm.  We decided that we had no other choice but to stay in this place, because no money was being refunded to me.Not only is it a filthy dirty place the Management are DESPICABLE, Booking.com sent me on emails that Atlas sent to them stating that I was complaining from I arrived, and that I was just looking for an upgrade, and I quote \"I pulled the fire alarm from the ceiling\", and that I was just creating a fuss for nothing\".   They also told Booking.com that they had offered me a refund on the remaining nights, again another LIE, if they had we would have jumped at the chance to get out of there. I have sent and email to them after I got home that I have their email that they had sent to Booking.com and still no reply! These are descipable people that run this filthy place all theY are interested in is your money and don't care after that. FILTHY, DIRTY PLACE AND RUN BY DESPICABLE PEOPLE, STAY AWAY!!",
      "rate": 1.0,
      "tripDate": " July 2015"
    },
    {
      "title": "Wonderful accommodation close to Metro Toronto Convention Centre",
      "text": "Just stayed there attending a three day conference. Kind of hard to find and no parking zone out front-- if you are driving there I found out you actually have to go past condo at 250 Wellington to Blue Jay Way , turn right and then right again at alley beside Rustico Pizza.  Keep going down alley to back door (glassed entrance) to check in and get parking access fob.   Apartment was beautiful with all needed amenities. Free underground parking and secured access to building. Security very helpful for check- in and a special \"Thank you\"  to Al who was so helpful!  Would recommend one bedroom apartment to anyone over a hotel room. Cheaper and better with kitchen, eating area, and even a washer/dryer and dishwasher! ! Friendly Royal Stays staff member was available by phone for any questions. Was very impressed! 5 minute walk to convention centre!!",
      "rate": 5.0,
      "tripDate": " October 2014"
    },
    {
      "title": "Avoid at all costs",
      "text": "I booked on booking.com and cancelled only two weeks later, around 7 months before I was due to travel (because when I read them properly the reviews were awful). They took a deposit without giving any receipt and I didn't realise they had done that, or that they hadn't refunded it, until my credit card bill was pending on my bank account, three weeks after I'd cancelled, then it took another full week for the refund to come through. On top of that, they did not refund the full amount I'd paid. They blamed the currency rate, but if that were true I'd have received more than I paid. I am still owed money, plus I had to pay extra interest on the credit card bill meanwhile they were earning interest on my money that they should have refunded. They're either incompetent or criminals. Either way, I've been robbed.",
      "rate": 1.0,
      "tripDate": " September 2019"
    },
    {
      "title": "A pleasure ",
      "text": "Booking was easy, staff present to give me my key and show me around, well appointed kitchen, clean, great location, great security, lots of space in apartment, affordable, any questions or concerns were addressed immediately.  I would use this company again and I would bring my family too!",
      "rate": 4.0,
      "tripDate": " January 2018"
    },
    {
      "title": "Acceptable space and good kitchen but run down and rude personnel ",
      "text": "Stayed there for four nights with the family and was very disappointed with beds provided - mattresses for both, bed and children's folding couch were completely run-down and should have been replaced years ago. The couch so small that it was impossible to have a 6 and a 13 year old sleeping in there together - selling this as a 2+2 accommodation is strongly exaggerated. Sleeping quality was definitely the worst I ever experienced. As linen and pillows for the couch were unavailable upon arrival I called the owner's company - just to find myself in a lengthy discussion with an Indian counterpart who denied that anything was missing (was then delivered only after one hour). Good was definitely the rather well equipped kitchen which allowed proper cooking, parking in the underground parking and the location in the center allowing visits to many places by foot.",
      "rate": 2.0,
      "tripDate": " June 2017"
    },
    {
      "title": "Great location ",
      "text": "Great location, ease of coming and going, and facilities with helpful staff at the front desk. Some one did come into the apartment while I was in bed to drop off a pan and brush which made me uncomfortable for the following time.",
      "rate": 4.0,
      "tripDate": " February 2017"
    }
  ]
}