{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Ryerson University - Pitman Hall Residence",
    "url": "/Hotel_Review-g155019-d185616-Reviews-Ryerson_University_Pitman_Hall_Residence-Toronto_Ontario.html",
    "priceRange": "$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.5",
      "reviewCount": 40
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "160 Mutual St",
      "addressLocality": "Toronto",
      "postalCode": "M5B 2M2",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0f/bc/fb/2f/notre-chambre-506.jpg?w=500&h=-1&s=1"
  },
  "description": null,
  "featues": [
    "Paid public parking nearby",
    "Street parking",
    "Free High Speed Internet (WiFi)",
    "Meeting rooms",
    "Baggage storage",
    "Concierge",
    "24-hour front desk",
    "Laundry service",
    "Internet",
    "Newspaper",
    "Non-smoking hotel",
    "Shared bathroom",
    "Shared kitchen",
    "Shared lounge / TV area",
    "Air conditioning",
    "Desk",
    "Housekeeping",
    "Telephone",
    "Wake-up service / alarm clock",
    "Bath / shower",
    "Complimentary toiletries",
    "Non-smoking rooms"
  ],
  "reviews": [
    {
      "title": "Spot on",
      "text": "Stayed here for 4 nights in August.  The room was dead on, as was the bathroom.  Had a sofa and tv too.  Breakfast was included in the deal, and there was free internet in the lobby.A less than 5 minutes walk brought you to the Eaton Centre on Yonge Street.Overall, if you are looking for clean and cheap accomodation in Toronto I would definately recommend Ryerson.",
      "rate": 4.0,
      "tripDate": " August 2007"
    },
    {
      "title": "Simple, good for the price, no WiFi in rooms",
      "text": "A very decent stay that is in line with the price. The room is clean, decor is nothing special, old but does the job, private bathroom that is clean. Has an A/C. Easily accessible via public transport and in a good location for seeing the rest of the city.Only problem is that there was no WiFi in the room, only in the common area on each floor. This was inconvenient. Also it was at times a bit noisy with teenage kids attending some school, I was thankfully not on a floor that they were staying on. Decent breakfast that is included.",
      "rate": 4.0,
      "tripDate": " July 2018"
    },
    {
      "title": "Basic but cannot beat the location! It's a University Residence adjust your expectations",
      "text": "First and foremost you must adjust your expectations for accommodations in a university residence.  It is not a luxury hotel nor is it bunk bed hostel.  It is somewhere in between but usually the location is exceptional.  Residence rooms are usually rented out from mid May to Mid August. You can find individual rooms, joint rooms with shared bathrooms or quads with common areas and kitchenettes.  The combinations vary from property to property.   I have stayed at student residences at St. Francis Xavier in Antigonish, NS, University of Ottawa, Brock University in St. Catherine's ON and McGill University in Montreal.  All university residence accommodations are different: some new, some old, some are converted hotels (as was this case with my room at Ryerson University).  You are more likely to get a standard dorm mattress so be prepared they make those mattresses to last not to be comfortable.  My stay at Ryerson University, TorontoThis residence is located in the International Living/Learning Centre (ILLC) on Jarvis Street but is also accessible from Mutual Street facing the RU campus.  The campus is a block away from Dundas Square, The Eaton Centre and Yonge Street shopping & restaurants.  My room was not large but it did have a private bathroom, small closet and dresser drawers with a large desk.The mattress was a queen size bed and was very comfortable.  There was a radio, Ethernet internet but no TV. There is an Ethernet cord provided for your use in the room.  Free WIFI was available in the community lounge (on my floor located just down the hall).  FREE WIFI was also available in the lounge just off of reception and in the dining room.  You have easy access to the university with a Metro (grocery store) right across the street.  This is very convenient if you are planning an extended stay.  You have access to a communal kitchen with a stove, fridge and microwave.  You must bring your own plates (and I will assume pots).  Residents are responsible for cleaning their dishes.Otherwise, housekeeping is provided with fresh towels and minimal toiletries.  The towels were not very large or soft. But once again, keep your expectations realistic this is a dorm after all.A full breakfast is included in the room rate.  It varies through the week but it includes a hot breakfast (eggs, bacon, potatoes, oatmeal), bagels or toast, yoghurt with fruit, orange or apple juice and coffee are all included.  Breakfast can also be purchase if you are not staying in the residence.  It was reasonably priced from $5 - 11.The other benefit of staying on campus is you can call campus security to accompany you through the campus and a few blocks radius away at night.  It is a safe walk program and you can ask at the desk for more information.My rate was $90 CDN for either a queen bed or a queen + sofa bed (usually for those with 3+ guests).  This does not include tax.  There is another residence on campus that was closed this summer so I cannot attest to that facility or rate per night.Overall, I thought it was worth the price because the location is fantastic, breakfast was included and the staff was super friendly and helpful.You can also store your luggage if the 11 am check-out is too early for you!  I will be returning because you cannot beat the location and I felt safe and comfortable. If you are interested more about my travels (and full review), hotel and restaurant reviews drop by the blog: DownshiftingPRO dot com.",
      "rate": 4.0,
      "tripDate": " June 2016"
    },
    {
      "title": "Has to be the best value in Toronto",
      "text": "This student residence used to be the Hotel Ibis, and therefore its rooms are actual hotel rooms.        Queen size beds, pull-out sofa, desk, cable TV, closet, full bathroom which is actually quite large.         I stay here during the summer, often during Gay Pride week and its proximity to the village is great! Furthermore, the price can't be beat! I can usually stay at or around $100. In June, July and August in downtown Toronto you can't beat that price!        The rooms are clean, the entire staff are Ryerson University students and they are all very friendly. Can walk to the Eaton Centre in 5 minutes, there is a 24hr Dominion Grocery Store across the street and indoor parking just beneath the hotel.        No cinder block walls indicative of student residences anywhere in sight! Just a great find and an even better deal!",
      "rate": 5.0,
      "tripDate": null
    },
    {
      "title": "2 Very Different Locations - Pitman Hall and International Living Centre",
      "text": "There are two very different locations  - I've stayed at both for different reasons  Pitman Hall 160 Mutual St - single room with a single bed and a desk - no restroom/bathroom in your room. Shared bathroom and shared private shower/tub. The mattress is very basic and very hard, not the most comfortable. They have extremely restrictive rules about having visitors to your room, and no one permitted past 11pm into your room. Breakfast is basic but ok. Location and price is fantastic - a couple of blocks east of the Eaton Centre is the primary attraction to this location.  International Living Centre 240 Jarvis St - Queen Sized Bed - some include sofabed(which is useless since the mattress is worse then Pitman hall - I couldn't sleep on the mattress without having pain throughout my body. I had to sleep on the cushions from the sofa bed on the mattress which was challenging) I mentioned it to the front desk at checkout, and the young woman laughed at me. The room is better then Pitman Hall, includes private bathroom/restroom with shower. Still with restrictive access at night though, no guest access after 11pm. Breakfast is good. There is a TV in these room.  Both have common rooms with a TV, fridge and stove.  If you find a hotel at a similar price and location, I would recommend to choose the hotel over either of these locations as the reduced flexibility and improved customer service would be a better experience for most.",
      "rate": 2.0,
      "tripDate": " June 2012"
    },
    {
      "title": "Nice and very inexpensive",
      "text": "I've stayed at this hotel every summer for 3 years, and have already made reservations to return this coming July. I've read the other reviews and feel it has to be pointed out, the rooms cost around $100 a night, high-season downtown Toronto.While other hotels just blocks away are charging over $200 even over $300 for their rooms, this place is a great deal! You can't expexct the world for $100, but if you shop around, and compare prices, you'll see this place has them beat! The hotel is entirely run by students who are training to work in the hotel industry, so you have to expect a little roughness around the edges.The bottom line is this hotel is VERY inexpensive, the rooms are very modest but include the essentials (bed, telephone, cable TV, private washroom, alarm radio, air conditioning) and is a great outlet for new students to enter the hotel industry. At $100 a night, you can't expect the Four Seasons, and at the same time, these kids to a better job than many Ramada's and Howard Johnson's I've stayed at in my time. If you're ona budget, this is the place!",
      "rate": 5.0,
      "tripDate": null
    },
    {
      "title": "Not worth the hassle",
      "text": "This place is amateurish in every way. The front desk had no change for a dollar. The clerk told me they accepted American dollars for payment, then when I checked out they said they didn't. It took them an hour to scrounge up an ironing board, and I carried it back to the lobby myself because they seemed so incompetent by that point I figured they'd lose it and then try to charge me for it. Not worth the hassle.",
      "rate": 2.0,
      "tripDate": null
    },
    {
      "title": "Smelly, noisy, and uncomfortable",
      "text": "I spent 2 nights at the Pittman Hall residence.  It was a 4-room unit with a shared bathroom.  Since it was the summer they were in the middle of painting and the fumes mixed with the embedded stale smell of greasy student cooking was very unpleasant.  The mattress was thin - imagine a worn 2\" thick foam camping mattress wrapped in vinyl and that pretty much sums it up.  There was a lot of noise from the courtyard until late at night which also made sleeping difficult even with earplugs.  The sheets, blankets, and pillows provided are very thin.I was traveling with a group so it was good price for the number of people.  But for a business trip it wasn't ideal.  The one good feature was the washer and dryer which I did use, just buy a card from the front desk.  The staff were friendly and helpful with directions to amenities in the area.You are essentially staying in a hostel - although I have stayed at hostels that are much nicer than this.  For a leisure trip or traveling with a family where you want cooking facilities it may be worth considering if you can get a good price, but otherwise I wouldn't recommend it.",
      "rate": 2.0,
      "tripDate": " June 2012"
    },
    {
      "title": "Don't even think about it",
      "text": "I didn't expect too much since I knew this is a budget/economy hotel, but the staff there were so not professional. Checked me in a room where someone else is still sleeping on the bed, and gave me grill cheese while I ordered a burger. The hallways are so dark and dirty.  I could stay in some other better places at the same price.",
      "rate": 1.0,
      "tripDate": " July 2007"
    },
    {
      "title": "Cheap and clean",
      "text": "This is by far the best deal you can get in downtown Toronto.  My friends and I booked a four-room suite which had four little dorm rooms, two bathrooms (4-piece and 2-piece), kitchen and sitting area for only $89 a night -- for the whole thing!Let's be realistic here, this isn't a four-star hotel, and nor should you expect it to be.  What you can expect is a clean, quiet, secure place to stay in the middle of downtown Toronto.There is a 24-hour grocery store a block away, but if you need any extras such as a hair dryer or an iron, you'd best to bring them yourself.This time I stayed at Pitman Hall and the year before I stayed at the ILLC (they're across the street from each other) and both were fine.",
      "rate": 5.0,
      "tripDate": " June 2007"
    },
    {
      "title": "Good value",
      "text": "We spent three nights at the ILLC.  The room was small but clean and the staff was very friendly.  We were able to park our car in the building garage for an extra $13 a night.  The location was excellent, a few blocks from Dundas Square.  It's not fancy but it is a great value for downtown Toronto.",
      "rate": 4.0,
      "tripDate": " July 2012"
    },
    {
      "title": "could be better",
      "text": "we stayed at the residence for 3 weeks for a study tour. The hotel was quite pricey it was like paying for a 5 star hotel. The staff were lovely and accommodating and so were the cleaners. but our room was quite disappointing, the rooms had a stench, our room had a toilet that always smelt like urine. Cleaners would cover up the stench with a deodorizer but comes back after a few hours. The location is brilliant, close to Eaton centre and the CBD. overall it didn't affect our stay, just a few minor flaws. We stayed a year ago, so things could be different",
      "rate": 3.0,
      "tripDate": " July 2010"
    },
    {
      "title": "Ryerson student rez is where its at!",
      "text": "great service, very friendly staff , the rooms are very comfortable (considering the price), and above all EXCELLENT LOCATION.  it's very safe as it is part of the Ryerson University campus. i would def stay there again when im in Toronto",
      "rate": 5.0,
      "tripDate": " July 2009"
    },
    {
      "title": "Decent place, but GREAT location",
      "text": "I love Toronto and have been trying to find economical alternatives to hotels since I began going there. Ryerson was NOT all i expected - small room with a regular bed, pullout, desk, closet-type unit, dresser, tv, bath, phone, but everything was so tightly packed into the room that when the pullout was out there was really no walking or standing room.  Items weren't new but decent. Bath tub/shower needed unclogging (water gathered when i showered), but this is a dorm type facility that maintenance probably hadn't gotten around to yet, but it was a great deal.   Hated the fact that there was no pool and only 1 computer in the lobby. Food was decent. Safe deposit box at desk came in handy.  The location makes up for everything though. We walked to eaton, subway, buses, etc. It's at the heart of everything. Bad side...not close to beach and you have to pay fee to use the campus pool/rec center.",
      "rate": 3.0,
      "tripDate": " July 2006"
    },
    {
      "title": "You think you're getting a residence, but it's so much worse.",
      "text": "Decided to stay here for the summer as it was relatively affordable while I was working in Toronto. But wish I spent another $200/month just not to deal with so much irritation.First: the main irritant: TERRIBLE mail system. Do not stay here and expect even an Amazon package to arrive on time or arrive at all. I've gotten exactly 4 things shipped, 2 we're available at reception 1 day (which is a bit irritating but okay..) after the tracking marked them shipped, another 3 days, and the 4th envelope was lost. Staff are no help as they are a bunch of students who will give you the same canned response even though you've been through the situation multiple times.Second: Horrible AC. I wouldn't even call it AC, more of a fan and even the hallways are sweltering hot throughout summer.Third: Grimy, bugs everywhere. A bit expected with a res but it's almost ridiculous here. Dust will cover everything you own as soon as you move in.Fourth: Terrible plumbing. Seems like a weird thing to complain about, but you will be complaining too once you realize the taps rarely dispense cold water, yet the shower stays hot for 2 seconds.Avoid this place like the plague, no matter how cheap they offer it to you.",
      "rate": 1.0,
      "tripDate": " July 2019"
    },
    {
      "title": "Awesome location  pretty cheap and clean, but no Wi-Fi",
      "text": "Perfect location; a few steps from Yonge-Dundas Square.The bathrooms and rooms were very clean and tidy.Friendly staff.Safe, as not anyone can go into the residence area.The only glaring problem I can think of is the lack of Wi-Fi.",
      "rate": 4.0,
      "tripDate": " June 2018"
    },
    {
      "title": "Fine and great price",
      "text": "It is a really good priced accommodation in the centre of Toronto very close to yonge dundas Square. Also very close to bus terminal to and from niagara falls.Friendly and helpful staff, always there to help.Good choice and breakfast and good overall facilities. No TVs in rooms but available in the common room.",
      "rate": 4.0,
      "tripDate": " June 2018"
    },
    {
      "title": "Basic room in an excellent location",
      "text": "Great cheap room which is really basic - bed, storage and bathroom. Free breakfast was good - pancakes, hash browns, egg, yoghurt, juice e.t.c. Only downside was that WIFI is not available in rooms, only in the common rooms.",
      "rate": 5.0,
      "tripDate": " June 2018"
    },
    {
      "title": "Pitman Halls all your basic needs",
      "text": "I stayed in Pitman Halls for a few nights. Basic accomodation but all you need. Towels and toiletries provided. Laundry room you need to buy a card for but it's only $5CAD and you can do a massive load. There was a \"metro\" supermarket just around the corner so very handy. You need key access for your room which self-locks so don't ever forget to take your key with you when leaving your room. There are men's women's and gender neutral with disabled access bathrooms on each floor and no sink or running water in the bedrooms so you must always leave your bedroom if you need running water. No fridge or cooler in the bedroom. you can open the bedroom window but there is a mesh on it so no hanging food out of the windows in a plastic bag like you may have done at university in the past! Reception were very helpful when I had an issue with bedding and they gave me new bedding as requested. Super handy location and well worth staying here if you're going to be out all day exploring Toronto as I was.",
      "rate": 3.0,
      "tripDate": " July 2017"
    },
    {
      "title": "Reasonable place to stay in a great downtown location",
      "text": "Our family of five stayed here for one night when we were in town for a Blue Jays game. Even though we had to book 2 rooms to fit us all, we still paid less than we would at nearby hotels. It seemed to be staffed by students who were pleasant and friendly. This place is not fancy. The mattresses are old. The rooms were clean and comfortable and contained a clock radio, telephone, desk and wardrobe. There is wired (ethernet) internet in the room or free wi-fi in the common areas. There was a hot breakfast included which during our stay consisted of scrambled eggs, waffles, hashbrowns, bacon etc. Yogurt, fruit and toast were also available. There was parking onsite for an additional fee. We were about a 30 minute stroll from Rogers Centre and maybe 5 minutes from the Eaton Centre. If you accept this hotel for what it is and don't expect a lot of amenities it represents good value in the heart of downtown Toronto.",
      "rate": 3.0,
      "tripDate": " July 2017"
    },
    {
      "title": "Résidence student dorm rooms",
      "text": "Basic room with air conditioning and clock radio, own bathroom. Cant be picky about stained carpets,  WiFi is available in public lounges on every floor.  5 mins walk to Dundas square so location is great.",
      "rate": 3.0,
      "tripDate": " July 2016"
    },
    {
      "title": "Amazing value, amazingly nice staff",
      "text": "This is not a Hilton, an Intercontinental Hotel, or even a Delta Hotel.  Don't expect luxury.  What it is, is an amazingly great place to stay on the cheap.  The staff are largely students, who are super helpful, friendly, and nice.  The beds and accommodations are comfortable enough and well worth the price.  I stayed for a conference and just needed an affordable, clean, safe place to sleep.  This provided me with that.  The location is also unbeatable.",
      "rate": 5.0,
      "tripDate": " May 2015"
    },
    {
      "title": "No Bath Tub Plugs because of safety?",
      "text": "My daughter stayed at Ryerson for the month of July - she was part of the National Ballet Summer School Program which uses Ryerson as their housing.  When I went for a visit my daughter complained they would not give her a plug for her bathtub.  As she was dancing everyday she wanted to soak in the tub.  When I went to the lobby to ask for a plug they said due risk of students committing suicide they could not allow the rooms to have plugs.  Give me a break, if someone wanted to hurt themselves they could think of other ways than a tub.  I was very upset with this rule, talked  to many people at Ryerson but they would not allow a plug under any circumstances.  When I went to the store and bought my daughter a plug, the cleaning staff took it away.  Come on Ryerson, if you are advertising tubs in rooms then let the guests use the tubs!!!",
      "rate": 2.0,
      "tripDate": " January 2005"
    },
    {
      "title": "good deal",
      "text": "Stayed in Pittman residence halls for 6 nights while in Toronto for a conference.Good stuff: It was SO CHEAP! It was clean, close to good stuff & the staff were really nice. I shared a suite w/ my coworker (thus shared a bathroom with one other person). It was relatively quiet. Could have been better: I had forgotten what college dorm beds were like. They're small and hard, if you don't recall, & the pillows are worse (although I'd been warned & had brought my own; also a towel). Had to walk a couple blocks to get coffee which I really disliked. If I did it again: I'd bring a little coffeemaker (as well as my nice towel & pillow). I might actually spring for the International Living Center (across the street, more hotel like), esp if I were alone... it would have been really bad if we'd had something loud going on while we were there.",
      "rate": 4.0,
      "tripDate": " July 2014"
    },
    {
      "title": "Great value place to stay in downtown Toronto",
      "text": "We just arrived home after a fantastic trip to Toronto.  My family of 2 adults and 2 kids, along with a friends family of the same stayed at the ILLC.  Each family had a room with a pullout sofa bed, which were not as uncomfortable for me, or the kids, as others had mentioned- a sound nights sleep for the one or two nights I was in it.  The room itself was smallish but was laid out efficiently to store the far too many clothes that were brought, bathroom was perfect with nice shower to cool down after a day in the Toronto heat.  Each floor had a common room with a few sofas and a kitchen area, where we cooked on a couple of occasions and got pizza pizza in on another.  The air conditioning wasn't working properly here, but sweating was probably our own fault for not mentioning it to staff until checking out.  Staff were very friendly and courteous.  One girl behind the desk helped me connect my android device to the free wi-fi network on the ground floor (also available in the common room)Breakfast was very good, orange juice, choice of 3 cereals, fruit, yoghurt, toast, hash brown, scrambled egg, bacon and sausages.Finally, as everyone else has mentioned, we were able to walk to loads of Toronto attractions from here and 24 hour shop out front on Jarvis and an even bigger one out the back on Mutual meant that we were never short of necessities.",
      "rate": 4.0,
      "tripDate": " June 2012"
    },
    {
      "title": "great bargain",
      "text": "My stay at the Ryerson was very relaxing and comfortable.  Granted it's not a 5 star hotel, however, the staff is very friendly and helpful, and the bed was very comfortable!  There is a Metro supermarket across the street and it is a short walk to Eaton Center Mall.  I would definitely stay there again.",
      "rate": 3.0,
      "tripDate": " July 2009"
    },
    {
      "title": "Pride Festival ",
      "text": "It was unexpectedly great, the Staff are all very accommodating and nice. The 4 bedroom suite are very basic with a/c, clean facilities. There’s a big fridge, no microwave in the suite but there’s one in a common area across the elevator.",
      "rate": 5.0,
      "tripDate": " June 2018"
    },
    {
      "title": "Cheap place to stay in Downtown toronto",
      "text": "This is a student dorm room basically.    Parking is extra, had to get this from the front desk, underground.   You are not far from downtown action, basically all on foot.   The surrounding area though has a bunch of weirdos, I was accosted in the local mini mart by some guy out of blue who said I was going to burn in hell????    Aside from that experience, staff were friendly, answered any of my questions.    The bed and furnishings are basic, but they did trick.  Shower/bathroom ok level.   Basically instead of paying hundreds of $, I got this for a $100 and downtown Toronto, so no complaining.   I'd stay again if need be.",
      "rate": 3.0,
      "tripDate": " July 2017"
    },
    {
      "title": "Cheap, convenient, suited its purpose",
      "text": "I stayed here for 5 nights during an Aikido seminar. It was convenient, I could cook in the common area and use the fridge. I kept most of my food in my room. The beds were ok comfortable, they provided everything you needed for the stay. The ambient noise was quite high, you couldn't keep the window open with the air conditioning noise outside, the room did get stuffy if you didn't have the air conditioning on which was also quite noisy. I had to sleep with earplugs. Wireless wasn't available in the rooms, you had to go to the common area. If you bring your computer, bring an ethernet cable. It was ok, but wouldn't be my first choice.",
      "rate": 3.0,
      "tripDate": " June 2015"
    },
    {
      "title": "A great place to get some rest",
      "text": "I was here in toronto because my husband was in the ICU at St. Michaels hospital. There was not a hotel to be found in the city at the time. I was directed to Ryerson and couldn't have been more grateful. For $90 you got a clean room and a hot breakfast. The rooms are plain but clean and were more then adequate for my needs.It was quiet and the people were very friendly.",
      "rate": 3.0,
      "tripDate": " June 2014"
    },
    {
      "title": "Good location nice people",
      "text": "The location is close enough to walk to some destinations and only a few blocks from eaton centre and the subway. Rooms are small and old, but clean. There are full kitchens on each floor with fridge, sink, microwave, and stove, but NO pots and pans. Save some big money by bringing and old pan and a few forks and spoons and shop at the very nice metro grocery that is right out the back door. After spending 60 + dollars to eat every night for 4 people, it would have been nice to just eat in once in a while.Breakfast was part of our stay and it was the exact same thing every day. Sorta wet scrambled eggs, limp bacon, hash brown triangles, sausage links were hot. They had cold cereal, juice,  yogurt that was unsweetened and toast. Got old after a few days. Quality was ok. The desk people are terrific and made the stay enjoyable.The small tv in the room has no remote and few channels, just saying.Overall the price made the stay more attractive, but the I,d hotel needs some updates for sure.",
      "rate": 3.0,
      "tripDate": " June 2013"
    },
    {
      "title": "Decent for the price, service could use some work.",
      "text": "I stayed with my brother for 4 nights here. The room was certainly bigger than I expected, but I've never been in a dorm before.The room wasn't sparkling clean, we even found an open bag of nacho chips in one of the cupboard (but by the looks of it they'd only been there a day or two at most). That didn't really bother me, as there were no bugs or stains in sight. There was some noise from some kind of construction/renovation happening on the floor above, but it always started late in the morning and stopped early in the evening.My only real problem was that although they'll advertise that they have rooms for multiple occupants, they only allow 1 key per room, and as my brother and I were doing our own separate things all day, I had to hold onto the key and run back when he needed to get into the room. Another little thing is that while they did have a decent sized closet, they didn't include any hangers, not even a couple cheap wire ones. Also, while not a real problem, I was a bit annoyed that they only had one internet outlet, and it was in the bedroom, not the living room that had a proper desk.The continental breakfast was okay I guess, but every time I went they had all jelly and no peanut butter, and the one time they did, the toaster stopped working, so I couldn't thaw the partially frozen bread. The fruit was fresh tough, along with the juice and pastries.Overall, the room itself wasn't bad, it was mostly the 1-key-per-room thing that really bugged me. Due the the location and price, I'd still come here again, but maybe with a travel buddy rather than just someone to split the bill with.",
      "rate": 3.0,
      "tripDate": " July 2010"
    }
  ]
}