{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Saint Lawrence Residences & Suites",
    "url": "/Hotel_Review-g155019-d293179-Reviews-Saint_Lawrence_Residences_Suites-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "1.5",
      "reviewCount": 77
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "135 Jarvis St",
      "addressLocality": "Toronto",
      "postalCode": "M5C 2H6",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/03/e8/a5/04/saint-lawrence-residences.jpg?w=500&h=-1&s=1"
  },
  "description": "Located in the heart of downtown, St. Lawrence Residences & suites is designed to handle all accommodations-leisure travels, business travels, extended stay or student housing. Our rooms are moderately priced and includes amenities such as: -air-conditioner - Color TV -Free wifi -Microwave -fridge -double cook-top -pots, pans & dishes. -Linens and towels provided Dining table or love seat or both depends on room configuration. Guests are welcome to use common kitchen and bathroom. Laundry facilities are within the premises. Phone in the lobby is free for local calls, Free Wi-Fi available all over the property. The dishes, pot and pans are yours to use at no extra charge all we expect is clean dishes, and pots & pans, for the next person. We offer accommodations geared to budget minded travelers. The Linen is provided Free for a limited time and includes bed sheets, pillow cover, blanket or comforter, and a bath towel, Limited secure parking available at property for $35 a night. Neighbourhood unsecured surface parking at reduced rates may be searched A 13% HST & 8% sundry charge is added to room charges etc. Our front desk hours are 2:30 PM to 6:30 PM, Monday to Saturday. Sundays closed. Please contact us 48 hours prior to arrival, by email. Check out time is 11:00 AM House keeping service if required No pets allowed No smoking in the building",
  "featues": [
    "Parking",
    "Internet",
    "Non-smoking hotel",
    "Air conditioning"
  ],
  "reviews": [
    {
      "title": "DONT BOOK HERE",
      "text": "Booked a suite and got something much less, called me four times while I was at a concert and threatened to throw my friends and I stuff into the street. Had to leave our 380$ concert early to get our stuff before he threw it away. Room was gross and over heated, terrible customer service. Pushed us aside for someone who spoke the same language as him. Absolutely the worst hotel/customer service I’ve ever experienced. It’s in a super sketchy part of town yet, deemed safe. Don’t book here unless you expect bad customer service and bad rooms/bad area. DONT BOOK HERE",
      "rate": 1.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Had an awful experience at St. Lawrence Residence",
      "text": "We booked the St.Lawrence for three nights in July, 2005 after having read one very positive review on Trip Advisor.  It seemed reasonably priced and from the pictures and description it looked as if it would meet our needs. We are experienced travelers, not needing luxury, but wanting the basics ( like a private bathroom and airconditioning during a 90 degree heat wave). When we arrived at the front door I was immediately concerned. It looked more like a homeless shelter or a student hostel than a hotel. It had no lobby or front desk but a note on the door said to go down to the basement where a man sat behind a counter ( in an unfinished basement) fixing some kind of utility)  He wouldn't show us a  room until we produced a credit card and a photo id....he then ran the charge through for three nights. Then we were led to a room and shown the shared bath in the hallway.  We said we understood that we had our own bath.  He then led us to another floor and showed us what he said was the delux suite.  It was very small, like a college dorm room but it did have a bathroom and an airconditioner.  On returning to the basement the man fixing the appliances said we could have that room for double the price we had contracted for..which was about $120.  We said absolutely not, if we wanted to pay that much we would go to a regular hotel.  He then offered us a 10% discount.  By then we just wanted to leave.  He turned in the VISA charge for three nights.  The hotel policy was if you concelled three days in advance there would be a 10% penalty...but we had only booked it three days before and the pictures and description were very misleading.  We left and found a perfectly clean, acceptable chain hotel for less than his \"deluxe suite\"....Travelers should know, by the way that the framous booking agency we went through did nothing for us when we complained.  So only stay there if you are on a very, very tight budget, used to dorm living and don't mind a rather dicey area with no security whatsoever....front door was open and no one was in what passed for a  lobby.  It was the worst travel experience we have encountered several years of visiting many countries on a fairly slim budget...Forewarned is forearmed ...or something,.",
      "rate": 1.0,
      "tripDate": " July 2005"
    },
    {
      "title": "Do Not Give Credit Card Info To THIS PLACE!",
      "text": "I booked what I thought was a great \"hotel\" deal on Expedia and when I found out that it was a hostel,(on the internet), I tried to cancel the reservation. Expedia told me to take it up with the 'hotel'. I called the place and a man answered the phone,\"Hello?\" I asked where did I call and the man rudely asked,\" You don't know where you call?\" I told him to cancel my reservation and he stated to hold and he never returned to the phone.I showed up,( two days later) Sat. night about two in the morning to a scary building in downtown Toronto on Jarvis St. No one answered the locked door. I wound up looking for a hotel at three in the morning in  downtown Toronto. And to top it all they charged me over 200.00 US for the room I did not use. I have notified the FTC and other officals.Please...do not let this happen to you.",
      "rate": 1.0,
      "tripDate": " October 2005"
    },
    {
      "title": "What a dump and the owner is rude and a thief",
      "text": "My sister-in-law and her fiance rented this \"hotel\" (which is really a seedy hostel). They were there a week until the guy wanted to suddenly charge $100 a night for such a dumpy room. He also owes them money for deposit and wouldn't return it. There is also no way of contacting guests. We were desperately trying to reach them and couldn't. All phone calls go through the deskperson (who is also the owner) and he is extremely rude and won't pass on messages and hangs up on you. The place doesn't even remotely resemble the photos. You will get ripped off. And your loved ones will become worried about you when this guy won't let you speak to them or leave messages. There are plenty of nicer, equally-affordable places in the area. This is what they decided to do.",
      "rate": 1.0,
      "tripDate": " November 2005"
    },
    {
      "title": "A great place to stay in downtown Toronto - very affordable",
      "text": "It was  just a coincidence that I dould this place.  I was going to to TORONTO for a months training at the headoffice of my employer.  I looked all over but found nothing at a reasonable price, close to my headoffice that I could book.  Then I found this place, ST. LAWRENCE RESIDENCES AND SUITES.  WOW, a nice comfortable bed to sleep, a kitchenette for cooking, and my own washroom with shower.  Seeing over places at over a $100.00 a night, this was unbelieveable, only $75.00 a night.  Nothing came close to it a fully furnished studio right in Downtown Toronto, and it just a short walk Bay and King, the place of my work.  Though I was not expecting much, but it turned out to be a great stay in Toronto.  While there, I enjoyed a few shows in the nearby theatres, as well as a great game of Raptors at Air Canada Centre.  Food.  It was just heaven, such a great variety of restaurants, and walked to every place, they were all so close.  I will definitely recommed this place to anybody who is visiting Toronto on a budget, for few days, or few weeks.  MOE, the manager, even fixed me up with a highspedd internet connection.  Reetika, his assistant provided me with all the pots, pans, and cutlery. They didn't even charge me for the internet connection, or may be they just forgot",
      "rate": 5.0,
      "tripDate": " March 2005"
    },
    {
      "title": "Good room, but overall experience was negative",
      "text": "Good aspects: Room is clean and organized, and has a good, clean bathroom. It seemed to have been recently renewed, and had an equipped kitchen.  Location is good, close to the Younge and Dundas Streets.Bad aspects: Reception hours are terrible - it`s only open a couple hours a day. Since we arrived at the hotel outside those open hours (5pm on a saturday), the manager was extremely rude to us. At night, we noticed that the heater in the room was not working. The room was just freezing cold!!! There wasn`t any hotel staff anywhere to help us, and the phone that the manager gives the guests was obviously off. We could only sleep after we turned the burners on to try to boil some water and warm up the room. Even like that, it was a bad night of sleep because a little after we turned the burners off the room became cold again.You might find good reviews about this hotel because the manager offers to pay CAD5 per positive review that the guests write about it. If you still want to go to this hotel, check reception hours and plan to arrive when it is open. Check if everything in the room is working ok, because after those hours you are not going to find anyone to solve your problem.",
      "rate": 2.0,
      "tripDate": " March 2011"
    },
    {
      "title": "Rude Owner.. Crappy Place..What A Dump!!",
      "text": "Worse place I have ever stayed in my life. What a dump. I do not even classify this as a hotel, suites or residence for that matter. The owner guy was rude not understanding at all. The place is very ghetto to say the least. I recommend to any and all people to stay away from this place if you do not want to be sorely disappointed.",
      "rate": 1.0,
      "tripDate": " August 2007"
    },
    {
      "title": "Owner is a Cheat, Very rude, Unprofessional. Worst Place to stay",
      "text": "Never ever give your credit card information to the owner of this crappy hotel. He will rip you apart! He charged me 100s of dollars claiming telephone charges !!!   He is extremely rude and has no professionalism what so ever. He doesnt hesitate to hang up on you, if you try to ask for justification. He will charge you for each and everything, without even discussing it with you.Be very careful!  Dont recommend at all.",
      "rate": 1.0,
      "tripDate": " September 2006"
    },
    {
      "title": "Low class hotel",
      "text": "Do not book with this hotel unless you can handle very rude and unprofessional management.  The owner/operator claims that being a small business excuses him from common courtesy and customer service but it does not.  He will hang up on you.  He will ignore you.  He will hide behind the obnoxious “legal terms and conditions” and do everything in his power to make money off of you while providing as little value as possible.  That is his idea of a running a business:  money first, customers second.  If you wish to support this type of business go right ahead and book, but you have been warned.",
      "rate": 1.0,
      "tripDate": " August 2006"
    },
    {
      "title": "An awful experience",
      "text": "I had booked a room at this particular hotel through hotels(-) and after reading all the reviews cancelled it the very next day well in advance to what hotels(-) 's cancellation policy is, yet the manager had charges me $700 dollars to my credit card. Now I have disputed the charges with my card company. I am seriously thinking of filing a law suite with this manager if I dont get my money back . The manager is a theif.",
      "rate": 1.0,
      "tripDate": " July 2006"
    },
    {
      "title": "Crappy hotel",
      "text": "Old, decrepit and generally just bad. The price was too high for such a bad place but everything else was booked and i had to go for business. Tenting would have have been a step up. Who charges $15 a day for TV on an old CRT type TV on top of $137 a night?",
      "rate": 1.0,
      "tripDate": " July 2016"
    },
    {
      "title": "This will be the worst hotel experience of your life!",
      "text": "I booked this room through Hotels.com which in itself has been a horrible experience. We discovered that the hotel is located in a drug dealer and hooker infested neighbourhood and decided to cancel our reservation which we were unable to do. Save your money or give it to one of the many homeless people in the area, you'll feel better about yourself and it will be money better spent.",
      "rate": 1.0,
      "tripDate": " August 2014"
    },
    {
      "title": "Great value, great location",
      "text": "I've read some of the reviews below and have to say that people have been really unfair regarding this hostel. The proprietor was an easy going, straight forward guy - not rude at all - actually very funny and easy to get along with. It’s rare to see people in the services work that hard to please guests – so we appreciated this having come from backpacking around Europe.  As backpackers we were looking for value. We had the flexibility of cooking in if we needed a break from eating at restaurants which we really enjoyed. It was great to meet other guests at the hostel in the common area. Really relaxed vibe. Clean, simple, cheap. That's what we needed.We were so close to all the major sites in the city - couldn't have asked for a better place. St. Lawrence Market was literally down the street - it is an awesome farmers market - highly recommend!Overall - we would definitely come back to this hostel next time we're passing through Toronto and will recommend it to friends.",
      "rate": 5.0,
      "tripDate": " March 2012"
    },
    {
      "title": "Clean with complimentary internet and snacks!!!",
      "text": "Me and my girlfriend stayed at the St. Lawrence for 4 nights in July 06. The Location of the accomodation was great and within easy reach of all the attractions Toronto has to offer.The room we stayed in was very small, with one double bed, cable tv, refigerator and air conditioning - but there was little space for us to store our suitcases and bags and there were no window in our room - but a skylight above the bed. There is a clean communal kitchen that offers complimentary drinks and snacks (tea, coffee, water cereal etc) and suffiecent dining and seating areas. There are also loads of bathrooms and showers too choose from, which were always kept in a clean condition. There was also unlimited complimentary internet outside our room, which is never a bad thing!!!The residences and Suites is also very safe, there is an outside lock to get into the building, then a key code door that lets you in to the floor area and sufficient key locks for our room.",
      "rate": 4.0,
      "tripDate": null
    },
    {
      "title": "Can I give a zero? Please don't stay here.",
      "text": "They will try to take as much money from you as they can. Don't believe the rate they give you. Don't believe them when they say you can cancel with 3 days notice. I beg of you to go anywhere but give these awful people your business. The U of T residence is cheap (and nice ppl) in the summer. Or go to a hostel. Or sleep on a bench. Cause that would be better than letting them have any of your money!",
      "rate": 1.0,
      "tripDate": " May 2018"
    },
    {
      "title": "Annoying",
      "text": "I stayed last minute for $120 something for one night. No lockable doors on one of the shower rooms, hair dryers didn't work, but no water in any of the showers so that didnt matter anyway. Wifi didn't work. No staff in the messy office to talk to.",
      "rate": 2.0,
      "tripDate": " June 2017"
    },
    {
      "title": "Disgusting Cesspool - thieves",
      "text": "To start its a paper thin room within a hallway upstairs.  No working toilets and filthy showers.  There is only 1 exit and you have ZERO privacy.  Can't forget to mention that part of the floor is sinking in and unsafe.  Don't walk past the couches on the 2nd floor.  You do not have a bathroom.  You can use a locker-room type of bathroom which is carpeted and moldy. OR a smaller bathroom with toilets that don't work and have feces left in them for god only knows how long.  Camera everywhere yet no one around to accommodate us.  No towels to use. Not that I would use them. NOTHING WAS CLEAN.  Linens were stained.  We slept in our clothes.  When we left I have accidentally left my turtleneck in the room.  We lefty and had to drop the keys in a drop box, no one was there.  I called Monday morning and they said it was not there.  Then it was thrown out.  They said I hadn't called in 24 hours so it was considered garbage.  It was a new (worn 1x) Le Chateau shirt.  It was not garbage, it was a clean white shirt.   There is so much more to say about this place.  But they are not worth another minute of time.  DO NOT STAY HERE!!!!",
      "rate": 1.0,
      "tripDate": " November 2016"
    },
    {
      "title": "Toronto's dark, dirty, dingy secret",
      "text": "Scary neighbourhood and poor management. Photos make the place look decent, but OMG, the reality is something else. Uneven floors, warehouse style. Hallways freaked me out. Rooms grubby and pretty dates. Wish I could say something nice but it is difficult.",
      "rate": 1.0,
      "tripDate": " February 2017"
    },
    {
      "title": "Just unfortunate",
      "text": "we had a last minute trip to Toronto and it was a busy weekend so most places were packed, this was the last one on booking.com. It was so awful. We said we could deal with a shared bathroom, but this one had too few for the number of rooms on the floor, there was a queue outside. The bathroom, hallways and common areas were not clean, and the shower areas were not cleaned after every use. It is nothing more than a student/ backpacker dorm, don't be fooled. Worst value for money ever -- was so expensive for what we got. Glad we had to stay just one night and the following morning we dashed to get out of there.",
      "rate": 1.0,
      "tripDate": " May 2016"
    },
    {
      "title": "Very Suspicious Activity.  DO NOT A STAY HERE.",
      "text": "The owner wanted a \"preapproval\" of $94 extra to the hotel charge, and wouldnt allow me to stay otherwise. Also he wanted numbers of both of my credit cards. Even though no damage was done to the property he started to withdraw the $94 from my account. Only because I noticed it and told him to stop that it didnt get withdrawn. THEN a month later my bank rings me to tell me that someone in Toronto is trying to steal money and closes the card.  This is the only place I stayed in Toronto where I used a card.",
      "rate": 1.0,
      "tripDate": " August 2014"
    },
    {
      "title": "very poor",
      "text": "Do not go to this hotel. The room was very small and crowded with run down furniture, one tiny window to open for a little fresh air as respite from cooking smells. The room was grubby, although shared rooms not too bad. Worst was over charging. Price on internet reasonable, but charge made for changing us $ to CAD but booking was on mastercard. Other charges then too high, very  unhappy.",
      "rate": 1.0,
      "tripDate": " September 2013"
    },
    {
      "title": "Bad Bad Bad",
      "text": "Luckily we only had booked this room for one night. Being a Canadian myself, I was expecting a minimum standard for a rented room (120$/night) in my own country. The lobby is surely a good preview of the room you're gonna get. A chaotic space where you can find anything piled up  . Our room was smelly (mothballs), without a window (but surely with a 5 meters high ''skylight'' impossible to be opened) with two holes in the wall (one for a high window connecting with the corridor, the other for a A.C. who takes the corridor air to furnish the room.) I must say I'm not even sure this is legal...stale air shared by everybody as ventilation for the room... Then the shared bathroom's roof was about to fall out and held up with a stick. Well I would compare my experience to the ''hotels'' I was renting during my trip in South East Asia (40 times the price though) and without the included breakfast. I found myself really stupid for not looking on trip advisor BEFORE renting a room at this «place».",
      "rate": 1.0,
      "tripDate": " August 2013"
    },
    {
      "title": "do not trust this guy with your credit card.",
      "text": "My boyfriend and I had been travelling in south america and returned to canada to activate our working holiday visas (we're Irish), the weekend our flight arrived into toronto happened to be an incredibly busy weekend, gay pride, canada day and some other kinda international day (im sorry for not knowing the name). All accomodation was booked up except for this place and we thought we were really lucky but realised after we were wrong. we booked 3 nights at at $ 224 (alot i know but it was a busy weekend and we were desperate). We then phoned the manager and asked for another 3 nights as we were searching for a more permanemt residence, The Manager/Owner told us that this was fine and we would be charged the same rate from when we booked in ..('exact words'). a week later as we had extended our stay further, as we looked for apartments we realised that he had carged our credit card  $200 more than the first rate. We rang him immediately and he told us that july was a higher rate than june ... which was completely contrary to what he had said when we first wanted to extend our stay. We were gutted as were on a pretty tight budget and this guy had totally decieved us. We ended up being charged for $90 plus 21% tax a night instead of $55 even though 'hostel bookers.com' had quoted cheaper for those dates and we were helpless as he had our credit card details. Please do not stay at this place with this guy... and please please do not trust him with your credit card details because you will not know the true charges until its too late.",
      "rate": 1.0,
      "tripDate": " July 2012"
    },
    {
      "title": "Nightmare on Jarvin street",
      "text": "what to say... BE AWARE !!! crappy place... hidden charge to your credit card... Poorest plac e of Toronto with homeless all around the hotel... Parking in front of the hotel is a trap for your car with broken glasses the second night... don't go there!!! The beds are not CLEAN !!! Service is rotten... RUN FROM THIS NIGHTMARE !!! Try a best western hotel at 15-20 minutes of downtown instead... for 50$ more, you will get the bang for the buck...",
      "rate": 1.0,
      "tripDate": " August 2008"
    },
    {
      "title": "Worst costumer experience i had in over 60 countries",
      "text": "I hope this will stay as the WORST costumer experience ever! We had booked a room for one night to see the Mapple Leafs hockey team play at Air Canada Center. After waiting a long time for the receptionist to come (we had to wait 20 minutes despite the reception being within opening hours), we saw that there was a price difference between what the booking said we will pay, and what he wanted to charge on the credit card, and asked what is this difference about. The guy went ballistic, saying that we should go somewhere else if we have a problem with such a small difference of price anyways, and that we don't appreciate the offer. There was no way to interrupt him as he was in a tirrade of verbal aggression towards us. Prior to that, they took a scan copy of my credit card, saying that this is normal, despite me protesting that this not a practice anywhere, and I've tried hotels and guest houses in over 60 countries on all continents. Now I am monitoring my bank account to see if they are trying to misuse my credit card.Stay here only if you are on the tightest possible budget and can tolerate the worst costumer service I ever experienced.",
      "rate": 1.0,
      "tripDate": " April 2018"
    },
    {
      "title": "Is there a rating lower then one?",
      "text": "I would first like to point out that normally when you give a bad review of a hotel you will see comments from the manager apologising however if you read the comments from this manager it is very clear what kind of service you will be given.  The hotel ( for lack of a better word ) or perhaps the word dive would be a better fit is in a terrible part of the city. The manager, Muhammad is extremely sketchy and the building itself should be shut down.  When booking the room they tell people there is a bathroom however at check in your told it is an additional 60.00.The entire room isn't worth 60.00 much less the 160.00 that I was charged. There is also a sign on the door stating an extra 25.00 if you don't leave the room \"made up\" which leads to the question does the sheets not get changed, or bathroom cleaned after each guest? Oh, and lets not forget the tv didn't work and there was no heat. If you are considering staying here DON'T. In hindsight I would have felt safer and been more comfortable had I stayed on a bench in the middle of the subway station. ..and now as in all the other posts that gave a negative  (and they were ALL negative ) review I Am sure you can scroll down and see some type of nasty response from Mr. Mohammad . He really should realize that he response to the opinion of his customers just goes to prove that the comments are all true. I am not from Toronto but I have to wonder and in fact do some researchto see if there is not some type of guidelines in place that can get this hazard shut down! !",
      "rate": 1.0,
      "tripDate": " February 2015"
    },
    {
      "title": "Avoid this place - overpriced and rather nasty",
      "text": "This is priced at about double the price of equivalent places. Its handy for downtown places but other than that it is exceptionally bad value. The owner doesn't turn up on time for  guests- he did for us but I saw many people waiting over an hour for him to turn up. We had a blocked toilet within a day which flooded the bathroom and he blamed it on us and started shouting at us ( we unblocked it and it wasn't our fault). Worse, he is seldom there in case of such emergencies. There only seems to be him there, for a few hours a day so if you lock yourself out or something, that's it. The accommodation is cramped and typically low hostel standard, which isn't too bad if you're not paying these high prices.",
      "rate": 1.0,
      "tripDate": " August 2013"
    },
    {
      "title": "I loved the place",
      "text": "What a hidden gem. I was looking for budget place to stay in downtown Toronto and came across this place.  The prices were good, the location was excellent.  I booked a deluxe double room, for me and my girl friend.  The room was small, but comfortable.  It had a TV, fridge, and even a microwave oven.  Microwave really came in handy to make morning coffee, and to heat the food.  One minor inconvenience, the washroom was shared but it wasn't too bad.  There were plenty of washrooms and they were clean.  To compensate there was shared, full kitchen, that my girl friend found very handy, to make quick meals for both of us.  It was inexpensive, and quiet.  Mind you it did not have all the facilities of a big hotel, but we didn't have the time to use them, even if they had them.  Truly, I was a bit scared, there were some reviews that cautioned, but I took a chance, and I am glad I did.  For us, it was just right, at a good location, quiet, and cheap.   I have no hesitation to recommend to anyone who is looking for quiet luxury.",
      "rate": 4.0,
      "tripDate": " January 2006"
    },
    {
      "title": "DO NOT STAY HERE!! WORST HOTEL OF MY LIFE SCAMED ME OUT OF MY MONEY",
      "text": "WORST HOTEL EVER THEY WILL SCAM YOU OUT OF YOUR MONEY. This hotel feels extremely unsafe. Terrible neighborhood, bars on the windows. I got to the hotel and checked in around 10 pm because my flight was canceled. I found out the door was locked and I had to bang on the door. The night manager or possibly owner said \"you're lucky I'm opening the doors for you I usually keep them locked after this time of night.\" . The hotel was suppose to charge $100. The hotel charged me $268USD. I asked the hotel manager why this was he told me I was confused and didn't understand how currency worked. Which is extremely wrong. This hotel is in business to scam people out of their money. The room had a terrible smell to it. There was a phone but the phone was not connected to the wall which is illegal in the US I'm not sure about Canada. The shower had broke titles exposing the hollow wall. In the hallway there is 1 ironing board for all the rooms. Also there is a creepy stair case to the basement. I'm not sure if there are basement rooms but it would not surprise me. All and all this is the worst hotel I have every stay at in my life. It should be shut down.",
      "rate": 1.0,
      "tripDate": " July 2016"
    },
    {
      "title": "WORSE THAN SLEEPING ON A STREET",
      "text": "This place is disgusting. Additional $25/day for cleaning, $15/day for tv. The rooms are smelly, the air conditioners are loud, furniture is stained, the lobby looks like a crappy janitor's closet, they couldn't print a receipt for me, it took forever for them to email it after I asked. If you book with expedia you'll be charged in American dollars (surprise!)This is an expensive flop house, not a hotel.",
      "rate": 1.0,
      "tripDate": " September 2016"
    },
    {
      "title": "Not ok for Female Travellers. Unsafe",
      "text": "No issues with the room itself, (air con isnt working but thats ok) But i was using the shared bathroom, door was locked and as i was completely naked about to get into the shower a Guy managed to open the door. I screamed and he left. When i locked it again i noticed that u are able to Push down really hard and the door comes unlocked. While i desperately needed a shower, i had my shower and midway through the shower the lights went off. Terribly Scary and Unsafe. Please get in touch.",
      "rate": 1.0,
      "tripDate": " July 2016"
    },
    {
      "title": "Straight from a horror movie...",
      "text": "This place filthy, they charge and extra 25 dollars to make your beds and clean room.  When my friends arrived, the elderly gentleman (if you can call him that) behind the desk proceeded to answer phones and deal with everything else but my friends... that would have more noticeable save for the smell of garbage, curry, B.O. and musky.  Oh wait, it gets better, or should I say worse.  When our friends arrived in their room, there was garbage in the closet and in the drawers, the mattress was stained and the bed was moist (yes... moist).  I hate the word moist, but that's the best way to describe it.This is like one of those hotels you see on trivago or hotels.com with Captain Obvious saying 'you should not stay here'.In this instance, I truly wish TripAdvisor had a zero rating.  You've been warned.",
      "rate": 1.0,
      "tripDate": " August 2015"
    },
    {
      "title": "Stay away",
      "text": "I found myself stranded in Toronto looking for a reasonable hotel. I booked through Expedia which I guess was my first mistake. At first the representative asked me if I would be comfortable in a dorm, and I told him absolutely not. He then went on to tell me about St. Lawrence suites. I specifically asked him if this was a dorm or a hostile he told me no it's a hotel. He told me the price was $70 plus tax. When I arrived there I discovered a very small cramped office that the manager took an hour and a half to check me in, The room came to $100. The manager then gave me a key and access code to go upstairs to my room I was horrified when I open the door to my room and discovered there was no bathroom in it. I went back to the office to speak to the manager he then told me if I wanted to bathroom that would be an extra $60. At first I said no but then I couldn't picture myself getting up through the night And going through the halls of this disgusting hotel to a shared bathroom with the sketchy residents that lived there . So I paid the extra money for the  room with the bathroom that was now $160 room. This room had no heat the manager brought me a small space heater, which barely heated the room at all. there's no security in this horrible place at night I slept all night with the chair up against my door.  He claimed the TV was brand-new although I could only get one channel on it. He spent an hour in my room playing with the remote trying to fix it but ended up doing nothing. Then told me I  probably wanted to go to sleep and wouldn't need to TV anyway. This place is deceptive and disgusting and it was a horrifying night spend laying awake being scared to death",
      "rate": 1.0,
      "tripDate": " February 2015"
    },
    {
      "title": "Horrible. Horrible!!! Stay away from this place.",
      "text": "The place is a dump. It's very old and dirty. All of the photos you see on the website are really far from reality. My room was really tiny and stuffy, and when I turned on the AC the noise was just unbearable. The door was flimsy and the hallway light comes through... My pillow looked very anorexic and the sheets smelled funny. Wasn't even able to shower since someone dumped food in the shower. What a torture! I stayed only one night instead of two as planned.Neighborhood is fairy central but very sketchy. The owner is rude and unprofessional. Doing self-check and following his mumbling and unclear instructions on my cell (and I don't really have a long distance plan) was a very pleasant thing. My phone bill would be huge!They should totally close down that dump. Stay away from this place!",
      "rate": 1.0,
      "tripDate": " June 2013"
    },
    {
      "title": "Very expensive, bad experience",
      "text": "I'll try to describe my personal experience, I just stayed in this residences one week, in a small baseman room, no direct light, very dark (at 2.00 pm. seemed to be mid-night) with a tinny little kitchen and a small bathroom, the bed was comfortable, the sofa was ugly and dirty, in need of new covers. For this room I had to pay $700 per week!!! And since we had to stay one extra night and we paid $150. Imagine almost a month rent!! When we asked if we could move to a room with more light the manager told us that it was more expensive... unbelievable!! They were charging us is like a hotel when is not. I thought this was normal because I was new in the city but is not, this place is in downtown next to a shelter, it should be cheaper. Even though the manager was always kind with us, I would not recommend this place at all, better find a real hotel or an apartment for this price.",
      "rate": 2.0,
      "tripDate": " October 2012"
    },
    {
      "title": "Stay away!",
      "text": "This 'hotel' was terrible.  There was no hot water in the morning and despite calling them and letting them know, there was still no hot water 8 hours later.  Our tv didn't work even after they worked on it.  Generally the place was shabby and the mattresses were well worn despite the website's claim of being new.  This place wasn't worth half the price.",
      "rate": 1.0,
      "tripDate": " July 2012"
    },
    {
      "title": "Review Saint Lawrence Residences & Suites",
      "text": "Just some comments:- The heating did not function. It was freezing cold in my room. Only after three days I was offered a small electric heating.- The first two days I did not have any warm water.- The room was not clean. Especially the floor needed desperately some vacuum cleaning.- It is not the best neighbourhood, but that was not a real concern to me. Just depends on what your plans are.- The man at the reception was friendly. I don't suppose he was responsible for the poor condition of this hotel? He helped me to get a tourist trip as well as an electric heating (after my repeated complaints about the cold).",
      "rate": 1.0,
      "tripDate": " March 2012"
    },
    {
      "title": "Never Again!!!! Terrible Management with Terrible room",
      "text": "I dont know where to start with this place, I felt I was staying at a buddies crummy apartment rather than a cheap hotel. location is horrible, only thing within wakling distance is a gas station and a bus stop to get outta there, room and beds were disgustingly small..I'm six feet and my feet were hanging off the bed, one very dim light in the bedroom, 10\" T.V. from 1995, stained carpets and floors, rat traps in the corners of the hotel, shared bathroom which was 30 feet away from my room, Its better to use a washroom in the convienience of your own room, no amenities, and management was terrible.",
      "rate": 1.0,
      "tripDate": " December 2011"
    },
    {
      "title": "Not hotel but hostel, nobody at the office",
      "text": "This place is not the hotel but  a hostel. If you take up with that you ok.  There was missing button on air conditioning in my room but I had no chance tell it to the manager - he never appeared in the office. The blanket was quite ugly but fortunately bed sheet was enough  because night was hot. Carefully arrange your arrival out of front desk hours and do not give the signed paper to the notice board - I did, paper somehow disappeared (I hope nobody enjoys my credit card number printed on it) and later I obtained an abusive mail from the manager (\"You ought to be ashamed of yourself\").Never more.",
      "rate": 1.0,
      "tripDate": " June 2009"
    },
    {
      "title": "Stay Far Far Away!!!",
      "text": "Absolutely the worst hotel I have ever seen. Before arrival I received a phone call from the hotel manager asking when we would be arriving as the front desk was to close at 6PM. After explaining to him that we live 3 hrs away and the weather was bad the manager seemed put out that he had to wait for us.After we checked in and looked at the \"room\" (More like a closet with 2 small beds crammed into it) we realized their was no bathroom in the room. When making my reservation I specifically asked to have a bathroom in the room. There was one bathroom per hotel floor which everyone is expected to share. After explaining to the hotel manager that this was unacceptable and not what I booked he proceeded to tell me their are no refunds. After an hour of arguing and a phone call to the police he then offered to refund me 2 out of the 3 nights that I had booked and Hotels.com would issue me a credit for the balance. At that point we just wanted a nice hotel and a worm bed so I accepted that offer. This man is a crook and a thief. The hotel was dirty and very sketchy. Stay far far away. Do not book here you will get ripped off.",
      "rate": 1.0,
      "tripDate": " March 2014"
    }
  ]
}