{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Salmon B&B",
    "url": "/Hotel_Review-g155019-d20260331-Reviews-Salmon_B_B-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.5",
      "reviewCount": 2
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "224 St Marks Rd",
      "addressLocality": "Toronto",
      "postalCode": "M6S 2J2",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/29/b4/32/1c/caption.jpg?w=500&h=-1&s=1"
  },
  "description": null,
  "featues": [],
  "reviews": [
    {
      "title": "Nature in the city ",
      "text": "The Salmon BnB is in a great location. Very peaceful and tranquil, yet so close to the city. You can walk to the river either end of the street.The rooms are small, but very clean and comfortable. Plus the lounge area, deck and yard where you can sit or relax.I really enjoyed my stay. Garf is a most obliging host.",
      "rate": 4.0,
      "tripDate": " August 2023"
    },
    {
      "title": "A breath of fresh air",
      "text": "It is rare that I review a place an hour after checking in, but the Salmon Guesthouse is special - after staying in several downtown hotels that were either awful or ridiculously expensive, this place is like a breath of fresh air, literally and figuratively.The location is superb. Don't let the low walkscore on tripadvisor discourage you - it's computer generated nonsense, because while yes, it does take 20 minutes to walk to the subway and to most of the shopping and dining options, but it is an absolutely beautiful walk through the forest or along the river; there's a hiking trail as well as a flat, paved pedestrian and bike route depending on what you prefer. During the winter I would also recommend this place if you're into cross country skiing but also want to be close to downtown - it really is the best of both worlds here, and unlike the parks closer to the city center, there are no homeless camps, no litter, no annoying bylaw enforcement officers. Travel time to yonge and bloor in downtown Toronto is 30 minutes by car or by train + a cheap 5 minute Uber... Or 50 minutes if you walk to the train station (Old Mill; it's on line 2 which goes all the way across the city from East to West)The room itself is very nice and comfortable, and there's a shared living room and kitchen area for guests - since there are only 3 guestrooms you will likely have the common area to yourself for a significant portion of time. Depending on the room you get there's either ensuite bathroom (1 room has this) or shared bathroom which is shared between the other 2 rooms - I got the shared bathroom option to save money and I'm perfectly happy with it... It's nothing at all like a shared bathroom at a hostel, the host is very diligent at maintaining the guest areas and he lives in a separate apartment in the basement - it's like a traditional b&b, tho I don't know if breakfast is included...I know that it sounds kinda too good to be true but I am being completely honest, and I am not personally receiving any benefit or discount for this review, the guy doesn't even know I'm writing it! Ps. Speaking of discounts, they do offer discounts depending on how you book and on the payment method you use... I received a discount at checkin just because the guy wanted to be nice",
      "rate": 5.0,
      "tripDate": " July 2023"
    }
  ]
}