{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Samesun Toronto",
    "url": "/Hotel_Review-g155019-d23926778-Reviews-Samesun_Toronto-Toronto_Ontario.html",
    "priceRange": "$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.0",
      "reviewCount": 98
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "278 Augusta Ave Kensington Market",
      "addressLocality": "Toronto",
      "postalCode": "M5T 2L9",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/26/d8/e3/aa/caption.jpg?w=500&h=400&s=1"
  },
  "description": "Samesun Toronto sits nestled in the downtown area, in Kensington Market, one of Toronto’s most eclectic and vibrant neighborhoods. Filled with copious trendy bars and award-winning fusion restaurants, a memorable night out is just around the corner, and at the end of the night, you’ll never be far from your cozy bed. If you feel like staying in, we’ve also got a well-equipped kitchen for you to cook your own meals and a TV room for movie nights. Did we mention we have free popcorn?",
  "featues": [
    "Free High Speed Internet (WiFi)",
    "24-hour security",
    "Non-smoking hotel",
    "Shared bathroom",
    "Shared kitchen",
    "Air conditioning",
    "Non-smoking rooms"
  ],
  "reviews": [
    {
      "title": "Very good alternative to Toronto's completely overpriced hotels",
      "text": "Samesun on Augusta Avenue is a hostel; so, you know that there are no private washrooms. Yet, everything else is pretty wonderful. You feel very safe in the building, the staff is extremely friendly and helpful, and you can make yourself an amazing breakfast in the shared kitchen - all ingredients provided by the hostel. As a couple we had a private room for $120/night, which is pretty amazing for Toronto. The room was clean, as were the shared bathrooms and the kitchen. Everything was very uncomlicated and the staff was always ready to help. Altogether, I can really recommend this place for people who do not mind sharing bathrooms.",
      "rate": 4.0,
      "tripDate": " November 2022"
    },
    {
      "title": "Samesun Hostel Toronto",
      "text": "I was looking for a low price option to stay in Toronto and this was the only hostel I found. So I booked it. In addition to the expensive price I had to pay taxes (which weren’t included!) For the price that I paid (over 130CAD on weekend nights) I definitely at least expected more! The rooms were small and the beds just simple bunkbeds. The lockers didn‘t have locks - they needed to be purchased seperately.  One shared bathroom and one showerroom for the whole floor. Two days the water (sink and shower) wasn‘t working on the 4th floor and the showers weren‘t very clean. Breakfast was included and ok, the kitchen not always clean. General foods as salt and oil were not to be found. The kitchen and Public areas to hang out were not cozy and very tight and there wasn‘t enough space in the morning. The place to store luggage after checking out was unlocked. It was all this little things that made me leave with a not very good and happy impression in total..The location however was central and nice, staff was nice and helpful and the beds were comfortable and clean. Free use of towels.",
      "rate": 2.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Lovely stay, great brand",
      "text": "As soon as I saw Samesun was in Toronto, I booked it.  I had previously stayed in Samesun SF a few times and have had a wonderful time each time.  So I trusted their brand.  I was glad I did.  Although not as nice as SF, it is bigger than SF's although the rooms are smaller than SF's for sure.  Nevertheless, Samesun's brand shone through.  I had the best customer service and was lucky enough to book a 4 bed woman only room.  My roomies were all considerate and although it was quite small room, I felt I had enough room to have my own corner and I had a great sleep.  They clean everyday and it shows.  The ladies bathroom was nice and clean and the room was nice and clean as were the towels and the linens.  The hangout room was basic and not as cozy as SF but it was bigger and I was able to get some work done although sometimes the people in the kitchen were loud.  The two fridges are stuffed and a bit of a mess but that'slikely because there are many people booking.  They likely need a third fridge b/c my stuff couldn't fit in the fridge but the front desk helped me with that.  They will be renovating and updating the common areas so I would hesitate to return.  It's also a bit more expensive than SF even counting the conversion and honestly $50 for a hostel is a bit too much.  Still, I\"m glad that I can count on the Samesun brand to deliver.  I felt at home and felt safe.  Neighborhood had many vegan restaurants which made me so happy.  Thanks Samesun.  Oh, one more thing the view from our window was pretty depressing as it was like a junkyard and rundown back alley , looking a bit sketch so hopefully they can clean that uup a bit so it doesn't look so sketch.  But I felt completely safe.  Glad I booked here.",
      "rate": 4.0,
      "tripDate": " May 2022"
    },
    {
      "title": "Worth the price!",
      "text": "Stayed here for 3 nights as a 21 year old solo female traveller. Stayed in an 8 person mixed gendered dorm and felt so safe. The hostel and rooms are nice and really clean. The beds are really comfortable and the bedding felt clean. There are lockers in the rooms but I didn’t even use them because I felt pretty safe to leave my stuff out. There is free breakfast in the morning with a big range of options from cereal to a hot breakfast. The kitchen is a really nice communal space where I met lots of lovely people. There are also free yoga sessions. The location is right in the heart of Kensington Markets which was the best area I saw in Toronto. I arrived here on a pedestrian Sunday and the whole street was alive with music and market stalls. But when you’re ready to crash out for the night, the rooms are quiet and respectful of the people sleeping. The staff are very kind and helpful and at the desk 24/7. They helped me figure out how to get to Niagara Falls and let me leave my bags in the downstairs storage locker for the day even though I was checked out that day. It was free but you can also pay $5 a day if you need somewhere to store your bags for longer.Things to note: there is no elevator so you need to be ok with stairs. The showers are in a seperate room to the toilets but that’s only mildly inconvenient. There are lots of homeless people and addicts on the street but I think that’s just the city in general and I never felt unsafe walking around at night alone. The aircon in our room wasn’t really working so we had a fan in there but it wasn’t too bad.",
      "rate": 5.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Great location, clean and vibrant!",
      "text": "This hostel is nestled in Kensington Market - which is a fun, eclectic location for entertainment and food. The check in process was easy and staff were very friendly. The private room was made up when we arrived (some hostels just give you your bedding upon check in, so this was nice). The hostel is very clean, they provide shampoo and soap for the showers and the doors are key cars locked for safety. While it isn’t sound proof, we found it quiet overall and the big AC units actually help drown out noise. We had a fun stay and do recommend this hostel to anyone looking for a great location and accommodations in the city!",
      "rate": 5.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Greatly located hostel",
      "text": "We spent two nights in the hostel. The location and neighbourhood is great, gives you good vibes and a big selection of food and drinks. The rooms, at least our room, are still quiet. Just keep in mind that there is no parking that belongs to the hostel. We had to park our car 10 min walk away, which cost extra.Our bedroom (1 queensize bed) was clean, but the bathrooms should be cleaned more often and soap dispenser regually checked and refilled.The breakfast was very good with a diverse selection.",
      "rate": 4.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Private room on weekend - Great experience and awesome deal!",
      "text": "We spent two nights in a private room and were pleasantly surprised at how clean, bright and well kept the hostel was considering the very reasonable price and awesome location.The bed was comfortable, the staff were friendly and helpful, the room was spacious. Breakfast that was included in the price had options of bagels, toast, waffles or cereal with a variety of milk options. Being steps away from all that Kensington Market has to offer and a 5min walk to China Town and University of Toronto, we had plenty to do and see and never even hopped on transit. We went to a show at The Horseshoe Tavern and walked home in about 15mins. Great experience, and would absolutely stay here again!",
      "rate": 5.0,
      "tripDate": " April 2022"
    },
    {
      "title": "Good location, average price, small rooms",
      "text": "The workers were nice. I had a room for 4 women, it was small. You need to bring your own key for the locker or buy it at the register desk or closest shop. Toilets and shower are clean. Breakfast was bad,  you can choose bagel or cereals, but it's understandable for this price. Location is really good, 20 minutes to Dundas square by feet or you can use a public transport, a lot of options. Normal place to stay for a couple days, if you need just a place to sleep and take a shower.",
      "rate": 3.0,
      "tripDate": " February 2023"
    },
    {
      "title": "Okay hotel but the best location",
      "text": "The hostel was quite all right. It was clean and you had a free breakfast. About breakfast: The selection was not huge, but for the morning hunger perfectly okay. A cook cooked in the morning pancakes and muffins, which tasted very good. About the hostel itself: Everything was clean and the staff was very friendly and helpful. From the men's showers came only cold water. Unfortunately there was no paper in the showers as well as in the toilets, only electric hand dryers. A hairdryer for after showers was also not provided to us. The hostel was very noisy, so you could hear room doors slamming at night, which robbed my mother of sleep. Some guests had no decency and could not pull the trigger after going to the toilet, so it sometimes stank of urine in the toilets.Location: The location of the hostel is absolutely great. The Scotiabank Arena (event hall) + Central Station and the CN Tower are nearby.",
      "rate": 3.0,
      "tripDate": " October 2022"
    },
    {
      "title": "Very good quality to price comparison option",
      "text": "Samesun Toronto is a hostel, and you should not expect hotel conditions. However, it has more than everything regular hostels have, like shower supplies in the shower area and a very good quality, varied breakfast, with the ingredients provided by the hostel. The staff was extremely helpful with everything I needed. I was overall very satisfied with my stay and I felt safe all the time.",
      "rate": 4.0,
      "tripDate": " November 2022"
    },
    {
      "title": "Pros and cons",
      "text": "The staff were so friendly and kind! The free breakfast in the morning was great! However, the bed was so uncomfortable, I could feel the springs! The balcony door was broken and couldn’t shut properly, and there was a lot of noise from the vent outside. The shower was absolutely awful and only gave a drip of water. However the hostel was very clean. There are not enough cooking facilities E.g pots and pans. The area that the hostel is in is super cool!! However, I was told by a friend who lives in Toronto that it wouldn’t be safe to walk around that area by myself at dark.",
      "rate": 2.0,
      "tripDate": " October 2022"
    },
    {
      "title": "Overall very good!",
      "text": "Really enjoyed my stay here, staff was very friendly and i loved the area. They had just opened when i was there so were some issues with check in process, keys etc but nothing that bothered me!Unfortunately i didn't sleep very well - roommates didn't show a lot of respect (of course not the hostel's fault) and bunk beds moved a lot when other person moved. If I could leave some advice for samesun it would be to please do something about the awful blue lights next to every bed. They were super bright and difficult to cover in a safe way since they were right next to the outlet. Felt like an unnecessary disturbanceThank you for an overall nice stay!",
      "rate": 4.0,
      "tripDate": " March 2022"
    },
    {
      "title": "Nice but culd be better",
      "text": "Nice staff but didn't seem very organized. We had to wait a lot for check in because they were discussing their schedule..Nice and central location with a lot of restaurants nearby, lively neighborhood and close to everything.. but a lot of drug users in the area and homeless people, which can make you feel really uncomfortable.There is only on restroom and one bathroom per floor which is not enough. The two showers in the bathroom are not private.Wifi is awful ! Disconnecting all the time and needing you yo put the password over and over again.Breakfast is simple but was enough for me.The room is nice, clean and the beds are comfy. But if you are a solo female, i would suggest you find something else. I was in a 6 bedroom with one empty bed and 5 men. It was a horrible experience, noises all night, lights on and off, bad smell etc.. I asked to change, the other room was with 2 men. No women. Overall, a lot of men there, of all ages.",
      "rate": 2.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Nice & safe place to stay",
      "text": "I stayed with Samesun in Toronto in Mars 2023. They have a 24 h open reception. The check in went smoothly, the rooms, bathrooms and showers were clean! You have a charger and a small lamp by your bed and curtains to separate yourself from the other’s. The best thing about the stay was the free of charge breakfast in the morning! Coffee, bagels, waffles, cereal, fruit etc.. so nice.",
      "rate": 5.0,
      "tripDate": " March 2023"
    },
    {
      "title": "Only good thing is the location",
      "text": "Stayed here for 6 days. In a shared 4 Bed dorm.Everything in this hostel is just the bare minimum of standards. Very crappy wobbely bunkbeds, i was surprised they didnt collapse when i climbed on the top bunk. One toilet for the whole floor, which obviously was disgusting and one time it didn't even work. Took them 3 days to refill papertowels in the bathroom.  Showers are crappy aswell, nothing to hang your towel, clothes... It would take a hook and a screw in the wall and it would make the whole showerexperience a lot nicer. 5 minute job. Nobody in their management apparently cares.I definitely would not recommend this hostel. You really get not much for your money here. But the location is great. Kensington Market never sleeps and great food in the area.",
      "rate": 1.0,
      "tripDate": " May 2022"
    },
    {
      "title": "Atrocious customer service!",
      "text": "Check in process was ridiculous.I got there, was told by the guy with the Scottish accent that there was a $100 deposit (At a youth hostel?), then that it had to be on a credit card, not a debit card. Eventually my debit card was accepted, naturally presented as a favour to me of course.  Then was rudely told that I wouldn’t be able to extend unless a separate credit card was on file, which made no sense. Later that evening I had to extend a day and the lady at the desk told me not to worry, my card was on file, and she could see I’d booked the extension on booking.com. However I’d still have to come down to check out and then check back in and only then could the payment be processed. And then they’d still have to take another $100 deposit. In terms of company policy, bizarre and unnecessarily complicated are an understatement.   However in the morning before I could go to reception the payment had already been processed. And my original deposit had been returned. Confused so far? I assure you I was. Then later in the day the same rude Scot told me he’d mentioned that I wouldn’t be able to extend without a separate credit card and shouldn’t be at the hostel. And I wouldn’t be able to extend a 3rd night. 1st, I had no desire to stay at that dump another night, and 2nd, this is how they retain customers??And if I’d turned it into a race issue, the usual defensive nonsense would have occurred. Not to worry, I’ll NEVER stay at any of the Samesun hotels ever again anywhere. And I’ll be letting as many people as I know about how customers are treated there. Good luck staying in business much longer with this attitude.",
      "rate": 1.0,
      "tripDate": " February 2023"
    },
    {
      "title": "CNice stay !",
      "text": "Great place for one night. Clean and well positioned in the mythical Kinzington Market in the heart of Toronto.  The breakfast is the cherry on the cake! Washrooms could be a bit cleaner. Could also invest in more comfy : )",
      "rate": 4.0,
      "tripDate": " January 2023"
    },
    {
      "title": "Dump on Agusta",
      "text": "This place is absolutely filthy. We stayed for three nights and were happy to leave. The private room was still dirty from the last guest with trash under the bed. The bed frame was broken. One mens toilet for the entire floor which was clogged for one of the three days. Growing mountain of pubes in the urinal. If they did clean the bathroom is was a pathetic job because the high tide poop stain was still there.  Just stay away from here unless your fine with filth for $200 a night Balcony was out of order for a bird nest/trash storage. TV did not work.",
      "rate": 1.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Location, location, location",
      "text": "Someone posted some unfair pictures! This is not how this property looks. Loved the location, cool street, easy to get everywhere you want to go. My room was clean, sheets clean, bathroom/ shower situation clean. Sheets were nice and in excellent condition. Aircondition worked great. The room next to me... the guy kept going in and out to the bathroom and just letting the door slam, woke me up. I left him a very pleasant note and he started closing it gently (at the end of the day it is a hostel I get it). Breakfast room nice, decent choices. All in all as far as hostels go, I would stay again (if I still needed to save money) and won't steer anyone away from staying here. Also front desk guy friendly. Again, at the end of the day it is a hostel BUT there was nothing what so ever that gave me the creeps, seemed gross, etc. It is well taken care of.",
      "rate": 4.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Great staff, great location",
      "text": "If you want to be in the mix of Kensington Market stay here. I didn't feel overly crowded using the bathroom and shower area. I did not use the kitchen so I can't speak to that. Beds were comfortable enough. Check in and check out are super easy. Sebastian and Far were awesome working the front desk.The only con was Wifi didn't work in my room. I only stayed for one night so it wasn't a big deal but a longer trip would have affected me.",
      "rate": 4.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Nice but a bit dirty",
      "text": "The hostel was alright, there’s a couple great things and a couple qualms I have with this hostel. Firstly, the price was wayyy too expensive for what you get. The entire place is really not clean, the bathrooms were quite dirty and didn’t seem to be cleaned overnight. However on the bright side, there’s free breakfast, there’s wifi, and there’s a chance to have a great view of downtown from your room’s balcony (which I was lucky enough to get!). I’d say it’s a great location as well, the area is super busy and full of things to do, it’s walkable, and public transport is all around you. I think the worst part of the hostel was the cleanliness but the rest was pretty good!",
      "rate": 3.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Cheap, clean, cozy, convenient",
      "text": "Needed somewhere to stay for a quick overnight trip in Toronto that wouldn't break the bank; got a private room, pretty good breakfast, & a patio to myself for <$200. Solid spot, good location. Lots of nearby restaurants, quick walk to a few different parks, and within a 30 minute walk of downtown for any meetings you might have. Really solid option for a cheap place to crash. Shared bathrooms, as with any hostel, so not quite as much privacy as a traditional hotel, but less than half the average price for private hotel rooms in Toronto in 2022. All in all a very good deal.",
      "rate": 5.0,
      "tripDate": " October 2022"
    },
    {
      "title": "Overpriced and a bit smelly but good location",
      "text": "The location was great – Kensington market and Chinatown are right around the corner and there's a bikeshare station nearby that we used a lot to get around. The street is pretty loud at night due to all the bars, etc. but we didn't mind that. Main issue was the place just didn't smell fresh. It smelled like cleaning chemicals at best and mildewy in other places. The men's bathroom was always wet. The women's toilet on our floor had no handsoap for at least two days, which is troubling. That said, I got the impression the staff are working hard and trying their best so maybe it's just an understaffing issue.",
      "rate": 2.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Not the best for your bucks",
      "text": "After a certain price, you might as well stay at a decent hotel. I've stayed in many hostel and this one, hands down, is the most expensive borderline ridiculous. They charge so much just for location. Room is hot asf. AC is set at 24 but barely blowing any air. Charger/light by the bedside some work some don't. Washroom's pretty clean and soap and shampoo are provided. Breakfast room is fairly chaotic when the hostel is packed - not much space, but selection is OK (waffle, pancake, bread, hard-boiled egg, bagel, cereal). Could be better for the price they're charging for a hostel... At least fix the damn AC.",
      "rate": 3.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Can’t sleep well at this place",
      "text": "Good location and very convenient to travel downtown, but the outside is so noisy until 1-2am midnight. There was spaces on the window, but aircon was broken. No heater as well, so we couldn’t sleep because of the cold room temperature. It was so funny to see there was a remote controller of TV in the room, but no TV. Had to share the shower and toilet with the other guests and bathrooms were dirty. Bed was tiny (they said it’s queen size for 2 people) and the mattress was so bouncy. We couldn’t move because of the space, had to share the thin blanket, so wore coats and lied down.  The worse place to stay in my entire life, Never recommend this place for the people who wanna have a relax night.",
      "rate": 1.0,
      "tripDate": " November 2022"
    },
    {
      "title": "Super nice hostel",
      "text": "I had a very bad opinion about hostels but my stay in Samesun hostel completly change my opinion. I really loved this place ; staff is very nice and smiling, all is very clean and people respectful. Location is just perfect and the area is very animated but not noisy. Breakfast is just enough to start a good day. I will be back for sure.",
      "rate": 5.0,
      "tripDate": " October 2022"
    },
    {
      "title": "Not worth the money",
      "text": "We stayed at the samesun for 2 nights Thursday-Saturday in a private room. The balcony door was broken so we couldn’t shut it properly. On the Friday night there was a night club a few steps away which was blaring out music until 4am. We weren’t notified about the noise before hand plus the balcony door not being able to shut made it pretty impossible to sleep. We paid $420 for the 2 nights and wish we had gone to a different hostel or paid a little extra for a hotel.",
      "rate": 1.0,
      "tripDate": " October 2022"
    },
    {
      "title": "Very bad experience!! will never recommend!",
      "text": "I pay for my son to stay here and the female staff that called herself manager was very condescending, talking over my head, I could not get a word in and had the audacity to falsely accuse me of shouting when she overcharge my credit $345 for  an incident that never occurs and at first telling me she never charge my card and the charges are there in black and white. They also lied on my son that he smoke on the property more than once and discriminate against his disability. My question to you the woman that describes yourself as a manager, learn customer service skills, and if you lied on me accusing me falsely, I have no dough you lied on my son which he told me you were, and treated him poorly.",
      "rate": 1.0,
      "tripDate": " November 2022"
    },
    {
      "title": "Awful experience",
      "text": "My husband I booked a three night stay. The day prior to check-in we reached out to cancel and were told our stay was non refundable. Their website cancellation policy states: “We have a 24-hour cancellation policy. Please let us know by 3pm the day before your arrival if you need to change or cancel your booking. If you do not cancel within this window, you will be charged for a same-day cancellation and the rest of your reservation will be cancelled free of charge.” Clearly not the case as I emailed several people and were just told it was non refundable over and over again. The best part is that they did cancel our stay so that they could have the private room available for someone else to book, but didn’t even offer a partial refund.",
      "rate": 1.0,
      "tripDate": " July 2023"
    },
    {
      "title": "Chill little balcony",
      "text": "If you can get it and can do stairs, I recommend getting a room here with a window balcony that looks out over Kensington market. You can see some cool cats walking down there all the time. That whole area is chill, and this window gives you great people watching. A view of the artistic side of people playing music on the street and the engineering feat that is raising sky scrapers in the background. Really recommend the window, great view.",
      "rate": 5.0,
      "tripDate": " April 2022"
    },
    {
      "title": "On a budget? Not many other options really.",
      "text": "Good things. Location, pubs, eateries, transport, friendly helpful staff. Look, this is a budget shared rooming house in prime downtown location Toronto. If you're lucky with the random selection of other guests you'll be fine and it won't break the bank.Downside. Toronto is an economic magnet and many guests will be staying here for job related activities rather than being travellers/backpackers so the vibe can be different. To make the most of the free breakfast get up early to avoid a very crowded social space. Evenings too can get very crowded. Facilities are clean but not enough of them.",
      "rate": 3.0,
      "tripDate": " March 2023"
    },
    {
      "title": "Good location but overpriced for what it is",
      "text": "Location was good, staff friendly and helpful, decent breakfast - but it's overpriced for what it is given you're in a 6 or 8 bed dorm on a corridor with 3 or 4 dorms with (for males)  2 showers, 1 toilet, 1 urinal. The communal areas are okay (kitchen decent) but quite small, which is a bit odd because behind one of the staff only doors there's a very large area that seems not to be used, but could be insurance/licensing issue. Cleanliness was not a problem, would recommend flip flops for the shower.",
      "rate": 3.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Clean but a couple hickups",
      "text": "This might win for cleanest hostel I've ever stayed in. I was in a private room for three nights, and the room had a balcony with a stunning view of Kensington market and the CN Tower. The breakfast was truly impressive with fresh baked muffins and waffles everyday. And the staff were accomodating. I did have to change rooms because the AC was broken and the room was 28 degrees. I was moved into a room with an equally good view on the 4th floor, but the TV didn't work in that room. No elevators in the building so be aware of that as well. The only other issue was the showers had zero water pressure, but I made it work. Bathrooms and showers were never busy when I needed them. Would definitely stay again.",
      "rate": 4.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Overpriced, dirty, loud and not bikefriendly.",
      "text": "First off, you only pick this hostel because all the other hostels are taken. Yes, you're in Kensington market, that's nice and that's pretty much it. It seems like management painted the walls, bought some blankets and thought: ''Well that's enough''. Every single door slams shut all the time, it's crazy loud, 24h, you'll have to sleep with earplugs. The washrooms and bathrooms are filthy. Breakfast is ordinary at best. Tiny common room. The private room (no bathroom) is wayyyyy overpriced: 170$ a night when the same room is 110$ at Planet Traveler Hostel (50 meters away, 1000% nicer place). And, the staff simply refused to find a safe spot overnight to put our two bikes within the hostel's property: ''Leave it outside, CCTV cameras are running''. Two bikes, in Kensington Market, at 5AM, let's say it's statistically very likely you won't see them again. So, we brought the bikes in anyways, for one night, before bringing them somewhere else safe 4km away. We store them on our private room's balcony (tiny, dusty, and overlooking a dump). That was deemed as rude by management, and we were nearly threatened of expulsion, and still no solution. The manager dealt very poorly with the situation (accused us loudly of being rude, in the stairs, where anybody could hear) and made us feel very unwelcomed. If that was the only thing, we would have gotten over it, but since all the rest ranged from disappointing to bad... we didn't. For the record, this is the first time I felt the need to write a review, after 15 years of travels and youth hostels.",
      "rate": 2.0,
      "tripDate": " May 2022"
    },
    {
      "title": "Excellent!!",
      "text": "Extremely safe, quiet and clean. Good nights sleep. Lots of activities in the area. Unbeatable price! Can’t recommend enough! The 4 person rooms have curtains that allow you complete privacy. I believe they plan to install them in all the dorms!",
      "rate": 5.0,
      "tripDate": " October 2022"
    },
    {
      "title": "Not great for women travelling solo",
      "text": "They consider that a mixed room is one with 5 men 1 women, which is not fair for women, they don't balance. This said, they were always responsive, kind and understanding. I had some issues with a guest I shared room with and they ended up giving me a room for myself, but overall I wouldn't advice any women travelling solo to stay here. Spend a bit more and feel safer.",
      "rate": 2.0,
      "tripDate": " May 2022"
    },
    {
      "title": "Will never stay in this hostel again.",
      "text": "For someone who has many years of experience in staying in European hostels, this experience was massively underwhelming.ROOMS:Yes, as can be seen on the photos, the beds in the rooms do not have a curtain, like in other hostels, so we knew what was coming. What you see on the photos are not lockers in the room, just storage spaces.BATHROOMS: There is a good reason, for why there are no photos of the shower facilities. There are curtains but no doors to lock. There is no place to dress or undress before or after taking a shower. Tried to be quick, but another girl \"walked in\" at me... If I had known, I would not have booked. Rather pay 100 dollars up and stay in a hotel, that´ll be money well-invested. THE STREET Please further note, that the street, on which´s end the hostel is located is for parties & weed. Rather take a road to the left or right and enter the street from the back, but don´t walk it through if you do not like the smell,  otherwise if you like it, this is perfect for you.Breakfast is included, should try the oranges, they were great.",
      "rate": 2.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Affordable Hostel in a Business Area",
      "text": "Most hotels in DT Toronto run you 250-400 a night. If you choose a shared bedroom, this place goes to 60-70/night. The toilet and shower are relatively clean. There is 24/7 desk support. The balcony view in my room was trash (literal trash). But if you're here to explore the city, this shouldn't be a problem. The free breakfast is mediocre at best. The staff are helpful. Overall, it is recommended for people on a budget.",
      "rate": 4.0,
      "tripDate": " May 2022"
    },
    {
      "title": "its a hostel, its an inn, its a hotel, its samesun",
      "text": "Our samesun was a pleasant stay, with a pleasant staff and accomodation that was clean, nice, quite and respectful.Its a mix of hostel and hotel stay. Where we got our room we shared the washroom and bath which was all clean and accomodating.We were given rooms on a short notice and we thoroughly enjoyed it for the price. If you are backpaging, an inidividual or even a small family and dont mind the small sharing parts of the stay, its a great place.Its close to kensington market with loads of places to eat, drink and explore and close to dundas and college st.",
      "rate": 5.0,
      "tripDate": " March 2022"
    },
    {
      "title": "It was okay.",
      "text": "Enjoyed the street for dinner, drinks and breakfast. The ease of that was nice. The street can be very noisy at night. The first night I was unable to sleep due to loud and aggressive yelling until very early in the morning. Be careful walking this area late at night. Interesting area and a good spot for eclectic shops, restaurants etc. I didn’t mind using the shared bathrooms and shower spaces but found some of the patrons were untidy and using the female bathrooms/showers. I won’t stay again because I enjoy having a bit more privacy in not having shared common spaces, and I need it be quieter for sleeping. The staff were nice and friendly at check in.",
      "rate": 3.0,
      "tripDate": " May 2022"
    }
  ]
}