{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Sandman Signature Toronto Airport Hotel",
    "url": "/Hotel_Review-g155019-d675165-Reviews-Sandman_Signature_Toronto_Airport_Hotel-Toronto_Ontario.html",
    "priceRange": "$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.0",
      "reviewCount": 1067
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "55 Reading Ct",
      "addressLocality": "Toronto",
      "postalCode": "M9W 7K7",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2c/8d/6d/68/exterior.jpg?w=500&h=-1&s=1"
  },
  "description": "Alluring, inviting, and with a bold style that is distinctively modern, Sandman Signature Toronto Airport Hotel is the ideal choice for travellers who want elegant, relaxed comfort at its best. Just minutes from Toronto Pearson International Airport (YYZ), this stunning property overlooks the gorgeous scenery of the Royal Woodbine Golf Course while also offering exceptional amenities. Sandman Signature Toronto Airport Hotel makes travel easy.",
  "featues": [
    "Paid private parking on-site",
    "Free High Speed Internet (WiFi)",
    "Fitness Center with Gym / Workout Room",
    "Pool",
    "Bar / lounge",
    "Pets Allowed ( Dog / Pet Friendly )",
    "Free airport transportation",
    "Business Center with Internet Access",
    "Parking",
    "Wifi",
    "Hot tub",
    "Indoor pool",
    "Heated pool",
    "Saltwater pool",
    "Restaurant",
    "Kids' meals",
    "Free shuttle or taxi services",
    "Airport transportation",
    "Shuttle bus service",
    "Conference facilities",
    "Banquet room",
    "Meeting rooms",
    "Baggage storage",
    "Newspaper",
    "Non-smoking hotel",
    "ATM on site",
    "24-hour front desk",
    "Express check-in / check-out",
    "Dry cleaning",
    "Laundry service",
    "Self-serve laundry",
    "Ironing service",
    "Air conditioning",
    "Room service",
    "Safe",
    "Iron",
    "Kitchenette",
    "Microwave",
    "Flatscreen TV",
    "On-demand movies",
    "Refrigerator",
    "Non-smoking rooms",
    "Suites",
    "Family rooms"
  ],
  "reviews": [
    {
      "title": "Great staff, great value",
      "text": "We stayed here for an overnight having flow into YYZ.  The hotel is located a short drive from the airport - ie far enough away not to hear the planes!  We could have taken the shuttle but had our own car.   The receptionist was very friendly and on request for \"a good room\" gave us one of the penthouse suites since this was available.  The room was spacious and well equipped and we got a great view of the sunrise the following morning.   Breakfast at Moxy's was waiter-served and although a little pricey was a great start to our holiday.",
      "rate": 5.0,
      "tripDate": " July 2022"
    },
    {
      "title": "I was WOWED!",
      "text": "My experience exceeded my expectations.  Remarkable given the unprecedented COVID-19 pandemic we were all faced with.  Right from the start, the hotel staff met my needs and beyond.  The airport staff failed to ask if I needed a potty break after a 3hr flight.  I had sat for so long, I was unable to get to the washroom fast enough.  Rita at the front desk contacted the General Manager, Claude.  While in the washroom, he took my luggage to my room and met me with a wheelchair to take me to my assigned room after registering with the hotel.  Whenever I needed to go to Moxie’s, the onsite restaurant, or to the business centre, Claude came to accompany me wheeling me when I requested.  I was in a accessible access room, which I needed to get in and out of the shower.  Met my needs precisely.  The heater in the room and the bathroom exhaust fans were not noisy!  Anyone who has visited any hotel where this is not the case, knows this is a rarity.  The cleaning staff were excellent and provided necessities of coffee, cups, towels and toilet paper soon after these were requested.  I will definitely be returning to this hotel in the near future.  Thank you to everyone.  When physically disabled due to muscle injury, it’s not often we feel treated like we’re human beings who are people just doing the best we can to stay active and included.",
      "rate": 5.0,
      "tripDate": " March 2020"
    },
    {
      "title": "Sandman hotel airport a place to stay",
      "text": "We stayed at the sandman Toronto airport hotel on Saturday afternoon and checked out on Monday afternoon. During our stay, we had stayed in the pent house suites on the highest floor. The room was huge and spacious! It had brand new pots and pans never used and even had a stove and fridge for any time cooking. The bedroom was beautiful, with a nice soft, comfy bed for a long goodnight sleep. The room came with two TVs which were working perfectly with live tv channels. The balcony is pretty spacious with two chairs and a cute little table for a nice view of the city in the evening. The staff at the front desk named Julie took great care of us and made sure we had all the basic necessities to make our stay as comfortable as possible. She gave us extra towels, crayons and colouring books for the kids etc. She was so kind enough to ask us if it's too loud in our room upstairs as the airport is right beside the hotel. She did an excellent job in making sure my stay was the best as possible with friendly and great costumer service experience. Overall, I enjoyed my stay at the Toronto airport sandman hotel and I will be coming back again shortly for another stay!",
      "rate": 5.0,
      "tripDate": " January 2022"
    },
    {
      "title": "Couldn't be more disappointed.",
      "text": "Had a very disappointing stay at Sandman.  This has been our go-to hotel when we are travelling out of Toronto.Upon arrival, there was no extended parking, so ended up going to park-n-fly.  was still amazed at the number of vacant spots overnight as we looked out our window. Doesn't make sense.Also upon arrival, we booked for the morning airport shuttle.  We were the first three on the list.  The next morning,  we were unable to get the shuttle, as it was full, and when i spoke with he front desk, he showed me the grid, and someone had added a name in the last spot with a +2 beside it.  So they purposefully overbooked.  So we had to call a cab, which cost us $25 when we should have had a free shuttle Very upset about that. Then to top it all off, we have been booking this hotel through Expedia for years, in fact every single booking we have made has been through Expedia.  We also joined Sandman's loyalty program and have been getting stamps for every stay.  This stay, the front desk said we couldn't get a stamp because we had booked through Expedia and not the hotel directly. Im amazed, as I have always got the stamps before, every single time.  So i guess the loyalty program doesn't want your loyalty.  If the  program isnt available to me, then i may as well stay at anyone of the other dozens of hotels at the airport.  My loyalty was to Sandman because of the program, now they have taken that incentive away from me.  Overall an incredibly disappointing experience.",
      "rate": 2.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Terrible Waste of Money",
      "text": "Initial welcome was not impressed, did not like the cleanliness of the room, marks left on kitchen cupboards and dry drips on stove, greasy fingerprints left and not wiped clean; filthy. The PLUMBING WAS TERRIBLE!! This hotel needs to have their plumbing, water softener or whatever, but the shower shut down, the sink was not bringing water, hard sounds in the walls due to bad or old plumbing...TV remote was not available in the living room was found under the sofa bed. The tables and futon were dusty and obviously not cleaned in a long time. TV channels are terrible, need to get with the times and have smart TV's. Only 1 mug in the kitchen for a room for two people at least. Room keys failed after a short while. Staff are not organized and some showed to be very unprofessional. The way the management runs this location chain is not up to par. Communication to guests on protocols needs to meet our expectations and needs to be adhered to. The front desk Auditor/Mgr was helpful throughout the whole disappointment, however, the housekeeping staff are terrible and this will result in us not ever returning to this location again. To pay over $350/night for terrible service and the experience was literally a waste of hard-earned money and the overall experience was just bad. This is a first time I have had so much to say in what I \"didn't like\" in a hotel stay review.",
      "rate": 1.0,
      "tripDate": " August 2022"
    },
    {
      "title": "A favourite of ours for years has unfortunately been dropped off the list of our places to stay prior to travel.",
      "text": "The Toronto Pearson Sandman hotel is in desperate need of a facelift. We have been staying there for multiple years prior to any travel. Our tradition was to always enjoy a meal at Moxies as a start to any vacation and the shuttle to the airport was always a great service provided by the hotel. Those things haven’t changed but the hotel rooms themselves are very tired. We will be looking for an alternative hotel until such time the Sandman gives their rooms a facelift at the least.",
      "rate": 3.0,
      "tripDate": " April 2022"
    },
    {
      "title": "Super comfy!",
      "text": "Our room was appointed with two televisions, a fridge, kitchen sink, assorted dishes, good closet space, an abundance of seating, and a king size bed that was super comfortable. Although we checked in late, staff was helpful to assist us finding food.In the morning, the attached Moxie's restaurant was quite helpful.We also appreciated the airport shuttle that ran every half-hour.",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Quarantine Room",
      "text": "The room was very lacklustre, seems like it hasn’t been cleaned or repaired in years. None of our doors including the sliding door to outside could close properly. Had what we needed but was nearly all broken or dirty. We were using this room as a 2 week quarantine and paid nearly 2 thousand dollars and I feel like I paid that much for a roadside motel. At least the location and the balcony was good.",
      "rate": 1.0,
      "tripDate": " November 2020"
    },
    {
      "title": "Great sleep",
      "text": "We stayed at the Sandman pre and post our vacation in October with their stopover rate including parking.  We had always stayed on Dixon or Airport Rd but this hotel is a short shuttle away from the airport.  The hotel includes a Moxie's which is great after a late arrival. The rooms are very spacious and the bed is the most comfortable bed I have slept on in any hotel in years.  One of the best things the rooms have to offer is that you can open a window slightly to get fresh air while sleeping.  A definite recommendation for any clients.  Covid measures in place and the staff were very friendly.",
      "rate": 4.0,
      "tripDate": " October 2021"
    },
    {
      "title": "Great Park and Fly Hotel",
      "text": "We stayed at the Sandman Signature Toronto Airport Hotel the night before a recent trip to the Caribbean. The hotel was clean, the bed was comfortable, our bathroom had obviously recently be cleaned well, and they upgraded us to a corner suite.The best thing about this hotel is the Park and Fly option. Most hotels in the area of the Toronto airport have you park at a nearby, but separate lot like Park 'N Fly. The Sandman allows you to leave your car in their lot which is well lit, and they have a private shuttle to the airport for just their hotel. Most other hotels share a shuttle. My only complaint is that the desk clerk in the morning of our checkout was rude and acted like he was doing us the biggest favour by supplying me with a receipt for our stay. Perhaps he had a bad night, but it left an impression on us. The hospitality / tourism industries cannot afford to lose customers due to poor behaviour of staff.",
      "rate": 5.0,
      "tripDate": " April 2022"
    },
    {
      "title": "Terrible service and outdated rooms",
      "text": "Staying in this hotel from Oct 3 to Oct 6, 2022.Let me start with a mid-night arrival.There were 3 of us trying to check-in.There was nobody at the front desk.We waited for 10 minutes and I was going to make a phone call to the hotel but then someone showed up.Great (not) and welcoming (not) service.Not even a bell to ring.I am a diamond RSVP member and asked about a room upgrade (which comes for free with diamond membership). They told me I am already in a room with a balcony (for which I paid) so no further upgrades.The room is dirty, the balcony glass door was probably never cleaned in a few years.It was wide open when I checked into the room.For $300+ a night this hotel should have paid more attention to services and cleaning.",
      "rate": 2.0,
      "tripDate": " October 2022"
    },
    {
      "title": "Sorry No More",
      "text": "This is the fifth and last time I will stay at the Sandman Signature Toronto Airport Hotel, it use to be a nice hotel with large clean rooms, now they have become old and outdated rooms. The room smelled, it was poorly cleaned and the handle on a dresser was clearly broken. The cleaning rag was left on our bed and we had no coffee.This is not the first time i've been disappointed, though the location is good with Moxies below its not worth staying there anymore with so many new choices.",
      "rate": 1.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Not bad",
      "text": "It's a nice looking property, but during Covid the airport shuttle stopped at 11pm and the restaurant closed at 10. I wasn't aware of the limited shuttle service, I would not have booked this hotel. So, nowhere to eat or get a drink at the end of a long travel day...not even room service. The hotel location is not amenable to walking anywhere else, especially during winter. I will do better research next time.",
      "rate": 3.0,
      "tripDate": " December 2021"
    },
    {
      "title": "Stay away",
      "text": "While checking in I was  asked for a credit card I asked if debit  master card would work The representative said yes. After checking out I received a call from a representative at sand man advising I never collected my 100$ deposit.  I had already left town and asked what deposit. The representative told my they require a credit card but made an exception for me because I didn't have one. I told them now I have  a credit card and a debit master card. The rep advise me debit master card would work. She told me know that they made an exception and the ALL aways advise to collect your deposit. The rep advise she will have a manage call me back .no one has called me back.",
      "rate": 1.0,
      "tripDate": " August 2021"
    },
    {
      "title": "Business trip",
      "text": "Ok overall but internet was slow to the point where facetiming people was freezing and cutting frequently.  Breakfast boxes were not available on one morning but got a Moxies gift card to compensate.  TV was changing channel by itself constantly reverting to the opening screen.  All the rest  was allright.",
      "rate": 4.0,
      "tripDate": " July 2021"
    },
    {
      "title": "Above and beyond",
      "text": "Love this hotel when flying out of Toronto! My last visit they were under renovations but have now completed the work from what I saw. The lobby was fresh and new, have a little market set up in the corner to buy refreshments or snacks for the road. My room was 5 star amenities from even a coffee table that lifts up to revert into a table to eat comfortably in front of the TV while watching the hockey game. As always to top my stay off the staff are always helpful with a smile and makes me look forward to my next visit!!!",
      "rate": 5.0,
      "tripDate": " April 2024"
    },
    {
      "title": "Ok but could improve",
      "text": "Chosen as a new spot to use as a pre and post stop over. Easy parking while checking in and unloading our suitcases. A little wait to check in as only one person on front desk. She did well (patient and efficient) Explained everything clearly.    Parking is on site and easy to access. You can either leave your vehicle outside or in the parking garage. Easy access from there to the lobby and the elevators. Signage is good.   Room lay out is different n a positive way. First room has a sofa, coffee table, desk and tv. Nice size bathroom and shower. Bedroom is separate with it’s own tv and comfortable bed. All are very clean and fresh.   Hotel has a bar area, pool and a 24hr Denny’s within the hotel. Nice touch for those early flights.   The room we had needs more lighting. It seemed dark even wth all lights on. No light at desk. Wifi could be a little better (slow). Tv channel selection could be better.",
      "rate": 4.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Disappointed",
      "text": "Rooms is not clean.  Toothpaste splatter on the wall in the bathroom.  Fingerprints of lotion or sun tan lotion all over drawers of  dresser in bedroom.  Sofa has stains and 2 greasy hair stains on headrests.  We had to put a blanket over the couch to sit on it.  On our arrival, there were dirty dishes in the hallway next to our room.  2.5 days later, those same dishes were still there.  We have been staying at your hotel on business once every month for the last year.  On another occasion there were dirty dishes in the hallway for our entire stay.  We are now in the process of looking for another hotel.",
      "rate": 1.0,
      "tripDate": " March 2021"
    },
    {
      "title": "Excellent Customer Service",
      "text": "We had a great and comfortable stay in Sandman Hotel Toronto Airport during our 1st momshies trip. Julie from the reception gave her excellent customer service by going beyond our expectations. We love our 2nights and 3days stay in Sandman Hotel because staff were approachable, friendly and very helpful. The hotel also was clean, as well as the rooms. We're supposedly staying for only 1night 2days but our flight was cancelled and when we called the hotel to get a new room for us they were very accommodating, Julie helped us all the way from our transition and even upgraded us to a bigger room without extra charge. Even if we had a bad day because our flight was cancelled, we were so grateful that Sandman Hotel staff made us comfortable in our stay. We'll definitely go back to stay here when we get a chance to visit Toronto again. We highly recommend this hotel, it's all worth your penny.",
      "rate": 5.0,
      "tripDate": " March 2022"
    },
    {
      "title": "Kim Smith",
      "text": "I booked and paid for 3 rooms.  Two rooms.s called front desk for a wake up call and didn't get it.  This left 4 people scrambling to make the shuttle in 12 minutes.  The hotel took no responsibility,  and offered 15% off on the next visit. Room keys  didn't work twice, which meant twice we had to go to the front desk to get them redone. The shuttle was overbooked but we had to take it sitting on others and standing on the the steps of the shuttle amongst the luggage  or risk missing the flight.Every hotel has problems that creep up but it's how they are handled that makes the difference.  If you can find another hotel please do, with this one you roll the dice.This hotel is not managed well at all.",
      "rate": 1.0,
      "tripDate": " December 2022"
    },
    {
      "title": "Best Staff, friendly service going above and beyond",
      "text": "I have been staying at this hotel since Aug 31, 2021 completing a project in the city with most of the crew staying here. The staff at this location, Specifically Maiyo at the front desk has jumped through hoops to continuously make sure our long stay is as comfortable and stress free as possible. Whether it be a friendly greeting as I walk in after a long day or organizing cleanings, towels or any other service or problems I have, Maiyo is always happy and content to help us in anyway that he can in a timely fashion. Get this man a raise !!10/10 keep up the great work Sandman !",
      "rate": 5.0,
      "tripDate": " October 2021"
    },
    {
      "title": "Quiet and Convenient Airport Hotel",
      "text": "Our hotel was booked with our flights by Air Canada.  Sandman Signature is a good choice. We waited a half hour for the free shuttle.  Check in was efficient.  We had a room on the 12th floor away from the elevators and it was extremely quiet.  The robes were soft, the linens good.  There was some wear and tear in the hotel, but the important aspects of clean and quiet were met.  We would chose this hotel in the future.  Moxies in the building was convenient.  For our early departure, it was great to have a Starbucks open in the lobby.",
      "rate": 4.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Thank You Hafsa!",
      "text": "My Spouse and I would personally like to thank Hafsa for her amazing Hospitality during our check in at the Sandman Hotel in Toronto. It was my wife’s first day back to Canada after almost 8 months over seas and every request we had was personally taken care of by Hafsa with such professionalism and joy, she had a smile on her face everytime we talked with her, it was a very heart warming stay for us because not o ou the room was amazing but the staff was too. Hafsa also went above and beyond to make sure that we received the best available room price for Canadian Forces Members. The booking system online was not allowing the Government discount to be added to the room  but Hafsa personally went to her Manager and made sure it was applied to our room Rate. I will definitely be recommending this hotel to all my Canadian Forces Friends when they’re flying in/out from YYZ. Thank you again, bless you.",
      "rate": 5.0,
      "tripDate": " November 2022"
    },
    {
      "title": "Needs serious updating, depressing old rooms stained couches and old noisy motel type single air conditioner",
      "text": "When we checked in, I requested a  possible upgrade, and the gentleman from the front desk told us that we shouldn't worry, he will give us a room.  The room he gave us was just disgusting.  The brown furntiure is from the 80s, all worn out and dented, the bathroom is tiny with a big old bathtub in it.  I went down and asked for a new room, and he told me he has a better-renovated room 5 floors up, basically doing us a favour to move us and he could only do it for us and not for our friend who had the same issues with his room.  But the next room was identical to the first room.  I wouldn't have minded it as much if there were not big disgusting stains on the couch.  This is the first time I have had to write a review for a hotel, that is how unhappy I am with this place and the staff in the front.",
      "rate": 2.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Very nice hotel before flying out of airport",
      "text": "We stayed here 1 night before flying out of Toronto airport. Probably one of the nicest hotel rooms we have had! It was so clean, had a living room, full kitchen and 1 bedroom. The pool area was very small, there was no chairs to even sit on, however the water was clean and warm so we were happy. Moxies downstairs was so delicious, we have one in our hometown but this one was HUGE and the food was way better. We loved our meals. We parked across the road a few minutes away at a park and fly instead because it was cheaper and we felt more safe leaving our car in a gated lot. Overall would stay here again!",
      "rate": 5.0,
      "tripDate": " January 2024"
    },
    {
      "title": "Hotel is not ready to receive guests",
      "text": "This is not a hotel that I would ever stay at again.  The front desk was very understaffed.  When I got there the line was so long it took me over 30 minutes just to check in.  Things just got worse after that.I got to my room to find that there were no toiletries, no paper products, and no towels.  The beds were made so I guess I should assume the room was cleaned, but I have no idea if it was or not.Then next morning I went to the fitness center and there was nothing available to sanitize/wipe the equipment down with.When I went for breakfast, it took nearly an hour to get my food and my check.  Additionally, when you ask for a refill on your coffee they charge you for a 2nd cup of coffee, without telling you!  I have never been to a place that does that; regular coffee always comes with free refills.In response to all of this terrible service, all I got from the staff was a shrug of the shoulders and a 'sorry'.",
      "rate": 1.0,
      "tripDate": " July 2022"
    },
    {
      "title": "A good choice, not a great choice.",
      "text": "We had a one night layover in Toronto and chose the Sandman Signature Toronto Airport Hotel mainly based on brand and recent experiences staying at Sandman properties elsewhere. This particular property however was not up to the same standard we've grown accustomed to.The lobby was nice and inviting but the room needed some work. It seemed they slapped the renovations together when they converted this building into a Sandman property. Cleanliness in our room was much to be desired. It was OK but not great...attention to detail was lacking by those responsible for cleaning the room. A number of things are tired and in need of updating. Rooms were spacious and beds were comfy though! Starbucks in the lobby and Moxies on site were convenient. Shuttle wasn't reliable and check-in was slow. Overall we likely won't stay here again.",
      "rate": 4.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Pleasant Stay",
      "text": "I had a 2 night stay at the Sandman while in Toronto for a medical appointment. I was pleased with the accommodations, I had a king bed in the bedroom and there was a sofa bed in the living area. The furniture was comfortable and having the 2 spaces was relaxing. I ordered from Moxie’s, the on site restaurant. The food was tasty. I was impressed with the process of ordering and getting your order. The kitchen would  call up to the room when your order was ready. You went down to the front desk and your order was at the desk in a stapled bag with your room number on it.",
      "rate": 4.0,
      "tripDate": " May 2020"
    },
    {
      "title": "Flight cancellation",
      "text": "Our flight got cancelled and we checked in into this hotel because it as one of the options that Swoop gave us. This is a nice hotel for cleanliness some of the rooms are clean some are just ok (got two different rooms during our stay).but nice hotel overall.Julie, at the front desk , she was super nice! Very accommodating and always have a smile on her face. She made our “second”check-in very smooth and easy. Also the shuttle service was very good, on time and reliable.The only thing I didn’t like was Thom, the night  front desk guy who we saw the first checked in. This guy n doesn’t know how to smile, not pleasant at all, he was eating up his words when he was talking, couldn’t understand what he was saying. When I went to my room, I called the front desk, and no one was answering, I went down to ask for a toothbrush and Thom was not even busy, but he was not answering the call, and when he gave me the brush he almost like threw it on the counter, as if he didn’t want to give it me. I said thank you, and didn’t even reply nor smiled.",
      "rate": 5.0,
      "tripDate": " December 2021"
    },
    {
      "title": "Always a great stay",
      "text": "We just rebooked for a stay in August and thought it important to share why this is the one hotel we consider before or after a flight. We always have chosen Sandman as the facilities are incredibly clean, comfortable, and convenient!Moxies being on site is great and always great service / food. We have never had any issues with leaving our trucks on site for parking, and the shuttles are on time and have lots of room.The rooms are spacious. We have stayed in many of the different layouts, and the suites are great for our family. The corporate King is great for when I travel for business alone and we even had a Penthouse at one point which was a terrific experience!Sandman should be happy that they have such a great staff.",
      "rate": 5.0,
      "tripDate": " July 2021"
    },
    {
      "title": "All you are looking for",
      "text": "Despite COVID conditions, the Sandman was a fabulous experience. They covered the cost of cabs because the shuttle was not operating.  Moxie's Grill was incredible and the King sized beds were like sleeping on a cloud.  I would highly recommend the Sandman for your next Stop N Fly destination or just a place to rest and relax while visiting T-O.",
      "rate": 5.0,
      "tripDate": " December 2020"
    },
    {
      "title": "Excellent service",
      "text": "In the vicinity of the Pearson Airport there are two Sandman hotels, one about 16 km away in Mississauga and the other about 2 km from the airport on Reading Court.We somehow screwed up our booking and arrived at the Reading Court Sandman to discover that we were booked into the Mississauga location. We had dinner reservations with family and friends at Moxies in the Reading Court Sandman, and we had flights leaving the next morning so we really did not want to stay in the Mississauga location. The desk clerk at the Reading Court Sandman spent quite a while with us to help us cancel the original booking for full refund and then get new bookings at this location - all done at the last minute.He then gave us 2 $10 gift cards for the Moxies restaurant for our inconvenience.Rest assured that any inconvenience was entirely our doing.I give this place 5 stars for service.",
      "rate": 5.0,
      "tripDate": " May 2022"
    },
    {
      "title": "Provides all you need for an airport lay over.",
      "text": "Similar to many chain hotels in that while it doesn't have the character of some smaller hotels it does have everything you need. The room was large, clean and provided everything I wanted and staff were professional and helpful.  The position is chosen for access to the airport rather than local attractions but then of course that is why you stay here.  The restraurant/bar area was very busy when I was there meaning that I had to wait approximately 45 minutes for a table so you may want to reserve a place beforehand.  There is a small coffee bar next to the entrance which operates early in the morning and is very welcome as you wait for your shuttle which runs every half hour.  On that note: shuttles can be booked at the reception for a particular half hour slot if you want to be sure of a place.",
      "rate": 4.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Nice hotel, great location",
      "text": "Stayed one night before flying to Calgary. I was able to bring my little dog as she was coming to Calgary with me. Nice big room with a kitchen. The bed and bedding was very nice. The hotel is on a quiet crescent and there are sidewalks outside of the hotel so I felt comfortable walking my dog in the area as I was on my own.",
      "rate": 5.0,
      "tripDate": " November 2021"
    },
    {
      "title": "No parking",
      "text": "The hotel was fine in appearance. I had stayed at this hotel previously and I was told that (for a fee) I could park my car here for the 3 days I was out of the country(as the shuttle service was appealing) I actually called upon booking my room to confirm this (It was confirmed that parking would not be an issue and that I did not need to pre-book a parking spot.) Upon arrival, I was told that they would not be able to accommodate. I was then instructed to go to the nearest \"Park & Fly\" lot and to take an Uber back. So I had to load my luggage into my room (leave my family) take my vehicle to the lot approx 3-4 kms away and get an Uber back to the hotel. Instead of my parking costing $15/day as discussed, it cost me $85 for parking, a $9 uber (to get back to the hotel from the lot) and a $23 taxi ride to get back to my car from the airport. The hotel was fine(hence, the 3-star review), but this really left a bad impression.",
      "rate": 3.0,
      "tripDate": " March 2022"
    },
    {
      "title": "Overnight Stay for Layover ",
      "text": "This is a beautiful hotel! I stayed in a Signature Corporate King Suite, it had a very comfortable King Bed, a 3 piece bathroom, separate sitting area and Kitchenette no cook top or oven but a microwave, sink, mini refrigerator and coffee maker. Air conditioner worked great. It is connected to a Moxies Bar and Grill. Check-In was quick and easy. Desk staff was very friendly! I would definitely recommend stay here.",
      "rate": 5.0,
      "tripDate": " August 2020"
    },
    {
      "title": "Unprofessional staff",
      "text": "The night duty guy was so rude that he dint bother to respond professionally. I would say housekeeping was much more professional than the front desk guy because they did their job beyond expectations. In this pandemic people losing their job and the one who was working at desk, doesn’t appreciate that he has a job. I wish management would look in to this and will replace a persona who really deserves it.",
      "rate": 2.0,
      "tripDate": " November 2020"
    },
    {
      "title": "Excellent value and location for  Airport",
      "text": "If you are staying the night (or two) before catching a flight or visiting Woodbine Thoroughbred raceway and casino, this chain hotel is an excellent choice for comfort and value. A/c and heating unit was quiet.Value, location, amenities(pool/hottub and balcony available), friendly/helpful staff and Moxies restaurant onsite. Also Starbucks in foyer or Tim's within a short 5 minute drive.",
      "rate": 5.0,
      "tripDate": " August 2021"
    },
    {
      "title": "Very comfortable beds, the rooms are in need of an update",
      "text": "Great hotel that’s a bit tired.The beds were amazing, the bedding was amazing and the sleep was amazing.Overall the rooms are a bit crowded and small.The hotel needs to pay more attention to the little details of the room and do a better job of maintenance. The hotel has excellent amenities with an on-site Moxies with a great bar. The front desk staff were very friendly and helpful.The airport offers a free shuttle to the Pearson Airport which was very handy.",
      "rate": 5.0,
      "tripDate": " March 2023"
    },
    {
      "title": "Good Price, Bad Service",
      "text": "I was charged after checking out, not because of the conidtion of the room, but for a movie I have no knowledge about. If there was a movie ordered, then it would have been disclosed to me at checkout. Not a good thing to see a surprise charge on my credit card the following week. Also the reception did not advise me of how room service/cleaning is run at the hotel. I went my entire 4 day stay without any service, and on the third day when I asked why this was so, I was informed then that I must request room cleaning 24 hours in advance. This should have been disclosed at the time of check in. Neither did my family in 4 other room receive service as well. We were all left in the dark. Also I have never stayed in a hotel where complimentary water bottles were not provided. That just speaks to how much they are penny pinching with their services. The room was a little outdated and beds were too soft to sleep in. I am confused to as why they received a 4 star designation. This is a false rating and very misleading.",
      "rate": 1.0,
      "tripDate": " September 2021"
    }
  ]
}