{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Sheraton Toronto Airport Hotel & Conference Centre",
    "url": "/Hotel_Review-g155019-d184506-Reviews-Sheraton_Toronto_Airport_Hotel_Conference_Centre-Toronto_Ontario.html",
    "priceRange": "$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.0",
      "reviewCount": 1190
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "801 Dixon Rd",
      "addressLocality": "Toronto",
      "postalCode": "M9W 1J5",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2c/09/e1/9a/swimming-pool.jpg?w=500&h=-1&s=1"
  },
  "description": "Take care of business and relax at Sheraton Toronto Airport Hotel & Conference Centre. Our centrally located, Toronto, Ontario hotel offers easy access to Toronto Congress Centre, shopping at CF Sherway Gardens and the Royal Woodbine Golf Course. Travel seamlessly with a complimentary shuttle to and from Toronto Pearson International Airport (YYZ). Other hotel amenities include a 24-hour fitness center, heated indoor pool, global cuisine at our on-site restaurant, complimentary Wi-Fi and pet-friendly accommodations.",
  "featues": [
    "Valet parking",
    "Free High Speed Internet (WiFi)",
    "Fitness Center with Gym / Workout Room",
    "Pool",
    "Restaurant",
    "Bowling offsite",
    "Pets Allowed ( Dog / Pet Friendly )",
    "Free airport transportation",
    "Paid private parking on-site",
    "Wifi",
    "Indoor pool",
    "Heated pool",
    "Breakfast available",
    "Breakfast buffet",
    "Breakfast in the room",
    "Vending machine",
    "Free shuttle or taxi services",
    "Airport transportation",
    "Conference facilities",
    "Banquet room",
    "Meeting rooms",
    "Baggage storage",
    "Concierge",
    "Convenience store",
    "Non-smoking hotel",
    "24-hour front desk",
    "Express check-in / check-out",
    "Dry cleaning",
    "Soundproof rooms",
    "Air conditioning",
    "Desk",
    "Housekeeping",
    "Coffee / tea maker",
    "Cable / satellite TV",
    "Sofa bed",
    "Bath / shower",
    "Interconnected rooms available",
    "Safe",
    "Telephone",
    "Bottled water",
    "Iron",
    "Private bathrooms",
    "Wake-up service / alarm clock",
    "Refrigerator",
    "Flatscreen TV",
    "On-demand movies",
    "Radio",
    "Complimentary toiletries",
    "Hair dryer",
    "Non-smoking rooms",
    "Suites"
  ],
  "reviews": [
    {
      "title": "Could, indeed, should be better",
      "text": "Most airport hotels are places to stay enroute to elsewhere but this one has extensive conference facilities so that’s probably its primary market. Along with the other hotels surrounding the airport, this one offers a shuttle pickup/drop off but their shuttle service was reasonably regular, the drivers were cheerful and the ride was painless. As a traveller, there’s little here to get excited about here and there were a few irritations which compromised what should have been better stays. The hotel aspires to 4 stars which it may reach on technicalities but a more honest 3 would be closer to the mark.  The good: the front desk staff were professional and helpful. We had different rooms during a couple of stays that book-ended a polar cruise. Our deluxe king & twin bed rooms were reasonably roomy, clean, comfortable, quiet and adequately appointed. Most things expected were there and what there was worked as expected. The beds were comfortable, the linens plush and there were enough pillows for each of us to find a favourite. The bathroom was adequately appointed and the plumbing worked well. The Wifi – when  connected (see below) – worked well on all our devices. The + cost breakfast in the hotel’s Olio Restaurant is a buffet with eggs to order that is a about chain hotel average.                       The not so good: the tired guest room furnishings and décor could definitely stand a makeover. The in-room refrigerator was welcome but the noise it made was not. The bathrooms are very compact – even by comparison to what we had just become accustomed during a couple weeks on board a ship. There were no robes or slippers in our deluxe rooms yet the hotel’s website clearly lists them as inclusions. The need to daily renew the Wifi login credentials is an irritation that we have not had to endure in other Sheraton hotels. There seems to be a communications problem with the room cards and the elevator card reader because we had to have the cards reprogrammed during both of our stays and other guests were evidently enduring the same problem.The annoying: on a few occasions we found it impossible to get through to the hotel by phone from outside and when in residence it was very difficult to get any response from the guest services or the room service phone lines. At one point I was tempted to try the emergency line to see if that might arouse a response. In the end we resorted to physically visiting the obliging reception staff but our complaints about the lack of phone response went unremarked.",
      "rate": 3.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Helpful staff",
      "text": "Air Canada booked me into this hotel due to an overnight layover. Front desk was friendly and helped store some produce I was bringing home with me in the restaurant's freezer. Sent me a message on Facebook later on to let me know that the produce has been safely kept away -- they found me because I had messaged the hotel a month earlier to check on the shuttle times, and it was a nice touch that they remembered and connected the dots. Room was spacious but a bit warm, which could be remedied by opening two vents in the windows to let cool, fresh air in. Hotel was a bit noisy that night due to some teens having a party, but didn't affect my sleep.",
      "rate": 4.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Very Happy With the Stay for Our 3-day Mandatory Hotel",
      "text": "I must say, from the front desk stay when we arrived, to the food that was dropped in the hallway for contactless delivery our quick stay at this hotel was exactly what we needed.Pleased with the friendliness of the staff who also provided good information! We enjoyed the comfortable bed and the great portions and taste of the food (dinner was the best, breakfast and lunch were decent!).The time we spent outdoors was good, there's a nice grass area to enjoy a quick walk. The window in the room also has a small opening for fresh air! :)We drove and parking was free. They accommodated our vegetarian request!Thanks to the staff who, again, where great. The only thing I can't understand is the no refund policy, considering we only stayed about 13-hours on site and have to pay for food and board for 72-hours?",
      "rate": 5.0,
      "tripDate": " June 2021"
    },
    {
      "title": "A Convenient Stay",
      "text": "During a recent overnight trip to Toronto, my family and I stayed at the Sheraton Toronto Airport Hotel. The hotel was extremely clean and had lots of amenities. It also had some restaurants that were very close and actually accessible via walking. The rooms were spacious with two beds and a large vanity that held the TV. In addition, the hotel had a breakfast buffet which featured hot items as well as cold ones and an omelette station. The hotel also serves Starbucks coffee which was great. This hotel is located about 5 minutes away from the airport. You could definitely see the planes coming over the hotel to land at the airport and during the day heard them. At night, there was no distraction from the planes or anything which was good. If you are visiting for any length trip and want to be conveniently located near the airport, I would recommend the Sheraton Toronto Airport Hotel.",
      "rate": 5.0,
      "tripDate": " December 2019"
    },
    {
      "title": "AMAZING HOTEL for 3 Day Quarantine",
      "text": "Whilst I am only on the second day of my 3 day stay here, I can say 100% that this hotel is wonderful.  The staff are SO kind and to quote one of them \"we know it is not the best thing to be quarantined in a hotel, so we do what we can to make it nicer.\"  Clean room and the staff are so attentive to requests.  Quarantine or not, I highly recommend this hotel.",
      "rate": 5.0,
      "tripDate": " June 2021"
    },
    {
      "title": "3-night Mandatory Hotel Quarantine",
      "text": "Watch my full video review on Youtube (bit.ly/canadacovidtravel).I spent 3 nights in Sheraton Toronto Airport Hotel & Conference for my Mandatory Hotel Stopover. The Airport Transfer is included in the GAA Package Rate, as well as all the meals and security staff. The food was brought to my room promptly (3rd floor) without any contact. They would just leave the paper bag on my door handle. Afterwards, I would leave my trash outside the door for someone to pick up. There was more than enough food and water (and the occasional juice or soda). I felt safe and secure throughout my stay. The only comment I have is the few strands of hair I found on my bed sheet.",
      "rate": 5.0,
      "tripDate": " May 2021"
    },
    {
      "title": "Completely mismanaged and probably not safe Covid quarantine hotel",
      "text": "Following a 6 week business trip, I had to stay here as part of Canada's (ridiculous) mandatory quarantine program that selectively victimizes air travelers. The rooms are comfortable, but there is no tea or coffee making facility - you have to go down to the lobby. The food is appalling, bland and barely lukewarm. I couldn't take it so I called Door Dash, and I not quite a few others do as well as evidenced by pizza boxes and other non hotel food containers. There's no security and people seem to be drifting in and out. I certainly could have walked out without anyone challenging. The cleaning carts in the corridor do not seem to have any extra disinfectant - they look like pre-covid carts. There was a large group waiting to check in around 9am and generally milling about. A person in front of me was told that his room is available from 3pm and that they will all need to wait to check in as rooms become available. He was also told that they cannot be given breakfast or lunch because room rental technically starts at 3pm!!!! As if all the planes land after 3pm... This is a place where covid is likely to spread. I'd be much better off at home. Very poorly managed, but it's the food quality that's the worst.",
      "rate": 2.0,
      "tripDate": " March 2021"
    },
    {
      "title": "Luckily ended up here, at the wrong hotel!",
      "text": "This was actually the wrong hotel- I thought I had booked the Sheraton which is attached to the airport in terminal 3. (We had an early flight and wanted to be right there.) The very friendly clerk cancelled my reservation and we left… only to return 30 minutes later after being shocked by the sad state of the terminal 3 Sheraton ! Ugh! We had to push our way through dingy black curtains, separating COVID travellers. When we were checking in, I was very bothered that there was no valet (apparently, there never is, not just because of COVID ), and then I was told \" Because you booked so late, you will have to share your room with people who are quarantining while waiting for their COVID results.”I replied, \"I think you mean share a floor, but no thanks, anyway.\" We hightailed it back to the other Sheraton, which was not only clean and bright...but half the price. The same friendly front desk Clerk gave us a lovely room on the Club Lounge floor (not that the lounge was open ), and we were happily ensconced in a trusty Sheraton.No idea what the airport hotel rooms were like, but if you can judge a hotel by its lobby ( and you should!) stay clear, and stay elsewhere! This Sheraton was great.",
      "rate": 4.0,
      "tripDate": " July 2021"
    },
    {
      "title": "Dilapidated. Leaking. Unaccommodating.",
      "text": "One of the worst hotel experiences I’ve had to date- particularly of note since I travel a lot with Marriott (Lifetime Gold Status). First was check in; while I know early arrival cannot be accommodated often… I didn’t expect to have to fight tooth and nail AFTER stated check in time for my room. I was booked into an Executive Suite. #714 After finally getting into my room, I was greeted with a mildew smell. I dismissed it as that the room’s AC was turned off and it was 76° in the room. I turned the AC on, changed, and left for dinner for the conference. Upon my return to the room at nearly 11pm I was greeted with a soaking wet floor and rusty-water pouring out of the AC. The hotel was able to put me into another room, but was not able to be placed on the club floors or into another suite. I just wanted to sleep so I settled into a 2 Queen standard room.  While the bed was comfortable, service of the room was awful. Both days housekeeping came and casually remade the beds, and didn’t refresh towels or bathmats. (Which I dutifully left on the floor together for easy pick up). The first day could’ve been an “oops we forgot” but both days was unacceptable. I expect more from a full service hotel. I felt like I was at a dilapidated Courtyard or other more inexpensive property. I’ll be staying at a different Marriott property for my next trip to YYZ.",
      "rate": 2.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Pleasent stay, good staff and foods",
      "text": "Our stay was overall pleasant. Everybody was helpful and on time. Food was better then we were expecting. We stayed for 2 nights due to mandatory quarantine with an early check-out on the second day of our stay. As it was described before, we paid for 3 nights beforehand and warned against that it is non-refundable. But as far I see from other hotel chains, guests are getting their fees for non used nights back. I wish that will apply to us.",
      "rate": 4.0,
      "tripDate": " August 2021"
    },
    {
      "title": "We were lucky in choosing the Sheraton !",
      "text": "After  Air Canada cancelled our overnight flights and told us we were not eligible for a hotel ( even though we live in the UK and were on vacation )  , we booked this hotel 30 minutes before we turned up at 12.30am. Had no idea of  the reputation of the hotel but we got lucky, as this hotel was lovely.Granted, we didn't use any of the facilities - bar, restaurant, pool - but we were greeted by a very friendly receptionist ( very unlike the Air Canada staff we had been dealing with for over 5 hours...) and we were in our room within minutes.Very large room, spotlessly clean. Bathroom was spotless too. Plenty of space for luggage. Two bottles of water in the room meant we were given more than we had received from Air Canada in the 5 hours we had been stood in queues trying to find out what happens when a flight is cancelled at the last minute. Also had a coffee machine in the room.Bed linens were good quality, good lighting, both in the room and above the beds. Heard very little noise, except for aircraft noise, which is to be expected in a hotel so close to the runway.On checking out, we met another great receptionist who let us leave our bags whilst we tried to find a flight back .We were sorry we couldn't spend more time at the hotel. The area around reception was spacious and looked out onto a lovely garden area.Thanks Sheraton !",
      "rate": 5.0,
      "tripDate": " July 2023"
    },
    {
      "title": "Good overnight airport hotel.",
      "text": "Over all 4/5 rating. Good stay for an over night. Airport Shuttle was quick and the ride to the hotel was a maximum 15 mins drive. Frontdesk staff were pleasant and helpful. They suggested a different mall to where we were heading and it was a great option. The room was clean and had adequate space to accommodate 3 adults. We did not use the restaurant so I am unable to speak about the food and experience. Check out was quick and efficient. We were able to store out bags until late evening.",
      "rate": 4.0,
      "tripDate": " April 2022"
    },
    {
      "title": "Very good for 3-day quarantine",
      "text": "I read so many terrible reviews for the various airport hotels for the 3-day quarantine, so I was pleasantly surprised by this one. I stayed in a The staff were extremely helpful and the room was spacious, clean and comfortable. The food wasn't mind-blowing but it was way better than I expected. Think really good airplane food. If you're used to 5-star accommodations and cuisine then you might be disappointed, but if you're not too fussed about these things you'll be happy. Obviously the whole thing is an insane cash grab but while we still have to do it, this is a good place to stay. Also because it's a high rise you can't open the windows really but there are small slats that open to get air in and out.",
      "rate": 4.0,
      "tripDate": " June 2021"
    },
    {
      "title": "Mandatory Hotel Quarantine ",
      "text": "While I absolutely disagree with the Hotel Quarantine rip off, I have to say that my experience at the Sheraton Toronto Airport Hotel & Conference Centre was much better than expected.Check in was quick, the room was clean and the food exceeded my expectations.After receiving my test results after 20 hrs, it is a hard pill to swallow knowing you still have to pay for the full 3 nights!!",
      "rate": 4.0,
      "tripDate": " May 2021"
    },
    {
      "title": "Disappointing sheraton",
      "text": "We checked into this hotel for one night on 7th June 2022.  The foyer was ok for a Sheraton, but not fantastic.  The reception staff were very polite and the process wasnt too painful.  On entering our room on the fifth floor, i noticed it looked old and dreary, there were stains on the carpet and a letter to the previous guest still on the table.  I was wondering how well the room had been cleaned.  I found a few bugs in the room as well.  The curtains were dirty, and the room was just in general not upto standard.The manager on duty (a lady) was very unhelpful, and rude.I will never visit this hotel again and urge would be visitors to see other hotels in the area before booking i to this one.",
      "rate": 1.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Constant ding of the Elevators all night!",
      "text": "I had so much hope for this property after reading other reviews. We had an unexpected flight change and needed a place to stay overnight. We thought the higher price we paid was worth the amenities and comfort, wrong! We were placed in a room directly across from the elevator, all night we could hear the constant singing and buzzing from them. We’ve travelled extensively and never had such loud elevators. So, unfortunately by 330am wake up we never slept a wink. When checking out not a single question of how our stay was? So I mentioned the elevators, the front desk manager response “ we were full last night, that’s all we had???  So, how is that ok…. Why take my money if you know that room is a problem! Nothing else was said, I would not recommend this hotel for overnight stays at Pearson. There are nicer, better hotels in the area whose staff actually care. On a positive note the hotel restaurant was delicious and excellent service!",
      "rate": 2.0,
      "tripDate": " May 2022"
    },
    {
      "title": "Not a four star",
      "text": "The room was very nice but the amenities were not. We chose this hotel because of the pool yet when we arrived it was closed for maintenance. This was not indicated on their website, or when we checked in. Contrary to other posts, you CAN hear the airplanes coming in, though it’s not as loud as you’d expect. Our other issue was the lack of room service. We tried to order food to our room and when we dialed “0” the receptionist said she “wasn’t sure” how we order food and that we have to order from a restaurant specifically and ask for delivery. So, essentially there isn’t room service here? The restaurant in the lobby was very nice and had good food and drinks. For the price point I’d probably stay at one of the competitors next time.",
      "rate": 3.0,
      "tripDate": " March 2024"
    },
    {
      "title": "No Show Hotel Shuttle!",
      "text": "We booked a room while flying home from a trip, and ended up cancelling after waiting 1.5 hours for the hotel shuttle to arrive! We were told by at least 3 hotel staff where to wait which we did, along w other hotel guests we met waiting at the same spot. They ended up calling a taxi when the shuttle never appeared. We had an early flight so it wasn’t worth going to the hotel at 130 am. Not impressed!",
      "rate": 1.0,
      "tripDate": " March 2024"
    },
    {
      "title": "Overnight stay at Sheraton Toronto Airport and Conference center.",
      "text": "The hotel desk crew was very quick and efficient.They were very busy when I got there but it was a short wait.I was happy with the room layout and cleanliness.I did not get a chance to try out any of the hotel amenities as I wasonly there for 8 hours. I do think that a $28 is excessive for overnight parking and based on thiswill probably not stay at this hotel again.",
      "rate": 5.0,
      "tripDate": " April 2022"
    },
    {
      "title": "Pleasantly Surprised",
      "text": "Shuttle bus was a great quick service.  (Air Canada gave us the wrong pickup post.  (Not S5!It was changed back during Covid.)Front desk staff greatElif at the restaurant/bar was greatAll of the staff (front desk, housekeeping, maintenance & restaurant) were very friendly & helpful.Comfortable beds & pillows.Swimming pool a plus but I  Forgot my bathing suit, duhI didn’t give 5 stars due to the bathroom.  Toilet flush was poor (due to the water capacity of the small tanks) + the bathtub plug for the drain was missing. Maintenance came & worked his magic.  Phone not working nor a big issue unless you need to contact front desk, etc. I will as informed that Updates are planned & supposed to be coming for these few issues.Having said that, I would not hesitate to come back. Would highly recommend",
      "rate": 4.0,
      "tripDate": " February 2024"
    },
    {
      "title": "Great hotel for airport stays!",
      "text": "We stayed at this hotel for one night on December 24, 2019. We chose this hotel for it's proximity to the airport and the Toronto Congress Centre. zThe staff upon check-in were helpful and friendly. The room was spacious and clean. We spent most of the evening in the hotel pool.Being Christmas eve, the hotel had free cookies available in the lobby. We also received free coupons for breakfast on Christmas morning, but had to be at the airport before breakfast was served so we never got to experience their restaurant.",
      "rate": 5.0,
      "tripDate": " December 2019"
    },
    {
      "title": "Convenient location, close to YYZ airport and business in Mississauga area.",
      "text": "Stayed for a few nights at Sheraton Toronto Airport hotel in August 2021.  This was my first time staying at Sheraton at this location.  Due to COVID, the hotel was not very busy.  My room gave a bit dated impression, although it was clean.  Perhaps this hotel can use some renovation.  Location is great!  Close to YYZ airport, and many business in Mississauga/Airport area.  Hotel breakfast was good, and there is a steakhouse restaurant on the premises.  HSBC bank is within walking distance.  Really convenient.  Gym and swimming pool were available with reservation to limit the number of people, though I did not use the facilities.  Overall a good business hotel near YYZ airport.",
      "rate": 4.0,
      "tripDate": " August 2021"
    },
    {
      "title": "No way",
      "text": "This is, by far, the worst hotel ever. Save your money and choose another one. There is a pool limit but you can't make a reservation so you must go check all the time and if you have kids forget it!! At one point they call us saying that we can come to the pool, we went to the reception but surprise: the pool was fool. The breakfast is bad, the rooms are very outdated, they say it's an 4 stars hotels but I stayed in 3 stars hotels better than this one",
      "rate": 1.0,
      "tripDate": " February 2022"
    },
    {
      "title": "Good but could have been great",
      "text": "I stayed for 4 nights as part of attending a pet expo relatively close by.  The Sheraton is a moderately priced hotel with an attached conference center.  Good things about the hotel are location.  It is close to the airport without being noisy or crazy busy.  There is a different Sheraton that is attached to the airport via walkway.  To get to this hotel you need to take a shuttle or have a car.  Rooms are spacious and quiet.  The climate control does not seem to work and the rooms were very warm.  There is only a tiny vent in the window to get a little fresh air.  Lighting in the room is on the dim side.   Bathrooms are well done and big enough.  Parking at the hotel is a ridiculous fee of $28 per day.  I expect this at a city hotel.  But not at an airport hotel with parking outside and not very close to the hotel entry doors.  There is no housekeeping at the hotel. So running out of something means a trip all the way to the lobby.  The front desk is frequently understaffed and will have one poor worker trying to handle everything by themself.  It is not fair to the front desk employees clearly.  I had to wait a long time just to check in as the clerk was so busy having to tend to other guests.  Despite the downsides I do like this hotel.  But there are things that are correctable by the management and it would truly be a great experience.",
      "rate": 4.0,
      "tripDate": " April 2022"
    },
    {
      "title": "Rip off hotel at its finest",
      "text": "Rather than go home and quarantine where I would be safe, the government forced me to check in at this hotel at the airport and wait for my covid test. Long story short, this hotel is a total rip off. They made me pay for 3 full days at a ridiculous daily rate, full well knowing I would be checked out within 24 hours as most tests are returned this quickly right now. 22 hours after check-in, I was on my way home, having being totally ripped off and disappointed that there was no compromise from the hotel. No refund ? No credit? Give me a break. No reason to punish travellers who are following rules and fully vaccinated to boot. Sheraton should not get involved in the government's socialist games. Use your brains.",
      "rate": 1.0,
      "tripDate": " May 2021"
    },
    {
      "title": "Great option near Pearson Airport",
      "text": "This property is a 5 minutes drive from the airport. One can reach it by shuttle bus (every 30 minutes) and they also offer ample of parking at the back of the building. Overnight parking is charged at $28.00. The room was spacious and quiet. The Club Lounge offered a nice selection of evening snacks and a delicious breakfast. Staff members were friendly.",
      "rate": 4.0,
      "tripDate": " August 2023"
    },
    {
      "title": "Rude and condescending front desk staff",
      "text": "Front desk staff were rude and unhelpful. They treat people like they are worthless. I have never experienced being talked to in such a manner. I would never stay at a Sheraton again because of the staff at this location. Credit card was charged multiple times and they would not honour the rate the hotel was booked under.",
      "rate": 1.0,
      "tripDate": " October 2022"
    },
    {
      "title": "Peloton Room and great food!",
      "text": "After a long haul flight to TO this Sheraton was an extremely welcome surprise. Room completely updated. All business needs in the room. Bathroom clean and loved the sustainable touches. The bed was super comfortable. Fresh and smelled extra clean. The PELOTON room was just what I needed to move my body after 11 hours on a plane. So great. Suggest they add a tread!The breakfast was amazing. Coffee on point and good high end. I spied the bar list and loved the cocktail options. Looking forward to another stay to give that a try.",
      "rate": 5.0,
      "tripDate": " November 2022"
    },
    {
      "title": "Quarantine stay",
      "text": "My review is one star only as it does not permit zero stars.Our quarantine stay was dreadful in every sense. The hotel was disorganized, unwelcoming and appeared to be very under staffed.Room had no tea/coffee facilities.  No cups and less than half a toilet roll for 2 people for a 3 day stay.The food had no option, was delivered at a time of the hotel’s choice and was truly awful.  Little nutrition value, bland, cold & continued to send dairy items (ignoring dietary requirement).   We were treated like prison inmates rather than hotel guests.We did go to the Marriott Bonvoy group to notify of our experience and did not have an impressive response.  Our loyalty to the brand is severely damaged by the experience.(We did just complete another quarantine stay with another hotel brand in Vancouver and experienced very impressive, excellent customer care.  Incomparable experience!)",
      "rate": 1.0,
      "tripDate": " March 2021"
    },
    {
      "title": "Convenient and Excellent Service",
      "text": "Perfect place to stay when you are catching a flight the next morning and need accommodations for one night. The King room we stayed in was extremely spacious. A little pricey, but you are paying for the convenience. The restaurant offerings are tasty.  All of the staff from the reception, cleaning and servers in the restaurant are attentive and friendly.  The hotel has been beautifully updated since our stay a number of years ago.  Would definitely book another stay in the future.",
      "rate": 5.0,
      "tripDate": " February 2022"
    },
    {
      "title": "Overnight stay on Air Canada's dime",
      "text": "Connecting flight canceled by Air Canada, so they provided a voucher for this Sheraton. Hotel restaurant open until 11, which was definitely a bonus. Restaurant staff was pleasant, and although the choices were limited on the \"after 10 pm\" menu, there was enough to satisfy our hunger. Room was clean, quiet, and wall-mounted toiletries were fragrant, but the coffee maker was disgusting. When I put water into the \"tank,\" water became a brown slug. Rinse several times and ran several cycles before even thinking of making a coffee.",
      "rate": 4.0,
      "tripDate": " January 2023"
    },
    {
      "title": "Great Experience!",
      "text": "We recently had a reception for about 50 people in the Ambrosia ballroom for about 5 hours.  The staff were amazing - Hughena and Alicia in particular was an absolute pleasure to work with - professional, quick to respond and seamlessly ran the event with their team so we had no worries.  The food was fresh, tasty and catered to varying tastes; the room was clean and spacious and everything was set up as soon as we arrived - podium, easels, tables etc.  No stress for us and our guests and it made our experience that much more pleasant.  COVID protocols were in place and respected by all guests; thank you to the Sheraton Conference staff for a great experience!",
      "rate": 5.0,
      "tripDate": " October 2021"
    },
    {
      "title": "The Sheraton Club Lounge",
      "text": "Best part of the hotel is Val in the Club Lounge. She was extremely helpful and friendly. Pay the extra because food is good and healthy. For breakfast they have tons of fresh fruit, salmon and hot bites too.",
      "rate": 5.0,
      "tripDate": " March 2020"
    },
    {
      "title": "Taken advantage of by Sheraton Toronto Airport Hotel and Conference Centre",
      "text": "We stayed one night at the Sheraton Toronto Airport Hotel & Conference Centre on December 22, 2022, checked out on December 23, 2022, and left our car at the property for 9 days Confirmation Number: 72591442 and cost of $189.00.  We were staying again on our return on December 30, 2022, and checking out on December 31, 2022 Confirmation Number: 72622031 and a rate of $129.00.  Our flight was cancelled in Panama on December 30 so we had our travel agent cancel our Reservation Confirmation #72622031 and price of $129.00 for the night as we did not know when we would be able to return home. (part of the Sunwing disaster). We did return on December 31 and when we asked to book a room (our car was still at the property) we were advised that as we cancelled our reservation, we would have to pay the \"walk-in rate\" of $359.00.  We asked if the hotel was completely booked and it was not as we could get a room. We were told that we could book online or our travel agent could book for us to get a cheaper rate.  We were advised that we should have \"extended\" our reservation.  This is the most abhorrent treatment of an existing customer under duress due to circumstances beyond their control. Not only did we have a disaster of a holiday and both fell ill and were on medication at the time of our return, but we were also totally taken advantage of by Sheraton, and Marriott Bonvoy.  I have advised my travel agent of the treatment we received to make them aware in future to protect other clients.",
      "rate": 1.0,
      "tripDate": " December 2022"
    },
    {
      "title": "Our favourite layover hotel",
      "text": "We have booked rooms at Pearson Sheraton 6 times now as gold members. 3 of stays, we received complimentary upgrade, as it was available, to the club level which includes the lounge with some snacks, food and coffee/tea. The rooms are modern with a nice layout. We never hear planes taking off and landing. Members receive two complimentary bottles of water. Front desk, bellboy and managers are always polite and courteous. It’s located at terminal 3. If you land in terminal 1 or 2, it’s a short train ride. You can’t take the airport luggage cart into the hotel for safety reasons but just ask the bellboy and they’ll be more than happy to help you.",
      "rate": 5.0,
      "tripDate": " August 2023"
    },
    {
      "title": "Rude front desk attendant. Terrible if you have a disability!",
      "text": "Paid parking that you have to park blocks away… I have a disability. Arrived at 2 am and we were asked to pay the $28 for parking even though I had to bring in all of the bags and sleeping kids on my own since my husband had to park on the other side of timbucktoo. I politely asked the front desk attendant to waive the fee since we will only be here for 6 hours and I was in a lot of pain (fibro) and had to do the bags and everything on my own. The man was very rude and waived a paper with names of all the people who “did pay”. I asked him again to consider the situation and he raised his voice and was rude again. Never would I ever recommend this hotel to anyone ever, especially if you have a disability!!!!I would give this hotel a zero if I could. The front desk guy could have at minimum been polite, and what would have been fair was to waive the fee or discount it for our 6 hour stay (2 rooms) and inconvenience of people sleeping in the driveway making the unloading of our bags much more difficult with our already challenging situation.",
      "rate": 1.0,
      "tripDate": " May 2022"
    },
    {
      "title": "One night for business",
      "text": "Stayed just one night for a business meeting. Had booked a standard room and was upgraded to a club level room which was a nice surprise. The hallway was hot and stuffy, but the room temperature was fine and the window even had a little section that could open. You can definitely see that the room has received a lot of updates but for some reason the TV system was very old-school.  Keurig coffee machine, refrigerator and a safe.Ordered room service and it was tasty and warm and served on actual plates with real cutlery which is a nice return to form from the takeout boxes and plastic cutlery that we have experienced in recent years.The bathroom was nice, if small, and I appreciated the toiletries but I thought it was oddthat they all had a really masculine scent. It was a bit sad that there was no outdoor space to sit, but I guess it is a bit loud outside due to the proximity to the airport, but the room itself was extremely quiet.On that point, I did appreciate the proximity and the availability of a free shuttle to and from the airport.Would definitely stay here again for meetings or otherwise if I needed to be close to the airport.",
      "rate": 4.0,
      "tripDate": " June 2024"
    },
    {
      "title": "Upstanding Service and Dinning Experience",
      "text": "I stay at the hotel regularly once a month. I have built a relation with the hotel staff as they are very kind and go the extra mile to ensure my stay is exceptional!Every morning I have breakfast and talk to Delroy Reid (one of the chefs) as he prepares my meal. Delroy heard about my dietary needs and introduced me to the sous-chef Mohammad Zaheer who then together arranged for Halal meals! I am blown away by this level of care and how they catered to my needs without me even asking!I then talk to Urzsala and Beta (hostesses) as they take turns daily serving me tea. Urzsala once brought me a concoction after I stated I had a sore throat and it worked! Delroy then told me about various remedies and ingredients that would also help. Overall, I must say it's always a fantastic stay. I choose this hotel as my location to stay and will continue to do so for 2 reasons: The exceptional service & the HALAL options. I would recommend!",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Excellent hotel",
      "text": "We stayed for 3 nights at this hotel. The hotel was clean, the staff were very friendly and accommodating and the breakfast was great. The shuttle drivers were always on time and very accommodating. One driver dropped off a person who could not find her hotel.   It was one of our best stays in Toronto. The restaurants close by (Montana’s, Boston pizza, and Jack Astors are within a few minutes of the hotel. We would definitely stay here again.",
      "rate": 5.0,
      "tripDate": " October 2021"
    },
    {
      "title": "Mixed review for 2 stays a week apart",
      "text": "I stayed at the hotel for a night before and after a package tour and then stayed another night i reserved myself.  The two stays were very different.As a Marriot Bonvoy member, on the first stay I was provided a room on the club floor. It was an excellent room with many amenities and a pleasing atmosphere making the room feel special. I would rate the room a 4.5 or 5 for comfort and amenities.On the second stay a week later, I had asked that the reservation for the one night stay on the package be linked to the next night that I had booked through American Express - Expedia. When I checked in, they had not done so and at first said I would have to check out of the room after the first night and then check in again. After I explained that I had requested the 2 nights be linked, they finally did so and I did not have to change rooms. Because the second night had been booked through American Express and their booking partner Expedia, I was told that the reservation did not qualify for a club floor room and that it also did not qualify for Bonvoy points.The room we were provided was dated and did not compare in any way with the room on the club floor provided on my first stay. The bathroom was smaller and there were some stains on the carpet. The beds were very comfortable and the shower pressure was great, although the water temperature was scalding if you were not careful.My first stay was excellent on the Club floor, but the problem with linking the second reservation and the dismissal of benefits because of the method the reservation was made resulted in a less than satisfying experience on the second stay.",
      "rate": 4.0,
      "tripDate": " August 2022"
    }
  ]
}