{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Sheraton Centre Toronto Hotel",
    "url": "/Hotel_Review-g155019-d183085-Reviews-Sheraton_Centre_Toronto_Hotel-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.0",
      "reviewCount": 2669
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "123 Queen Street West",
      "addressLocality": "Toronto",
      "postalCode": "M5H 2M9",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2c/15/3d/36/pool-view.jpg?w=500&h=-1&s=1"
  },
  "description": "Experience downtown Toronto from our hotel in the center of it all. Embrace the city's energy while staying at the Sheraton Centre Toronto Hotel. When you arrive at our hotel, impeccably located on Queen Street in the financial district, you'll feel a sense of belonging. Our recent transformation brings a new arrival experience, a lobby with a welcoming ambiance, world-class culinary experiences, open and collaborative workspaces, and over 130,000 square feet of flexible meeting space. Experience the unbeatable comfort of our pet-friendly rooms and suites, work in our 24-hour fitness center or relax in our waterfall garden. Upgrade to a room providing access to the hotel's stunning 43rd-floor Sheraton Club Lounge - a place to connect with co-workers and gather with friends or family. Sweeping views of downtown Toronto, complimentary breakfast, all-day refreshments, and free Wi-Fi keep you fueled and connected throughout your visit. Sheraton Centre Toronto Hotel is dedicated to exceeding your expectations, whether you are here for work or play.",
  "featues": [
    "Electric vehicle charging station",
    "Free internet",
    "Pool",
    "Fitness Center with Gym / Workout Room",
    "Bar / lounge",
    "Patio",
    "Highchairs available",
    "Pets Allowed ( Dog / Pet Friendly )",
    "Valet parking",
    "Paid private parking on-site",
    "Wifi",
    "Pool / beach towels",
    "Indoor pool",
    "Outdoor pool",
    "Heated pool",
    "Fitness / spa locker rooms",
    "Coffee shop",
    "Restaurant",
    "Breakfast available",
    "Snack bar",
    "Special diet menus",
    "Vending machine",
    "Conference facilities",
    "Banquet room",
    "Meeting rooms",
    "24-hour security",
    "Baggage storage",
    "Currency exchange",
    "Executive lounge access",
    "Gift shop",
    "Non-smoking hotel",
    "Outdoor furniture",
    "Shops",
    "Sun deck",
    "Sun loungers / beach chairs",
    "ATM on site",
    "24-hour front desk",
    "Express check-in / check-out",
    "Dry cleaning",
    "Air conditioning",
    "Desk",
    "Dining area",
    "Housekeeping",
    "Coffee / tea maker",
    "Cable / satellite TV",
    "Sofa bed",
    "Walk-in shower",
    "Room service",
    "Safe",
    "Seating area",
    "Sofa",
    "Telephone",
    "VIP room facilities",
    "Bottled water",
    "Iron",
    "Private bathrooms",
    "Wake-up service / alarm clock",
    "Flatscreen TV",
    "On-demand movies",
    "Radio",
    "iPod docking station",
    "Bath / shower",
    "Complimentary toiletries",
    "Hair dryer",
    "City view",
    "Landmark view",
    "Pool view",
    "Non-smoking rooms",
    "Suites",
    "Family rooms"
  ],
  "reviews": [
    {
      "title": "Fantastic! ",
      "text": "I stayed at the Sheraton for two nights in late February 2020. It was my second visit to this hotel. I was here last February for the same conference I attended last week. My second visit was much more pleasant than my first. The hotel staff go above and beyond to make you feel welcome at check in and throughout your stay. It’s clear that they are well-staffed and everyone I met was very friendly and accommodating. I stayed in room 739 and it was a beautiful, simple room with 2 Queen beds and I was pleasantly surprised to have a mini fridge in my room this tome around. This was quite handy and allowed me to buy some drinks and snacks and keep them cold. The bed was superb— the linens and bedding were soft, comfortable and smelled lovely. The water pressure in the shower was great and hot water plentiful. I ate breakfast both days at the in-house restaurant and, while quite costly, ($22+ tax for a “Classic Canadian”: 2 eggs, bacon, hash browns and toast), it was delicious and, again, service was great. Thanks again for a great stay!",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Just OK",
      "text": "I stayed at this hotel for a conference in January 2020.  I reserved a King room, but received a room with 2 double beds.  When I arrived check in was very busy, the kind woman at the counter tried to find me a King room but was having trouble locating one.  She took my phone number as I needed to get to a seminar, she said she would call when she located a King room.  I really just wanted to freshen up after my long drive and go to my seminar, so I took the double beds room she offered.  I didn’t receive any form of rebate for being downsized.The room was clean and comfortable.  I did find it rather odd that there was no mini fridge in the room.  Even the small resorts in Cuba have mini fridges.  There is not a lot of table/desk space to do work on.It was very difficult to regulate the rooms temperature, seems there was a draft coming from the very large window, nice view of City Hall, but chilly.The location of my room was at the end of the hall, bonus as no neighbours on one side, disadvantage, the slamming of the doors from staff using the maid’s room or whatever it was beside me.  The ceiling’s are paper thin, you can hear loud walkers, bathroom noises and tv’s above.Room service was extremely expensive, the quality of food did not match the price.  The bathroom was big enough, but the sink and tub were small.Overall this hotel is extremely large, you need a map to know where you’re going, a little dated but clean.Ok for business travel as everything is centrally located.  Too overpriced for a family getaway, in my opinion.",
      "rate": 3.0,
      "tripDate": " January 2020"
    },
    {
      "title": "I will only book with this hotel when I’m in Toronto from now on",
      "text": "I normally book with whatever is the least expensive 4 star hotel in Toronto through Priceline, but I’ve been finding myself coming back to the Sheraton because the staff goes above and beyond. Marc at the front desk is the reason I’ll continue to book at this hotel even if it’s more than the other 4 star hotels. He is so kind, attentive and accommodating. I love having a room with a bath instead of a shower and the front desk had no problem accommodating that! I never once got the “Priceline treatment” and if you’ve stayed in more upscale hotels and booked through Priceline then you know what I’m talking about. Thank you so much Sheraton- I’ll be back in a few weeks.",
      "rate": 5.0,
      "tripDate": " November 2020"
    },
    {
      "title": "Disappointing hotel experience to say the least, but night staff was commendable",
      "text": "First of all, this review will be in two parts.....first what we experienced and second what the staff did afterwards.  These are very different and as such I want to clarify this from the start.We arrived late on the night of the 27th of December, and when we entered our room we noticed that the carpet had not been vacuumed.  We overlooked it, as we know this is a very busy season and we had been flying all day.  The safe was locked, and we called security to have it unlocked.  They arrived and unlocked it, but the battery low alert was showing so we told them we were going to eat and the engineer could come after we got back to fix the battery.  We ended up watching some live music and returned to our room around 1 AM.  I went to take a shower, and my wife waited for the engineer to replace the safe battery.  I came out, and my wife went to take a shower.This is when we discovered that the room had not been cleaned in any way.  There was urine all over the underside of the toilet seat.  Thoroughly disgusted, we called the front desk and asked the night desk clerk to come up to the room.  Upon showing him this, we went down to get a new room and talk to the night manager.  She was genuinely shocked and offered us another room.  We went to look at the second room and discovered blood on the pillow, and hairs all over the bed upon receiving a third room.  At this point, we told the manager we could not stay at this hotel and needed to go somewhere else.Now to discuss the staff we interacted with.  Kevin (the night receptionist) and Rosa (the night manager) were very understanding of our problems with the rooms.  Kevin inspected the second and third room with us and acknowledged that the standards were not up to par.  Rosa did all she could to make it better in light of the situation that was thrown onto her that night.  She transferred us to the Delta Hotel, and refunded our entire four night stay even though we had purchased non-refundable rooms with no hassle (which was GREATLY appreciated).  She arranged transportation and ensured that our situation was briefed to the Delta hotel staff so they made our arrival at 3 AM quick and hassle free.  They called us the next day to apologize again, and the Director of Housekeeping called twice to let us know she was very sorry and that their entire staff would be briefed on the issue.  They also credited us with enough Bonvoy Reward points for a free night at any Marriott.  They understood we couldnt stay at their hotel, yet went the extra mile to try and make our experience up to us.",
      "rate": 2.0,
      "tripDate": " December 2019"
    },
    {
      "title": "Very good stay - wonderful in most aspects!",
      "text": "I stayed in January 2020 for a Conference.  I arrived at noon, and they were able to find me a room.  Beds are very comfortable; linens clean.  Lots of hot water for showers.  Excellent restaurant for breakfast!  Room service delivers very quickly; there is a $5 fee for room service, and a 15% charge as well. Very convenient location to downtown, and right on “The Path”.  I was offered bonus points for declining housekeeping, which I did.   My one real concern was that the room beside me, with the adjoining door, had a guest who listened to the TV very loudly, and the noise was in my room much of the times.  As well, he set an alarm for 5:00 a.m., and didn't mute it; so though he wasn’t up for the day, I certainly was!",
      "rate": 4.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Bed bug infestation - don’t stay here",
      "text": "I stayed 4 nights at the Sheraton in February (last week) and moved rooms four times due to bed bugs in 3 of the rooms. Hotel management handled the situation very poorly and denied there was a problem - stating that I had an allergic reaction to the washing powder used to launder the bed linen. I actually have photos of the bugs and also the extensive bites on my body. To make things worse the hotel lost one of my luggage duffel bags during the room move and it still has not been found. I am a weekly user of Sheraton hotels for business use and a loyalty member. Sadly this hotel has a huge problem that they will not publicly admit to.",
      "rate": 1.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Can’t beat the location and a better lounge than either the Ritz Carlton or the Hilton",
      "text": "The rooms are basic and the bathrooms rather small but they have been recently refreshed and they are comfortable and have everything you need. For the location they are great. There is a nice pool, half indoor and half outdoor that in the summer also has lots of deck and bar action. Apart from the location, the lounge is the biggest draw - a fantastic view of the city with beverages and nibbles and a cash bar. We stay here more than we stay at the Fairmont, Hilton, Ritz, Intercontinental, and Westinn Harbour Castle because of this, though the Westinn comes in at a close second and is marvellous in the summer. This last stay they gave us a room by the elevators and they are loud. We heard screeching all night. If they offer you a room behind the elevators, I would ask to switch and actually go to another hotel if they can’t - there are several good ones in the neighbourhood.",
      "rate": 4.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Perfect spot for a getaway weekend",
      "text": "Busy, very clean hotel in a fantastic location.  We spent the weekend in a king room (corner location provided a great view of the city). The room was outfitted with the right amenities (fridge, coffee, comfortable bed, good linens) and was spacious.  We opted for the breakfast buffet (well worth the price with the room) and the staff there was friendly, attentive, and professional.  We also utilized the valet parking, which was super-convenient.After taxes, each night (Friday and Saturday) cost $208 US",
      "rate": 4.0,
      "tripDate": " December 2019"
    },
    {
      "title": "Atrocious ...",
      "text": "While the facility is beautiful,  the customer service is simply atrocious. Besides it taking at least 7 to 10 mins to get anybody at front desk, requesting your room to be cleaned is a mission and a half. We requested a room clean at 3 and then had to push it by one hour. The story continues at 4 pm when the cleaning person sees we are about to leave to our meeting and angrily asks us to leave within 5 minutes otherwise a clean wouldn't happen. Well, we left. Only to come back in the evening at 10 pm and find no clean, no towels, no nothing. This after requesting a clean 3 times. There's barely any room service. And just everything is a mission and a half. Suffice it to say, never again.",
      "rate": 1.0,
      "tripDate": " April 2022"
    },
    {
      "title": "Great location",
      "text": "Stay here often when we book the theatre, friendly staff, concierge  staff are friendly, knowledgeable and experienced. Andrew is my go to!  Just love this location, economical parking at City Hall lot, dozens of great restaurants within walking distance as well from steak houses to eclectic eateries nearby. We typically go out to eat with family when downtown but other guests are highly complimentary to their \"Club floor\"",
      "rate": 4.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Customer service",
      "text": "I am a long standing SPG and now Bonvoy member and have had no issues until the customer service and lack of understanding I received from Jonathan and Victor tonite. 2 days before Christmas I decided to take my wife and 3 kids for a stay at this hotel which I have stayed numerous times for many years. I booked 2 rooms by phone and explicitly asked about club lounge access for my entire family during my stay and was told upon booking that they will all have access given my status. That being said upon entering the club lounge I was told by Jonathan that I would have to pay $55 extra per kid?? I asked the front desk manager that evening and was told the same even though I was not told this upon booking. I understand there are policies but I asked for some compromise given the misinformation I received upon booking and the fact this has never occurred during the 15 years of loyalty. Victor’s suggestion to rectify the situation was to pay the $55 per kid even if they just have a glass of milk with no further consideration of the overall situation. I then asked him if my kids have a glass of milk and a cereal if that was worth $55 and he said no but I still have to pay. Not sure what a reasonable compromise would be to this situation but thought I would share this disappointing feedback",
      "rate": 1.0,
      "tripDate": " December 2021"
    },
    {
      "title": "Booking nightmare",
      "text": "I know this is not a review on this hotel stay but felt I needed to post this .I had booked to stay in this hotel for July . I booked through booking.com with the book now pay Later and  free cancelations up to the 5th July Under the terms it said that the hotel may take a deposit to ensure the credit card is legitimate.However I didn’t think they would take the full amount of €1700 . 2 weeks later after they took the money I cancelled this hotel and emailed the hotel that I had cancelled and would appreciate the €1700 to be refunded .12 days later no refund ( it’s been 4 weeks in total since they took the money ) I finally got through to the hotel (phoning Canada from Ireland ) to a lady in reservation who was adamant that booking.com had taken the money even though it was stated on my credit card bill it was the Sheraton hotel I am just annoyed I didn’t get her name as she was no help at all and kept saying it was booking.com booking.com that took the money .I got in touch with booking.com and they told me it was the Sheraton that had taken the money and not booking.com and the lovely lady Annie who  I was speaking to ,  did everything to assist me and is now dealing with the hotel on my behalf .I am completely annoyed that a well known hotel chain like the Sheraton can treat people in this manner . And have incompetent staff that didn’t have the decency to take my name or try to help me knowing how distressed I was . I definitely will never ever book this hotel in the future .  Joanne",
      "rate": 1.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Great location and hotel",
      "text": "This hotel is conveniently located within walking distance to great shopping and eating. The staff I encountered were all very friendly and try to accommodate you in anything you ask for. A little disappointed there is no microwaves in rooms, however I heard you can phone and request one, but not sure about that or if there is a charge for that. Would definitely stay here again.",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Spending NYE in Toronto",
      "text": "We were greeted with a friendly smile at check in and the process was Smooth. The rooms had two queen beds and the size of the room was average, as expected. The room could use updating. We upgraded to have club level access because we were told that for 12/31/19 they would be passing out late night appetizers and they would have a open bar. It was an extra 100 per room. Although they charged they were completely unprepared for the number of people. They offered Tostitos with cocktail sauce (not even salsa) and a sheet cake. It was disappointing. They did not have the ingredients to make the drinks on the menu. We ordered room service and they got the order wrong. They were completely unprepared. The view of the fireworks was nice but they completely missed the mark. The hotel is centrally located.",
      "rate": 4.0,
      "tripDate": " December 2019"
    },
    {
      "title": "New Year Eve 2020",
      "text": "This hotel is located in a AAA Location, it looks from the internet booking website to be a 5 star hotel, it is not, it is clean, yes, but it functions more like a 3 to 4 star hotel. Great to view the fireworks at City Hall but that is it! Next time we will book a room to view the fireworks but will be staying at a much better hotel, this property lacks good restaurants, proper breakfast and a more impressive roof top lounge. It has the feel of a family hotel where you bring all the kids and pets - seriously not our thing!",
      "rate": 2.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Location, location, location",
      "text": "Choosing a hotel in Toronto is not an easy task. They're all pretty expensive, even compared to other big cities and they're all pretty much concentrated around the city center. For my first visit to Toronto I wanted to make a good start, so I chose the Sheraton Toronto Center. It is located right at the foot of the famous \"Toronto\" sign on the central square.And the Sheraton makes you pay for this location! At well over 700 euro (800 cdn) per night for a small room I had high expectations. First impression: this is a big hotel! The hallway is huge and where other companies suffer from a shortage in workers, the Sheraton is very well staffed. Even when I arrived 2 hours early, receptionist Lilly delivered service above and beyond. Although my room wasn't ready yet, she found me a similar room with a significant view. Her warm, practical welcome made an excellent start to my stay with the Sheraton. Hotels should really cherish dedicated workers like Lilly!Although not the biggest room (#4115), everything was clean and so pristine that it felt like I was the first person to ever stay there. So house keeping also did a great job.Thanks to the high floor, the noise from the city somewhat fades away guaranteeing a good night's sleep.During my 1 week stay in the hotel there was always someone at the reception or in the central hall to help me plan day trips or solve minor problems. Once, room service was so fast that they knocked on my room within 1 minute (!) of my request.Anything bad to say? Yes, the hotel is very much car oriented. For pedestrians there's no entrance, no grand facade, no nothing. One has to enter where the cars enter, which is a dark place reeking of exhaust gasses. How about a fresh air entrance? Or only allowing electric vehicles? And asking old cars to stay outside where the exhaust gasses can blow away? Holding my breath every time I want to enter the hotel isn't a great experience...In summary: at the Sheraton you pay for the location. And they make you pay a lot! While the Sheraton didn't do anything wrong, I later found out there are even better hotels at much lower prices. However, they are not at the central square with the big \"Toronto\" sign.",
      "rate": 4.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Not sure what to think...",
      "text": "The Sheraton Centre in downtown Toronto was my go-to hotel whenever I visited Toronto prior to the Covid-19 pandemic. However, I stayed at this hotel from Aug 19 to 21. While the hotel is newly renovated and looks beautiful. I think this stay didn't live to my expectation as I was looking forward to staying at this hotel like I did prior to Covid. For starters, there was no ice machine etc on the floor I stayed on so I had to ride to a different floor every time I wanted to get something. Secondly, I asked for housekeeping from the phone operators (twice) but it seems they failed to put me on the housekeeping list as when I was a housekeeper who was working on the floor, she said my name/room did not appear on the list. But luckily she was able to clean it whenever she was finished with all her other rooms.",
      "rate": 2.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Safe, secure and amazing staff",
      "text": "In addition to the great location, well appointed rooms and amenities, the Sheraton Centre Toronto Hotel takes safety and security very seriously. The staff are polite, professional and will go above and beyond to ensure their guests are well taken care of. I was impressed by the hotel's commitment to following all COVID-19 protocols.",
      "rate": 5.0,
      "tripDate": " September 2020"
    },
    {
      "title": "All-around wonderful",
      "text": "We truly enjoyed our stay at the Sheraton Centre Toronto on Queen St.  The hotel's location was perfect, within walking distance of Christmas Markets, restaurants, the Scotia Bank Arena (for an awesome hockey game), and the enclosed shopping center (Eaton Centre).  It was perfect!  The BnB restaurant on the main floor was fabulous.  The breakfast buffet was truly incredible, with something for every taste!  The Christmas Day dinner was so good and we were made to feel so welcome.  Everything about this hotel, from the friendly and professional staff to the prime location was absolutely perfect!",
      "rate": 5.0,
      "tripDate": " December 2019"
    },
    {
      "title": "Review Sheraton Centre Toronto",
      "text": "I seldom write reviews unless the experience was very memorable. I was extremely disappointed with the price point for this hotel in terms of value. While the location is ideal, the hotel rooms are most definitely not. The service was extremely poor, there is never any one available to answer, the front desk or concierge service doesn’t pick up calls. Neither does the restaurant, we ordered room service and they forgot to pack 1/2 the order as well as the utensils, and no one could pick up the phone to correct it after many attempts. At the hotel, room service is only offered when requested but the front desk doesn’t pick up the phone so there is no way to make the request unless you go in person to the lobby and speak to some one.The room itself was very shabby and dirty. There we’re stains all over the carpet I felt uncomfortable walking barefoot. The bathroom was small and dated the shower curtain was filthy and looked like it was an original to the hotel. It seems that if you are very near elevators, those rooms are newer, than the rooms accessed by the second set of elevators.I cannot recommend this hotel in good conscience. Having stayed previously there was a considerably noticeable decline and it was not a good experience or value for money spent.",
      "rate": 1.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Great location and food",
      "text": "This property has been around for many years but the upkeep and regular renovations are ensuring that the quality remains. The location on Queen Street and a short walk from Eaton Centre as well as within the CBD make this a good base for Toronto. The hotel is very big with over 1000 rooms. Unfortunately this also reflects in the number of guests using the beautiful lounge on the top floor. The layout of the lounge is excellent but there aren't enough tables and seats for so many guests. Generally I am used to experience lounges in a more relaxed and exclusive way. The line during breakfast in particular was too long and the place is understaffed so that empty tables aren't cleared quickly.However the rest of the hotel was great, rooms are well equipped with whatever one needs. The bed and bedding are were very comfortable. Valet parking is efficient and the ordering of our car via the online system was smooth and efficient. Of course parking charges are very high like elsewhere in Toronto.Check in and check out was smooth. Overall a good property to consider when staying in downtown Toronto.",
      "rate": 4.0,
      "tripDate": " December 2019"
    },
    {
      "title": "Home Away From Home",
      "text": "We needed to move out of our house for a week during the start of the second Covid wave in Toronto.  We were not thrilled.  But the Sheraton Centre Hotel made for a delightful home away from home.  Upon arrival, it was clear that they took safety very seriously. We had zero concerns during our visit.  In fact, it was all so easy and comfortable it felt more like a staycation.I can’t say enough about the pool. I think it’s Olympic-sized! It’s open all day and heated to the perfect temp.  So much so that when you tuck your head outside the indoor part of the pool, you don’t even notice if it’s cold or even raining.  And if you happy to get some sunny days as we head into late Fall, you can still spend the day on the patio relaxing by the pool. The staff are all so lovely. While obviously some services are limited, they didn’t let you want for anything and someone was always available to help.  Special shout out to Sharon the manager and Mary by the pool. They also have a great system for getting you food at almost all hours and you can’t beat the location in downtown Toronto. Make sure you check out the waterfall court yard. While the world may be a bit quieter these days, it’s still a pretty unique place that you don’t find very often in the middle of a hotel in the middle of the downtown of a major city. Food tip: check out the Assembly Chef’s Food Hall across the street (Richmond side). It’s basically fancier food stalls which, in some cases m, are the small siblings  of other well know restaurants in Toronto. A bunch of the stalls are Covid closed, but they still have a patio, a bar and some great eats available.",
      "rate": 5.0,
      "tripDate": " October 2020"
    },
    {
      "title": "EXCELLENT CUSTOMER SERVICE & CLEANLINESS",
      "text": "I stayed again at the Sheraton Centre Toronto Hotel at Queen Street and compliment one of your employee in the Front Desk named MARILYN BOCALAN for the excellent service.   Her professionalism and ability to help of the situation exceeded my expectation.I have been finding myself coming back at the Sheraton because the staff goes above and beyond with the services that I received.   And Marilyn gave extra level of precaution reminding us to do social distancing, wearing mask  and sanitize our hands since all the places they have  sanitizing stations.The high standard of cleanliness of the hotel makes us more safety to stay. Thank you so much Sheraton and will be back in few weeks.",
      "rate": 5.0,
      "tripDate": " October 2020"
    },
    {
      "title": "Great hospitality",
      "text": "This is one great place to stay at when visiting TO. Whether business or personal travel, this hotel offers a travel everything needed to feel comfortable. Clean rooms, quiet hallways and very polite staff.thank you all.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Wait to stay until renovations are done",
      "text": "This hotel is completely under construction. The lobby is non-existent. This would have been ok, but it’s all the other things that created a negative experience. These include: when we checked in the woman was very nice but kept telling people in line she would “just be a minute” and it felt very rushed. It would have been nice if she told us there was no room service and no housekeeping; our room is allegedly “premium” but is worn and looks nothing like the photos on the website; the towels in our room were musty smelling - have they been sitting here since August? (The hotel was closed all of September); when we asked the valets for an umbrella they said they don’t have any; on day 2 I called and asked for more towels but 5 hours later they hadn’t arrived so I called again. I asked for a full set but got only bath towels; I called last night for more coffee and towels and spent several minutes on hold so I hung up. Why can people go to hockey games but housekeeping can’t come into a room when we aren’t here?",
      "rate": 2.0,
      "tripDate": " October 2021"
    },
    {
      "title": "Excellent Stay! Central Location, Book!",
      "text": "My family and I (3 adults, 1 toddler, 1 infant) traveled down from NY and stayed in a 2 Queen bed room for 1 week and had an excellent experience. From the moment we parked our cars with the friendly and helpful valets, we knew we made the right decision. The woman at the front desk was extremely helpful and was nice enough to move things around so that we could get a room with a good view for my toddler. We were on the 16th floor facing the square and it was perfect! The man who helped us with our many luggages (parents traveling with kids will understand), was extremely patient and we never felt rushed or like we were bothering him. We only needed housekeeping once and when we did call for it, the woman (whom we met later and was so pleasant) had cleaned the room perfectly; felt like we just checked in again! I was able to fit my pack and play in the room and there was still enough space for all of us to comfortably move around. We ate once at the little restaurant in lobby and the food we ordered (sliders and french fries) was really good! And as usual, the workers there, super helpful and friendly. We also went to the indoor/outdoor pool once during our stay and it was pretty cool as well. The fact that you could be in the water indoors or outdoors depending on the side you swam to was a unique feature.The night we came was also the night that the Caribbean festival, Carribana was happening so they required quests to wear wristbands after a certain time. They also had additional security who were actively checking to make sure guests were entering. I appreciated the diligence because before the set time, the lobby was crowded with extra people who clearly were not guests. It was annoying because they were just milling around in the way but the hotel did a very good job of managing the crowd.This hotel was at the center of Toronto and walking distance from so many shops and restaurants. We also went to the Harborfront Centre multiple times which was a quick 15 min ride away. We already know we're coming back to Canada and when we do, we're definitely staying here again!",
      "rate": 5.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Lovely renos to public areas but miss Starbucks",
      "text": "We haven't been to this Sheraton in three years because of the pandemic and because there were many renovations happening at the hotel. Previous to that, we stayed here many times over the last 20 years.We parked under City Hall.  It was $45 for 2 nights with easy underground access to The Sheraton and the PATH. The front valet parking seemed too busy at the time.  We arrived at 3:30pm and with no line-up at the front desks...just lucky...friendly Anastasia checked us in.  It was our anniversary and Anastasia provided a $30 credit to spend in the hotel and a lovely King room facing City hall on the 30th floor.  We recognized our favorite  front desk person, Tammy, and enjoyed a warm greeting from her.  We were so happy that Tammy recognized us.  It was also nice to see that Sheraton managed to retain one of their best employees.Our room was not renovated but clean and large with a small fridge, a one cup coffee maker and safe all hidden in the large dresser, along with 2 large drawers.  There was a large screen TV on top, and a large closet with plenty of hangers, iron and ironing board. The bathroom was small, with hairdryer, tub-shower combo, make-up mirror, large mirror, hook on door and like other Marriot products, had the large body wash, shampoo and conditioner bottle attached to the wall in the shower.  There was a bar of soap and a large bottle of hand wash and hand cream beside the tap.  Kudos for getting rid of those little bottles.   The open shelving under the sink allowed for our toiletries in a bag but felt like more convenient shelving could be installed.There were 4 pillows, king bed was comfortable and high off the ground, a large desk, desk chair, extra chair, armchair and ottoman, with a floor lamp and side table,  suitcase bench, 2 bedside tables with plugs, lamps and one had a clock radio with ipod dock.Our room attendant was lovely but I forgot her name.We ate in the new restaurant and Gary was our server.  He greeted us warmly, was personable and made us feel welcome and taken care of.  He is an asset to the team!We had chicken breast and mac and cheese.  The chicken breast was so tasty and tender and the mac and cheese was delicious. (We like to order mac and cheese all over Canada, this was in the top 3)The gym was great, clean with all the necessary equipment and wasn't crowded.  The pool....I was looking forward to a nice swim but after attempting a few times, I gave up.   The problem was that there were so many kids it was impossible to enjoy a swim.  They were having fun and the pool looked nice, but might I suggest that they have \"adults only\" from 9pm to 11pm?  I was unaware that there was a fee to use a chair.  If that is the case, then its disappointing and a definite negative.We will return!!",
      "rate": 4.0,
      "tripDate": " August 2023"
    },
    {
      "title": "Amazing Private Suite Dining Experience & Stay!",
      "text": "We booked the Dine & Stay package at the Sheraton Centre Toronto. It was a very memorable and unique experience. Because of COVID-19, Toronto restaurants are closed and even places with indoor dining are not able to to provide private rooms. The Suite Dining at the Sheraton Centre was perfect for a safe dinner experience. We had a suite with two connected rooms, one with a dining table and the other with the bed. The meal was delicious from the appetizer and main course to the coffee and dessert after dinner. I especially enjoyed the salmon crusted with pumpkinseed. The highlight of the night is that we were able to watch Chef Andre through livestream on our TV in the suite, while he prepares the dishes and talk to him personally. The hotel is very clean and the room is also very nice. Outside the window is a view of the city of Toronto, which you can enjoy throughout dinner.The staff were very friendly and professional throughout our entire stay. Special thank you to the hotel manager, Shane and the Suite Dining manager, Abhijeet for the wonderful experience. We had a great stay. Would definitely recommend!",
      "rate": 5.0,
      "tripDate": " November 2020"
    },
    {
      "title": "Check your credit card for extra charges!",
      "text": "My credit card was charged for my stay two weeks before I checked in. When I arrived to check in, the person at the front desk asked me to pay for my stay, so I let her know I had already paid. I even showed her my credit card statement that clearly showed a charge from the Sheraton for the exact cost of my stay, but she kept repeating that they hadn't received payment. Another staff member said the charge was likely just a hold on my credit card to make sure I had enough to cover my stay. I called my bank and after 45 minutes on hold I spoke to someone who confirmed that I had been charged by the Sheraton for the cost of my stay, it was not a hold but an actual charge. I went back to the front desk and they said I was reimbursed for the charge two weeks ago and that's why I was being charged again. But my card does not show any record of reimbursement. In addition to this charge, my credit card is now showing a hold for an  amount greater than the cost of my stay. I am now waiting for the accounting department to look into this and they aren't in until tomorrow. Needless to say this has added a lot of stress to what was supposed to be a weekend away. Sheraton used to be my hotel of choice but now I will never stay there again.",
      "rate": 1.0,
      "tripDate": " February 2020"
    },
    {
      "title": "An OK stay at an promising hotel in a great location.",
      "text": "Beautiful new lobby. Quick check in at prime check in time. Beautiful view from our room on the 41st floor. Comfy beds and good shower. The room took us back to the early 2000s with carpet, Ethernet, glass tops on furniture and hard to find outlets. Heads up to those paying for club lounge access. Access is only available for 2 persons, even if paying extra person fee for a 17-year-old to stay in the room. We were disappointed to have our son turned away from the lounge. We’d stay again but obviously not upgrade to club level.",
      "rate": 4.0,
      "tripDate": " June 2022"
    }
  ]
}