{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Shuter House",
    "url": "/Hotel_Review-g155019-d3965575-Reviews-Shuter_House-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "2.0",
      "reviewCount": 33
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "118 Shuter St",
      "addressLocality": "Toronto",
      "postalCode": "M5A 1V8",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0f/ed/94/87/photo0jpg.jpg?w=500&h=400&s=1"
  },
  "description": null,
  "featues": [
    "Free High Speed Internet (WiFi)",
    "Children Activities (Kid / Family Friendly)",
    "Laundry service",
    "Air conditioning",
    "Hair dryer"
  ],
  "reviews": [
    {
      "title": "Ok for one or 2 nights",
      "text": "Place was ok, people were nice that operated front door and parking, cheap price for alot of space and amenities, beds were ok, towels were really rough, wifi was nice to have, parking was 12 a day, we stayed in room 4, bathroom was very tiny so if you are a bigger person you wouldn't fit in shower very tight squeeze, very outdated, not really clean, 2 beds and sofa, cable TV, cobwebs on ceiling, walls need paint, very very noisy, walls are paper thin, they say noise needs to be kept down between 8pm and 11am but the people that run the place didnt obey that, the owner had construction going in the house while we were there which woke us up at 9am in the morning which was disrespectful to guests, renovations are nice but not during times when people are staying there,  commom area for washing clothes and cooking, very hot in room cant control heat during winter, and you wont get your money back also if you have to leave early. Overall ok for 2 or 3 nights max but not any longer than that. Close to things downtown for walking distance which was nice.  Just wasnt comfortable there so glad we left early.",
      "rate": 3.0,
      "tripDate": " January 2020"
    },
    {
      "title": "The worst start of our holidays",
      "text": "I booked an entire apartment at the Shuterhouse 5 months ahead and I paid one night deposit. Despite that when we arrived there the place was double booked and the owner (Linda) moved us to the University apartments in Chinatown. This place was filthy, dirty, moldy, with dirty sheets and towels. mm little daughter got an impetigo in there and I was running to the hospitals instead of visiting places. What is more lINDA charged us 90$ per room per night instead of 70$ per room per night as she had previously said and refused to give us a refund. HIGHLY NOT RECOMENDED. THE OWNER IS NOT A TRUSTWORTHY PERSON",
      "rate": 1.0,
      "tripDate": " August 2014"
    },
    {
      "title": "Never never never again !!",
      "text": "I was sooooo disappointed I actually cried :-( from the broken blinds on the front door (that was filthy ) to the saggy mattress on the bed if I could have found another room anywhere I would have left immediately ...... Please please don't go here",
      "rate": 1.0,
      "tripDate": " June 2014"
    },
    {
      "title": "Avoid!",
      "text": "I booked this hotel for two days for a conference.  The eating area was dim and the fridge was dirty.  The free coffee did not include coffee filters, so much for included.  My hunt for coffee filters uncovered rodent poisons in amongs the edibles in the kitchen.The room itself was shabby, the mattress saggy, and dingy overall.  The shelf above the coatrack was tacked up with 1x2s.  There were no hangers.  It was so depressing we couldn't bring ourselves to stay there.I naively paid for the two nights before a closer examination.  I was offered no refund.  Later I was notified by booking.com that I was a no show, and charged $210 (which I will not be paying).Avoid like the plague!",
      "rate": 1.0,
      "tripDate": " September 2015"
    },
    {
      "title": "STAY AWAY!!  TRAP!!!",
      "text": "DON'T try to make reservation!! even from BOOKING.COM!!!They are cancelling your booking without any reason!!!The main reason is that  THEY ARE SELLING FROM HIGHER RATES IF YOU MADE AN EARLY CHEAPER BOOKING!!!Avoid!!!",
      "rate": 1.0,
      "tripDate": " September 2018"
    },
    {
      "title": "The night before the surgery",
      "text": "I had a surgery sheduled for 7.45,but needed to be at hospital at 6 on a monday morning. Well we decided to book a place to stay instead of fighting the traffic from Brampton. We were very please to see how easy it was to book it. The lady texted back if we had any questions. The room was very clean and very large. We had a private bathroom and private  backyard. It was clean. You have to remember this is an older home. We enjoyed our stay and I will be recommending this place. It was quiet. We had a very good night sleep.",
      "rate": 4.0,
      "tripDate": " April 2017"
    },
    {
      "title": "Good experience - buena experiencia",
      "text": "After reading all the bad ratings, we were very afraid of what we could find. But when we got there... It was just allright. Maybe it's not the cleanest and newest instalations, but it's worth the price you pay. The rooms and bathroom are ok. It's very well located and it's cheap. You got a little kitchen if you want to cook or store food. If you are looking for a centric and cheap hotel this is your place, I would repeat. Después de leer los comentarios espantosos nos esperábamos una casa horrorosa... Pero esta muy bien! No es el hotel más limpio ni nuevo de la ciudad, pero por el precio que pagas está bien. Habitaciones y baño bien. Tiene una pequeña cocina para uso propio. Muy céntrico y barato. Repetiría.",
      "rate": 4.0,
      "tripDate": " July 2015"
    },
    {
      "title": "AVOID",
      "text": "Here are a few photographs of our room at Shuter House. I would have gladly left after the first night, but this property has a no refund policy for cancellations, so my niece and I had to stay for the second night, as I had made reservations for two nights.  This was a special trip my niece and I  had been planning for months.  Our trip was ruined because of this flop house. When you arrive at Shuter House, you are not greeted like you would be in a regular Inn or B & B, you must first ring the door bell and a disembodied voice gives you the code for the keypad so you can enter the building.  The voice also tells you which room you have been assigned. I learned later that the voice belonged to the owner who does not live on the premises. We never got to meet the owner.This voice gave my niece  and I our room number.  It happened to be under  the stairs, in the basement, not in the main part of the building as you would expect it to be, based on the promotional photographs.  After waiting for 30 minutes for someone to come and greet us, and two more conversations at the front door intercom  with the disembodied voice , a woman finally showed up.  She was not the owner and we were never given her name.  Our room had no closet to hang up our clothes, no phone to call for any assistance, if needed, no toiletries, no face cloth, just one towel for each of us, and getting two keys for each of us was an issue, even though I had indicated we would be two people in the room when I made the reservation. That first night we only got to sleep around 1:30 am. The walls were paper thin.  The noise from people in other rooms walking around, talking, taking a shower, flushing the toilet, etc could clearly be heard in our room under the stairs. The second day, we moved to a different room on the top floor of the main house. Still no closet to hang our clothes, no toiletries, no facecloths, no customer service.  The disgusting photos I am sending are from that room. I asked the woman how I could reach her if I needed anything and was told she also had a room in the building.  I never found out where that room was.  Around 10:00 pm that evening I tried to watch TV.  It did not work, So again, the only way to speak to someone was to go outside and ring the front door to speak to the disembodied voice through the intercom, because guests are essentially on their own if a problem occurs.The voice told me it was late and no one could help me with the tv.  As you will see from the photo the TV screen was broken.  Perhaps that was the problem.  I then went to sleep having had little sleep the previous night.  Then around 3;30 am, my niece and I were awoken by a man on the porch, screaming aggressively at the top of his lungs.  This went on for at least 30 minutes.   My niece and I were terrified.  Again, because guests are left completely on their own at Shuter House, with no support from the owner, whoever she might be, or staff, I called 911 to request police assistance.   When I called I was told they had received a similar call. Perhaps from another guest, perhaps from a neighbor.  Certainly not from a Shuter House staff member,since none were on the premises!  Finally, the screaming man left the front porch and moved on. I highly recommend you avoid this property at all cost.",
      "rate": 1.0,
      "tripDate": " August 2018"
    },
    {
      "title": "Sad and neglected",
      "text": "Shuter House has so much potential - it's a charming house on a row of heritage houses facing Moss Park. Fantastic location and good views. Once upon a time, the design of the place (exposed brickwork, skylight in the stairwell, the shower with its built-in window-wall, wooden indoor shutters...) would have been impressively modern, considering this is a conversion; years later, it is neglected and unloved. If a building could convey depression, this would be it.It is not the fact that almost everything is shabby or dirty that bothers me. It is the owner's attitude. Selena, who merely works there and welcomed us, was lovely and helpful. I couldn't help feeling sorry for her trying to look after a place like this and probably having to handle complaints every day. It IS cheap. But just a few tweaks that cost very little would make this place great. Example: rather than treat visitors as honoured guests, which should be every guest house's mantra, you feel that you are being patronised like an idiot student. Scruffy notes (see photos) in the common parts, threatening eviction or fines, sharply contrast with Toronto's friendly, welcoming and laid-back vibe. Never presume the worst of your guests! Details such as reachable bedside lamps would have been amazing. Some storage as well. If you are going to put rugs down on a perfectly decent wooden floor, make sure they aren't grubby. Bins emptied more regularly would have been a nice touch. The kitchen area was serviceable, but there was certainly no promised free tea or (real) coffee. Tons of flour though...How about it, Linda? If the guests do their bit - do the dishes and not smoke pot in their rooms (though I can see why they might want to...) - will you give the place a bit of TLC in return? It deserves a lot more love.",
      "rate": 2.0,
      "tripDate": " June 2017"
    },
    {
      "title": "Horrible, never stay here!",
      "text": "A friend and I booked seperate rooms to stay during a conference. I only booked for the duration of the conference, but my friend arrived a few days before it and stayed a few days longer afterwards.The place looks shabby and quite dirty, but since we were not spending time there except for the nights, it was initially okish for us. But then, at the last night of my stay, my friend was informed that she had to leave her room the next morning and go to another hotel the owner had arranged for her,  because a group of people booked the whole first floor of the hotel. No warning in advance, no possibility to switch to another room, no refunds, etc. The next day, my friend tried to talk to the owner again, trying to get anything done (difficult, since the owners English is quite bad). The main reason was the location of the hotel she was supposed to go to: farther away from all the main tourist attractions and in a pretty shady neighbourhood. This conversation lasted very long and emotions ran high. Eventually she did get a refund for the night she had to stay in the other hotel. We later heard this happened multiple times before, so this is definitely not just an incident. It ruined our last day together in Toronto, and will really be a blemish on our memories of this trip. So all in all, don't go to this hotel! It's not just old, worn out and dirty, but guest are not made feel welcome at all. Even worse, it feels like people are not respected at all, since I would not even ask a non-paying house guest to leave the next morning without any notice and proper alternative!",
      "rate": 1.0,
      "tripDate": " October 2015"
    },
    {
      "title": "Affordable and central",
      "text": "This clean lodging in heritage row housing is less than a 10-minute walk to the Eaton Centre and St. Lawrence Market areas. The room (#5) we stayed in had two comfortable double beds. The bathroom was shared with one other room, requiring a stair climb to the next floor - just a minor inconvenience. There is a central well-equipped shared kitchen and dining room. All rooms are accessed via a narrow staircase, so this is not suitable for wheelchairs or less mobile guests. The room price was moderate and definitely competitive for this central location. One negative, however, was that it took three phone calls over two hours between 2 and 4 pm before staff answered the phone to let us in.",
      "rate": 4.0,
      "tripDate": " July 2017"
    },
    {
      "title": "Got charged for not staying due to noone speaking English.",
      "text": "Ok. Where do I start..I don't normally I'm afraid to stay in lower quality hotels but, this is not hotel.Don't be fooled.It is like Airbnb, you get a room in a quite raugh neighborhood and you have to follow silly rules .For example owner demands to take shoes off straight away after entering main hall.I would understand a room , but on another hand you guys advertise this as hotel and j can wear whatever I am pleased in the hotel so.Arrived by 11 to ask if I can leave my luggage noone to say yes or no.Outside homeless people where constantly fighting and nearby is a centre for homeless.No shops (as in grocery ) apart from one and not even Tim Hortons nearby.Have relocated to harbour Westin hotel by the harbour for whooping 20£ extra. And best thing... Hotel has cancelled their reservation themself and tried to charge me.In general for 90£ a night there is way more better places than this and I wish I would never tried to save.Don't bother unless you like living a life of adventure.And before anyone says you get what you paid for, look at places I usually stay. Half price to this junk and way safer.",
      "rate": 1.0,
      "tripDate": " October 2018"
    },
    {
      "title": "DO NOT STAY! I REPEAT DO NOT STAY!",
      "text": "The price tells it all, Its Chea[ and thats what you get.  They couldn't even bare to advise me that I couldn't park where I did and received parking tickets the owner refuses to pay even though there was neglect in important information.  I repeat, DO NOT STAY.  It is worth the couple extra bucks to stay elsewhere.  This is only the beginning of the negative reviews.",
      "rate": 1.0,
      "tripDate": " July 2018"
    },
    {
      "title": "Reasonable  place to stay",
      "text": "I was looking for a reasonable and centrally located place to stay for 2-3 nights. My search criteria include free WiFi and private bathroom.And that's what I got. A calm place (my room is in the back), it's clean, Wi-Fi fast and shower hot. I didn't expect anything else.The host is lovely and all processes are  pretty easy. So all my expectation were met. It's a good place to stay for that price.I didn't rate 5 star because of the area. Moss Park isn't the safest place to be at night but manageable when you know how to behave (or just take a cab or Uber at night).",
      "rate": 4.0,
      "tripDate": " February 2018"
    },
    {
      "title": "Clean and reasonably priced. Parking available.",
      "text": "It was easy to find the place, but no one was there to answer the door. A quick phone call brought Serena, who was very pleasant and helpful. Although the website says no parking, there is a small lot less than a block away that you can park in for $10.00 a day, CASH ONLY; the owner has an arrangement. The room was very clean, as was the shared washroom, although the availability of the facilities depends on how many people from the other suite are using it at the time. The location is great, close to Eaton Square (subway), restaurants and shopping, but the neighborhood is not too loud.",
      "rate": 3.0,
      "tripDate": " May 2017"
    },
    {
      "title": "Forgettable experience",
      "text": "I had high expectations for this B&B. I was disappointed. This cannot be called a B&B, I am not even sure it qualifies for a cheap motel....The place has seen better days and needs to be renovated. We showed up and there were major street works being done. A quick phone call from the management to let us know about it would have been appreciated. Not an apology, nor even an offer of a rebate for the discomfort. The room had bare minimum, with gallon jugs (yes, jugs) of soap left on the grungy floor of an even grungier shower stall. No AC. A stand up fan instead. No breakfast, unless the forgotten half-eaten fudge cake in the drawers count for that. A series of warnings on the walls advising that certain behaviors would result in immediate expulsion without reimbursement, or eXtra charge that would ensue. This is rather offensive and should cease immediately. However, the staff was very nice and helpful. Unless nowhere else is available, I will pass in the future.",
      "rate": 2.0,
      "tripDate": " September 2016"
    },
    {
      "title": "Never Stay Here",
      "text": "We booked the 118 Shuter house property. When we arrived we were shocked to find out that the owner has two units but only lists the photos for one of them online. She lists just the \"good unit\" upstairs that has a balcony, light areas, living room, nice kitchen, and a designer looking bathroom. This was not the case. The one she placed us in was dark, dirty, no living room area, and not at all what we expected. We later found out this house is also located in the primary drug and prostitution district in Toronto. It was very close to a homeless shelter as well; We were not offended by this, but did find that the men were often aggressive in their request for money, and at night the ladies in our group felt uncomfortable walking home alone or trying to bring food back from the subway. We contacted the owner, Linda, who informed us that the properties were the same because the \"square footage was the same.\" We requested a discount/refund and she stated that she would not do that. At times it was difficult to communicate with her because her primary language is French. Homeaway was great but we were unable to find another property in the area due to such late notice. They tried to contact the owner who informed them that she would not give us a refund even though she was dishonest in her listing. They encouraged us dispute the charges with our credit card company. There were only 2 reviews on Homeaway that didn't seem too bad when we originally booked the property. We later discovered that  there are several reviews of this property listed on other websites that were less that glowing. Wish we had Googled the property before purchasing it. There was very little to do in the neighborhood and quite a distance from any grocery store. We never ate in the area at any local restaurants, but did go to  chain Tim Horton's around the corner a few times.",
      "rate": 1.0,
      "tripDate": " July 2016"
    },
    {
      "title": "*PLEASE AVOID*",
      "text": "The photos on the website we booked on must have been taken 20 years ago because when we arrived it looked like Herman Munsters weeked place. We stayed 2 nights and found somewhere else. The area was unsafe and well known by the locals. I would rather stay in a time share tent on gaza strip.",
      "rate": 1.0,
      "tripDate": " July 2018"
    },
    {
      "title": "Avoid like the plague",
      "text": "The photos looked ok , so we booked , could not have been more wrong , it was like a decent prison. The area is so unsafe, druggies all about , paid 70 dollars for parking , which was a seedy back yard , where a couple were taking drugs openly. Maybe if had have been in a safer area we could have coped. We paid in full, after one night we moved on and went to the Chelsea Hotel , best decision I’ve ever made. The area as time moved on, we learnt was the highest murder rate in Toronto and possibly Canada. Looking online can see it’s up for sale , which make me realise why it’s basically neglected , should have tried to get money back knowing what we know now, but just wanted to get my wife away from the area to safety. Do not stay here if you value your own personal safety , I will surely be more careful booking next time.Would posted a pic of our wardrobe , but we didn’t have one , just a coat rack with two coat hangers .The gutter on the balcony was hanging off , see photos",
      "rate": 1.0,
      "tripDate": " July 2018"
    },
    {
      "title": "Terrible fraudulent dishonest. DO NOT EVER BOOK THIS PROPERTY.",
      "text": "I had booked this place through booking.com three months in advance and got an approval. A week before I confirmed my check in time and got a confirmation. On the day of my arrival they apparently sent me a mail a couple of hours before my check in that my \"Card was invalid\" and that my booking was therefore cancelled. I was in a flight and saw this message on arrival in the city. We then called them and said we would pay entire amount on arrival. They told us they had already sold the room. So this was just a ploy to sell the room for higher prices. Need less to say we went to another place which is way better and with honest and helpful people. In the hospitality business such properties are a shame to the domain!",
      "rate": 1.0,
      "tripDate": " June 2018"
    },
    {
      "title": "Location!!",
      "text": "Location is very good, in an old heritage house in the garden area but 5 mins walk from Toronto´s main street (Yonge). So very central. 25 mins walk to CN Tower, Dundas Sq. appr 10 mins. We walked to most of the sights, even to the Royal Ontario Museum. Metro and Hop-on bus on Dundas corner. Nice view from the street toward the skyscrapers. Entrance is very narrow (not very pretty but upstairs look better) and need to climb the steep stair with the luggage. Our quad room was facing the street but silent. Shared bathroom on other floor, sometimes had to wait a bit for the toilet. It was clean and renewed. Room was big enough, bed ok. There were some ants in the room but some white powder was used to keep them away. There is a small kitchenette and fridge for common use, always clean. Good Wifi. Parking very close (10CAD per day) or on the street in front of the house by meter. Helpful personnel, flexible with check-in/out.",
      "rate": 3.0,
      "tripDate": " October 2017"
    }
  ]
}