{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Sky Suites Yorkville",
    "url": "/Hotel_Review-g155019-d12683919-Reviews-Sky_Suites_Yorkville-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.0",
      "reviewCount": 7
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "85 Bloor St E",
      "addressLocality": "Toronto",
      "postalCode": "M4W 3Y1",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/17/f9/5e/37/dine-in-style-in-the.jpg?w=500&h=-1&s=1"
  },
  "description": "Situated along the granite sidewalks of Toronto’s famous ‘Mink Mile’ in the city’s exclusive Yorkville neighbourhood, this extraordinary high-floor corner suite will impress even the most discerning travelers. All our properties are corner suites featuring two bedrooms on opposite ends for maximum privacy, comfortable queen-sized beds, two marble-clad bathrooms with showers including an ensuite with bathtub, dining table, large living room with generous seating, mahogany cabinets and hardwood flooring, ten-foot ceilings throughout, spacious balconies, in-suite washer and dryers, high-speed wireless internet, and home theatre featuring a 75-inch HD television and over 300 channels.",
  "featues": [
    "Paid private parking on-site",
    "Free High Speed Internet (WiFi)",
    "Fitness Center with Gym / Workout Room",
    "Hot tub",
    "Bar / lounge",
    "Bicycle rental",
    "Game room",
    "Children's television networks",
    "Parking garage",
    "Wifi",
    "Wine / champagne",
    "Billiards",
    "Board games / puzzles",
    "Strollers",
    "Pets Allowed ( Dog / Pet Friendly )",
    "Airport transportation",
    "Shuttle bus service",
    "Car hire",
    "Meeting rooms",
    "Facial treatments",
    "Manicure",
    "Pedicure",
    "Salon",
    "Steam room",
    "Waxing services",
    "BBQ facilities",
    "Baggage storage",
    "Concierge",
    "Currency exchange",
    "Non-smoking hotel",
    "Outdoor furniture",
    "Sun terrace",
    "24-hour front desk",
    "Express check-in / check-out",
    "Private check-in / check-out",
    "Dry cleaning",
    "Laundry service",
    "Self-serve laundry",
    "Ironing service",
    "Shoeshine",
    "Allergy-free room",
    "Air conditioning",
    "Housekeeping",
    "Safe",
    "VIP room facilities",
    "Bottled water",
    "Microwave",
    "Refrigerator",
    "Iron",
    "Bridal suite",
    "Non-smoking rooms",
    "Suites",
    "Family rooms"
  ],
  "reviews": [
    {
      "title": "wonderful experience",
      "text": "This is a really beautiful apartment , It is really spacious and has great views , There is free WIFI so was able to watch Netflix on my computer. The kitchen had all the necessities except no dish cloth , great for a business trip stay And good value for the money. restaurants were next door so food experience was also great .",
      "rate": 4.0,
      "tripDate": " November 2019"
    },
    {
      "title": "Superior apartment in great location ",
      "text": "Found this great place after staying at a nearby hotel. Chris provided a very warm welcome and did a full walk-through of the self catering apartment and all it’s facilities. It had everything from fully functional kitchen with dishwasher to washer and dryer. My stay was very comfortable and very relaxing - next to the subway and the Path. Nearby shops included top brands and great restaurants. I have booked to go back!",
      "rate": 5.0,
      "tripDate": " February 2019"
    },
    {
      "title": "Easy and Inexpensive",
      "text": "Tornoto is an expenisive city. My daughter and I were lucky to find this great apartment to rent. Its on the best block in Tonornto and used to be the old Four Seasons Hotel. Lvley front desk, gym in building, great views. Very clean and I loved ahving a kitchen. Super convenient across the board. We will likley go back next trip up to Toronto",
      "rate": 4.0,
      "tripDate": " May 2018"
    },
    {
      "title": "Emergency Funeral In Toronto from Dubai",
      "text": "Our family of three stayed at the Sky Suites Yorkville March 24th-March 31st. Although I made the reservations 24hours prior to arriving using Travelocity’s bundle option with airfare, and communication with the Sky Suites management was difficult due to limitations with our overseas mobile carrier, Chris allowed us to check in late. We typically stay in upscale hotels but decided we could use the space to accommodate us and our 13 year old son. We were very happy with our choice. Here’s a list of our Pros, Cons and Recommendations. PROS:1.  Very nicely furnished w/ comfortable furniture and all amenities needed.2. Rooms were spacious. 3. Very large TV (son/husband loved it)4. Fantastic location. Starbucks, Tim Horton’s, supermarket, shopping center, and many restaurants within 3-5 min walk. 5. Basement parking provided. 6. Washer/dryer in condo. 7. Front desk security was very helpful and friendly. 8. Very clean. 9. Very close to the subway. CONS:1. Master closet door was off track (as this style usually is)2. Master duvet was annoying. Insert kept slipping down into a big ball. 3. Washer/dryer was serviced last 2 days of trip. Not a huge deal but would’ve used it if available. RECOMMENDATION:1. Provide an umbrella. 2. Fix closet door. 3. Provide a few more towels4. Replace duvet. Pretty but a pain. Overall, we were very satisfied with the accommodations and Chris was very friendly and helpful. We highly recommend Sky Suites in Yorkville.",
      "rate": 4.0,
      "tripDate": " March 2018"
    },
    {
      "title": "It is not a hotel",
      "text": "This building is not a hotel. It can be found on Airbnb for renting furnished apartments. We expected it to be a hotel but to our surprise it isn’t. The apartment is spacious and the kitchen is fully equipped. Cleaning detergents are provided. There is no lobby, no concierge and no cleaning services. We were charged 100 dollars for cleaning when we booked. It is clean but the rugs aren’t. The bedsheets and linens are old. The iron was broken and the broken part was wrapped in plastic. The location is the best thing about this place. I wonder why there aren’t hotel apartments in a huge city like Toronto. We couldn’t find one. The available accommodation is suites or rooms in hotels.One more thing, if you need extra pillows or beds you have to pay more. If you rent it from Airbnb , you have to buy these things if you need them. There is no one to help you immediately. You have to contact the manager who is available until 6 pm.",
      "rate": 3.0,
      "tripDate": " July 2018"
    },
    {
      "title": "Best little find in Toronto",
      "text": "We had the pleasure of staying at Sky suites on our visit to Toronto,as we were traveling around we were after an apartment style accomodation this place was great. It was a two bedroom apartment,2 bathrooms ,fully equipped kitchen,lounge room,balcony and laundry. Chris the manager was very helpful throughout our stay contacting us to make sure we had everything we needed.To find a place like this in the middle of the city was fantastic it was so clean and it felt like home. I totally recommend this hotel/apartment to anyone travelling it was the best place we stayed in our travels.",
      "rate": 5.0,
      "tripDate": " July 2017"
    }
  ]
}