{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Smile Back Bed and Breakfast",
    "url": "/Hotel_Review-g155019-d7722356-Reviews-Smile_Back_Bed_and_Breakfast-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.0",
      "reviewCount": 8
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "2547 Eglinton Ave W",
      "addressLocality": "Toronto",
      "postalCode": "M6M 1T2",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/09/b8/fb/91/smile-back-bed-and-breakfast.jpg?w=500&h=-1&s=1"
  },
  "description": "This is a great accommodation for any guest who wants to venture out in the Toronto Area. We are located in the Greater Toronto Area (GTA). All your immediate amenities are within this vicinity. We are Torontonian, Canadian hosts; we are travelers too. Walking distance to several stores, and Public Transit (TTC). Easy access to downtown Toronto.",
  "featues": [
    "Free parking",
    "Free High Speed Internet (WiFi)",
    "Free breakfast",
    "Children Activities (Kid / Family Friendly)",
    "Airport transportation",
    "Business Center with Internet Access",
    "Meeting rooms",
    "Baggage storage",
    "Wifi",
    "Chapel / shrine",
    "Gift shop",
    "Non-smoking hotel",
    "Shared bathroom",
    "Shared kitchen",
    "Shared lounge / TV area",
    "Shops",
    "Private check-in / check-out",
    "Clothes dryer",
    "Dry cleaning",
    "Laundry service",
    "Washing machine",
    "Ironing service",
    "Bathrobes",
    "Air conditioning",
    "Desk",
    "Housekeeping",
    "Room service",
    "Iron",
    "Kitchenette",
    "Complimentary toiletries"
  ],
  "reviews": [
    {
      "title": "Twilight Zone Bed and Breakfast",
      "text": "This place was not what me and my fiance were expecting. I would describe it as more of a youth hostel. The place had separate small bed rooms with shared a kitchen/living area. They had a kitchen stocked with mostly dessert and bread items. I will say it was clean and the staff were friendly. I just feel it shouldn't be called a bed and breakfast when they don't offer any hot breakfast. It's a self serve breakfast and items like there cereals looked like they were sitting open in the cupboards for awhile. We ended up eating breakfast elsewhere. Also the parking situation was interesting. They had us make our own space along the wall of a public parking space.",
      "rate": 3.0,
      "tripDate": " June 2016"
    },
    {
      "title": "False Advertising",
      "text": "This is a youth hostel, not a \"bed and break\". While the place is clean and affordable, its located in a somewhat shady neighborhood that is several miles from the city center. The \"Bed & Breakfast\" itself is housed in a one story brick building, which it shares with a church and some sort of resale shop. The \"free parking\" is basically the alley of a public parking lot. As for the complimentary breakfast.....  expect to be referred to a refrigerator filled with cheap pastries from Walmart.  If you want minimum accommodations and dont care where you are located, than this is your place.",
      "rate": 3.0,
      "tripDate": " July 2016"
    },
    {
      "title": "Weird and misrepresented ",
      "text": "This is the weirdest place is have stayed in over 20 years of international travel. The description on TripAdvisor is incorrect. So also the other internet sites. This converted basement under a small mattress store with a few rooms and shared bathrooms and toilets. My room was a foot to two feet wider than the bed with a washbasin next to the bed. I am sitting in the common area since the room is just too small. This could be a youth hostel, certainly not a hotel. It was very warm too but the old gentlemen told me that it was standard. There were people coming in and out. I really wish that they and trip advisor had accurately depicted the place as I had planned to work and take calls and this has wasted my day. The lady at the store was warm and polite. This may be great for some people as the rooms are not dirty and the people are warm but not for business travelers or people who want some privacy.",
      "rate": 2.0,
      "tripDate": " October 2017"
    },
    {
      "title": "Weird Set Up",
      "text": "I don't typically write a lot of reviews but I felt prompted to write this after our stay at Smile Back.... in all fairness, the property was clean, the bed was comfortable and the owners were very nice.... The presentation and layout of this place is so weird. First of all, the building is actually a Furniture showroom with a church in the back..... the bed and breakfast is wedged in between these two businesses and has a side entrance where you go down a flight of stairs feeling like a basement..once inside there is a common area with sofas, a tv, odd tables and a mismatch of furniture..... it almost looked like the space was previously used as some type of office or doctor's office because there was a reception desk on one wall.... there were four bedrooms none of them had their own private TV ...there were two shower stalls and two seperate toilet rooms with sink vanities.... the toilet was not close to our bedroom so in the middle of the night it was not convenient...... the thermostat was locked and we felt uncomfortable because it was rather hot ... there was traffic noise consistently all night and the area seem to be a little sketchy.... this place should really be called a youth hostel and was way overpriced for what the accommodations were.... it looks to be like parking is a problem as well...I'm mostly upset because Expedia calls this a three-and-a-half star bed-and-breakfast totally mislabeled and misrepresented.....",
      "rate": 1.0,
      "tripDate": " July 2017"
    },
    {
      "title": "How to scam people during Toronto's housing shortage",
      "text": "Rats, prostitution, horrible customer service (asked 3 times for fresh towels and still didn't receive it). You live in a basement that is stuffy (they refuse to keep the fan on properly, even after asked). They tell you to keep the door shut cause this area is dangerous/has a lot of homelessness. They hold church service in the same building (look at the tv security footage) and sing very loud. You're only entitled to a bed and a SHARED BATHROOM, SHOWER AND COMMONPLACE. There's a kitchen, but you can only use it till 19:00. No breakfast is included, another lie. (Just call it bed, not bed and breakfast.) Discounts mentioned at the reception are if you're only 1 person. (150 first night, then 140 for the rest if you are 2 people paying daily. ) Don't forget that the price mentioned doesn't include tax. They barely clean the place. Just unprofessional and for the price they're asking...You also get a CAMERA in the middle of the common place area! Lesson learned. If you ever plan on coming to Toronto, best book your stay ideally 2-3 months before arrival (at a reputable site like airbnb). Or you will be forced to stay in this type of place where you are not welcome, only your money, rats and prostitution (in that order). Or pay $500+ a night for something decent (due to late booking and no availability). Stay healthy ladies and gents.Alternative: Try studio 6 Mississauga. Comparable price, but you get a room (2 beds) with a kitchen all to yourself. With a laundry in the building.",
      "rate": 1.0,
      "tripDate": " September 2023"
    },
    {
      "title": "Cute bed and breakfast off the beaten path",
      "text": "The bed and breakfast was a little ways outside of Toronto.  We booked it late at night and they were very accomodating since we didn't get there until around midnight.  It is located under a mattress store and the owner was super nice.  There are 3 bedrooms, 2 separate shower rooms, and 2 separate bathrooms with a nice kitchen.  Everything was super clean and updated.  Very nice place to stay; I would go there again!",
      "rate": 5.0,
      "tripDate": " August 2017"
    },
    {
      "title": "it was a good place to visit and to take a rest, near the road very convenient.",
      "text": "they have nice room for cheap price. accommodation comes with free breakfast and free parking. it has centralized aircon/heater, clean wahsrooms,clean kitchen, friendly customer service. very thoughtful, they will ask you what you want for breakfast and they will make it for you the next morning.",
      "rate": 4.0,
      "tripDate": " August 2015"
    }
  ]
}