{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Sonder The Wellesley",
    "url": "/Hotel_Review-g155019-d1235878-Reviews-Sonder_The_Wellesley-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.5",
      "reviewCount": 33
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "29 Wellesley St E",
      "addressLocality": "Toronto",
      "postalCode": "M4Y 1G7",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/25/1a/94/9a/sonder-the-wellesley.jpg?w=500&h=-1&s=1"
  },
  "description": "Welcome to The Wellesley — one of the last standing Victorian-style buildings on the street. Your remodeled rustic room is the perfect space for a cozy sleep. Or a relaxing time with Roku streaming. The backyard makes for a serene hideaway in the Church Yonge Corridor. This downtown neighborhood has plenty of shops and attractions, like the CF Toronto Eaton Centre and Royal Ontario Museum. Plus, the Toronto Gay Village is around the corner. And with Wellesley subway station across the street, the rest of the city is easy to explore. Surrounded by modern skyscrapers, The Wellesley is your comfortable city escape. Due to the historic building, spaces are only accessible by stairs.",
  "featues": [
    "Paid public parking nearby",
    "Free High Speed Internet (WiFi)",
    "Business Center with Internet Access",
    "Meeting rooms",
    "Baggage storage",
    "Non-smoking hotel",
    "Express check-in / check-out",
    "Laundry service",
    "Street parking",
    "Wifi",
    "Air conditioning",
    "Desk",
    "Housekeeping",
    "Coffee / tea maker",
    "Complimentary toiletries",
    "Hair dryer",
    "Non-smoking rooms"
  ],
  "reviews": [
    {
      "title": "Self-Check in Hotel with Good Public Transit Options",
      "text": "Being a self-check in hotel, I had great communication with the staff via Booking.com.  They were quick to respond and answer all questions I had which was good to know prior to getting there in case of issues.  The room code you get will only work at 4pm and not before, even if the room is already made up.  I felt the late check in should be allowed to be moved up if the room is ready that day like most other hotels do as 4pm is pretty late.  There is, however, luggage storage that is monitored and you use a key code to access which is avaliable the entire day of your arrival and check out days.  So that was at least good to know and I used that.  The hotel has everything easily labeled, so you know where things are, where to get extra towels, soap, etc.  The room was small with a big bed.  Not much else but a table and a chair and a small table on one side with a socket to plug in phone chargers, etc.  The other side of the bed had a lamp, so you couldn't use that to plug anything in.  Also there was a shelf with an iron on it.  I ended up putting a towel over part of the ledge so that I didn't accidentally hit my head exiting the bathroom to the bed as it's sharp and the space is limited in the room to move around.  Bathroom is small, with soap/shampoo dispensers that are bolted in and locked, however, I found the bolts were easily removed giving access to the contents in the containers.  This could pose an issue if someone were to put other liquids besides what was marked in there.  Lots of pillows, and the bed was fine.  The window shades you need to pull down or up, but there was no stick to allow you to do that.  I ended up having to make a make-shift pull from clothes hangers that were there so that I could open or close the blinds.  In the back there is a small courtyard with tables and chairs that you can relax in if you want.    The location is great, right down from the subway station and giving you access to the city.  It's an interesting concept, cheaper than many other hotels and better rated than the lower tier ones and I have seen this hotel in Phoenix before and never elected to stay as I wasn't sure how it all worked.  Now that I have stayed at a Sonder, I'm more apt to chose it if the price was the best in the future.",
      "rate": 3.0,
      "tripDate": " June 2024"
    },
    {
      "title": "Very mediocre",
      "text": "Although the location was excellent, the property was incredibly small, and the pictures did not show the room in the correct way. My partner and I travelled with 2 suitcases and we could not have them both open in the room. The air-con also didn't work which meant the window had to stay open, and being in the middle of the city, meant for partly sleepless nights. The cleanliness of the room was okay, but could be much better. In all honesty, I wish I paid a little extra and stayed elsewhere. If you're thinking of staying somewhere central in Toronto for a long period of time, I would not recommend this.",
      "rate": 3.0,
      "tripDate": " April 2022"
    },
    {
      "title": "Worth it???",
      "text": "Location was great. It was clean. Price was good, but considering it is a hotel without an elevator and staff to serve you?  not sure. When I booked it, I honestly did not feel comfortable providing my passport images, etc. Also, not happy with upfront payment of my stay. It was not clear on the site it was a different kind of hotel ( no staff). Although i did not need any staff, I would feel safer if there were. I did not like to be in a basement room, which I could hear the train ( although it did not bother me, but it might for some people). Also, it would be good to have a small table/ desk, an iron and a small refrigerator in the room. Also, the room to store our luggage should have locks.",
      "rate": 4.0,
      "tripDate": " October 2021"
    },
    {
      "title": "Great location and unique room",
      "text": "The building and room were both very clean.  The property is in a great location - walking distance to shopping and restaurants.  The subway is across the street.  The room was unique and very clean.  The bed was very comfortable, loved the decor, and it was quiet. There is public parking next door and down the street. Throughly enjoyed my stay!",
      "rate": 5.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Birthday trip",
      "text": "My POV only. Value for money, you can't argue the price in comparison to other hotels in that area. The location is top notch. Wellesley is just off Yonge Street and that main road takes you to everything you need. From Pearson airport it cost me $15 to get to my hotel. The subway is literally bang on opposite the hotel. Now i stayed in room 101 which is based in the lower part of the hotel. You do hear the subway and i thought it was going to keep me up, but its tolerable and because you're so close to the subway you'd expect and certain level of noise. The room itself was nice and tidy and well presented. The WiFi was good, had a solid connection. I would strongly advise to download the app. It makes any conversation with the hotel much easier. If you're looking for a well priced hotel with an excellent location, Sonder on the Wellesley is by far the best deal. Price and location. My trip for 6 nights cost £600 Other hotels in that area wanted £1200-1500",
      "rate": 5.0,
      "tripDate": " November 2022"
    },
    {
      "title": "Excellent City Hotel",
      "text": "Our stay at the Sonder Wellesly was fantastic.  Easy to access, yet secure.  Room was lovely, location was perfect.  It was close to all amenities with a wine store just a block away!  One small suggestion would be to add glasses to the room equipment; there were only coffee cups and they were tiny :)",
      "rate": 5.0,
      "tripDate": " October 2021"
    },
    {
      "title": "Good Location",
      "text": "Location was good as it was a quick walk to most things we were in town for. But the beds are not comfortable, rooms are much smaller than anticipated. We also had quite a few issues with the keyless entry. (also the group with us had the same issues with their entry codes) When booking we did not know this is more like an airbnb. There is no one on duty when you arrive. You must download their app and fill a lot of information out before arrival. Also there is no maid service, so to get more towels or soaps we had no idea what to do. Just know its not a hotel.",
      "rate": 2.0,
      "tripDate": " November 2021"
    },
    {
      "title": "Comfortable Stay",
      "text": "My husband and I loved our stay at the Sonder Wellesly location! Our room was cozy and comfortable and surprisingly quiet for being in the middle of the city. The location was perfect too as we were a 15 minute walk from the museum and the subway entrance was just across the street. The only downside was that our room did not have a mini fridge, which would have been nice since we stayed for a week, but overall we were able to work around it.",
      "rate": 5.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Damp, musty basement rooms",
      "text": "I stayed in a basement room in August. The entire basement floor smelled musty, including my room. The air conditioning unit was filthy and only contributed to the musty smell. Chat support was useless - I reported the issue and they assured me they would clean it, but nothing happened (I think the AC needs a pretty thorough clean, not just a wipe over). Ditto when requesting a partial refund - promises to investigate, but no follow through. Don't bother staying with Sonder, on account of cleanliness and nonexistent customer care.",
      "rate": 1.0,
      "tripDate": " July 2023"
    },
    {
      "title": "Shining simplicity",
      "text": "The room was extremily clean with very confortable pillows and mattress. Extremely higienic bathroom with complete sets of soft clean towels and disposable papper tissue. Great location, between Yong St. and Church str., with inumerous restaurants and bars in the area. The buiding is just in front of a metro Station (Wellesley) that connected me to virtually all the key locations in Toronto in a very shep and fast way. Very quite neighborhood and great privacity.",
      "rate": 5.0,
      "tripDate": " July 2023"
    },
    {
      "title": "Only the location is good, the rest is to be forgotten",
      "text": "I understand that we are talking about a North American metropolis, therefore the evaluations on the cost of a B&B must be commensurate with the place, but frankly I don't feel like recommending the Sonder. I stayed in a room below street level, without air conditioning, small, with an equally small bathroom. Add to this that there is no key to access and one evening the code lock did not recognize me and I only entered thanks to the very lucky coincidence of a guest who had arrived in the meantime...",
      "rate": 1.0,
      "tripDate": " November 2023"
    },
    {
      "title": "Close to downtown Toronto",
      "text": "Great location, directly at Wellesley station. You can conveniently visit all sights from here. Great restaurants and cafes close by.The room is small but we didn’t mind as we only stayed in the hotel for three nights.",
      "rate": 5.0,
      "tripDate": " April 2023"
    },
    {
      "title": "Spooky manor with good amenities",
      "text": "Easy access to a simple but affordable hotel right at the metro station. Full access to Netflix etc and clean. The bed was very confortable. The outside looks a bit like a spooky manor but inside it’s all modern and well designed. Everything is available.",
      "rate": 5.0,
      "tripDate": " November 2023"
    },
    {
      "title": "Would not recommend",
      "text": "Pros:The location is great and I think this is the only positive aspect of this property.You get the A/C, TV, and tea and coffee which you can prepare with the provided amenities.Cons: Basically, this is not a hotel. It is more like a bed and breakfast without breakfast. There is no reception and no staff; you get the code that you use to enter the building, storage room, and your room.I spent 3 nights in room 101, a room that is located in the basement.It has just one small window which means that whenever you are in the room, you will have to turn the lights on because that small window does not provide sufficient light.The room is really, really small and it lacks some of the basic stuff to make your stay more convenient like a table or chair... You can hear sounds from the hallway or from the other rooms, during the night light from the hallway is coming through the doors. Each time some of the other guests flush their toilets or they leave the water running in the sink - you can hear the water running through the pipes in the walls.The subway station is located nearby and you can hear the train passing every couple of minutes.There is no place in the bathroom to hang the wet towels. Even though the place did seem clean at first, after I spent some time in the room I noticed that it was actually not properly cleaned: there was dust on the shelf and on the wardrobe, booger on the wall (I know that you cannot paint over the room before a new guest arrives, but you could at least remove it from the wall), I also found some old sock near the bed which means to me that the room was not vacuumed at all (if it was, then I am sure that this dirty old sock would not have been there anymore).I would definitely not book this place again. There are other properties nearby that cost pretty much the same as this one and I do not feel like this is a good value for money option.",
      "rate": 2.0,
      "tripDate": " May 2022"
    },
    {
      "title": "Below expectations for ~$450/night",
      "text": "No WiFi or TV (as TV is only streaming) and A/C didn't go below ~25 degrees regardless of what it was set at (noting it was only low 20's outside so I can only imagine how bad it would get when it is really warm...)",
      "rate": 1.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Simple, but effective stay in a great part of the city",
      "text": "You are truly steps from the subway at this place, so it is super easy to get around everywhere, and the place is the perfect spot that is no frills and just put your head down at the end of a crazy day in the city",
      "rate": 4.0,
      "tripDate": " February 2022"
    },
    {
      "title": "Good, but could be better",
      "text": "I would come again as it was a good price and an excellent location, but I missed at least one personnel physically present. I missed furniture for clothing and a real table to eat (specially under Covid-19 conditions) and to work.",
      "rate": 4.0,
      "tripDate": " January 2022"
    },
    {
      "title": "Horrible Company!",
      "text": "I was unfortunately unable to travel to Canada due to contracting COVID and Sonder refused to refund me for my booking. I informed them as soon as I got my test result (at the time you needed to have a negative PCR test within 72 hours of travelling). I have had to go through my bank to claim a refund via a Section 75 chargeback.The customer service has been appalling when trying to get my booking refunded. There is never a manager to speak to, and they don’t take calls. I explained my situation numerous times to their customer service agents and there was no compassion or understanding.To make things worse, when I suggested that I would like the revoke the cancellation (since they weren’t going to refund me!) and offer the room to a family member in Toronto, they said this wouldn’t be possible as the room had been booked by another customer.My plan was to just rebook the same accommodation when the time came to re-book my trip, however the horrendous customer service, lack of compassion, and sheer greed displayed by Sonder ensure I will never book with them again and will never recommend them to anyone.Their behaviour has been appalling.",
      "rate": 1.0,
      "tripDate": " December 2021"
    },
    {
      "title": "Modern and nice",
      "text": "Everything was great, but it is not as sound proof. We were told by security to keep it down when we were just having a conversation in bed. Location could not be any better if you're looking to visit downtown and food nearby.",
      "rate": 4.0,
      "tripDate": " November 2021"
    },
    {
      "title": "Great stay",
      "text": "I live in the City and wanted a get away. This place was affordable and the design seemed interesting. I had my doubts with it being a hostel and all but I was quite impressed. The room was clean and exactly how it was pictured. A mini fridge would be nice but it is a small space so I understand it is not always possible. I would definitely return and recommend this place. Clean and I felt safe. Lots of great places for food nearby and it is downtown Toronto so that’s a plus for travellers (Subway is right across the street).",
      "rate": 4.0,
      "tripDate": " November 2021"
    },
    {
      "title": "Very small room, but enough to visit and sleep!",
      "text": "The room is really very small, and no elevators here! However, the accommodation is modern. Suitable for people who just want to have something functional and spend all day outside. The location is well served by public transport.",
      "rate": 4.0,
      "tripDate": " April 2024"
    },
    {
      "title": "Air-conditioning didn't work during heat wave",
      "text": "Auto check in was good, the place was clean, but we had to leave halfway through our first night. The wall mounted a/c was so feeble that the heat in the room became unbearable (it was during a heatwave). And this was in one of their basement units -- I can't imagine how upper rooms would have been if the a/c units were bad there as well. And yes, I have similar remote control a/c units at home, so I know how to work them).",
      "rate": 2.0,
      "tripDate": " July 2021"
    },
    {
      "title": "Lock out of the building due to the problem with access code",
      "text": "Not very inspiring accommodation but the worst part was that they invalidated my building access code one day before my check out so I was stranded in front of the building. The app and their telephone customer service is terrible. Eventually they sorted out the access code problem after many attempts on app and expensive long international phone calls.",
      "rate": 1.0,
      "tripDate": " September 2021"
    },
    {
      "title": "Spring Break Stay",
      "text": "Great value for the price and nice location near the subway. Sonder support staff was accessible through the app and were consistently attentive and kind. The room was small, but clean. We would stay here again.",
      "rate": 5.0,
      "tripDate": " March 2023"
    },
    {
      "title": "Great experience",
      "text": "Comfortable, very clean and well appointed room. The chat function in the app worked well to get help when I could not figure out the Roku options. The chat personnel were very responsive, and the human who came the next day to help me further with the tech, and the lighting was terrific. He was both knowledgeable and really went out of his way to provide good service. I would definitely stay at this hotel again. I had a lovely stay.",
      "rate": 5.0,
      "tripDate": " February 2024"
    },
    {
      "title": "Great week in Toronto",
      "text": "The Sonder was an amazing little place very clean and tidy.The remote staff called me on my second day to make sure all was great.The local area was great and only 20-30 min walk to SBA.The pub nest door was also great and was made to feel like a local by my second day.",
      "rate": 5.0,
      "tripDate": " January 2023"
    },
    {
      "title": "Great stay",
      "text": "Good location for walking. Close to lots of bars and restaurants Nice clean modern roomNo street noise slept well.Fridge,coffee and tea pots in room was nice.Would like to have a microwave But still a very nice room.",
      "rate": 5.0,
      "tripDate": " June 2022"
    },
    {
      "title": "TERRIBLE PLACE I EVER HAD",
      "text": "My stay at sonder was terrible.If you want to stay awake the whole night and choose not to sleep,relax and enjoy your trip, then choose sonder.All the noise from outside is in the room.You sleep and count peoples steps from upstairs",
      "rate": 1.0,
      "tripDate": " February 2022"
    },
    {
      "title": "great location",
      "text": "This was a great stay clean, quiet and Modern for sure. This apartment building is locate next to anything you could need. I would definitely stay here moving forward if there is availability. Thanks to Sonder for putting together such a fabulous home for us!",
      "rate": 5.0,
      "tripDate": " November 2022"
    },
    {
      "title": "Great for the price",
      "text": "We had a cool room on the top floor. Kind of dark but decently quirky. The hotel was clean and quiet and we had no problems with the check-in. The bed was average and the location fantastic. Overall the hotel could use a bit more personality, it was a bit too grey.",
      "rate": 5.0,
      "tripDate": " June 2022"
    },
    {
      "title": "The Toronto Wellesly Sonder",
      "text": "Great Location. Easy to access. Plenty of things nearby and the subway steps away. Rooms wer good. the linen was clean and the Sonders app worked well. Minor complaints. No way to regulate the heat. The TV did not work and the closet space was limited. Great for single business travellers but not great for families or couples",
      "rate": 4.0,
      "tripDate": " March 2022"
    }
  ]
}