{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Sonder The Slate",
    "url": "/Hotel_Review-g155019-d21151803-Reviews-Sonder_The_Slate-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.0",
      "reviewCount": 77
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "348 Adelaide St W",
      "addressLocality": "Toronto",
      "postalCode": "M5V 1R7",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/21/52/87/01/sonder-the-slate.jpg?w=500&h=-1&s=1"
  },
  "description": "If you're looking for a unique space in the heart of Toronto's Entertainment District, The Slate has you covered. Take your pick from our selection of modern rooms and chic lofted suites – there's something here for every style. Located in downtown Toronto, there are more restaurants, nightlife, and shopping than you could hope to see in one visit. Don't worry; we've provided a noise kit to help keep the excitement out of your space. For a quick bite, the neighboring restaurant Haam offers hearty Japanese-Mexican dishes. We also recommend checking out Graffiti Alley, an urban art explosion only a few blocks away. When settling into The Slate, you're in for an unforgettable Toronto experience.",
  "featues": [
    "Paid public parking nearby",
    "Free High Speed Internet (WiFi)",
    "Complimentary Instant Coffee",
    "Complimentary tea",
    "Baggage storage",
    "Concierge",
    "Express check-in / check-out",
    "Private check-in / check-out",
    "Non-smoking hotel",
    "Air conditioning",
    "Desk",
    "Seating area",
    "Iron",
    "Coffee / tea maker",
    "Electric kettle",
    "Flatscreen TV",
    "Bath / shower",
    "Private bathrooms",
    "Complimentary toiletries",
    "Hair dryer",
    "Non-smoking rooms",
    "Suites"
  ],
  "reviews": [
    {
      "title": "AMAZING",
      "text": "Our stay was amazing! The location is perfect, we did literally everything by foot! The room was amazing, really big and clean. The bed is super comfy and big, the bathroom is also amazing, with a big tub and two shower heads. All the staff was super friendly and helpful, answering my messages really quickly. We loved our experience and will come back for sure!",
      "rate": 5.0,
      "tripDate": " January 2023"
    },
    {
      "title": "Convenient location and great price",
      "text": "This Sonder was very convenient for me because of it's proximity to my office.  The app makes check in and communication very easy.  The location I selected was quite noisy because of construction - ear plugs are provided and I was out of the room early so the impact to me was minimal but if you were planning on spending a lot of time in the room that may be an issue.  The room is clean and well designed - great wifi and you connect to ROKU with your own streaming accounts which was simple.  The amenities provided are good - coffee, tea, shower products but there are no items such as glassware or cutlery.  One other note is that parking in the area runs about $30/day and the lots are not on an app so it means running out to pay parking at 6:00 a.m or risk a ticket.",
      "rate": 4.0,
      "tripDate": " October 2021"
    },
    {
      "title": "Amazing! Highly recommend",
      "text": "First time using a Sonder property in Toronto, and it did not disappoint. I love the mobile key ability to get in the building very quickly. Everything was clean, king size bed was very comfortable, overall loved the thoughtful details, such as earplugs in case you are a light sleeper. We stayed on the second floor and did not need the headphones but we come from New York City so maybe used to noise.",
      "rate": 5.0,
      "tripDate": " November 2022"
    },
    {
      "title": "😑",
      "text": "I was very excited when I was booking this place, based on the pictures and the location (in hindsight, I should have taken some time and read through some of the reviews). I wanted to treat myself to a 2 night stay in the city, and based on what I saw on the site, this seemed like the perfect place. A massive king size bed, a huge tub, and cool modern interior design. How exciting right?Well, the excitement didn’t last that long after staying there for a few hours.For the price you were paying, It seemed like I should be getting competitive service. But no, everything is an up charge, even cleaning service??? Now I may have missed this when booking, but really?I asked for fresh towels, toothpaste, and toothpaste, the bot chat system that they have told me I could only have one service call for my stay, but they would send my request shortly. I talked to 5 different people and they all said the same thing, \"items will be there soon\"Well, I never got them! One other thing that was a huge turn off, was the strong dirty odor inside the toilet. The concept of the toilet is cool, with frosted glass and a massive door opening. But, there was no switch for a fan, and also no openings for airflow. It felt like the smell had infused itself into the tiles and glass (somehow) from each and every single toilet use over its life time. Definitely not ideal. The switch for bathroom lights was also outside of the bathroom!!! 😑So I only stayed there for one night, and although the bed seemed nice, it definitely wasn’t a comfortable bed. Now the funny part, after a disappointing one night stay, I decided to leave and contact customer support to let them know I do not want to continue my stay. They told me I had to cancel three days before my arrival. I booked the night before so there was no way for me to cancel three nights before!! Like how does that policy make sense when I’m expressing my dissatisfaction? So they didn’t want to help, and luckily I had booked it through Expedia, which took care of it right away. So overall, definitely won’t be recommending this to anyone who cares about some of the basic things that one could expect from a hospitality provider.",
      "rate": 1.0,
      "tripDate": " November 2021"
    },
    {
      "title": "Misadvertised and unfortunately disappointing",
      "text": "At a Sonder in downtown Toronto, a warning of noise, earplugs and noise machines had us ask for a room away from the noise. In our expensive 3-room unit, we got 2 rooms away from the noise but our bedroom was literally right in the middle of it, with the construction starting at 6:15am each morning, we asked for a workspace, a desk that didn’t race a bed. We got one, but it had no power outlets anywhere near it, so it was useless. So was the “kitchen” with no sink anywhere near by, one of the worst coffee machines a tiny dorm fridge and a tiny trash can. Nothing we could really use for a 4-day stay. The room was expensive and an interesting design but finished and maintained poorly. The only reason this stay gets a 2 instead of a 1 is for Sonder’s customer service and small % refund they issued us to make us feel better. I have stayed at great Sonders in MTL. I expected better.",
      "rate": 2.0,
      "tripDate": " August 2021"
    },
    {
      "title": "Very Disappointing",
      "text": "I booked a stay with Sonder as a surprise for my wife's birthday. The contact-less access was handy as we were still dealing with covid restrictions. However upon arriving at our room I came to find that the specific suite I paid extra for because of the size and view it offered had a concrete wall 8 feet from the window. Construction of a new building next door completely blocked our view, we felt very misled. Other minor details that on their own could be looked past was a large stain on the lounge chair and an open pregnancy test in the closet, which left my wife feeling a bit uncomfortable. All of that could have been tolerated but when extremely loud construction began INSIDE the hotel at 8am Saturday morning on our floor and the one above us (this is a small boutique hotel) this really turned our disappointment into frustration. There was no notice of such construction being done in the building and it continued for a number of hours. After this all happened I wrote an email to complain about our very underwhelming experience and after four days I finally heard back with nothing more than a \"Sorry you had a bad experience\" response. All in all this was very discouraging and it's unfortunate because the service has potential to be useful but the oversight on the part of Sonder resulting from a clear disconnect and a total lack of customer service makes me reluctant to ever use them again or do anything but forewarn others against doing so.",
      "rate": 2.0,
      "tripDate": " May 2021"
    },
    {
      "title": "good value for your money",
      "text": "I had a lovely two week stay at the Slate. I would say it's a good value for your money, though I must admit I booked long in advance to make sure I had the best price and had a substantial discount because it was a long stay. I have a low budget and I'm usually ok with minimal service. I booked knowing that there was no cleaning service included in the price and I was ok with it. I asked for fresh bedsheets and got them quickly, and I did the bed myself. They always replied promptly when I texted with a question. The room is well-decorated, the view is nice, the bed was confortable and it has a nice bathtub, and a good wifi connection. The building itself was very quiet, however it's on a busy street and there is construction right next to the building, so if you sleep lightly this could be a problem, but it wasn't one for me. I am sure glad that they upgraded me to a brighter room with a view on Adelaide street, because the one I was initially supposed to stay in was facing the construction site and was very dark (literally just a few feet away from a building being built: I think they should have the photos on their website updated to reflect the reality). A few things that could be improved: there was no proper towel rack in the bathroom, I had to use a clothes hanger. A person mentioned in another review that there was no ventilation; there is, but it's controlled through the thermostat panel, which can be a bit counter-intuitive. Maybe they can make it clearer. They could also mention on their website that there is a small fridge in the room. It's in a closet and looks like a safe because there's a key on it. It took me a few days to find out! I would have used it earlier. Also when you book online it would be nice if they would accept ID cards from other provinces. They only accept a passport or a driver's license. I don't drive, so I had to have my passport made (even though I was only coming from Quebec.) Finally, the French translation on their website and app isn't very accurate. They should have a French speaking person verify it, it seems like it was google-translated or something. I am mentioning these things hoping that they can look into it and make it even better :)",
      "rate": 4.0,
      "tripDate": " November 2021"
    },
    {
      "title": "Pleasantly Surprised",
      "text": "Super clean with everything you need. Check in and everything was done electronically this was very convenient. We had everything we need extra towels, coffee, tea, ironing board etc. So it was easy to get in touch with someone if you had problems but we had none. We were out late Saturday night and there was no need to wait someone to \"buzz you in\" because you are texted access codes to the building. Really good value for the money.",
      "rate": 4.0,
      "tripDate": " October 2021"
    },
    {
      "title": "Central Location",
      "text": "I had a lovely stay at Sonder The Slate! Through the description of this location on the site I was prepared to have my sleep disrupted by construction noise, but that was not the case at all. Should you visit this location while construction is underway, ear plug and a white noise machine is in arms reach! I really like that this location is walking distance to some great spots which I visited. A nice 15 minute walk to the CN tower & the Toronto Metro Convention Centre and under 10 mins walk to great restaurants. The room was clean and equipped with all that I needed, there was even a mini fridge which I wasn't expecting, but was very happy to see as it came in handy!",
      "rate": 5.0,
      "tripDate": " May 2022"
    },
    {
      "title": "Rooms have zero sound proofing!",
      "text": "I like the concept of the hotel (no reception). When my room didn't have an iron, I messaged them on the app and one was dropped off the next morning, so that aspect was good. Room itself was nice enough, although the bathtub looked extremely uncomfortable and the workmanship could've been better (a few loose fittings). But the reason why this room was terrible and why I will never return, is it has absolutely zero sound proofing. They are clearly aware of this as they leave ear plugs for you, but it's not enough. You can hear when someone in the room above or below you opens and closes their blinds, you can hear people on the street arguing, you can hear the elevator moving through the building, when someone else closes their door it's deafening loud. Like I say, zero sound proofing. If you want to sleep, don't stay here.",
      "rate": 2.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Perfect Place Downtown Toronto",
      "text": "Luckily I found the SONDER - Slate. My stay there was amazing. The location is so central. Restaurants, bars, supermarket are just around the corner. The room AND bathroom are very spacious and nicely equipped. Contact with staff was always very quick and helpful. I will always come back to the Slate when in Toronto.",
      "rate": 5.0,
      "tripDate": " February 2022"
    },
    {
      "title": "Medical Appointment Trip",
      "text": "I went to Toronto for a medical appointment and ended up having a surgical procedure. The Sonder staff was so kind and caring and went above and beyond to help me get comfortable. I was in incredible pain and couldn’t sleep. I was so thankful for their kindness.",
      "rate": 5.0,
      "tripDate": " May 2021"
    },
    {
      "title": "Excellent hotel",
      "text": "Ease of use and very convenient location. The tech was cool. Was a little strange not having a physical person to talk to but they responded via the app pretty quickly. I didn’t like that there wasn’t a place to store luggage though. They use a third party companies which wasn’t that close to my unit",
      "rate": 5.0,
      "tripDate": " August 2021"
    },
    {
      "title": "Good location",
      "text": "Very clean room in a great location. Modern and cute. Had a HUGE tub with two shower heads that had amazing water pressure. Our tub didn’t drain well all the time - it would puddle up while showering, but not a huge issue. The place is more like an Airbnb over a hotel (self checkin, no maid service, etc) which I prefer anyways. The only thing that would’ve made it better is a microwave and mini fridge. We ate out every day but had to throw away leftovers or eat it cold since we didn’t have one in the room. There are two bars underneath if you wanted a quick drink/food. Pizza spot across the street and lots of eat a short walk away!I probably would still stay here again for the location and price. But would love if they added microwaves and mini fridges to the room.",
      "rate": 5.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Great stay in Toronto ... centre of the universe :}",
      "text": "Fantastic downtown stay ... staff VERY helpful! The location can't be beat & our room was perfect. We felt right at home in Canada's largest city, super close to everything \"DOWNTOWN\". We are going to try out other Sonder Hotels.",
      "rate": 5.0,
      "tripDate": " May 2022"
    },
    {
      "title": "Good for a quick stay",
      "text": "This is in a great location downtown, close to lots of attractions and transport. The room was small but totally adequate for a few days stay. The bathroom is lovely to look at, but is a bit lacking. Not much counter space due to massive sink, and only one towel hook. Also no space in tub to store shampoo, soap etc. Bathroom door very big and heavy. Doors are code entry only, and we had trouble with our room locking us out (as well as a couple of other guests rooms as well - apparently the locks are a little touchy).Bed super comfy, and cleanliness okay. Not 100% perfect, but this place is really nice for a quick visit to Toronto. Price is almost incomparable. Very good price per night. Overall, would recommend.",
      "rate": 4.0,
      "tripDate": " April 2022"
    },
    {
      "title": "Consctruction Noise Early Morning",
      "text": "Know before you reserve here that a condo building is under construction 50 metres from the building. The banging and general disruptive noise commenced at 6:45am. I also was locked out of the building for 30 minutes on my 2nd day there, the door code was not working. I had to contact Sonder through the app to get help in resetting the code panel.",
      "rate": 1.0,
      "tripDate": " April 2022"
    },
    {
      "title": "Much worse than a traditional hotel",
      "text": "No extra towels. No extra housekeeping. Super slow and problematic wifi. Terrible noise due to construction + horrible VIEW of the construction for our unit. Slow service due to not having anyone at the front desk. Definitely won't want to stay again.",
      "rate": 2.0,
      "tripDate": " October 2021"
    },
    {
      "title": "A great week in Toronto for couples!",
      "text": "Our stay was wonderful! It was the best location in town and so close to public transit, restaurants, bars, and attractions. Check in/out was so easy, the room was clean and modern as well. Will definitely recommend to others!",
      "rate": 5.0,
      "tripDate": " October 2022"
    },
    {
      "title": "LIFESAVER",
      "text": "I couldnt thank this hotel more. I was unfortunate that the airline misplaced my luggage and never made it to the trip.Slonder listened and gave me an upgrade which made my stay so much better! A very clean room in a great location, close to all amenities downtown. Customer Care is on the ball and always ready to help! One of the staff  members went all the way to come and greet me and to check on me since i was upset re luggage - so thank you for that! Thank you Slonder for changing that frown upside down!",
      "rate": 5.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Too small lacked basic amenities",
      "text": "They just have 4 properties in Toronto, all 3 are too small,just ok for 1 day stay. The bit bigger property is way too over priced as compared to market rates for similar properties. Sadly my first experience was better,second time not worth it",
      "rate": 3.0,
      "tripDate": " January 2022"
    },
    {
      "title": "Amazing stay in the heart of Toronto",
      "text": "Nice room, very comfortable and clean and at an amazing location right in the heart of Toronto. Access was very convenient, no hassle at the time of check-in and there we were able to store out luggage post checkout. We really enjoyed our stay here.",
      "rate": 5.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Reliably great",
      "text": "What's nice about the Sonder is that you will always have a thoughtfully designed home base. It makes it nice to be in the room as part of a broader say. We were a bit worried about noise at this location but it was rare & very fine.",
      "rate": 4.0,
      "tripDate": " March 2023"
    },
    {
      "title": "Excellent stay",
      "text": "My husband and I were celebrating our 2 year wedding anniversary on this trip and decided to book sonder. Easy check-in, clean, nicely designed space, great location. If you drive, there’s a public parking space 2 mins away. The place was rather quiet considering of the location.",
      "rate": 5.0,
      "tripDate": " October 2021"
    },
    {
      "title": "Experience was amazing",
      "text": "The overall vibe of the space is immaculate and the app experience was like no other place I’ve stayed at. The chat support in the app was very responsive and I got my answers as quick as I can. Thanks for your time.",
      "rate": 5.0,
      "tripDate": " February 2023"
    },
    {
      "title": "Top notch service.",
      "text": "We had a wonderful experience at SONDER Slate. I can’t say enough how Amanda, Alana & Lucas did everything they could to make our stay memorable.  They were very attentive and responded to our needs so well.  I would definitely recommend this hotel, location is amazing but what really made it was the way they treated us.  Amazing, thank you",
      "rate": 5.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Lacklustre stay",
      "text": "No cleaning is offered, no amenities, all contactless. Overall, comfortable bed and really good location. However, for the price you pay, it’s better to get another hotel that offers more amenities and cleaning services.",
      "rate": 3.0,
      "tripDate": " August 2021"
    },
    {
      "title": "five stars",
      "text": "very clean and roomy. modern bathroom. great location. i rely more and more on Sonder when i travel and this did not disappoint once again. ive convinced friends to check out Sonder as well. so i am spreading the word and so ar we all agree, Sonder is a great way to consitiently find reasonably priced  places to stay in major urban areas. and th eSonder app is always there to answer any questionts tha may pop up duuring yoru stay. Sonder is the future of travel.",
      "rate": 5.0,
      "tripDate": " April 2023"
    },
    {
      "title": "Ok but too noisy",
      "text": "Could need some fresh paint The rooms are noisy. The app works but not everyone got it. Get a room in the back. Price Qratio is ok ish. But for the same amount you could do better. A fresh paint would help as well.",
      "rate": 3.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Want a HOTEL??? Don't stay here.",
      "text": "THIS was NOT a hotel.THIS is an issue of lumping it in with a proper hotel. This is not.I blame Expedia as much as The Sonder.No concierge, no security, no place to leave your bags on check out day, nobody to call if you have an issue... or a medical emergency. Nothing.You get a security password for the front door and hope to hell someone doesn't watch you figure out the pattern of button pushes to gain entry to the building. Of course, that is the SAME code to get into your room. Just not secure at all.Just angry. Feel cheated.",
      "rate": 2.0,
      "tripDate": " August 2021"
    },
    {
      "title": "Comfortable, stylish, and relaxed with quick access to nightlife, shopping and transport. ",
      "text": "Extrmely stylish, well equipped, comfortable and centrally located. The perfect modern loft stay in Toronto. Even though it is located on a busy street, no noise can be heard inside. The views are also really great. Sonder is setting the bar high and I'll definitely make sure to book another stay.",
      "rate": 5.0,
      "tripDate": " July 2022"
    },
    {
      "title": "A greedy staff dedicated to being inconsiderate",
      "text": "The room itself is nice, however you have to pay hand over fist in parking. Do not try and cancel or ask for change of dates, even months in advance, the staff is greedy and unwilling to accommodate regardless of factors pertaining to a global pandemic. They ask for a picture of your credit card, so they really have their claws in you. Good luck.",
      "rate": 2.0,
      "tripDate": " March 2022"
    },
    {
      "title": "Worth the search, better than a hotel!",
      "text": "Great property in a great location! Very modern layout. We had number 703, ‘The Penthouse floor.  Floor to ceiling window wall on both floors, a frosted glass bathroom, and glass along the stairway. A LOT of glass. It was very windy and sub-zero on our three days there, so there was a significant draft problem. A bit of advice: bring your own cutlery, perhaps some plates, reusable cups, and perhaps a trash bag if you will be there for more than a day and night.",
      "rate": 4.0,
      "tripDate": " January 2024"
    },
    {
      "title": "Great clean room/location for a business trip",
      "text": "Booking process was seamless and easy and the contactless checking was also very straight forward.The room was clean, amenities all there, comfortable bed, massive bathroom.Really enjoyed the personal note hand written by Alana  and the bottles of bubbly were a very nice welcoming gesture. Ran into Doneil on the main floor who was very courteous and polite and asked if we were ok and whether we needed anything additional - great customer service!Will definitely book with Sonder again, and look forward to staying at another property during future travels.",
      "rate": 5.0,
      "tripDate": " April 2022"
    },
    {
      "title": "Weekend Getaway",
      "text": "Great downtown location.  Within walking distance to theatre, shopping, sports and entertainment.  Easy access from Union Station, trams and subway.  Keyless entry was convenient and staff were knowledgeable regarding dining options.",
      "rate": 5.0,
      "tripDate": " October 2022"
    },
    {
      "title": "Modern stay great for a couple!",
      "text": "This was our first time staying at a Sonder and it was a great experience. I knew what to expect about it being different from other hotels (no check in staff, lobby, etc.) and made sure to download the app in advance so that check in would go smoothly (from reading other reviews). So, after we did that everything was easy! The Sonder was in a great location and the room was very modern! The only thing though....when booking, check to see if your room is more suited to a couple (like ours). By that I mean there was technically no bathroom door...and it was very er...open concept. Fine if you are a couple but would be more awkward with friends! Just something to mention.",
      "rate": 5.0,
      "tripDate": " January 2022"
    },
    {
      "title": "Awful customer service",
      "text": "Awful customer service, rude and disrespectful. This hotel will cancel your reservation at their discretion and will leave you hanging. They just send you an email (with this, which is super suspicious) telling you they’ve canceled your reservation and that their decision is final. Dreadful experience. Very unreliable.",
      "rate": 1.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Found my new favourite place to stay in Toronto",
      "text": "Went down for the ballet, and loved every second of this place, close to stores, food, and the entertainment District, which was perfect. Would be great for a night owls to, but my husband and I went to bed early and had no issues, they included a white noise, machine and complementary earbuds, which was so sweet even without it wasn’t bad at all. The shower and bathroom were beautiful and everything was very clean, overall one of my best Airbnb stays and honestly a little on the expensive size for the amount of space but nothing too bad will be booking here again.",
      "rate": 5.0,
      "tripDate": " March 2023"
    },
    {
      "title": "Please install usb outlets.",
      "text": "Really great stay that had everything i needed. The outside patio, the bedroom, the bathroom, the living room, the coffee. The location was central and far enough for me to take lots of pictures it was great.",
      "rate": 5.0,
      "tripDate": " April 2023"
    },
    {
      "title": "Felt like Family",
      "text": "This is my third stay at this Sonder all for medical reasons. The first two  times due to covid I was forced to stay alone. I was scared and in pain but I needed extra pillows and the service I received was above and beyond. I was even given a hand written note.  This last time I was having spinal surgery and needed an early check in due to needing to quarantine before surgery. I was offered a reasonable check in time that only differed by 30 minutes. I’m so impressed with Sonder that I may never stay anywhere else. I’ll definitely chose Sonder first. I felt like family. I’m handicapped and have a brain injury. Everyone was extremely helpful and accommodating to my needs. Thank you again for the handwritten welcome back note too. I was really impressed by that added touch. You don’t often see that type of service anymore.",
      "rate": 5.0,
      "tripDate": " October 2021"
    }
  ]
}