{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Sonder At The Liberty",
    "url": "/Hotel_Review-g155019-d23107132-Reviews-Sonder_At_The_Liberty-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "5.0",
      "reviewCount": 158
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "1100 King Street West",
      "addressLocality": "Toronto",
      "postalCode": "M6K 0C6",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2b/3e/1a/14/caption.jpg?w=500&h=-1&s=1"
  },
  "description": "A modern escape in the Toronto tech world — welcome to The Liberty. Natural light beams through the floor-to-ceiling windows. Pops of soft pinks and vibrant greens accentuate the contemporary appliances. And the fitness center has free weights and cardio equipment if you need a work break. Want a snack? Longo's grocery store is right downstairs. Sports lovers can catch a game at Lamport Stadium across the street. While foodies can sample a medley of international dishes from Mildred's Temple Kitchen. Whether you're getting down to business or hitting the town, the city is yours at The Liberty. There's no cable. We've provided Roku for streaming. The building's rooftop pool, terrace, and game room are unavailable to guests. You may hear construction noise daily from 7 am–11 pm. Earplugs are available upon request. We apologize for any inconvenience.",
  "featues": [
    "Paid private parking nearby",
    "Free internet",
    "Wifi",
    "Fitness Center with Gym / Workout Room",
    "Complimentary tea",
    "Express check-in / check-out",
    "Private check-in / check-out",
    "Washing machine",
    "Desk",
    "Dining area",
    "Seating area",
    "Sofa",
    "Wardrobe / closet",
    "Kitchenette",
    "Oven",
    "Flatscreen TV",
    "Private bathrooms",
    "Stovetop",
    "Electric kettle",
    "Kitchenware",
    "Family rooms"
  ],
  "reviews": [
    {
      "title": "Short Getaway",
      "text": "This was our second time staying with Sonder, our first time at the Liberty Village location. We had no complaints, everything was perfect. We look forward to staying with Sonder again when we travel.",
      "rate": 5.0,
      "tripDate": " January 2023"
    },
    {
      "title": "Good stress free stay",
      "text": "I like it comes with everything, you fo not need to carry anything with you like dishes, laundry soap, as the unit came with everything and the building I stayed in was new. I had coffee, came with extra pillow, the customer service is online, easy to contact. TV is available, internet is great, its clean, I liked it so much I stayed there twice in 3 months. I had to stay once for isolation, and sonder went out of their way, as they gave me a code so any food delivery service came to my door.",
      "rate": 5.0,
      "tripDate": " May 2021"
    },
    {
      "title": "Enjoyed my stay. Innovative experience.",
      "text": "I enjoyed the Sonder setup. Having an apartment-style hotel with a full kitchen was great, and paying less for services like daily housekeeping or hotel amenities that we didn't really need was good as well. Our unit was clean and ready for us when we arrived and the experience of using the app for check-in and room access was simple. The location was also great, as Liberty Village has some great restaurants and cafes and conveniently-located stores all right near our Sonder building.I'm not a fan of Airbnb because it feels like you never know what you're going to get, but traditional hotels can also feel like overkill (aforementioned housekeeping and amenities). This felt like a good middle ground.I did wish that the unit had a physical lock on the door in addition to the electronic/keypad lock (like the swing bar lock in most hotel rooms) and that the unit had a safe for valuables. Would have appreciated the additional security.",
      "rate": 5.0,
      "tripDate": " October 2022"
    },
    {
      "title": "First experience of Sonder, really impressed! Will definitely look to book further Sonder stays!",
      "text": "We really enjoyed the place. The only reason we didn’t give a 5 was because we had an issue with the fridge although this was rectified really quickly and with great communication. Communication was a little slow and laboured with dropping our cases off beforehand and leaving them after, although during our stay, the luggage procedure was updated  in the app, following a conversation with the team, and everyone was so friendly and helpful.Overall, the place was clean, really well equipped, modern, stylish and well located. The bed wasn’t the most comfortable I’ve stayed in, (being absolutely honest with feedback here, but I wouldn’t let this put us off staying again). Customer service were really friendly when speaking through the app and over the phone. Only other feedback was that we didn’t see any information in the apartment about the fire alarm and procedures. The fire alarm did go off once while we were there so this would have been especially useful. The kitchen was particularly well equipped and the nice touch of having coffee, oils, plenty of utensils alongside a decent collection of bathroom toiletries was good, in addition to having the dishwasher and washing machine including tablets. The internet was good and was good to have Tv with roku that can log you in to all your services and set up to log you out the day you leave!Location was great in terms of having Longi’s supermarket with Starbucks, and other amenities nearby and transport links. This was our first experience of Sonder (which we only found through booking.com) but we’d definitely look to use Sonder for future travel plans and would pitch this alongside booking.com and Airbnb when choosing accommodation. We were both really impressed and commented this was really what we needed after having travelled to 6 locations and staying in three other hotels and an Airbnb.",
      "rate": 4.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Don’t miss this great place!",
      "text": "We had a late flight into Toronto and everything was taken care of for us to check in seamlessly. The place was clean, modern and well equipped. The layout was ideal, with sliding door/walls on the bedroom and kitchen shared wall so you could open it up or close more for privacy. The kitchen was well equipped with coffee, tea, sugar and creamer. The only thing I would add are a few packets of decaf coffee.We had an issue with the remote control for the Roku TV and after a few tries, they got it fixed. This was late on Thursday night, after 8 pm, and we really appreciated the extra effort from Daniel (?). I think that’s who helped us out. Regardless, we did not have a problem after that. I also requested an extra blanket which was delivered right away.Having a code for the security door that matched the code for the condo door was genius. It was really easy to remember one code. The location was perfect, right on King St West, which connected us with the public transit system right outside our door. It was an easy 15-20 minute street car ride to downtown Toronto. We also took Uber to the Royal Ontario Museum and Casa Loma for less than $20/ride. I would highly recommend Sonder as an option for staying in Toronto and we will definitely stay here again when we return.",
      "rate": 5.0,
      "tripDate": " December 2022"
    },
    {
      "title": "Birthday trip success!",
      "text": "The room was beautifully modernized and clean. We loved having the washer/dryer in our room to keep up with dirty towels/clothes during the duration of our stay which was a major plus. The location really put it over the top for us when it comes to the view we had and the fact that everything you can need/want being in walking distance. Like we had a grocery store with a starbucks inside on the ground level!  Would love to come back here as my main place to stay for a trip to toronto❤️",
      "rate": 5.0,
      "tripDate": " October 2022"
    },
    {
      "title": "Fabulous place to explore Toronto ",
      "text": "When we first arrived we thought it was smaller than expected but actually it was an ideal size, so much so we felt we could actually live there.The apartment has everything you need, washing machine, dryer, dishwasher, microwave, cooker, fridge freezer and coffee maker. They even supply coffee bags and dish washer and washing nachine tablets.At first glance it looked like we were a long way from the centre of the city, but in reality you can just walk 30 minute along King St west and you are right in the centre. Alternatively you can take the number 504 streetcar which stops right outside and seems to run every 10 minutes. You can even buy the Presto card, which you need for the Toronto transit system, from Shoppers Drug store which is next door. There is also a food store a couple of doors down, which includes a Starbucks and if you like Mcdonalds then that's just a couple of minutes away. If I was too be ultra critical I would suggest that they could leave an information pack in the apartment to tell you all this.",
      "rate": 5.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Hitting most of the right notes",
      "text": "I stayed for two weeks in a one bedroom on the 7th floor of the tower, overlooking the King Street and the football stadium.  The building itself is quiet, but there is a certain amount of noise that comes up from King Street, the street cars that travel along it, and construction that was ongoing.  I didn't find the noise bothersome, and the double paned windows and doors shut out most of the noise in the evening.  The apartment is well-equipped, with a decent kitchen set-up, good quality linens and towels.  One small bedroom space was set up as an office, which suited my needs, and internet access was good.  Accessing the apartment was a trifle awkward with my three large bags because the construction of the towers results in long walks down hallways, and elevators located in strange places.  A luggage trolley would have been a help.  The neighbourhood will supply pretty much anything you will need during your stay, with Longos groceries, Canadian TIre, Shoppers Drug and Winners immediately below you, and the whole Liberty Village and Queen Street within a five minute walk.",
      "rate": 4.0,
      "tripDate": " September 2021"
    },
    {
      "title": "Very noisy location with broken furniture and leaky toilet. Difficult to reach customer service",
      "text": "There was broken furniture in the unit (chair had a broken leg, toilet was malfunctioning/leaky, broken table on the patio)The location is right above the train tracks, which was not specified in the listing, and was therefore very loud and hard to sleep through. They did offer a white noise machine however this was after repeated attempts to reach them via their mobile app. You initially reach a bot on the mobile app and they say someone will reach out to you the next day, which did not happen, and therefore you have to follow up again. It is somewhat difficult to access the unit upon arrival and I recommend that they provide clear instructions on the listing.",
      "rate": 1.0,
      "tripDate": " August 2021"
    },
    {
      "title": "Clean, Modern and Safe",
      "text": "Truly felt like a home away from home. We were provided washing pods for the washer and dryer, as well as the dishwasher and a broom. Parking was convenient and we were provided a key fob to access resident parking under the unit. Centrally located, with food and transportation in walking distance downtown adjacent.",
      "rate": 5.0,
      "tripDate": " February 2023"
    },
    {
      "title": "Perfect stay",
      "text": "Beautiful, confy, modern, well located, cheap. This place has it all! I was so happy with my stay. The only downside to this location is the noise from the train. Also, there was a wifi issue, but it was dealt with promptly.Booke Sonder, it's a no-brainer!",
      "rate": 5.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Always a great stay",
      "text": "Homely feeling throughout our stay. Everything that is needed is available (e.g. kitchen utensils, towels, bin bags, etc.). It's close to shops and restaurants and only a short trip away to the city centre.",
      "rate": 5.0,
      "tripDate": " May 2023"
    },
    {
      "title": "Avoid b&b’s",
      "text": "I’ve only written two negative reviews in all my experiences lodging on vacation. Be very careful when you think about a bed-and-breakfast. They take all the money upfront, and will rarely refund if there are any problems. If you do endeavor to solve problems, you have to navigate a labyrinth of entry-level scrubs and never or almost never end up talking to anyone of any authority. This particular organization was awful, and the Sonder hotel itself was funky and questionable.My advice to you, Sonder, not that you’ll ever read this because you proved to me that you don’t care, don’t lie. Just don’t lie, and you wouldn’t end up with so many negative reviews.",
      "rate": 1.0,
      "tripDate": " May 2024"
    },
    {
      "title": "Great location in Toronto for families",
      "text": "Excellent check-in and close by shopping right in the building. Hotel was very clean. Able to walk or take public transportation to downtown, Budweiser Stage and the water front. Area around hotel was safe and quiet. Parking was no issue off-property and very reasonable.",
      "rate": 5.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Loved My Stay Here!",
      "text": "It was a really good experience with Sonder at the Liberty. It was nice and clean. The apartment had everything we needed to cook our own meals and clean the dishes. Very central to a lot of tourist activities in the city. I would stay here again for sure!",
      "rate": 5.0,
      "tripDate": " December 2022"
    },
    {
      "title": "Excellent stay in a great location.",
      "text": "This apartment is a fantastic place to stay in Toronto. It’s location is fantastic, close to shops and eateries and is close to bus stops and street cars for downtown locations. It was easy to book and to manage the booking with Sonder. I needed a cot and a high chair and they were easily provided. The apartment itself was clean, in a nice location and excellent for a family of four. There are two good bathrooms with baths and showers. There is a balcony which overlooks a stadium which was great in the evening. The only issues that we had was that there wasn’t enough seating for all four adults and it would have been good to have more pots and pans as well as more general cooking equipment. However, I would highly recommend this apartment to anyone going to Toronto.",
      "rate": 5.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Leisure visit",
      "text": "We were visiting friends for a sporting event in nearby Bellwood Trinity Park and wanted a comfortable place to stay and it certainly was all that! Stores downstairs were a great asset. Young people all around so I knew we hit the jackpot! If I was Canadian I would Live in Toronto and in that neighborhood! While the apartment was tricky to get to with the long hallways we figured it out pretty quickly. Did I say that we Loved the apartment! It had a friggin dishwasher! Biking around the city was a huge plus!",
      "rate": 5.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Two days in Toronto",
      "text": "Wonderful room great location. Neighborhood was fantastic.  Room was clean and spacious. Balcony a plus, views were great and very hospitable stay. Eat at Egg club, streetline across the street makes for easy transportaion all around the city. Grocery and pharmacy right downstairs",
      "rate": 5.0,
      "tripDate": " April 2023"
    },
    {
      "title": "Perfect for us.",
      "text": "Reserving, checking-in and checking-out were all seamless. It was well stocked with cleaning products, hand soaps and shampoos. Happy to have a washer and dryer and a dish  washer. The apartment was very clean and comfortable. The location was perfect for us as it was close to family. Will definitely use again.",
      "rate": 5.0,
      "tripDate": " April 2023"
    },
    {
      "title": "Property needs complete refresh",
      "text": "I won’t be staying at this Sonder location in the future. Firstly, they give you only one key fob which is needed to use elevator - it’s a hassle if you’re staying with multiple people. The unit we’re in is also showing a lot of signs of wear, like damaged fixtures, clogged sinks and stains on the couch and appliances. It wasn’t the cleanest when we checked in either. And we’ve been disturbed three times today by staff fixing a clogged sink which should’ve been addressed before we checked in - what’s more, they just came without warning while I was on a work call. Definitely room for lots of improvement.",
      "rate": 1.0,
      "tripDate": " June 2024"
    },
    {
      "title": "Fabulous stay",
      "text": "We struggled a bit to actually find the apartment in the huge building but once in I can only say it was excellent. We had a one bedroom apartment which came with a comfy bed , loads of hangers and space . Plenty of charging points . A washer and dry , board and iron. The kitchen was very well equipped . We had everything we needed for our stay. There’s a nice balcony with a table and chairs so we ate outside most days. Nice views too. We are back again in two weeks but in a slightly smaller apartment but I’m sure it will be equally as nice. The toiletries are very nice too. There were 3 washing pods and dish washing liquid and tablets for the dishwasher. Plenty of grocery stores very close by. We were happy to walk into the city to watch the Blue Jays. Some very nice parks close by too. So much to see and do from this location. A lot of the road was closed due to construction but it wasn’t an issue for us. Excellent visit would highly recommend this location.",
      "rate": 5.0,
      "tripDate": " June 2024"
    },
    {
      "title": "Ideal for my needs",
      "text": "Absolutely ideal for my needs.  I was an exhibitor at a 5 day show at the Enercare Centre.  Sonder at Liberty was about an 18 minute walk each way, so the location was pretty good.  I got the parking (additional $35/day) leaving my car safe and secure in the underground parking until I left at the end of my stay.The apartment had everything I needed from kitchenware to in suite laundry.  The bed was very comfortable and the building quiet.  From inside my unit, I never heard a sound from other tenants at all.I've already re-booked for an 11 day event later in the year.(The ONLY improvement I can think of is the temperature of the water in the shower.  It wasn't hot enough for my liking.)",
      "rate": 5.0,
      "tripDate": " March 2023"
    },
    {
      "title": "Nice getaway",
      "text": "This is our second stay at the Liberty in Toronto. We loved it because of the location and being close to everything we could want or need. I mean we literally had a grocery store in the same building. The room was nice as well with a good view of everything, not just apartment buildings. Only thing that caused some stress was getting into the apartments from the main door where you needed an access code. The code worked but the door wouldnt open but there would always be people that worked or lived there coming in and out so we didnt have to worry about getting the desk to open it. Other than that it didnt mess the trip up for us.",
      "rate": 5.0,
      "tripDate": " March 2023"
    },
    {
      "title": "Terrible experience",
      "text": "They rented out a 1 bedroom unit for more than 150$ a night and while in the photos there’s a sofa in the living room, in reality there were two extremely uncomfortable chairs. I had to email them 4 times, call 3 times and message 4 times and it wasn’t resolved. They said they didn’t have any sofas they could bring in and take the chairs out. Horrible horrible experience",
      "rate": 1.0,
      "tripDate": " July 2021"
    },
    {
      "title": "Toronto",
      "text": "The staff responds right away and are very friendly! The condo was very clean and a great space.  I loved that there was a code for the doors so you don’t need a key card. This is our 2nd Sonder experience and it won’t be the last!!!!",
      "rate": 5.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Great location, will stay again!",
      "text": "Great location with transit and lots of restaurants nearby. Well-equipped kitchen, really nice upscale grocery store right downstairs. Everything was very clean. My 1BR/1 office suite had 2 bathrooms, one with a nice soaker tub. As others have said, getting to the rooms from the main entrance on King St is a loooong walk, so wheeled luggage is highly recommended (there are no hotel-style luggage carts there). The Jefferson St entrance is your best bet if you’re being dropped off in a vehicle, as there’s a bit of space for cars to stop, and you arrive in the main lobby.",
      "rate": 5.0,
      "tripDate": " April 2023"
    },
    {
      "title": "Absolutely ideal!",
      "text": "This was my 2nd time staying at Sonder at Liberty Village in Toronto for business events at the Enercare Centre. My first stay was 6 days; this time it was 12 days.Sonder is absolutely ideal.  If I were to do a “pros and cons” list, I can’t think of a single “con”.Contact-free check in and checkout are both done through the app so there’s no waiting at a desk, etc.  You get a code to get into both the building and your apartment.  Easy peasy!The apartments are very clean and so well equipped, with comfortable beds, lots of pillows, ample storage, livngroom, full kitchens and washer/dryers.  My most RECE stay had me in a corner apartment with floor to ceiling windows on both sides!  Beautiful view including the CN Tower.  The hallways, elevators and lobby are well lit and very clean.  On King Street, right next door is a Shoppers Drug Mart and to the other side is a Winners, a Longos grocery store, and a Canadian Tire.  I think everything you could possibly need is there without even crossing the street! It’s an easy walk to the Enercare Centre, and along the way, I spotted a Metro grocery store and an LCBO down a street I passed (sorry; didn’t note the street name).If you need parking, you can add that to your stay through the app as well.  The underground parking is safe, secure, heated, and very clean.  I am planning at least two 2024 trips and will definitely e staying at Sonder at Liberty.  I have dates elsewhere and will be searching to see if there are Sonders in those cities as well!",
      "rate": 5.0,
      "tripDate": " November 2023"
    },
    {
      "title": "Wonderful",
      "text": "This was a great place to stay.  We had to attend a market at the Enercare Centre which was an easy 15 minute walk away.  Everything was so convienently located near us, including groceries, pharmacy, restaurants, bars, and shopping!  It was a quick Uber ride to downtown attractions and only 25 minutes to the Airport.  Would highly recommend and if I return to Toronto I will definately look into renting again.",
      "rate": 5.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Exactly like the pictures.",
      "text": "No real surprises. The place was v.clean. The amenities complete.  The master bathroom was equipped with both  an adapted shower for wheelchairs(not that we requested such), as well as a full glass-tile standard shower stall. Very spacious. 2nd b.rm had access to their own bathroom/shower. Living area a little tight in space but nonetheless acceptable.",
      "rate": 5.0,
      "tripDate": " June 2022"
    },
    {
      "title": "This sonder is PERFECT, no joke.",
      "text": "I stayed here for 10 days, and everything is perfect to me that I might actually consider living here long-term. When I get into the room, it is exactly THE SAME as the pic that you can see online. And everything is so clean, I can’t even find a stink, so can be used with trust. The design is so nice and comfortable. The kitchen is fully equipped. The mattress and pillow is right to the point, even more comfortable the one in my hotel’s stay. The view and air from is balcony is also comfortable. The customer service was very good, everyone was very responsive and really try their best in solving ur problem. I am very glad that I have chosen this place, and I will definitely come back!",
      "rate": 5.0,
      "tripDate": " July 2021"
    },
    {
      "title": "Beautiful! Beyond our expectations",
      "text": "The location in liberty village was great, the streetcar was right downstairs and could take you into the heart of the city. There was a McDonald's, grocery store, and pharmacy right beneath the building and plenty of restaurants right across the street. The place itself was spotless, and extremely clean! Everything you need for a trip!",
      "rate": 5.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Best Hotel Experience",
      "text": "I absolutely enjoyed every aspect of my experience with Sonder. First was my excellent experience in the app which was a seamless way to access everything I needed before check-in and during. The agents who I communicated with were very knowledgable and resolved my questions within minutes. Upon my arrival, check-in was easy and contactless which was great for getting in quietly at night without having to disturb anyone. The room was large and spacious, there was an office available and full kitchen amenities, the entire suite was sparkling and beautiful. The building has a grocery store, department store and a few other easy to access stores on the ground level which is great for picking any last minute items or things that didn't make it into the suitcase. I don't have any disappointments with my experience and I will definitely be booking this experience again wherever it's available on my next travel. I think this model of stay feels familiar and home-y so it makes the entire trip more comfortable and relaxing. I definitely recommend this for couples (or anyone really) looking to have a nice quiet time, and enjoying the comforts of home away from home.",
      "rate": 5.0,
      "tripDate": " June 2022"
    },
    {
      "title": "First time with Sonder",
      "text": "I enjoyed my stay at Sonder at the Liberty. For those who are booking their first time, same as me, it's more so an airbnb rather than a hotel. There's no in-person concierge, so if you need anything you need to go into the chat on the app. I do have to say that they are quick to respond but the chat function on the app is buggy. So your screen might lag out. Side note, you will not have housekeeping during your stay, unless you want to pay like 85$ for them to clean your room. Also worth noting, your room might not look like the one in the pictures. They have multiple units under the same description. Overall the room was clean and it had everything in the kitchen needed to make a meal. Not sure if it's all rooms but my mattress was also really stiff.",
      "rate": 5.0,
      "tripDate": " January 2023"
    },
    {
      "title": "Pleasantly surprised by great customer service ",
      "text": "Our apartment was modern and well appointed, in a great location. Moreover, we were pleasantly surprised by how responsive the Sonder customer service was when we requested an extra set of sheets and needed our toilet unclogged. The staff was both friendly ajd communicative. We would happily stay at a Sonder property again.",
      "rate": 5.0,
      "tripDate": " June 2023"
    },
    {
      "title": "Great few days in Toronto",
      "text": "We stayed as a family of four in the apartment, it was great, 3 double rooms, two bathrooms and a well catered for kitchen, plenty of crockery and plates and also dishwasher and washing machine.  The sofa seated four, we also had a balcony although not the weather to enjoy this.  Supermarkets and restaurants right below us and tram stop outside, so easy and convenient.",
      "rate": 5.0,
      "tripDate": " January 2023"
    },
    {
      "title": "Best Hotel Experience Ever!",
      "text": "This is our first time staying in Sonder, and it soon became my best hotel experience so far.  As a new comer in the country, we wanted to stay in somewhere that has extra room to fit all our big suitcases and can allow us to work during our temporary stay here. Sonder satisfied and even went beyond all my expectations. It combines the best part of living in a home-like furnished apartment and enjoying the hotel level services and furnitures. The staff here are also really nice and responsive. They were able to accommodate our late check-out and early check-in requests and helped us when we switched the rooms for a longer stay. The location is also awesome. You can find grocery and drug stores downstairs and the bus station is across the street.",
      "rate": 5.0,
      "tripDate": " February 2023"
    },
    {
      "title": "Great stay in a great place ",
      "text": "Both apartments were very nicely laid out, and spacious. They had great views, although we weren’t used to city noises, the rooms were not that noisy. We had to change locations in the building as an issue requiring outside assistance occurred in our original location. The staff were very accommodating and the relocation went smoothly, thank you.",
      "rate": 5.0,
      "tripDate": " October 2023"
    },
    {
      "title": "Sonder Liberty Village in Toronto",
      "text": "This was our first time at a Sonder and it was nothing short of amazing! Check-in is completely digital so that was seamless - just put in the supplied code from the app and you’re good to go. Everything we could ever need was stocked in the apartment (dishwasher & washing machine capsules included!). The team was also really helpful in storing our bags after we checked out to accommodate our late flight. We’ll definitely be staying there again for sure!!",
      "rate": 5.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Excellent apartment Liberty village Toronto",
      "text": "Couldn’t fault anything. The apartment was spotlessly clean and was well equipped. The apartment is situated on King St with easy access to downtown Toronto even though the streetcar was replaced by buses. They stop right outside. The online checking was easy even though I had reservations about it. Messages through the Sonder app worked very well. There are shops, bars and restaurants close by. We particularly enjoyed Caffino Italian Restaurant in the old carpet factory that was only a few minutes walk away.After checking out we used the baggage storage facility which was very convenient.We would highly recommend this apartment.",
      "rate": 5.0,
      "tripDate": " March 2023"
    },
    {
      "title": "Excellent fit out with superior service from Sonder staff",
      "text": "This apartment has all the modern conveniences to make a very comfortable stay.      Complete with washing machine and dryer with a good supply of laundry soap provided was excellent.  As we stayed for 6 nights ordering more supplies such as coffee was easy to arrange via the Sonder chat.  They were extremely attentive and willing to cater to our needs.",
      "rate": 5.0,
      "tripDate": " May 2023"
    }
  ]
}