{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Stay Inn",
    "url": "/Hotel_Review-g155019-d281716-Reviews-Stay_Inn-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.0",
      "reviewCount": 340
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "560 Evans Avenue",
      "addressLocality": "Toronto",
      "postalCode": "M8W 2W1",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/1c/ac/84/fd/newly-renovated-2021.jpg?w=500&h=400&s=1"
  },
  "description": "Welcome to STAY INN. COMPLETELY RENOVATED 2021 -Enhanced Cleaning Protocols COMFY KING with LOVESEAT & COFFEE TABLE (just like home). Luxurious, All Glass, Walk-in Shower LED Mirror with Anti-Fog Function 55” LED TV Google Chromecast Eco-Friendly Bath Products Hair Dryer High Speed Wi-Fi In-house Movies Iron & Ironing Board In-Room Amenities In-Room Safe Luggage Rack Mini-fridge & Microwave Patio Doors In Ground-Floor Rooms Sofa & Seating Area Working Desk Easily accessible to public transit and seconds away from major highways, Sherway Gardens Shopping Centre, Restaurants and just minutes from MasterCard Centre for Hockey Excellence, Toronto Pearson International Airport and Downtown Toronto. Additionally, there are a wide variety of places to dine ranging from fast food to fine dining, the option is yours. When staying with us, We Offer COMPLIMENTARY• Calling within Canada• Breakfast Buffet• Movies• High-Speed and WIFI• 24/7 Coffee & Tea Service• Parking",
  "featues": [
    "Free parking",
    "Free High Speed Internet (WiFi)",
    "Vending machine",
    "Baggage storage",
    "Currency exchange",
    "24-hour front desk",
    "Express check-in / check-out",
    "Ironing service",
    "Parking",
    "Wifi",
    "Newspaper",
    "Non-smoking hotel",
    "Air conditioning",
    "Desk",
    "Safe",
    "Iron",
    "Wake-up service / alarm clock",
    "Flatscreen TV",
    "Non-smoking rooms"
  ],
  "reviews": [
    {
      "title": "GREAT LOCATION AND REALLY GOOD EXPERIENCE",
      "text": "Stayed 1 night and was very pleased. Very clean, quiet room with comfortable bed. TTC bus stop is right on the corner which takes you to the Kipling subway terminal - no need to move you car once it's parked - and parking is free. Will be back.",
      "rate": 5.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Construction continues but this is a great hotel",
      "text": "I live in Connecticut in the States.  My son and DIL live in Parkdale in the far west of Toronto, and I've visited frequently in the 13 years my son has lived there.  I often stay in rental apartments but if going for a quick trip Stay Inn has been my favorite spot to stay.  It's always been clean and safe with pleasant employees and a good breakfast.  The place is so dependable and reasonable that it's often difficult to find a room there at the last minute, which is when I usually try to book.I recently had an extended stay in Toronto for quarantine.  I was able to get a room at Stay Inn for four nights (broken up by several days out of town).  The hotel is still in the thick of renovations.  Between that and COVID, there is no breakfast right now and some of the services (laundry, coffee in the lobby) were disrupted.My room was newly renovated, quiet and safe.  I love being able to park for free, right outside the room.  Their renovations are being done at the highest possible level.  I thought the \"new\" rooms were beautiful.   The beds and linens were perfectly cozy, clean and comfortable.  The decor was stunning and rivals that of chain hotels that are double in price.  The bathrooms have been totally redone, with a vessel sink that is perfect for the space.  The tiles in the walk in shower are incredibly stylish and dramatic, in black and white.  The furniture is lovely and practical, with a cute loveseat and formica topped coffee table evoking mid century design.  Wall coverings throughout are varied and tasteful, and their variations make for subtle interest.  Staff was, as always, polite and helpful.  I bet, once this renovation is over, that this motel will be incredibly popular, so you may want to be sure to reserve ahead.  I will happily stay in future and recommend to friends and family.",
      "rate": 5.0,
      "tripDate": " September 2020"
    },
    {
      "title": "Surprisingly nice!",
      "text": "I was pleasantly surprised by this place! They were able to quickly accommodate me when my AirBnB fell through at the last minute. My room was spacious and clean, and my bed was very comfortable. I found it to be generally quiet. The breakfast gets a bit repetitive with the same offerings every morning, but it’s generally pretty decent for a free breakfast with hot options. The bus stop is right across the street, making it super easy to get to Kipling Station and then hop on the train. (Keep in mind though that you can only buy a Presto card at a subway station.) It takes about an hour to get downtown using public transport. The closest grocery store is Farm Boy which is expensive and about an 8-minute walk away. There’s also a so-so bagel place in the same complex if you need a quick meal, but generally I found few other food options within walking distance. (One last weird thing: In my room, the shower was designed in a way that made it difficult to turn on the tap without getting blasted by cold water. The water heated up quickly but I had to do ninja moves to dodge that initial blast every time.) Overall, it was a great place for what I needed!",
      "rate": 4.0,
      "tripDate": " November 2022"
    },
    {
      "title": "Myself and my three children",
      "text": "Quiet, clean, pleasant. My children and I enjoyed our stay.  Breakfast was great. My children especially enjoyed making their own waffles with the waffle maker.  The beds are comfortable and the showers are refreshing. Definitely would stay again.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Simply good value",
      "text": "We stayed here 2 nights on a weekend. Staff was polite and accommodating. Our room was on the 2nd floor and was quite clean and in nice condition. They have definitely renovated and modernized the decor throughout. Breakfast had both hot and cold options with the buffet being refilled frequently.",
      "rate": 4.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Service could have been better",
      "text": "I stayed there for a week in March 2022 and my first experience was not great. The front desk clerk not sure if he was new but he had no idea what he was doing. He wanted me to pay for the week all upfront and treated me like I was going to scam them I guess. I kept telling him that you don’t normally pay upfront but he wouldn’t listen and said that what we have to do. It was very frustrating. Other than that the cleaning staff were great, the room was very clean and nice. They stay was enjoyable. When it came to check out i found out I was charged only half the amount again very confusing. I thought maybe this was just a one off and I just recently tried to book again and when I called the front desk clerk was very rude on the phone, couldn’t find me in the system, said he didn’t have time to take my reservation and would call me back. He called back 3 hours later but I had booked with another hotel …just frustrating.",
      "rate": 3.0,
      "tripDate": " March 2022"
    },
    {
      "title": "Concert Night",
      "text": "We and another couple stayed here one night. The hotel had been renovated recently and both our rooms were very nice, bright and nicely decorated. Beds were comfortable and bathrooms were clean. Reception and check out was quick and staff were friendly and helpful. Breakfast is included and offers a good selection of options, although the dining area is small. There are two floors of rooms and there is no elevator so if you have mobility issues, you would have to request a room on the first floor. The hotel is located minutes from Sherway Gardens shopping mall. Would recommend.",
      "rate": 5.0,
      "tripDate": " June 2024"
    },
    {
      "title": "Two night stay",
      "text": "The hotel was in a retail park area which was about a 5 min drive to restaurants and shops.  There was a free car park, the rooms were well maintained and clean.  There was only two floors of rooms which you get to via the stairs.  The staff were friendly.  The only downside was the breakfast, you have to go to reception and ask for breakfast which consisted  of a large muffin ( a choice of three kinds) and a piece of fruit, not like the breakfast seen on the photographs.  There was an orange/apple juice machine and a free hot drinks machine.  The WiFi was good.",
      "rate": 4.0,
      "tripDate": " April 2022"
    },
    {
      "title": "Clean, efficient, well-maintained",
      "text": "Well maintained property - the staff hustle to get things done - nothing fancy but we weren't booking at the four seasons.  Great base location in the West End of Toronto (South Etobicoke).  The included buffet breakfast was well stocked with hot and cold choices and extensive array of refreshments.",
      "rate": 5.0,
      "tripDate": " June 2024"
    },
    {
      "title": "Great Value ",
      "text": "Great value! The rooms are really nice, clean and quiet. There is free parking on site, the staff are very efficient and the breakfast lounge served its purpose well. It's location is great as it's right by the highway and its easy to get downtown. Definitely coming back!",
      "rate": 5.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Good Stay",
      "text": "This hotel is located at a great location. Short drive to Downtown Toronto and other attractions. The room was clean and the room looked same as the website.My family enjoyed the stay and the free breakfast! If you are looking for a decently priced hotel then this the place to stay at.",
      "rate": 4.0,
      "tripDate": " April 2014"
    },
    {
      "title": "Wonderful Stay",
      "text": "For our son's wedding in Sep 2013 we booked the Stay Inn Hotel for our friends and family from out of town. Everyone enjoyed their stay. The location is convenient, the rooms are clean and spacious and the staff are friendly. The breakfast was great. Our advice to everyone is Stay Inn is a wonderful place to stay. -Koshy",
      "rate": 5.0,
      "tripDate": " September 2013"
    },
    {
      "title": "stayed for health reasons",
      "text": "this hotel was verry nice and afordable my wife had to have surgery so we did not spend much time in the hotel but when we were there it was veryy clean and quiet the breakfest was also great with good food. the beds were verry comfortable and clean would definatly stay again.",
      "rate": 4.0,
      "tripDate": " September 2013"
    },
    {
      "title": "Terrible 6:00 AM experience with the male Night Clerk",
      "text": "I tend to get up early, usually go the lobby or Breakfast Room to watch early news. 6:00 AM I am the only person in the room and change the channel manually to CNN news. 10 minutes later the TV shuts off. I get up, the night clerk says while laughing, I turned it off. When asked why he said I was not supposed to touch it despite the fact there were no signs stating that. I had to go to my room where my wife was sleeping and watch the news there. Fortunately he did not turn the TV off there. Never in my travels in various parts of the world and many times in ON. I have never experienced this lack of customer treatment. I belive he dislikes Americans. Email me if you wish at baldwinski50@yahoo.com",
      "rate": 1.0,
      "tripDate": " September 2012"
    },
    {
      "title": "A very nice property",
      "text": "I stayed at the Stay Inn for two nights during a recent visit to Toronto.  I really liked the place.  My room with two beds wasn't very large, but it was nicely decorated, clean, comfortable, and quiet.  My only complaint is that the parking lot was littered with cigarette butts.  Staff was very efficient. The breakfast was outstanding and featured not only the usual items but also eggs, bacon, sausage, and waffles.  Dishware was ceramic rather than plastic; dining area was pleasant and efficiently managed.  I will definitely return.",
      "rate": 5.0,
      "tripDate": " May 2012"
    },
    {
      "title": "Excellent Hotel complete with great location and service!",
      "text": "Last weekend, I attended a convention in Toronto and a few of the attendees were booked into the Stay Inn Hotel located on Evans Avenue in Etobicoke, Ontario.  The hotel is very close to the Queen Elizabeth Highway and the 427 Highway.  The exterior of the Stay Inn Hotel is very well groomed and the parking spaces are very clean and spacious.  Upon entry to the hotel, you are met with a very courteous and polite front desk employee. The entrance to the hotel is very presentable, clean and well maintained.  Off from the main front desk is a breakfast area which has numerous guest tables and of course, very clean and well maintained.  The guest hotel rooms were exceptionally clean and the hallways were spotless.  The beds were comfortable and the carpets were in excellent condition and also well maintained.  The washrooms were in excellent condition and fairly new.  The washrooms were stocked with extra toilet paper, soap, Kleenex and extras such as Q-Tips, shoe cloths, make-up remover pads, soap, shampoo and body wash.  The hotel rooms had new crisp sheets and comforters.  The Stay Inn Hotel provides free high-speed wireless and hard-wire Internet and free local and long-distance telephone calling within North America!  Wow, this is the first hotel that I ever stayed at that offered free North American long-distance telephone calling!  The exterior parking lot, hotel entrance, lobby and hallways are monitored and recorded with a high end digital state of the art video surveillance system.  The security is excellent and the neighbourhood is not a high crime area at all.The morning breakfast is excellent and guests have a choice of cereal, porridge, scrambled eggs, bacon or fresh made waffles (in two minutes), juice, coffee, tea, fresh fruit, yogurt, bagels, toast and cheese.  This is a great start to any morning – better than at home!The only petty downsize is that the hotel room service commences cleaning rooms at approximately 8:00 am and during my stay which was Saturday, Sunday and Monday, my intention was to sleep in until at least 10:00 am!  Other than the above petty observation, I recommend this hotel to anyone that wants to have a clean, comfortable and safe stay close to the major highways and a major shopping mall - Sherway Gardens and the many shopping facilities within close proximity to the Stay Inn hotel. The hotel rates are excellent and believe me; you would be paying twice as much for the same hotel in downtown Toronto.  Yes, you are only 8 minutes away from downtown Toronto.  Too bad the Stay Inn is not a major chain of hotels!",
      "rate": 4.0,
      "tripDate": " May 2011"
    },
    {
      "title": "A hidden gem just west of Toronto",
      "text": "I cannot recommend The Stay Inn highly enough!  Rooms are clean, modern and well equipped.  The staff and management are fantastic!!  I stayed for several weeks during April and May.  The staff could not do enough to ensure I was looked after.  Without exception they were kind, friendly, helpful and went out of their way to make me feel like \"family\".This hotel includes \"extras\" which you do not have to pay for.Hi speed internet (in room), continental breakfast and pay TV movies are all free.  Very nice given how most hotels operate these days.A note about location:  Be prepared that The Stay Inn is not located in downtown Toronto.  It's about a 15 drive west of the city core.  The hotel has excellent access to major highways (427 and Gardner Expressway) however it is in the middle of an industrial area.  There's a major shopping mall within walking distance and many fast food type restaurants.The Stay Inn is a great choice if you're looking for cleanliness, helpful staff and value for money AND you don't mind a short drive into the city.Hope this helps.",
      "rate": 5.0,
      "tripDate": " May 2006"
    },
    {
      "title": "Had a Great Time",
      "text": "We stayed at the Stay Inn 07/02 - 07/05. This hotel is a bargain and is worth the money. The rooms and hotel are extremely clean. The free breakfast was suitable and the perfect start to the day. The staff was very helpful and courtesy. I will stay there on my next trip to Toronto. Also, this place is just a short drive/ long walk to the first subway stop.",
      "rate": 4.0,
      "tripDate": null
    },
    {
      "title": "never again!!",
      "text": "I would just like to say that I will never be staying at the Stay Inn again. It is evident from the service received, that the staff is lacking in basic hospitality skills.",
      "rate": 1.0,
      "tripDate": null
    },
    {
      "title": "Great price, close to transit",
      "text": "My husband was in town for a business conference and we needed a hotel to stay at to visit the city after the conference was over. I wasn't going to pay the $300/night to stay downtown! We visited Niagara between hotel stays, so we were coming from the airport trying to get to Stay Inn. For those wondering, you take the airport rocket bus to Kipling, then the 123B bus to Evans Avenue. Maybe a 25 minute trip in all. We were assigned a room on the second floor, and the moment I opened the door, I smelled a smoke smell. Turns out the rooms below are for smokers, so it was going up through the vent. Immediately went downstairs and they changed our room to the side that is 100% nonsmoking. Hotel is definitely not upgraded, but it is comfortable. The airconditioning is next to the window, so when it turns on, the curtains blow. Quickly solved by putting something in front of the curtains, but this definitely could be more thought out. Breakfast is ok, nothing really to write home about, but it's free. Pleasantly surprised by the tub. We have been in higher grade hotels (such as a Hampton) that has been renovated, but the tub wasn't, so the thought of bathing after a long day wasn't appealing. This wasn't the case at Stay Inn. There was no sign of mold/mildew and the tub looked spotless! Very appealing after walking an estimated 6-7 miles through the day! Overall, it is not going to be as nice as Hampton or Best Western Plus, but definitely better than a Microtel or Travelodge. Again, price can't be beat!",
      "rate": 4.0,
      "tripDate": " July 2018"
    },
    {
      "title": "More than just another hotel",
      "text": "My wife and I arrived in Toronto for the night with nowhere to stay, so just arrived at the Stay Inn to check their rates, because it was convenient for the airport, being quite a way out of downtown Toronto. We got a room no problem. The Inn appears to be fairly new, so everything is in good condition. They advertise High Speed Internet access in all rooms, more for the business user I suspect but as I had my laptop with me I used it. The connection to my room was down initially, but the staff were very helpful and quick to sort the problem. Breakfast conisists of a serve yourself continental breakfast, that often I find disappointing, but this one was very good, fresh bagels and pastries, and bread for toast, alongside cereals, and tea and coffee.If you are going to Toronto to stay one night then fly out, this is a great place to stay, with some basic, but very good eateries quite locally.",
      "rate": 5.0,
      "tripDate": null
    },
    {
      "title": "Perfect if you need to be near the airport",
      "text": "It's actually pretty good especially for the price. Breakfast was also quite good. With pastries, fruit, bagels. Coffee and tea are available 24/7 for free. The rooms are big and very clean. Bathroom seemed quite new. It's no where near downtown but if you need to be around the airport this is a very very good option. I've enjoyed my stay.",
      "rate": 5.0,
      "tripDate": " May 2014"
    },
    {
      "title": "Great hotel for the price ",
      "text": "This hotel we picked because it was close to my work destination.  The room was clean. Staff were friendly.  I would stay here again and highly recommend it as a good reasonably priced hotel. Easy to get to with lots of parking available. Worth a look.",
      "rate": 4.0,
      "tripDate": " March 2014"
    },
    {
      "title": "Pleasant Surprise",
      "text": "This motel was chosen based on location from the website. What a delightful surprise it turned out to be! The room was comfy, clean, modern, with wonderful amenities. You wouldn't think this to be as nice and clean as it was, given its location, in an  industrial park area. The breakfast that is included with the room rate is worth every penny! Not your \"run of the mill\" breakfast either! Only down side is No Elevator. We had to literally drag our bags up the stairs when we arrived late at night. I would recommend if you need a place to stay close to the airport.",
      "rate": 4.0,
      "tripDate": " September 2013"
    },
    {
      "title": "loved the motel and the service we recieved",
      "text": "we spent 8 nights at the stay inn, the rooms were clean and comfortable the service was excellent!",
      "rate": 5.0,
      "tripDate": " March 2005"
    },
    {
      "title": "Excellent",
      "text": "My stay at this hotel was enjoyable and pleasant.  As it was my first visit to Toronto, the staff was extremely helpful in assisting me with my way around the city.  I cannot understand why there would be negative reviews posted about this hotel, as it was quite a lovely stay.  I reccomend the suite, in which one may enjoy a relaxing nght.  This hotel was good quality at an affordable price.",
      "rate": 5.0,
      "tripDate": null
    },
    {
      "title": "a lovely place to stay",
      "text": "I have stayed at Stay Inn several times and every time that I was there I have found nothing but exceptional service. The experience of Stay Inn has always been quite pleasant. The rooms are kept tidy, staff is well-mannered, and the overall service is great. I have stayed in hotels many times - many of which claim to be five star - that do not live up to the standards of Stay Inn. Keeping the price of accomodations in mind, Stay Inn is additionally a very good deal. The standard rooms are very nice and also reccommended are the very lovely (and not so expensive) suites. Anyone who reads this particular review should not be discouraged by the seemingly negative review posted by another patron. That invidiual should be more concerned with learning to spell, rather creating utterly false complaints. Stay Inn is truly a pleasant place to stay!!",
      "rate": 5.0,
      "tripDate": null
    },
    {
      "title": "Great Stay in this Hotel",
      "text": "We stayed in the standard room for three nights and requested a late check out on the last day, it was granted on the spot. The desk staff was very friendly and helpful in every aspect of our stay.I am amazed at the first negative commentary but pleased to see the second positive commentary which reflects our same impression. The room and the whole hotel were very clean, the beakfast was good and the staff were very professional and friendly. The cost is very resonable as well.I recommedn this hotel to anyone.",
      "rate": 5.0,
      "tripDate": null
    },
    {
      "title": "Don't get taken!",
      "text": "I booked this hotel over a month in advance of my trip. The night I arrived, the front desk couldn't find my reservation. There was only 1 room left (the Jacuzzi suite - at twice the price I was quoted).  When I arrived home from my trip I contacted the manager, first by email (to which I never got a reply), then I began phoning. I gave him my confirmation number, and the rate quoted. He advise me that someone had cancelled my reservation (not me, but he couldn't tell me who because of privacy laws). The hotel won't compensate me at all.",
      "rate": 1.0,
      "tripDate": " January 2018"
    },
    {
      "title": "Amazing value",
      "text": "After travelling as a couple for 2 weeks through Canada, we met with our daughter in Toronto and needed a place to stay before driving on to Montreal. A quick search came up with this gem. Excellent value as the rate was the best we have found in Canada to date and it included a full serve yourself breakfast. Beds comfortable, room clean and service polite and helpful. Easy to get to and quiet. We couldn't open a window for fresh air but there was an efficient air conditioner.",
      "rate": 5.0,
      "tripDate": " June 2014"
    },
    {
      "title": "Free trade Shampoo!!!",
      "text": "I liked the shampoo. It was free trade.Stay was undisturbed and professional. Rooms were kept cold. Hallways clean. Housekeeping staff will never loss their heads over unprofessional jackassery. Just a small disconnect in communication from front desk to housekeeping during my stay which was resolved over multiple re-engagements with the management and staff. Professionally handled, without admitting fault and failure towards improvements.",
      "rate": 5.0,
      "tripDate": " October 2023"
    },
    {
      "title": "We loved it!",
      "text": "The room was lovely, a king size, with the usual complementary items. We enjoyed the free wifi, the tv with services and channels galore. Breakfast was basic, but we liked it. Was close to all amenities, including St. Joseph's Hospital, the reason we were in Toronto to begin with. The staff are great people, the hotel is pristine. A lovely hidden gem in Etobicoke! Will visit again.",
      "rate": 5.0,
      "tripDate": " March 2022"
    },
    {
      "title": "A Pleasant Surprise!",
      "text": "I little gem of a hotel that I never new existed. I couldn't find anything decent in Toronto for less than $500 per night.  Then all of a sudden, I find the Stay Inn located in south Etobicoke.  $175 per night!This feels like a 4 star hotel.  I understand from other reviews that it's been completely renovated.  They've done an amazing job at it. If your looking to book a hotel that's decently priced and has a 4 star appearance and feel , this is  a no brainer.  The only draw back is it's about 30 mins from downtown.  However, it's right off the highway so no issues there.The staff are pleasant and professional and you get a continental breakfast to boot!",
      "rate": 5.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Comfort",
      "text": "Wow! Clean and spacious room, huge comfy bed, great price, friendly and professional staff, Easy access to all amenities . Nice hot breakfast, ample parking. When you want to stay in the city, choose Stay Inn, I know I will be back.",
      "rate": 5.0,
      "tripDate": " April 2022"
    },
    {
      "title": "First Time In Canada",
      "text": "The hotel was very nice , the room was clean upon check in. It was very spacious especially for two people. The staff was great when needed. The included breakfast was sufficient and did the job. I would definitely stay here again.",
      "rate": 5.0,
      "tripDate": " May 2022"
    },
    {
      "title": "watch reservations.com for extra charges to your bill",
      "text": "I like this hotel for its location. Unfortunately you must be careful when reservations are made. For a  $86 hotel room via reservations.com you will end up paying $116 for this room. What upsets me is, that this made up fee is not listed prior the registration. Once you pay, you cannot even cancel the deal. Pure theft. I just want to find out if it is the Hotel itself or Reservations.com, who are stealing $19 from you!! Please also note the time clock beside, telling you how \"your time is running out\" on this reservation. Absolutely a criminal gimmick worth mentioning, because after the registration I went to this hotel web site and they still had rooms available, and for $6.5 bucks less!! To this point, I did not even realize that I was bumped from the Hotels.com to the reservation.com. So fellow travellers, be warned and watch this (reservations.com) web site in the future !!!! The Stay Inn should ban this web site from selling their rooms. We do not need parasites like this in our lives.....",
      "rate": 1.0,
      "tripDate": " October 2014"
    },
    {
      "title": "horrible experience!",
      "text": "From the first time I called the Stay Inn located on Evans Ave I have been horribly stunned at the demenour and lack of professionalism the staff and management portray. Not only is it incredibly difficult to reach anyone at front desk, but once you do be prepared to accept \"hospitality with an attitude\" I have stayed at this particular hotel about 4 times and always have been dissatified, however continued on for the location. My last stay was the worst. I checked in at 2.15p.m. (a great \"favor\" on their part) only to be kept waiting at the front lobby for 10 min with no one in sight. After having to check the parking lot for someone who might be working at the hotel i manage to locate a worker, who I believe to be the manager. I continue to my room to open the door and cringe at the stale smoke and mildew odour that's filled the room. Surprising as it is a new hotel. I inform the man at the front desk who comes in with air FRESHIONER. My stay over the weekend was not a pleasure trip and all i wanted to do was close the door behind me and relax. The following morning i had fallen ill and could not get out of bed. I started to call the front desk and no one answered. I continued to call several times before someone answered. I girl at the front desk replied named Joycelyn replied. I had previousely rude encounters with her as throughtout my stayed found her to be very short tempered and unaccommedating. I expalined to her I would like to stay an extra day however if she could just charge my Visa as i was terribly ill and perfered not to get out of bed at the moment that if she gave me an hour or so to gather myself together i would bring her down the cash. It was at this time 11.30 am that she told me I would have to get to the front desk by 12.00 p.m. or check out. Astonished i unhappily got out of bed and went to the front deak to pay her and explain my discontenmt. I asked to speak to a manager who was not availably and left him a message which did not get retuerned. On the Sunday Morning I called the front desk to ask for an extended check out time. I was greeting by that same \"hospitality hostess\" and flately refused. When i continued to tell her that it didn't seem a problem another time as an \"additional fee\" is charged and i have no problem paying she than told me I must leave 1.00 p.m. all with that charming attitude of hers. My temper at this point had run thin....and although my stay was a personal difficult time for me...this girl was making it so much harder. With much regret on my part before i know it i'm at a fighting match at the front desk with this rude, miserable, spiteful hospitality hostess. She than tells me she will not grant the extended check out and that checkout time is 11.00am. Resisting to continue the fighting match i left with a message for her manager to call me back. I'm still waiting!! Horrible HOrrible Horrible",
      "rate": 1.0,
      "tripDate": null
    },
    {
      "title": "Hidden Gem in the City",
      "text": "The room was very comfortable and clean.  The bathroom was a nice size and I particularly enjoyed the shower head!!!  The breakfast buffet was excellent ( I would prefer my eggs cooked a little more though).  You had a nice variety and selection to choose from and you would not go away hungry (if you did, it would be your own fault).  I especially liked the fact that you provided coffee for your quests 24/7. I think we received exceptional value for our money.  I think you are a hidden gem in the city.  Your staff was very courteous and friendly and the reception desk staff were outstanding.",
      "rate": 5.0,
      "tripDate": " March 2014"
    },
    {
      "title": "Excellent Place to Stay",
      "text": "We came from Montreal to spend a few days with our teenage children to experience Ontario.The stay Inn was a excellent Motel to stay inn with it being central from Canada's Wonderland and 1 hour away from Niagara Falls.They offered significantly lower reduced entrance tickets to canada's wonderland that cut costs 40% lower to their guests.The continential breakfas was great with bagels,croissants plently of pastries and cereal.We will come back here again as the ambiance was pleasant and the staff were friendly and it was extremely clean. Good Value for the price.",
      "rate": 4.0,
      "tripDate": " June 2005"
    },
    {
      "title": "good value..",
      "text": "Was pleasantly suprised from the Stay Inn. It's has new, clean, fresh rooms to get great nights sleep. You can open the windows and let in fresh air. The rate included airport shuttle and free breakfast. And it's just not a muffins & coffee kind of thing, it had fresh chocolate croissants, bagels, cereal...very nice.  Nice Family owned & operated property where they actually care about your business...I can tell the differance because I have worked in the Hotel Business for many years. Great little DEAL!",
      "rate": 5.0,
      "tripDate": " April 2005"
    }
  ]
}