{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Studio 6 Toronto",
    "url": "/Hotel_Review-g155019-d183595-Reviews-Studio_6_Toronto-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.0",
      "reviewCount": 213
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "165 Grange Ave",
      "addressLocality": "Toronto",
      "postalCode": "M5T 2V5",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/08/41/11/a3/twin-studio--v7437214.jpg?w=500&h=-1&s=1"
  },
  "description": "Renovated guest rooms feature fully-equipped kitchens that include cooking utensils, a microwave, stove top, refrigerator and coffee maker. Along with the comfortable, residential feel, guests will enjoy free Wi-Fi Internet access, 32-inch flat-screen HD TV with expanded cable, multi-media panel with A/V connections for mp3 players, video game systems and laptop computers. Guest laundry facilities and on-site parking are also available $15 per night.",
  "featues": [
    "Paid private parking on-site",
    "Parking",
    "Free High Speed Internet (WiFi)",
    "Vending machine",
    "Bicycle rental",
    "Non-smoking hotel",
    "24-hour front desk",
    "Self-serve laundry",
    "Air conditioning",
    "Fireplace",
    "Kitchenette",
    "Microwave",
    "Refrigerator",
    "Flatscreen TV",
    "Non-smoking rooms"
  ],
  "reviews": [
    {
      "title": "My wonderful stay at Studio 6 Toronto Grange Avenue",
      "text": "Let me start by saying that this hotel is great value for money for people who are travelling and I mean, not just staying in the hotel. If you want a basic stylish, clean and comfortable room with new decor this is for you. Its basically a studio flat!I traveled to Canada Toronto for the first time by myself and was a lone female traveler. I read the majority of reviews before booking a place independently. I was worried about the area, my safety and security based on a few reviews on here which was helpful. However my worries were put to ease based on the majority good reviews. Plus I'm from London :)I arrived late and the sun had set between 6-8pm. I did take a walk by myself to Queens street to get some food. it was very quiet up until the main street (Queens street) it wasn't too bad, although I didn't go out late unless it was with a cab after the first day.Staff provide access to a good cab service and call cabs whenever you need for you, and can also give you a good cab service number to take you home from an outing. All doors have a good locking system (USE IT) there was only one occasion when there was some noise disturbance and I called the reception as did other lodgers and it was dealt with very quickly. The room: was beautiful I was pleasantly surprised. very clean, new facilities, very comfortable. Cleaned everyday depending on if you wanted it to be. As requested I had a room with the view on the CN tower. I felt soooo comfortable and as I was travelling alone this put me at total ease. Loved having a phone in my room with free calls in Canada VERY useful for a Londoner. Please check out my pictures.The facilities: For what I paid for I would not be able to get this standard in my hometown London for the price of £366 for a 8 days (approx 754CAD)! nice TV with multiple channels, beautiful new kitchenette. All kitchen utensils provided, you do have to buy your own sponge and washing up liquid though. hair dryer and nice shower over the bath. Coffee machine and telephone with national calls for free! The area: I was 5 minutes away from china town and Queens street and other shopping/entertainment areas are 10-15minutes away from downtown which includes the CN tower, Art gallery, Air Canada Centre (where I watched a basketball match) and Rodger Centre etc. Honestly its such good value for money and so close for all the tourist activities. Cabs and Streetcars are very easily accessible. NOTE that the city sight seeing company pick you up from the hotel for the Niagara falls tour and Toronto tour. The area is not affluent, and many reviews are correct in saying when you're out late take a cab especially if your alone. The area almost feels like you've gone back to the 80s. You really are within 5 - 15mins of downtown. NOTHING happened to me and I had a great time.Staff: Staff are friendly, approachable and talkative. They deal quickly with all enquies and requests including issues regarding safety that appears to be something are concerned with here.Areas for improvement: If they could have a locking/card system at the main entrance that is activated after 10pm that would be great. Although the rooms are secure it would be nice if the building was also secure at all times.I would one hundred per cent recommend this hotel!!! It was great and I will remember it forever, especially as it was my first time in Toronto and I loved it. I would recommend it for lone travelers, couples, groups, and business and leisure trips. I heard a few families but I don't know if its as suitable for children under 12.Overall I loved it and its great value for money.",
      "rate": 4.0,
      "tripDate": " November 2015"
    },
    {
      "title": "Great Location for a Bargain Price",
      "text": "I would first like to say, I do not understand where many of the negative reviews are coming from. My wife and I stayed at the Sudio 6 Hotel for more than a week, and I would be glad to tell you about it. To address its location:  The hotel is located about 2 blocks off of Queen Street in a residential neighborhood. Queen Street is of course a very busy and popular avenue with many restaurants, shops, etc. The neighborhood is not \"scary\" or \"dangerous.\" Those claims are preposterous. The area is no different than your average urban neighborhood in a densely populated metropolis. There is a primary school right across the street from the hotel with kids running around almost all day. Even at night we never came across any scrupulous individuals, just people going to and from their homes/apartments. We thought it was a very quiet neighborhood, which made for a very quiet night's rest. It is within walking distance to Kensington Market and Chinatown. These are both very fascinating areas to explore. You can catch a streetcar a block north on Dundas St, or 2 blocks south on Queen St. If you don't mind walking for about 30 minutes you can reach the city center by foot.The hotel itself is one of a former apartment building converted. The service at the front desk was simple and to the point. There are no fancy amenities at this hotel beyond a communal laundry room in the hallway. The room we stayed in was very modern and appeared to have been recently updated. Yes, there was a loose tile here, a missing/broken piece of molding there...but overall the room was very decent. We NEVER had an issue with hot water, as claimed in a previous review. The television worked fine. The complimentary WiFi worked fine. The only thing that did not work properly was the hair dryer attached to the bathroom wall. It simply would not turn on, but we didn't need to use it anyway. The A/C unit is loud when it turns on, but after awhile we didn't notice it anymore. The kitchenette was one of the reasons we chose this hotel. We were able to store some cold-food items in the fridge, heat items on the stove and microwave. A small amount of plates, glasses, and silverware were provided, but I don't recall seeing any pots or pans. The Keurig was nice and we used it to make coffee every morning. By the way, there is a Loblaws grocery store about a 5-10 minute walk away from the hotel on Queen St (perfect!) Every night was quiet and uneventful. No disruptive noises from any of the surrounding rooms and hallway. There have been claims made about Syrian refugees staying in the hotel. If that is the case, great on the hotel for doing so, but we didn't come across any. There were a couple of people that we crossed paths with that were speaking a little Arabic, but they could have been just normal guests of the hotel for all I know. There were no kids running around the hallways or making it feel like we were invading someone's living space. The budgeted price for our week-long stay was one of the other driving factors for us to choose the Studio 6, in addition to it's proximity to downtown Toronto. If you are used to staying in luxurious 5-star hotels, then no, this may not be the hotel for you. But if you are a seasoned traveler who enjoys immersing into the local culture, I highly recommend the Studio 6 Hotel. My wife and I had a great, comfortable stay, and we saved a lot of money compared to other hotels in the area. Cheers!",
      "rate": 4.0,
      "tripDate": " May 2016"
    },
    {
      "title": "Christmas stay",
      "text": "Studio 6 – we stayed at Studio 6 Toronto 22nd to 26th Dec and had an enjoyable stay. Our transfer from the airport took about 25 mins and cost about £25 using Uber. We checked in early evening and the process was very swift. The room itself was very pleasant and looked like the images on the website and trip adviser. There was everything to make our stay a comfortable one – there was plenty of storage, an iron, ironing board, fridge, hairdryer, coffee machine, plenty of plug sockets and mirrors. There were plenty of channels on the TV. We had to enquire about the heating system, although there was a thermostat on the wall that was cranked up to the max (25 c) we couldn’t find a vent for the hot air to circulate. Reception confirmed there wasn’t a vent and that the heating comes through the walls and floor. The weather was quite mild during our stay but on a morning it did feel quite chilly and it wasn’t until getting in a hot shower did we feel we were warming up. The shower has excellent pressure and reaches a decent temperature. The bed was comfy and we had undisturbed sleep as the neighbourhood is so quiet. Housekeeping serviced the room daily, making sure the towels were changed and coffee pods replenished. The kitchen is fully stocked with utensils for those wishing to utilise the kitchen area. The Wi-Fi was hit and miss at times, we found it worked perfectly between 5am – 6am, but after that it seemed to crash.Don’t let the surrounding neighbourhood discourage you from staying here. We had no trouble and didn’t feel vulnerable or scared. It’s only a short stroll down the road before you hit Queen Street. Overall we thoroughly enjoyed our stay, the price was value for money, the location was great, we had a peaceful night sleep and the staff on the front desk were very friendly and helpful especially Wang-Li.",
      "rate": 4.0,
      "tripDate": " January 2019"
    },
    {
      "title": "Horrible.",
      "text": "Had planned to stay in Toronto for 5 days, however the hotel was so bad decided to cut it short as we could not spend any more nights in this place. When we got to the hotel, went to use the bathroom and there was urine all over the seat. obviously not cleaned before we got there. There is a sign on the door saying to put the chain across and the dead bolt for your safety. dead bolt did not work. There were crumbs all over the floor and long hairs. There were grease marks all over the stove, fridge and walls.  The walls in the bedroom area and in the bathroom were covered with splatters of I don't want to know what.  The walls were marked up with crayon. There were holes in the bathroom door. The smell was so bad that before I could sleep I would spray my pillow with the Downy wrinkle spray I thankfully brought with me.  There were bugs and spiders. The air conditioner was so loud you could not hear yourself think, let alone sleep with it on.  With it off we nearly melted with the heat. The shower curtain had stains and smelled so sour. There were stains on the sheets.   We told hotel staff that the room was so dirty and that it needed to be cleaned while we were out, listing the issues.  The only thing that had been done while we were out was the dead bolt fixed. No clean towels were given for our second day of the stay.  Tried to call down to get some sent up but the telephone did not work.   Absolutely nightmare. Would not recommend this hotel to anyone!!!",
      "rate": 1.0,
      "tripDate": " June 2017"
    },
    {
      "title": "Clean, good kitchen, Close to Chinatown & Kensington Market",
      "text": "Easy checkin, clean lobby, elevator and hallway. Comfortable queen bed, good pillows, and a newish kitchenette. It had a full size fridge, cooktop, sink, and plenty of space for food preparation. The room was clean with a small table and two chairs. The window air conditioner had a remote control, and was somewhat loud. The bathroom sink had been updated, electric outlet in a good location, hairdryer, good towels, older tub with clean shower curt ain. Good water pressure.  Overall good hotel for the price in this location.",
      "rate": 3.0,
      "tripDate": " September 2017"
    },
    {
      "title": "Do not waste your money",
      "text": "This hotel is terrible smelly dirty especially the lift area room smells bathroom mouldy very stuffy and if you put the air conditioner on you can't here yourself think beds uncomfortable and dirty , Windows so dirty you can hardly see out , this hotel seems like a half way house for homeless people do not spoil your holiday by been taken in by the price!!!",
      "rate": 1.0,
      "tripDate": " June 2017"
    },
    {
      "title": "Terrible In Toronto",
      "text": "would prefer to give this establishment no stars but the reception staff , who at all times conducted themselves in a friendly and helpful manner deserve a star , after that please don't waste your money and spoil your holiday here , from the overwhelming smell pervading the entire building of damp and stale cigarettes which exacerbated my asthma from day one , to the loose toilet cistern , that wobbled constantly , the air conditioner sounded like a freight train going through the room , you got to choose between stifling stuffiness and smell of damp or no sleep from the noise , our room was only serviced on the first 2 days , despite leaving out the sign , the towels replaced with small , thin smelly towels each day , the linoleum floor crunching underfoot , the single beds narrow but quite comfortable . i would not ever stay here again nor recommend it . we treated ourselves to another motel on the last night even tho we had prepaid for our room here so we had one happy memory , as we were attending a conference the city was heavily booked out , so moving earlier wasn't possible at short notice ... don't be fooled by the photos ....",
      "rate": 1.0,
      "tripDate": " June 2017"
    },
    {
      "title": "Excellent for the price, cleanliness and location",
      "text": "Pleasantly surprised with this accommodation. I chose for the location and price. I was traveling alone so didn't need the amenities I usually look for when traveling with family. It is an efficiency type accom and I was impressed with the cleanliness and quality of the amenities. Though I was only there one night and didn't use. I plan on coming back with my family in the summer. Close to Chinatown and Ken Market. Beds were comfortable, shower was hot and the toiletries were nice too. Check in was very pleasant and the fellow at the desk in the evening was happy to assist with directions. There was some noise from other guests in the night but it was Saturday and to be expected. Otherwise a pleasant stay and def will be back!",
      "rate": 4.0,
      "tripDate": " January 2017"
    },
    {
      "title": "Comfortable Stay",
      "text": "We  stayed at Studio 6 (formerly The Grange) twice in the fall of 2013.  Both times we had a comfortable stay in one of their recently renovated rooms.  The rooms are basic with Ikea-type cupboards and furnishings (an extra chair would be an asset), and laminate flooring - everything was very clean.  I particularly liked the fact that the duvets were wrapped in white sheets, it made the bed feel very fresh.  The kitchen is adequate for preparing coffee, breakfast and cold meals, although a  pan and microwave dish would make it possible to cook  dinner as well - the hotel is about a 10/15 minute walk from Loblaw's supermarket on Queen Street.  It is also within walking distance of the Kensington Market and the Art Gallery of Ontario, and close to public transport. The neighbourhood itself is down-scale, but we did not feel nervous there.  I have given it a top rating for the sort of basic hotel it is: it is by no means  luxury accommodation, but it is simple, clean, well-located and good value for the price.",
      "rate": 5.0,
      "tripDate": " November 2013"
    },
    {
      "title": "Love this place",
      "text": "Honestly I stay here every time I come to Toronto, over the past nine months I have stayed here 15 times, you can't beat the price! The staff is so helpful and parking is a breeze. Yes the air conditioner are loud and some of the rooms still need some updates but what do you need the room for? sleeping - beds are so comfy, lots of pillows, clean.Shower - great water pressure, clean tubsToilets - they flushInternet- never had an issue works greatTv - each room I've had all new and work.Kitchen - everything you need is in there, full size fridge (yes you hear it turn on but what do you expect it's right beside your bed, sleep beside the one in your home and tell me it's not loud). You will need to buy dish soap so you can wash the stuff you use but most people would before use anyway, it's a hotel room not your friends place, who knows how well people clean and that's your own choice.Parking - never had an issue, right on site and not expensive. Location- you can walk downtown if you want or go to the corner and hop on the street cars. As long as the price stays low I will continue to come here.",
      "rate": 4.0,
      "tripDate": " September 2017"
    },
    {
      "title": "Sparse with a good location",
      "text": "The rooms were very European in that they were very small but well organized and functional. It felt like an Ikea dorm room. The room was clean. The location was good. The staff was less than pleasant and unaccommodating. We got a decent rate but extended our stay by one night which they charged us $40 more for than the previous night which was weird because it was a less popular night of the week. They claimed it was because of a last minute check-in but a person walked in off the street the next day as we were checking out and got a considerably better rate. For downtown Toronto it's an OK place to stay.",
      "rate": 3.0,
      "tripDate": " October 2014"
    },
    {
      "title": "Don't go there",
      "text": "Worst room ever. Filthy. We couldn't even sleep. Huddled till daylight then high-tailed it. We should have known when the room numbers were written in pen on masking tape on the doors. It was awful!!!",
      "rate": 1.0,
      "tripDate": " September 2014"
    },
    {
      "title": "Bring earplugs.",
      "text": "Overall the room was very small but housed nice amenities, i.e. the Kuerig coffee machine, the large fridge and the small kitchenette with hot plates. Our only real complaint (which is surprising since I checked this site for reviews before we stayed at the hotel and it was never mentioned) is the noise levels. This is a refurbished Motel 6, and although the rooms are clean enough and well maintained the walls are PAPER THIN. You can hear almost everything from your room. People talking in the hallways, slamming doors, TVs in the room next door and screaming babies three doors down. Considering it still cost us a fair bit for a room with a queen bed it was hard to sleep through the night on more than a couple of nights, and we were there a week. We will not be staying there a second time. For it's cost, we could pay $30 more a night and stay at the Sheraton for some peace and quiet.",
      "rate": 3.0,
      "tripDate": " September 2014"
    },
    {
      "title": "Hidden gem",
      "text": "I found this hotel because I was looking for something close to downtown Toronto but not wanting to break the bank for a one night stay. The hotel is tucked away on a residential street, which is a bit off putting at first, but if you walk around the corner you get to busy shopping, food, bars, all within walking distance!Whoever was working when I checked in was super friendly and provided great customer service. He helped me navigate cabs and how to get to a venue I needed to go to without a fuss. The room was cleanly and modern. If I was staying longer it would've been nice to have the full kitchenette but I couldn't make use of it while I was only there a night.The only thing was the room seemed to be quite warm and the thermostat was turned all the way down, but it really wasn't a large con. I was nicely surprised with this hotel and I would recommend this to anyone who isn't looking for a luxury suite with all the bells and whistles, but rather the simplicity of a room without fuss. I would stay again especially because the location is great, and it feels almost like you aren't staying in a hotel but rather an apartment because of the quiet street and amenities.",
      "rate": 4.0,
      "tripDate": " June 2014"
    },
    {
      "title": "Average hotel - awesome location",
      "text": "My friend and I went to the hotel last weekend. We booked our trip with a website online (not the official one). I was wondering what the room would looks like since there was many different pictures online. Seems like some rooms are better than other. We had a room with old-school look. Something like a dorm room.But everything is OK. The staff are friendly and charming.It's obviously not at 5 stars hotel, but for the price it's hard to have better. It's cheaper than a youth hostel if you are more than one... So that's a good thing!It's about 5 mins from Queen street and Dundas street Few meters away from Kensington Market, Chinatown and not too far from Younge street. There are a lot of nice spot to hang out around, to eat or drink a beer. It was kinda hard to find at first, but it's part of the charm of the hotel.I would recommend to friends that are traveling and are not asking for too much. People that are ok with just sleeping there and not hanging around in the hotel. If you are looking for a high class hotel, this is no the place for you.I would go back anytime. Can't beat the location.",
      "rate": 3.0,
      "tripDate": " March 2014"
    },
    {
      "title": "A Clean Baby Blanket with lots of stains",
      "text": "This hotel is called 'Studio 6 Toronto' or 'The Grange Hotel'. The night I booked, it was the cheapest hotel located in the city core. Although it is pretty cheap, the hotel itself is located in an ok area; Toronto is pretty safe overall and this hotel is located in a residential neighbourhood. it is close to restaurants and clubs. Check in lasted 30 mins as they seem to be having problems confirming reservations. The room we got was a smoking room, I tried to change it but was told nothing else was available. The smell was pretty bad (but that is what you would get with a smoking room). The room had a mini fridge , hot plate and sink. The linen in the room was clean and so were the towels. The room itself was clean but very very old and poorly maintained with stains and cracks showing. The shower works , bed is ok. If this is your maximim criteria then this hotel may work for you. I would stay here again only if I got a non-smoking room. There were no insects in the room and we checked for bed bugs (did not find any).",
      "rate": 2.0,
      "tripDate": " March 2014"
    },
    {
      "title": "Good Value for Longer Stays",
      "text": "My last trip to Toronto was very last-minute so I ended up with limited options when it came to hotels. I found this Studio 6 near my destination in the city so I gave it a try, fully prepared to be disappointed. The hotel itself is tucked inside Chinatown, walkable to many restaurants, stores and main transit routes - that said, it was darn hard to find the actual entrance of the hotel. Check in was fine and hassle-free, the Chinese gentleman who checked me in was pleasant and helpful. In my room I had a kitchen area which was appreciated. The room itself was okay in quality, cleanliness could have been better but definitely not as old and dirty as described by some other travelers. I did find the bathroom rather small but not an issue. All in all, although my stay was only 2 nights long, I can totally see this being an acceptable long-stay spot if needed, considering the low rate even when I booked same-day.",
      "rate": 4.0,
      "tripDate": " November 2019"
    },
    {
      "title": "Despite some negative things, great place!",
      "text": "Pending reviewvia mobileI spent 4 nights here while in the city for work. I also work for a non-profit and was very conscious of my budget. First, the location is incredible. Super close to Kensington Market, Chinatown, Queen West, and so on. As a lone female traveller I walked daily to and from my job site, to get dinner, etc. I never felt unsafe and travellers must remember- THIS IS TORONTO. A large, busy, diverse city. It’s all a part of the charm.The rooms are tidy and well equipped. Who cares about petty things like the state of a curtain or the view?! The bed was so comfortable.The kitchenette has the basics, the fridge was clean and worked well, the sheets and are towels clean and fresh. There was a great little space to set up my computer and for when I ate in. The shower has awesome water pressure and was super hot- perfect for a freezing March day. The rooms are chilly and it seems the thermostats are just a decoration, lol. However, bring earplugs and download a white noise app on your phone. I was on the first floor in 108 and had a family above me. It seems that some people might be living here. Welcome to the realities of the housing market. The children were...well, children. It was hard to balance my frustration with needing to get up early with the fact that it’s winter and people hibernate. I said something to the evening staff at around 9:45 and they said that they would say something. The running in the halls stopped, but the noise of the room continued to well after 10:30. It was very trying for getting work done and going to bed early, but certainly ear plugs and white noise helped. Moral of the story:- You get what you pay for. I paid for clean, close to my job site and my fave Toronto “haunts”, a comfy bed, hot water, kitchenette, parking- If you’re a small town person, go stay in a holiday inn or something if you’re scared of neighbourhoods in large cities *eye roll* - pack some warm clothing and slippers for a winter stay - BRING EAR PLUGS!!- Stay here if you want to be IN the heart of the greatest city on earth! Despite some of the things that sucked, I would definitely stay here again. Thank you Studio 6!",
      "rate": 3.0,
      "tripDate": " March 2019"
    },
    {
      "title": "Great people, great city, awful location.",
      "text": "My wife and I have just checked out today after spending 5 nights here and I wouldn't stay there again. I booked based on the pictures on a booking site and reviews on here, both were misleading. The rooms were run down and tired looking but were clean. We were on a ground floor room where security was poor. In our first room the window didn't lock so we were moved to the room next door straight away which was good. Although the window locked it took little effort to force it open, with small bit of wood wedged in place to keep ot locked. The staff were polite and helpful whenever we encountered them which was nice. The bed was very comfortable, normally I end up with a dead leg after a couple of nights in a hotel but not here, it was great! The location is the worst thing about this place. The surrounding streets are very intimidating and not nice to look at. One house round the corner had blood smeared up the doors and there were a few people with obvious mental health problems walking around. If/when I come back to Toronto it would not be to stay here. Some of the reviews I read suggested the location was good and this is what I was looking for so in future I'll take more care when booking somewhere.",
      "rate": 2.0,
      "tripDate": " November 2018"
    },
    {
      "title": "Nice & Central ",
      "text": "I stayed at this hotel first week of November.  Staff are helpful. Clean and tidy hotel rooms. The price is absolutely amazing in comparison to other hotels within the city. This hotel location is great. Very central and in walking distance to everything. Longest walk is around 25 mins to the CN Tower. The neighbourhood is fine. Many comments on here regarding the neigbourhood. However its not damgerous walking at night or anything like that and literally a 3 minute walk down the road to the highstreet. Nimmi on reception was an absolute diamond! She's lovely and kept me company on my last day whilst waiting to leave for my flight back to the UK. Her knowledge and information is extremely good. Staff in general are lovely.",
      "rate": 5.0,
      "tripDate": " November 2018"
    },
    {
      "title": "Comfortable budget option in good location",
      "text": "Stayed 3 nights at CAD 80 per night including all taxes. Interesting place. 24 hour reception who were both helpful and efficient. Modern enough studio apartment. Comfortable enough bed. Wifi worked well. Hot plate, TV, fridge, kettle, toaster, microwave and cutlery. Bathroom functional. Laundry area on 4th floor. Short walk to China Town and the other way to fast food shops and restaurants. Approx CAD 10 in taxi to Union Station (maybe 25 minute walk). Stayed on 4th floor. 6 floor building with other non hotel tenants also living in building. A little tired all round but once in the room you could be in any hotel. Well lit at entrance and a good cheaper safe option overall. Value at this price.",
      "rate": 4.0,
      "tripDate": " January 2017"
    },
    {
      "title": "Spn-Family Weekend",
      "text": "We had a complete filled kitchen, comfy beds, a working toilet in s hotel with a Great price for a special weekend. But we've had lots of mold behind the bathroom door and no working filter. And st least there was this extremely loud airconditioning.",
      "rate": 3.0,
      "tripDate": " May 2016"
    },
    {
      "title": "Don't trust the pictures",
      "text": "It looked great in pictures. However, the place wasn't very clean, and there were a number of things that did not work. It is an \"extended stay\" type of accommodation, but seriously, the motivation to stay there for an extended period of time is not there. Here are some of the problems --1. the curtain inside the room was torn, plus it was very cheap and poorly mounted, so it did not block out much of the light. 2. There is a large gap under the door, so at night there was quite a bit of light inside the room from the hallway. 3. The worst thing is that swallows have nested on top of the air conditioner, and their chirping is amplified by the air conditioner box, so I was up at 5:30 every morning because of the noise. 4. There is a flat screen TV and the remote control was out of battery. I called the reception and they said that they didn't have anyone to come upstairs and did not have any batteries. I had to go downstairs myself to get the batteries changed the next day. 5. Service and maintenance of the room are really at the level of a youth hostel. 6. The elevators and the hallways smell like smoke, as some people smoke in the rooms. 7. Notwithstanding all that, the room is not cheap -- all together I spent about $500 for 3 days. Don't go there...",
      "rate": 1.0,
      "tripDate": " May 2016"
    },
    {
      "title": "Don't stay here",
      "text": "When I arrived at this hotel at 8pm I thought I might go and look for a restaurant since there were none nearby during the cab ride. The receptionist said to me as I was leaving \"you're not going out alone are you?\" I said I was and she told me she would order me a cab that \"it is not a good area for a woman to walk alone after dark\". The credit card machine didn't work and after three attempts the receptionist asked me could she keep my card overnight as a deposit and try the machine again the following day. There were multiple hairs all over the bathroom; on the sink, all over the bath, on the tiles on the wall beside the bath, the shower curtain and even on the ceiling. The mattress is paper thin and very uncomfortable. The hair dryer in the bathroom was broken. The TV only had three channels despite a full range on their guide in the room. The corridor where I was saying on level 4 smelled very strongly of cigerette smoke and I could really smell it off my clothes when I was leaving after just two days in this hotel. I voiced my concerns re broken appliances/cleanliness issues upon checkout with the male receptionist but he was playing with his cell phone and briefly looked up to acknowledge me, my presence was an obvious inconvenience to whatever was keeping him occupied on his phone! I had to move to this hotel from a hotel in the downtown area due to expense but to be honest if I wasn't desperate for the lower rate I would never choose this hotel. It was not a pleasant experience. The customer service was the worst I have ever experienced in a hotel. I would never recommend this place to anybody.",
      "rate": 1.0,
      "tripDate": " December 2015"
    },
    {
      "title": "A cozy hotel Close to downtown and other attractions",
      "text": "I stayed here for 2 weeks. Its a nice cozy place considering the price you pay. This place is quite close to downtown and other tourist attractions. No breakfast though!!People in the front desk are quite helpful and there are plenty of places to eat near by.",
      "rate": 4.0,
      "tripDate": " August 2015"
    },
    {
      "title": "A cheap place CAN be amazing, this one IS NOT",
      "text": "It is hard to figure out where to start reviewing this place.They advertise their rooms as recently renovated, but fail to mention that the renovation was done very cheaply and quickly. There are gaps between the laminate on the floor and between the appliances and the furniture. It just looks like someone that did the renovation did not care about doing a decent job, but the worst part is that the person who paid for it also appears to have felt the same way.When we came into the room the kitchen was still completely dirty. The stove was not cleaned and was covered in grease and sauce. There were stains on the floor as well. The bathroom had orange stains on the tiles around the plumbing.The heating did not work properly and the blanket was so thin that we nearly froze overnight during our stay in winter.The Do Not Disturb sign disappeared after the first day and the staff said they would not give us a new one, but simply promised that no-one will come in, which, of course did not happen.It is a pity that the situation with the hotel is as bad as that, because it could have been an amazing affordable accommodation in the center of Toronto.",
      "rate": 2.0,
      "tripDate": " February 2015"
    },
    {
      "title": "for what toronto offers  for  hotels this is probably the only one worth the price",
      "text": "honestly its a budget motel but the staff is incredibly friendly and go out of there way to help you during your stay. i will be staying here again. the area is a bit dodgy at night but if your from the states nothing compared to most inner city areas. just have to use common sense and definitely single women should not walk alone at nigh",
      "rate": 5.0,
      "tripDate": " March 2015"
    },
    {
      "title": "Avid ut and pay a little more",
      "text": "1) the location & neighborhood are not appealing (i spite of being closed to attractions)2)  they want a deposit which expire... a week after you leave3) TV did not work in one room, and also not in a room they try to move us to.4) smell of cigarettes etc.Do yourself a favor and avoid it",
      "rate": 2.0,
      "tripDate": " March 2015"
    },
    {
      "title": "Joe's Apartment",
      "text": "Remember The movie Joe's Apartment? And i'm staying right now here! Worst place ever! And the people at the front desk aren't of any help at all! For a freaking \"Do not distrub\" sign they almost had to move a mountain!",
      "rate": 1.0,
      "tripDate": " March 2015"
    },
    {
      "title": "Below average",
      "text": "I arrived in Toronto to spend 2 days in the city. I booked 2 night at Studio 6...but when i arrived in the \"hotel\" i decided to stay only 1 night. Im not a picky person and I really get comfortable everywhere but this place was really so so. I didnt mins the room space...a bit small but I was meant to sleep only. When i parked the car, the one next to mine had a broken window with the pieces of glass still inside the car, probably a fresh robbery? The parking of the hotel has CCTV but they let this things happen? The room was not very clean...the bed had some hairs inside...many hairs was found in the towels..  bathroom door closes with difficult. You need to use force to close tne main door (there is like 1 inch gap at the bottom....). Marijuana smell in the lift, baked beans smell trough the corridor untill late night...also chit chat in the corridors at around 2pm.... the bed is soft but you will wake up with backpain. The staff was kind and helpful though, the guy at reception was comfortable and friendly. Also the room was nicely warm when outside was snowing. Overall i didnt really enjoy my stay and i wouldnt reccomend...better spend few more bucks for a proper hotel.",
      "rate": 1.0,
      "tripDate": " January 2015"
    },
    {
      "title": "Location A*",
      "text": "We stayed as a couple for 6 nights in this flats turned to studio apartments in April.It is what is is for the price you pay.Good pointsLocation is great in between Kensington Market & Chinatown about 15 minutes walk to Financial / Entertainment DistrictsKitchenette Friendly and helpful receptionists WiFiLuggage Room Access to public transportationDestination from the airport Not so Good PointsRooms could be a little bit cleaner Small double bed ( not Queen as advertised)No daily cleaning/ fresh towel service (although you can ask at reception for fresh towels)",
      "rate": 3.0,
      "tripDate": " April 2017"
    },
    {
      "title": "\"budget\" hotel with kithcenette",
      "text": "It seems that the rooms have been recently renovated but sad to say it has not been kept well.  The bed we slept on had a big long gaping hole in the middle.  What?  anyways by the time I found out about this hole, it was too late to change room (100am).  The microwave has a big burnt mark inside, the pots available are oily.  If you can fork out a few more dollars, I would suggest to get another place and avoid this place.  It is close to Chinatown but there are better hotel/motel in the area.",
      "rate": 3.0,
      "tripDate": " January 2017"
    },
    {
      "title": "Getting what you pay for",
      "text": "Room rates seemed quite low in the Springtime: I pre-booked online, and paid $89. + taxes - not bad for downtown Toronto. Outdoor parking was included.Not much service to talk of: the concierge was a young man, working on his laptop in the small lobby. But, he was pleasant, and I got my key with no problem. The room was clean and spacious enough, but with basic furnishings. The bed was comfortable, and the ensuite bathroom perfectly adequate. Perhaps the biggest problem was the noise from a person in the room overhead, walking constantly on the hardwood floor in what sounded like high-heels.The neighbourhood around this hotel has virtually nothing to recommend it. It's a gritty residential corner of the downtown: a ten-minute walk brings you to the intersection of Spadina and Dundas, and occasionally some decent Chinese food.",
      "rate": 3.0,
      "tripDate": " March 2015"
    },
    {
      "title": "DO NOT STAY AT THIS HOTEL",
      "text": "Where do I begin? Arriving at reception to find the lady behind the desk watching videos on the computer should have been a give away that this was not the place to stay. Not to mention the neighbourhood this hotel is in. We were given a room and proceeded to the old elevator. (You have to press a button to close the doors, even after selecting your floor) We entered our room to find a small room with cheap interior and kitchen appliances. We were only supposed to be staying here for 4 nights so could have lived with that. Then we seen something moving on the floor below the TV. Upon closer inspection we found ANTS all along the floor against the walls of the room. We went down to reception to ask to swap rooms. The lady sighed a little as she had to yet again pause the video she had been so desperately  trying to watch. As explaining we had found ants in our room the lady replied \" Ants? That's a new one!\" Offering no apology. We were given the key to the room next to our original. After moving all our luggage we found this room to be in worse condition to the first one! And yes, the ants were in here too! We stayed one night and checked out early the next morning. This time it was a male behind the desk who didn't even know we had moved rooms. We were given a refund for our room but had to pay a cancellation fee. The guy didn't even ask why we were checking out early, obviously oblivious to our situation with ants the night before. We checked into another hotel closer to central downtown which was much nicer.",
      "rate": 1.0,
      "tripDate": " May 2015"
    },
    {
      "title": "Loved the location and the room",
      "text": "This hotel is tucked off the main road in Chinatown in central Toronto. My husband and I were very pleased with the amenities in the room-- plenty of space, a little kitchenette and a generous-sized bathroom. The gentleman at the front desk was very friendly and helpful. We paid a nominal fee to park in their lot, and because of the great location we didn't touch our car until we left two days later. There is a public swimming pool about 1/4 mile away, as well as a neighborhood park. Plenty of restaurants nearby to choose from, and just a lot to look at in this very interesting part of an interesting city. If you value an authentic experience more than a generic one, you will love this hotel.",
      "rate": 4.0,
      "tripDate": " July 2014"
    },
    {
      "title": "Good place for a short-term stay in the city",
      "text": "My partner and I was in the city over a weekend and decided on staying at Studio 6, as we found a coupon deal online and the price was reasonable for us to pay for a short stay. We were there for a total of 2 nights and stayed in a standard room. The location of this place was ok, just a few minutes away from Kensington Market. It's located in a middle of a neighbourhood, and it can be sketchy at times during the night. However, it did not bother the both of us, as we spent most of our time outside exploring the city. It took us approximately 20 - 30 minutes to walk from Eaton Centre, which is reasonable if you do not mind the walk.  It would probably suck to walk so far if it is a snowy cold winter day, but if it's not, the walk will be quite pleasant as you'll be able to walk through Chinatown and Kensington Market. The location of this place is also very nearby to Queen Street, which is where we spent most of our time shopping and walking around. The room itself was decent we thought, for the price that we paid. All we wanted was a clean and comfortable room for us to sleep and shower in, and we're glad with the room they provided us. Sheets, pillows and bathroom were clean.The front desk staff was helpful and polite towards us, which made our stay a much more pleasant experience. Overall, I would recommend this place if you're looking for a cheap stay in the city.",
      "rate": 4.0,
      "tripDate": " March 2014"
    },
    {
      "title": "Good location",
      "text": "Arrived late on a Friday due to my flight in to Toronto. The staff were very friendly and chatty which was nice.The room was ok space with a kitchen area but the AC was very loud and unlucky for me we had arrived during a small heat wave so trying to sleep with it on wasn't easy. The room door also lets in a lot of light at the bottom so I had to use towels to block that off.The bed was quite comfy but found the pillows a bit odd sized where 1 wasn't enough but 2 was too much. The bathroom was ok with the toilet flush having to he held to keep it flushing. The shower was ok pressure but is fixed head.Free WiFi but was intermittent I found so was just using my phone data in the end.Parking was easy and seemed like the standard rate in Canada.Location wise it cost about $10 to get to Air Canada Centre area so not too bad with also plenty of restaurants a short walk away",
      "rate": 4.0,
      "tripDate": " September 2017"
    },
    {
      "title": "Reasonal Price is a good location",
      "text": "We stayed for 4 nights.  Parking is available but there is a cost  involved.  The rooms are clean but ours was very tired, flaking paint on the ceiling and stains in the cupboards.  There is a large fridge but it is rather noisy and the aid con makes even more noise.  Walking distance to Chinatown, CN tower and the Blue Jays Stadium.  Close to trams.  Lots of squirrels around the bins on Tuesday morning just before pick up.",
      "rate": 3.0,
      "tripDate": " August 2017"
    },
    {
      "title": "Great Location",
      "text": "The initial location and quality of the hotel has a lot left to be desired but the central location makes up for many flaws. Being right next to China Town and Kensington Markets is great for this hotel. However might take my business elsewhere that has higher standards of cleanliness for the bedding, kitchenette and bathroom.",
      "rate": 3.0,
      "tripDate": " January 2017"
    },
    {
      "title": "PLEASE DONT WASTE YOUR MONEY",
      "text": "This place is nothing as it seems, when we went to this places its im the middle of a neighbour hood, secondly the owner/manager, didnt seem to want to help. He took our money and handed the key we didnt know what floor how where the lifts were.After going to our room we could smells a strong smell of damp, the rooms were not cleans as dre was dust and stains everywereSo we went downstairs to complain , the manager did was tell us to pop our card into the machine. He didn't ask why or gor alternatives, anyways as we return to london, and refund isn't in our account so we call booking.com and they informed us the hotel didnt actually give us a refund and continued with the booking once we left. We finally got our refund of 500 pound for the week",
      "rate": 1.0,
      "tripDate": " March 2017"
    }
  ]
}