{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Super 8 by Wyndham Toronto East on",
    "url": "/Hotel_Review-g155019-d188320-Reviews-Super_8_by_Wyndham_Toronto_East_on-Toronto_Ontario.html",
    "priceRange": "$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "2.5",
      "reviewCount": 396
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "3280 Kingston Rd Highway 401 Exit 383",
      "addressLocality": "Toronto",
      "postalCode": "M1M 1P8",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/29/d1/38/b5/undefined.jpg?w=500&h=-1&s=1"
  },
  "description": null,
  "featues": [
    "Free parking",
    "Parking",
    "Free High Speed Internet (WiFi)",
    "Pool",
    "Free breakfast",
    "Children Activities (Kid / Family Friendly)",
    "Pets Allowed ( Dog / Pet Friendly )",
    "24-hour front desk",
    "Wifi",
    "Vending machine",
    "Air conditioning",
    "Housekeeping",
    "Kitchenette",
    "Microwave",
    "Refrigerator",
    "Flatscreen TV",
    "Non-smoking rooms",
    "Family rooms",
    "Smoking rooms available"
  ],
  "reviews": [
    {
      "title": "Pay attention to the review for this facility",
      "text": "Poor standart related to room comfort, cleaness, old and noisy air condition, pseudo breakfest not justified with the price. Fixed sash windows , no chance to have a little fresh air.  But the location was good close to the center.",
      "rate": 2.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Not bad, not great",
      "text": "We wanted a hotel with a pool and yes, there is a pool but it is small...very small.  It held the 2 girls with us comfortably but it felt crowded when 2 other kids were in the pool as well.  I liked the whirlpool tub.  Everything in the pool area was clean.  Check in person was very good and professional.  Our room was basic.  I like to read before sleeping but the light over the bed was too bright and kept everyone else awake.  The alarm clock was over on the dresser, too far for either hubby or I to see without our glasses.  There is a fridge in the room which was handy.  The bathroom was clean, no mold, but the sink tap leaked and sprayed water everywhere.  We didn't make it to the free breakfast but the tiny area it was in didn't make it too appealing. When walking the halls alone to the pool area I did not feel particularly safe.  I probably would not stay here again.",
      "rate": 3.0,
      "tripDate": " July 2006"
    },
    {
      "title": "GOOD BASIC TOURIST MOTEL",
      "text": "Good location for travellers although designed for people with cars.  ( I wasn't driving so was reliant on the relatives I was visiting.)  I don't know how good the local bus services are if you want to explore the area.   The room was clean with coffee maker and fridge which were all that was required for a short stay.   The only minor grouse was that the internal corridor leading to my room had no external ventilation and smelled of cigarette smoke.   Also this leaked into my room, presumably through the bathroom extractor system when it wasn't running.",
      "rate": 3.0,
      "tripDate": " June 2019"
    },
    {
      "title": "Ideal Place in Toronto",
      "text": "Super 8 is easily accessible on Kingston Rd.  I attended a funeral at McDougall and Brown's , the location of the motel was accessible.  In addition, it was the perfect choice for a family member who uses a cane as we found a room on the ground floor.  The front desk staff were friendly and helpful from booking, and helping us to find restaurants.  Super 8 was ideal for us.  As a motel, it was ideal, it limited our interaction with many people considering the corona-virus.",
      "rate": 5.0,
      "tripDate": " March 2020"
    },
    {
      "title": "I expected far less",
      "text": "Neither the chain or location have a great reputation here, but I was pleasantly surprised.  When the room I booked had no elevator access, the clerk accomodated me by putting me in a first floor walk-out room so I could go outside to smoke.  As far as I know this is the ONLY place to get a smoking room.  All staff was quite nice, fairly quiet neighbors, and no issues with traffic noise.  Bed was super comfortable and cable had what I wanted.  I was a little disappointed by the bathroom cleanliness and the food left in the fridge.  I was granted an extra hour on checkout with no attitude or issues.  I will definitely stay again.",
      "rate": 4.0,
      "tripDate": " April 2021"
    },
    {
      "title": "Never again!",
      "text": "So, let me start by saying staff seems nice! And no bugs! When we were waiting to check in someone was complaining because all the vending machines are broken, and the decour in the lobby looks stained. Now let's talk about the room- we walked in there were cigarette burn marks all over and a strong smell of smoke, we walk through and there is a phone number etched with a knife on the coffee table, there is a roughly patched hotel in the bathroom wall, there are rips in the screen- went back out mentioned to staff they did come right away and  noted the damage then pained the coffee table the next morning, also there were not enougj blankets, and the carped when i accidently walked on it without mu shoes was super grimmy. Now I would also like to mention breakfast consisted of 1 oasis juice and 2 nature valley bars. The  pool is empty there are old mattress/furnature in the pool area, also they had a large assortment of luggage with tags? The gym atea had 1 tredmill we did not check to see if it worked and assumed no. This whole experience was concerning I was very dissappointed that Wyndham puts their stamp on this hotel. The location was ok but NEVER AGAIN. I feel bad for the staff this hotel needs to be closed ps. The fridge in the room was nice and cold that is a possative",
      "rate": 1.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Don’t waste your money",
      "text": "Don’t waste your money. Management and front desk staff are terrible with poor service. No breakfast. No offer to fix a bad stay they ruined. The place is operating like a shelter with certain individuals and felt bad. Horrible smoke smell. Dirty carpets and floors. Only nice person is Asian lady at front desk. They keep making you switch rooms just to extend stay then try to get 2 deposits and argue with you rather than work with you to keep you as a guest. Imagine having a deposit then arguing with me to get another deposit on my credit card after they sold my room and forced me to move from non smoking to smoking. A manager did this smh. Just save your money and choose wisely. It is not worth $200 a night.",
      "rate": 1.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Absolutely Awful Hotel!",
      "text": "We rented two rooms for two nights.  My room was upstairs (accessible via a side door). There are no elevators. The stairs were very dirty - old kleenex, cigarette butts, coffee cups.  The room itself was dark and not well maintained. There were small flying bugs (looked like fruit flies) in the bathroom sink.  I came home covered in bites on my arms and legs which were, according to my pharmacist and google searches, caused by bed bugs. I wrote to the hotel and they \"categorically rejected my claim\", because other guests in the room prior and after did not complain. My brother-in-law took photos of mold on the shower curtain. I sent photos of my bites to the hotel and the parent company (Wyndham) and eventually was offered \"without prejudice\" two complementary nghts.  (A big No Thanks to that.)   I was given the name of the hotel owner by Wyndham and when I called he told me he is no longer the owner. Wyndham let me know the manager would reach out to me, but I have not heard further.  I have reported the hotel to Toronto Public Health.",
      "rate": 1.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Don't recommend at all. Not clean and many other issues.. Including food, broken items",
      "text": "Don't recommend at all. Not clean and many other issues.. Including food, broken items. The price per night was too high compared to the services provided. I have traveled a lot but never face such a service",
      "rate": 1.0,
      "tripDate": " January 2023"
    },
    {
      "title": "DO NOT STAY HERE!!",
      "text": "Do not stay here. This hotel is so dirty and gross. Spent my short time here trying to get a refund, but the hotel refused to allow Expedia to refund our money. My sheets had leftover food residue on top of and on the sheets.  Cobwebs hanging from the walls. My curtains looked like there was mould all over them. Office chair had numerous stains. Carpet filthy. Door didn’t close and latch automatically. Tub and sink still dirty. Overall disgusting. My friend’s room was also dirty with cobweb and stains. Also had a smell to it. Front desk staff and manager do not listen. They are to busy talking overtop of you. Was told ‘listen lady..’ Disgusting hotel and behaviour by staff.",
      "rate": 1.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Super 8 is Super Poor",
      "text": "To say that Super 8 is super poor is an understatement! I stayed there for one day during the last Caribana Festival, and they charged me double for the room, way out in the eat sticks; as well as $150.00 cash deposit. The room, the halls, the stairways all had peeling paint and damaged drywall. The next day on check out, they had the nerve to ask me if I gave a deposit. I immediately said yes, and told the desk manager that I had the serial numbers of the 3 $50 dollar bills in my wallet. He said, oh yeah, and gave me my deposit!",
      "rate": 1.0,
      "tripDate": " July 2016"
    },
    {
      "title": "Dirty and smelly",
      "text": "The hotel was undergoing minor renovations during our stay. The hottub in the pool room was permanently closed. Our bathroom smelled like mildew. The A/C in the room barely worked. Front desk staff was a little rude during check in because we had two vehicles.",
      "rate": 2.0,
      "tripDate": " September 2016"
    },
    {
      "title": "Disgusting!",
      "text": "This property looked amazing in the photos but once I got there, definitely no where near what the photo looked like. Prostitute and drug dealer motel for sure! No dead bolt on our door, a razor left in the shower, no toilet paper holder, walls weren't painted, floor in the bathroom wasn't complete, didn't even want to walk on their carpet without shoes on. Stains on the bed. Worst motel I've ever seen in my life!!! Beds were stiff as a board. Couldn't even leave my clothes or personal belongings in the room while I was gone.",
      "rate": 1.0,
      "tripDate": " September 2016"
    },
    {
      "title": "Only problem was the ice machine repairs right outside the...",
      "text": "Only problem was the ice machine repairs right outside the door started very early in the morning without warning.  king room we booked online was not available and given another room.  We would have asked a different location due to excessive noise in the morning.",
      "rate": 4.0,
      "tripDate": " August 2016"
    },
    {
      "title": "In need of upgrades.",
      "text": "The sheets were clean, the spread was not.  The room was cold because it was -23 degrees Celsius or -9 degrees Fahrenheit outdoors and the heater/ac was designed for summer use.  The flat screen TV was excellent.  The water was hot it he bath. The receptionist was very friendly and helpful. Upgrades are costly but the competition two doors east was $22.00 dollars a night more and excellent.",
      "rate": 2.0,
      "tripDate": " February 2016"
    },
    {
      "title": "Good Customer suevice but unpleas",
      "text": "I remember, long time a go I was reviewing this hotel in a good way. I do not regreat what I have said before. I recently have a chance to go to this hotel. The customer service is still amazing. A big \"BUT\" the room was awful specially 3rd floor ...WOAH!!!!!! Wait a minute! Is there any equivelant word to replace Bad or Extermely Bad? I was surprised that the room has bad smell, disgusting mattreses even ripped and doesn't have a bed just 2 or 3 pieces of metals on the ground....every where you can see Cockroach feces or poo, the washroom is unbelievable the worest part... anyways, it is the great lesson and decide not going to there anymore.",
      "rate": 2.0,
      "tripDate": " May 2015"
    },
    {
      "title": "Awful!!",
      "text": "Stayed in this motel for one night and it was horrible. I don't think that the room was cleaned for a long time. Thick dust on the lamps. Cobwebs in corners. Bedding was dirty. Slept on top with clothes on. There was a bad odour in the room. The hallways are in need of maintenance, and paint. Would not recommend this Super 8.",
      "rate": 1.0,
      "tripDate": " September 2013"
    },
    {
      "title": "So-so",
      "text": "Stayed 5 nights in Nov 2011.  Rate was pretty good.  Room was clean, and quiet, BUT:1. It was way too hot for sleeping comfortably. There was an old wall-mounted HVAC unit that only worked intermittently.  Could only open the one small window about 2 inches, to try and get some air.2. Double bed was comfortable, but the two small pillows were not.Location was good.  Very basic breakfast was included. Wireless Internet worked great.  Fridge in the room was nice to have.",
      "rate": 3.0,
      "tripDate": " November 2011"
    },
    {
      "title": "It wasn’t great.",
      "text": "Not a lot of effort to even try to fix my issues with the room. I wouldn’t recommend the establishment and there wasn’t even a chance for someone to resolve it because of the lack of staff. The breakfast was very limited and boring.",
      "rate": 3.0,
      "tripDate": " December 2022"
    },
    {
      "title": "DO NOT STAY HERE!!!",
      "text": "Poor experience. Hallway and our room was smelly. Bed was not comfortable at all, I barely slept. Our room was on 3rd floor and THERE was NO ELEVATOR, they should've put it in their website. They serve free breakfast yet they couldn't provide a fork, ( that's the only thing I asked from them), we didn't even eat breakfast there. They have coffee machine but they DON'T HAVE COFFEE FILTERS. Unbelievable!! Not worth the price and they couldn't even give compensation since we did late check in and early checked out and never used any of their amenities. I work in reception, so i know how it works. Ridiculous service. Will definitely not recommend this hotel.",
      "rate": 1.0,
      "tripDate": " August 2021"
    },
    {
      "title": "Great!",
      "text": "I stayed here with a friend as a result of a bad experience at another place (Havinn bed & breakfast) at the beginning of October. After deciding not to stay at Havinn, I made a few phone calls and found this place. The rate was one of the best. We got to this hotel at 1am (without reservations) and got what we wanted (2 double beds). There was a breakfast in the morning until 10am, but we never woke up in time to go down and get it. There's also a (small) pool but we didn't use it, as we weren't planning on staying at this hotel. We spent most of our weekend downtown Toronto. Our plan was to take the subway all the time, but that plan changed when we moved to this Super 8. We drove every time. It took about half an hour to get downtown, and it was very easy to get there. We took Kingston/Danforth/Bloor to get downtown (all one street) so it seemed to take very long, there weren't any highways nearby really. The owners are very nice and so are the cleaning ladies. I would definitely stay here again.",
      "rate": 4.0,
      "tripDate": " October 2005"
    },
    {
      "title": "Good/Quiet Stay",
      "text": "A very convenient location with free internet, continental breakfast and heated pool. The rooms have refrigerator, microwave and TV. The room was neat and all the staff were very well mannered and friendly. They do make you feel at home and never hesitate to provide you with small accessories that sometimes make a big difference to you in times of need. The building itself is quite old, but that in no way prevents you from having a nice and comfortable stay.",
      "rate": 4.0,
      "tripDate": " March 2013"
    },
    {
      "title": "DON'T WASTE YOUR HARD EARNED MONEY",
      "text": "Would rate it 0 if I was able to. When we arrived at the hotel, we all noted the scent of the hotel; smells very similar to dirty feet, no word of a lie. At check-in, staff and manager on duty were very rude and not understanding of our situation; we checked-in under my boyfriend’s reservation made through Wyndham, due to their mistake we werre forced to pay an “extra person fee” costing us well over $100. While at check-in there were 2 other customers waiting impatiently behind us for a room change as it was not what they ordered and staff were very impolite about this as well. Claims to have complimentary breakfast however there was only 2 kinds of cereal, a waffle maker and bread. The juices served seemed like frozen juice as my cup had small chunks of frozen orange mix. Staff were eating breakfast in front of all the customers and sighing when something was unavailable. We were told to “hurry up” by the lady working in the breakfast area at 925 AM because she needed to get on with her day. Staff members working in the breakfast area were very impolite, not replenishing items until asked, could not help when asked where the milk was for cereal. The room was not up to standards whatsoever. The room we were in had holes punched into the walls from previous customers, the painting was not finished, the bathtub was absolutely disgusting and rather than having the cocking white, it was a dark brown color. Towels and facecloths were found to have stains on them as well. The mini fridge was found to be very dirty on check-in so we went to the store to buy lysol wipes to clean it out rather than ask the staff members as they were severely lacking in customer service, and we did not feel like being lectured on how busy they were (as they did at check-in). The hotel room smelt awful, like it was a smoking room previously, and previous customer had vomited on the floor without being properly cleaned. The pool they claim to have is ice cold, and SO dirty. The flooring in the pool was very disgusting, band-aids were found on the floor of the pool, 2 to be specific. Once the band-aids were found, we left immediately. Their “high-speed internet” was no where to be found, the internet cut in and out constantly. At check-in many customers waited in line to tell the manager their wifi was not working and his very words were “well mine is so it can’t be an issue”. Location for this hotel was not up to standards either, very far travel to Toronto Downtown. The appearance of this hotel is similar to the motel next door in my opinion and we considered staying in the Motel next door as we believed we would recieve better customer service and a better looking room. I would think Wyndham would maintain certain standards for the hotels they call their own, apparently they haven’t checked this Super 8 out because it most definitely is not like any other Wyndham associated hotel I’ve stayed at in the past 3 years. Utterly dissapointed and will NEVER stay here again or ever recommend to anyone at all.",
      "rate": 1.0,
      "tripDate": " June 2018"
    },
    {
      "title": "dirty, smelly and low quality hotel, stay away!!!",
      "text": "The hotel is dirty and smells like a rotten boiled egg everywhere. The rooms are so dirty that if you touch the surface of the furniture inside your room, your fingers will stick to it. Breakfast is awful. They have a swimming pool which I believe may have more bacterias than H2O molecules. Don't waste your money and don't spoil your pleasure or business trip.",
      "rate": 1.0,
      "tripDate": " June 2018"
    },
    {
      "title": "Never Again!",
      "text": "Horrible Room!!!! Stank and felt unclean and some lights did not work. Do not stay!!! 94 dollars for horrible room!!!!! Disgusting. Never again will I even think twice about staying at a super 8 in Toronto",
      "rate": 1.0,
      "tripDate": " May 2015"
    },
    {
      "title": "Crap",
      "text": "after showing up with wife and child we were disgusted by a 3rd floor walk up room  that stank when  I went down  and refused the room  I was told they would cancel the charge  later  to my dismay  I found I was billed for a room  I only looked in for 5 seconds after calling the manager to refute the charge  I was told he would look into it  and call me  back   he never did",
      "rate": 1.0,
      "tripDate": " August 2013"
    },
    {
      "title": "Wasnt to happy staying there",
      "text": "The room wasnt like the pictures or the pool didnt get into my room until 1 or 2 after i arrived place wasnt very clean wasnt very nice place either wont be going back there again wasnt very impressed at all",
      "rate": 1.0,
      "tripDate": " June 2018"
    },
    {
      "title": "Terrible discusting stay. Never again!!! Would NOT recommend to anyone",
      "text": "Can not even justify giving this place one star. Asked for first or second floor due to disabilities and a toddler. Was told nothing available. Climbed to 3rd floor, through the stench of pot in stairwell, and 3rd floor smelled worse. Seeped into our room. Had requested a crib, front desk came and handed me a bath chair saying I open it up for baby to sleep in. She had no clue when I told her it was a bath chair for a disabled person. Couldn't stand the smell and went back to desk to be told she had a 2nd floor room with balcony.  Switched rooms (walking down the outside balcony carrying a toddler in a snow storm) and found it unsafe. Thermostat uncovered and mercury bulb open, mold in bathtub, drywall mud splattered on bathroom floor, wall plug where wallplate didn't cover the hole properly, patched and unpainted areas on the wall. Fruit loops and sock under the bed from a previous guest. Had to sleep with baby between us. Shift change had new desk clerk wake us up at almost midnight with a 'so-called' crib.  It was a rollaway bed. No one there knows what a crib looks like???  How does that keep a toddler safe?  I got maybe 2 hours sleep because of having to watch a child that wasn't sleeping just to keep him safe.The only good thing I have to say is the day shift front desk clerk was very friendly and helpful, as well as appologetic for our bad experience.I would not recommend this place to a homeless person if the rooms were free.  Pictures proof of room condition",
      "rate": 1.0,
      "tripDate": " February 2018"
    },
    {
      "title": "X-mas stay",
      "text": "I went to my oldest sisters house for the holidays  and I booked this hotel, as I have done for the last 5 years, for December 25th and 26th.I am always seeing the glass half full and am generous on my reviews taking many considerations into play but here all I want to say is \" STAY AWAY\" . What they call renovations must all been done by unproffesionals,",
      "rate": 2.0,
      "tripDate": " December 2017"
    },
    {
      "title": "Comfortable",
      "text": "We like staying at the super 8 it is very clean & very friendly staff, my husband & I are smokers & there are not to many motels that have rooms for smokers I would tell all my family & friends to stay here when they visit Toronto they are also Pet friendly.",
      "rate": 5.0,
      "tripDate": " March 2017"
    },
    {
      "title": "Place is crap",
      "text": "We chose this location so we could go swimming.  Told at check in the pool had been closed for years.  Duct tape holding TV cable in place.  Room height was about 4 inches lower than hall height.  Someone is going to twist an ankle.  Staff were good.  Found long black hair in sheets of bed.  Nobody in our family has black hair.",
      "rate": 1.0,
      "tripDate": " December 2022"
    },
    {
      "title": "BROKEN DOOR",
      "text": "My room door was busted in you could see and the lock dident work properly. I wedged a table and bed to block the entrance and cold cold room. The staff was nice but nope won’t stay there again. Sorry but a no go",
      "rate": 1.0,
      "tripDate": " January 2022"
    },
    {
      "title": "DONT STAY HERE",
      "text": "Bathroom seems like mold, pool is closed indefinitely, no breakfast. Staff is rude. Damage all over the room, noise all night outside by staff. Don’t stay here, go anywhere else. Trust me. The king bed is two single mattresses shoved together. Everything smells like bleach and mold. Floor under the bed is dusty and hardly cleaned.",
      "rate": 1.0,
      "tripDate": " August 2022"
    },
    {
      "title": "DO NOT STAY HERE",
      "text": "Shady people from the streets staying there. Guess that’s a regular thing. One couple next door to us was screaming/fighting both physically and verbally all night. Hotel staff did NOTHING. At 6am we had enough and checked out. We were terrified to even walk out of our hotel room. Not the cleanest hotel, rooms are small, tiny pool, and outdated furniture/amenities. Would not recommend staying here to anybody. Spend the extra money on a safe, clean hotel!!!",
      "rate": 1.0,
      "tripDate": " July 2021"
    },
    {
      "title": "Enjoyed our stay with friends",
      "text": "Had a great stay... Everything was clean and comfortable beds. Service was professional and knowledgeable staff. We were there for one night and we enjoyed delicious food not too far from hotel. Easy access to restaurant and tims. Will come soon again.",
      "rate": 5.0,
      "tripDate": " June 2021"
    },
    {
      "title": "Don't",
      "text": "Dingy with terrible internet. Just don't. It's cheap and it really shows. Breakfast was two granola bars and a juice box. Laughable.If you have any other options, take it. There's nothing redeemar about it in spite of the nice staff.",
      "rate": 1.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Peace at last!!",
      "text": "It's a home away from home. Pool is always nice and warm. Always a pleasant trip. Staff is always pleasant and I always feel welcome. Breakfast in the morning is always good. Very charming. Peace at last!!",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "excellent little trip",
      "text": "I have stayed at this place and was a nice little gate away for me speciallly after pendamic. staff were so nice and our room was clean. wish we could have spend more nights here but it was an excellent trip for me. i will be back again.",
      "rate": 5.0,
      "tripDate": " October 2021"
    },
    {
      "title": "Great Stay",
      "text": "Stayed for two nights. Peter at check-in was very friendly. You get what you pay for, but the service was really great. Bianca at check-out was very nice and did everything to ensure my partner and I had a great stay. Will definitely stay again, and will recommend this property to others!",
      "rate": 5.0,
      "tripDate": " May 2023"
    },
    {
      "title": "Very bad experience !!!!!!!!",
      "text": "When I came in to this motel it didn’t look the way it was on the Super 8 website. I had high expectation on this motel but as soon as I enter to the front desk I realized that I came to the wrong place to spend the night. I was surprised to see a tongue pierced women working in a front desk. She was busy with her cellphone so that I had to wait 15 to 20 min to check in. The room is too dark and cold. Hallways stinks like weed also it’s filthy. There is a flat screen TV but NO volume .When I called the front desk for help they ask me to turn the TV off and turn back on after few seconds to get the volume .Overall service and cleanness is terrible. I would never comeback to this place again and I would never recommend this to anybody.",
      "rate": 1.0,
      "tripDate": " February 2015"
    }
  ]
}