{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Sutton Place Hotel Toronto",
    "url": "/Hotel_Review-g155019-d23508064-Reviews-Sutton_Place_Hotel_Toronto-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.5",
      "reviewCount": 103
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "355 King St W",
      "addressLocality": "Toronto",
      "postalCode": "M5V 1J5",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/1f/ea/41/0d/king-blue-hotel-toronto.jpg?w=500&h=-1&s=1"
  },
  "description": "The latest addition to the Sutton Place brand, The Sutton Place Hotel Toronto (formerly King Blue Hotel), stands proud among the buzz of the Toronto Entertainment District. Guests are invited to relax in luxurious comfort featuring beautifully designed guest rooms, modern furnishings along with first-class amenities. An unforgettable dining experience awaits guests at the on-site restaurant, Abrielle. The Sutton Place Hotel Toronto is where modern luxuries meet exceptional and sincere service, all in the heart of downtown.",
  "featues": [
    "Paid private parking on-site",
    "Free High Speed Internet (WiFi)",
    "Fitness Center with Gym / Workout Room",
    "Pool",
    "Kids stay free",
    "Children's television networks",
    "Pets Allowed ( Dog / Pet Friendly )",
    "Business Center with Internet Access",
    "Parking",
    "Internet",
    "Indoor pool",
    "Heated pool",
    "Meeting rooms",
    "Rooftop terrace",
    "24-hour security",
    "Baggage storage",
    "Non-smoking hotel",
    "24-hour front desk",
    "Dry cleaning",
    "Laundry service",
    "Blackout curtains",
    "Bathrobes",
    "Air conditioning",
    "Desk",
    "Dining area",
    "Coffee / tea maker",
    "Cable / satellite TV",
    "Walk-in shower",
    "Housekeeping",
    "Interconnected rooms available",
    "Safe",
    "Seating area",
    "Telephone",
    "Clothes rack",
    "Iron",
    "Laptop safe",
    "Private bathrooms",
    "Tile / marble floor",
    "Wake-up service / alarm clock",
    "Microwave",
    "Refrigerator",
    "Flatscreen TV",
    "Bath / shower",
    "Complimentary toiletries",
    "Hair dryer",
    "City view",
    "Bridal suite",
    "Non-smoking rooms",
    "Suites"
  ],
  "reviews": [
    {
      "title": "Superb, Beautifully appointed, exquisite decor, comfort and quality and truly amazing ",
      "text": "Finding a hotel in Toronto is easy , finding a good hotel is relatively easy, finding an absolutely superb hotel is not so easy.   My first stay at the King Blue Hotel and won't be my last. Nestled in the facade of the old Westinghouse Building on King Street West this hotel combines old and new flawlessly. The spacious lobby has such an air of elegance and is modern and stunning.. The design and decor is beautiful and  the architecture and attention to detail and  just gives you a hint that the rooms will be special.  The elevators are modern and efficient with swipes for extra security  When you step out into the hallways you will find they are large, with excellent lighting and tastefully decorated. This is not your average hotel hallway for sure.  My room on the 5th floor was well appointed with a bank of windows looking out on the streetscape -but so very quiet -not a sound from the traffic at all.  The foyer contains a large closet with robes and slippers, a safe, drawers, ironing board and iron and of generous proportions   There is also a small service area with a fridge, microwave and coffee maker with a good selection of coffee. The bathroom was lovely with a massive shower and fantastic selection of toiletries and sumptuous towels   The bedroom/lounge had a very comfy king bed with beautiful quality linen and pillows.  Generous bedside tables with reading lights placed just right. The seating area had a lovely and very comfortable sofa as well as a desk and chair.  The wall mounted TV was of good proportion and at a height that was good for both watching TV in bed or from the sofa. Again the decor was extremely tasteful and attention to detail and quality evident.  The staff are very attentive and really show that they truly want to make your stay memorable.  Free Wifi, a fitness centre and pool as well as a lovely cafe lounge with seating, in the lobby,  pet friendly suites, parkinthig  and location location location.  This hotel has it all.  Elegance, comfort and exquisite taste in decor - this is my new Go To Must Stay `Here place in Toronto.",
      "rate": 5.0,
      "tripDate": " December 2022"
    },
    {
      "title": "⭐️⭐️⭐️⭐️⭐️",
      "text": "⭐️⭐️⭐️⭐️⭐️ very nice hotel, we had a great room very large. Our room was clean, had complimentary coffee, tea and water. Air conditioning was incredible. We had a great stay! There’s no restaurant at this hotel but plenty of places to eat around it. We only stayed on night but would have stayed more",
      "rate": 5.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Loved it",
      "text": "Fabulous is the best word to describe this hotel. Meeting up with family who flew in from Vancouver and us from Scotland UK, three generations do a very mixed group and we all thought the hotel was brilliant.Check in: after a seven hour early morning flight plus transfers this was really easy, staff very friendly and accommodating and gave us water as soon as we arrived for check in, with the heat it was needed.Rooms: we all had similar rooms two queen sized bedrooms I think they were called. The bathroom has lOctaine bathing products (shampoo, lotions, body gel, soaps a shower cap and loafer) there were also cotton pads, nail file etc, a fantastic selection. The spare toilet roll was in the cutest little bag, there was also a non slip bath mat for in the shower if required however I personally didn’t use it as the shower floor felt non slip even after I’d used shampoo etc. The beds were extremely comfortable and there was a choice of pillows with one saying firm and the other not, I slept with both pillows together and it was great I was out like a light. We had a room with a city view it was not too noisy as I was a little worried at first but apart from during the evening when I heard a siren I didn’t hear anything and I live in a quiet suburban area where I wake it the dogs start barking so that was a very pleasant surprise. The room was well set up with plenty of storage for clothing either in drawers or hanging, there was a safe and iron etc, the room had a lovely wee seating area with two nice chairs and table, and then a desk meaning we could all get together and have a chat. Cleaning: firstly it was very clean, we were staying a couple of nights and the staff did a brilliant job, even the top of the fridge area which usually gets missed was clean no dust. Especially as there is renovation going on in the street to a couple of buildings (no noise heard in room) which makes it dusty and the pollution from the wild fires it’s really clean. Staying at another hotel in Niagra and my daughter wants to go back to Toronto so we can stay at this hotel as she loved it..",
      "rate": 5.0,
      "tripDate": " July 2023"
    },
    {
      "title": "Nice Rooms but poor customer experience",
      "text": "As a regular business traveller, was recommended to to try a new hotel. But  I won’t be repeating the experience.  While the rooms were new and nice, nothing was based around the.needs of the customer.The company had set up payment on my behalf but somehow that didn’t work out and I had to to fork out my card.  There was no information in the room on how anything worked or times, so constantly had to call the front desk only to be given conflicting info. Breakfast came in the form of self service sugary snacks without even plates and cutlery. Coffee machine wasn’t even ready at 8am. Coffee pretty awful. Was told by one front desk person that pool opened at 9 am, another at 10am. But no written info anywhere. I wanted it open before breakfast and even when requested was told that the reason was no demand. So why do other Toronto.hotel pools open at 6 am?  My colleagues felt the same way.  This hotel management needs to understand its customers needs much more professionally.",
      "rate": 2.0,
      "tripDate": " May 2022"
    },
    {
      "title": "Luxury, location, fabulous rooms and the. best staff -My Go to Toronto hotel",
      "text": "I have stayed here before and is my Go To hotel in Toronto.   The staff are really kind and caring and very professional. The rooms are well appointed with the best beds ever and luxury linen and pillows.   The decor is stunning and carefully chosen to provide a chic and up market feel.   Spotlessly clean and large TV's wall mounted with a good selection of viewing options. Many rooms have windows overlooking Blue Jays Way or King Street but they are so well insulated you do not hear any street noise.  The lobby is currently undergoing a transformation which will include a restaurant which if anything like the rest of this beautiful hotel will be something unique and worth the visit.   There is underground parking and a great rooftop pool /gym and patio. Fantastic location with a streetcar at the door and walkable to many of the popular tourist sites.   Good hotels are abundant but great hotels like the Blue are a scarce commodity.. It has everything you want in a great hotel; and I cannot say enough about the staff.  They care about you as a guest and always make an effort to make you feel welcome and special.   Can't wait to come back again",
      "rate": 5.0,
      "tripDate": " May 2023"
    },
    {
      "title": "Great stay in the heart of the city.",
      "text": "Great hotel and kind and helpful staff. Big clean and new rooms are well outfitted and the location of this hotel is perfect for easily accessing anything in the core of the city. Front desk staff went out of their way to make sure we were checked in and able to get to an event that started before check in time. I wish I knew the woman’s name to give her proper credit. It was Thursday January 18th afternoon. Also, very kind and helpful valet service. Michael was the valet driver who deserves the credit.",
      "rate": 5.0,
      "tripDate": " January 2024"
    },
    {
      "title": "Neew Hotel but don't count on the breakfast",
      "text": "This is a relatively new hotel.  On the positive side, the rooms re large, clean an quit.  The bathroom is large and clean with a very large shower.  We stayed for 5 nights and the locations is superior.  5 minute walk to a blue Jays'' game and close by the entertainment district.  Public transit (street car)s tops at the front door providing  access to the entire city.The dispoointing were thehe supplied morning breakfast/snack - very uninspiring.  THE COFFEE was good although the machine dispensing same is slow causing wait times.  The  high calorie muffins and cinnamon rolls just did not cut it for even a continental style breakfast.  Another disappointment was the roof top terrace.  No seating and no ability to purchase  beverages or food.The front counter staff was very friendly an supplied good information..",
      "rate": 4.0,
      "tripDate": " May 2022"
    },
    {
      "title": "Warm welcome on my return ",
      "text": "Very short stay in Toronto and back to my Go To Hotel in Toronto.   Lovely room as always and a very warm welcome back by staff.   The Hotel is undergoing a massive lobby transformation to include a restaurant and seating areas when I was there and excited to return to see the outcome.   A great hotel and the beds comfy.  Large variety of nice toiletries supplied and the coffee bar has espresso and a nice working refrigerator.   Sumptuous bedding and decor is modern and tasteful. Always feel pampered and well looked after-staff are attentive and pay attention to detail and cannot to enough for the guests.  Spotlessly clean with a wonderful pool and gym on the top floor.  There is a banquet room and underground parking with concierge service.   Close to everything in the downtown core with loads of restaurants and transportation right at the door. Excellent value for money !!  The best hotel in Toronto.",
      "rate": 5.0,
      "tripDate": " August 2023"
    },
    {
      "title": "Nice rooms. Hotel needs works.",
      "text": "The Kind Blue is well located and stylish. We appreciated the fact that it occupies a heritage building. Our room was very nice and nicely appointed. We even had a sectional sofa. It should be noted that service is at a minimum. There is no restaurant, no bar, a nice pool that didn’t seem heated, room cleaning and supplies are on demand only. Even the TV didn’t offer regular cable, just a strange selection of English only channels (not very nice to francophones) and streaming. The room came with complementary breakfast, which they shouldn’t bother to offer. I have been to cheap motels that offered better. Croissants and muffins in plastic bags, little Oasis juices, cheap coffee, etc, in a 350$ a night hotel. Just don’t offer it. At least get a basket of fresh croissants and muffins from the very nice café around the corner (French Made Café). Finally, we had the misfortune to be on the front of the hotel. Toronto trams may be convenient but they are noisy and frequent!",
      "rate": 4.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Disappointing",
      "text": "In Toronto for five nights at TIFF. Location great. But for a US$600/night hotel there were a number of problems. No daily housekeeping (okay, I guess) but when mid-visit I asked for the room to cleaned and made up fresh, it wasn't done (not okay). Same thing happened to two friends who each asked and neither got service. No food available. A third-party vendor has a lobby \"cafe\" in the morning with pre-made breakfast sandwiches (the egg substance is a small circle of egg material shaped into a patty and the cheese was cold and unmelted). That same cafe is a \"bar\" in the evening. No bourbon, scotch, rye, or tequila, only some gin that was a \"promotion\" I was told, and the rest were brands I'd never heard of. One towel rack in the bathroom. No place to hang a damp washcloth. No shelf in the shower for my shampoo or conditioner. The spotlight reading lamps bill into the bed headboard were not functioning. The guest software in the TV had not been set up; advertised 'check your account' and 'set a wakeup time' but not working.Utterly without personality or style in the room decor. Surrounded by tall buildings; I was on the top (6th) floor and could not see the sky at all. US$600/night? Really? They'll not be seeing me again, great location or no.",
      "rate": 2.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Wonderful!",
      "text": "Shout out to Michael! This was our first time in Toronto and I didn’t have time to plan anything in advance. He took out a map, highlighted tourist attractions, helped me to plan out each day, and answered all of my questions without ever rushing me. Thank you! This is a beautiful, clean, and quiet hotel. It’s not huge, which is what I prefer. Valet parking is costly but I have no complaints. Friendly staff. We’ll stay here again next year.",
      "rate": 5.0,
      "tripDate": " May 2024"
    },
    {
      "title": "11 day visit - Kudos",
      "text": "I am writing this letter to express my sincere gratitude for your hotel's exceptional hospitality and service during my recent stay, May 25 to June 5, 2024. The hotel's attention to detail and commitment to customer satisfaction truly made my experience memorable. From the moment I arrived at the Sutton Place, the staff ensured a warm and welcoming atmosphere. The comfortable accommodations and excellent housekeeping services exceeded my expectations. I was particularly impressed with how smoothly everything was organized and the friendly attitude of all your team members. I would like to draw particular attention to the exemplary performance displayed by Julianna, Julian and Cekdar..Once again, thank you for providing me with such a delightful stay. I will be recommending your hotel to friends and all heading to Toronto.I look forward to staying with you again in the future.",
      "rate": 5.0,
      "tripDate": " May 2024"
    },
    {
      "title": "Great Stay",
      "text": "Stayed for one night with the family.  Great hotel with a great staff.   The front desk team, valet service (thanks Mike), and housekeeping were all extremely helpful and friendly. Great location to take in a play or walk to the Scotiabank arena or Rogers Center.",
      "rate": 5.0,
      "tripDate": " February 2024"
    },
    {
      "title": "Nice Hotel",
      "text": "Check in was a breeze, Peggy was  very nice and helpful. Our room was clean and well appointed. Our bed was comfortable,  and the bathroom was nice.  Avoid a King St facing room, lots of emergency vehicles, and the windows are not very soundproof.",
      "rate": 5.0,
      "tripDate": " April 2022"
    },
    {
      "title": "Customer Experience",
      "text": "Aswin from the front desk was so welcoming at the point of check in and check out. We were provided water bottles at the time we checked in and Aswin ensured that all our requests were swiftly handled. Kudos to the young gentleman. Keep up the good the customer service skill.",
      "rate": 5.0,
      "tripDate": " February 2024"
    },
    {
      "title": "Amazing!",
      "text": "Keith in valet was incredible, as was the front desk. The entire staff was so accommodating and kind, going out of their way to make sure that I was taken care of and happy. I will definitely be coming back next time I’m in town to stay at Sutton place thanks to the staff!",
      "rate": 5.0,
      "tripDate": " April 2024"
    },
    {
      "title": "Great place to stay",
      "text": "We checked in very late at night and very hungry. Staff we were very helpful In pointing out places to get a meal and gave us great directions the next day to where we wanted to go.  The room was big light and clean. Great swimming pool too! Good location. We appreciated the morning coffee and fresh fruit.",
      "rate": 5.0,
      "tripDate": " July 2023"
    },
    {
      "title": "Lovely Stay",
      "text": "New hotel in an amazing, central location.  The rooms were  spacious and clean.  The lobby was inviting.  The bar and restaurant was not complete, but the hotel is surrounded by some of the best restaurants in the city.  The front desk staff were very friendly.  We had a nice stay and we cannot wait to return.",
      "rate": 5.0,
      "tripDate": " March 2022"
    },
    {
      "title": "Fabulous stay",
      "text": "Fabulous stay at this hotel. Great location and near to all attractions. Great bars and restaurants nearby.  The pool was brilliant and so Warm. The staff couldn’t be more helpful especially Sue, Julianna and Rhys on reception who were the most helpful staff we have ever come across. Nothing was too much trouble and they were so friendly. They even provided us with umbrellas on rainy days. We had relations come to visit us and the staff helped with arranging parking for them which was an added bonus. We would definitely recommend and will be back. Sutton Place should be very proud of all of their staff.",
      "rate": 5.0,
      "tripDate": " May 2024"
    },
    {
      "title": "Toronto Hotel",
      "text": "Julian 我爱上藕粉great service，thank you foreverything.  问黑暗的啊great stay爱他他和Sutton Place Hotel Toronto. We will的棍儿理由被back next time Beautiful hote了， city， staf分爱你的great restaurant The pool我爱上great爱你的他和官员们我爱上啊咯啊good experience thank you",
      "rate": 5.0,
      "tripDate": " February 2024"
    },
    {
      "title": "Wonderful stay!",
      "text": "Had a wonderful stay at the King Blue! We received a generous upgrade to the presidential suite, which was incredibly spacious (2 bedrooms, 2.5 baths, king beds, large bathrooms, great lighting, etc). Thank you to the gentleman at the front desk that made this possible (sorry I didn't get your name!) I've also stayed here once a few months back and had a great stay then too. It's very clean and new. Staff is very friendly and helpful! My friends also enjoyed the pool. Location is great downtown, lot of shops and restaurants in close walking distance. I'm definitely planning to stay here again and highly recommend!",
      "rate": 5.0,
      "tripDate": " March 2023"
    },
    {
      "title": "Attention to Deatails",
      "text": "The check in process was very smooth and front desk staff are very good and attentive . The rooms are very large, beds and pillows are very comfortable . Little things like water, coffee, tea, shoe shine kit, slippers and great robes . A great pool and rain shower . The location is great right in the Theatre district, walking distance to Rogers Centre and Scotia  Bank arena and the Aquarium .Only issue is very limited onsite parking . We returned back from a function and there was no parking . The front desk went down to the parking garage and got us a spot . That was a nice touch",
      "rate": 5.0,
      "tripDate": " November 2021"
    },
    {
      "title": "So Glad I Stayed",
      "text": "Sleek, elegant design to this hotel. Clean comfortable king room. I arrived early and was able to check in and get on with my day. The TTC streetcar stops right outside the hotel and St. Andrew’s subway station is a short stop from there. Also close enough to Union station. Starbucks right across the street. All of this makes the location ideal for getting around Toronto. Friendly hotel and restaurant staff!! This is now my new place to stay in TO!",
      "rate": 5.0,
      "tripDate": " November 2023"
    },
    {
      "title": "Modern clean and beautiful property",
      "text": "I booked this property not knowing much about it as it was relatively new and found it is a downtown gem. The room was very spacious and modern. The bed was also very comfortable and the lighting was very good. Being downtown there is a bit of street noise but their sound proofing is decent and only the sirens and honks could be heard.",
      "rate": 5.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Definitely will stay there again !",
      "text": "We stayed for a night at the Sutton Place downtown Toronto. It was the first time my wife and I stayed at this location. We arrived early and our room wasn’t ready yet, but Zara was helping us at the front desk and  she offered an upgraded room at no extra charge that was available immediately.The suite was truly amazing, probably the nicest hotel room I have ever stayed in. Thank you so much Zara and The Sutton Place Hotel for this experience.",
      "rate": 5.0,
      "tripDate": " May 2024"
    },
    {
      "title": "Wonderful weekend get away!",
      "text": "Stayed at this lovely new property from May 5-8 2022. Excellent location to all the tourist attractions and a short Uber ride to others.  Customer service was fantastic for what we needed.  Always a smile to great you at the door.  We didn't have time to use the pool or gym but it looked inviting.  Rooms were spacious and comfy for two.  Most comfortable bed I've encountered for a while at a hotel.   There is a smart TV in the room that allows you to cast your popular streaming apps which is nice to have. Would most certainly stay again or recommend to others. Note: There is no bar, food, or coffee set up at this property.  There is a coffee machine and a couple bottles of water in the room but having a cocktail would have been nice.  There is a Shoppers Drug Mart right across the street for water and snacks though.",
      "rate": 4.0,
      "tripDate": " May 2022"
    },
    {
      "title": "Absolute hidden gem in downtown Toronto",
      "text": "New, clean, tidy, low key, no-frills boutique hotel situated in downtown Toronto.  Hands down one of the best hotel staff teams I have ever come across- from front desk to valet parking to restaurant. Aswin at front desk was a standout. I wanted to switch rooms and Aswin not only gladly helped but he offered to show me multiple available vacant rooms. The new room I chose was a grade lower than original room. To compensate Aswin offered to free all valet parking for my entire stay. I really appreciated it.",
      "rate": 5.0,
      "tripDate": " March 2024"
    },
    {
      "title": "Very nice place!!!",
      "text": "We loved staying here, the valet parking was a nice touch too. Although there is a parking lot just down the street, which we used after checkout😊. The room was very spacious and very clean! We had a view of King St.  I also requested early check in and the staff are amazing! No extra charge for early arrival. Walking distance to many things. For us it was the Roger’s Centre😁 It was a bit pricey,but everywhere downtown Toronto is…..",
      "rate": 5.0,
      "tripDate": " May 2024"
    },
    {
      "title": "Very nice hotel in the heart of Toronto.",
      "text": "Very nice new hotel.  The room had lots of room with a nice king bed and sitting couch.  The bathroom was huge.  Hotel is about a 10 minute walk from Union Station so easy to get to from the airport and is a straight walk down Blue Jays Way to Rogers Center aka Skydome.  Hotel is able to store your luggage for the day if you are taking a late flight out of Toronto.  Hotel is pricy but all the hotels in downtown Toronto are.  Just look out for deals.",
      "rate": 4.0,
      "tripDate": " May 2023"
    },
    {
      "title": "Great experience at this hotel",
      "text": "Julian and the valet service were amazing here. Would come back 10/10 . The rooms are above par. Very elegant and high class hotel. The staff goes above and beyond for all the guests and makes you feel so welcomed. I love that the rooms are stocked with water and there are so many amenities to use in the room. The bath robes are so soft and I would stay again",
      "rate": 5.0,
      "tripDate": " March 2024"
    }
  ]
}