{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Taigh Ice",
    "url": "/Hotel_Review-g155019-d8558273-Reviews-Taigh_Ice-Toronto_Ontario.html",
    "priceRange": "$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "2.0",
      "reviewCount": 8
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "259 Wellesley St E",
      "addressLocality": "Toronto",
      "postalCode": "M4X 1G8",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0c/d0/51/a1/taigh-ice.jpg?w=500&h=-1&s=1"
  },
  "description": "Taigh Ice located at Cabbagetown at Wellesley and Parliament St. It's a Victorian house with 3 different types rooms: elegant high-ceiling with shared bathroom, luxurious room with private bathroom, the whole top floor as studio or family room with private bathroom and kitchen and big private deck! The supermarket just across the road. Steps to TTC. Many fancy restaurants and bars around!",
  "featues": [
    "Paid private parking on-site",
    "Free High Speed Internet (WiFi)",
    "Children Activities (Kid / Family Friendly)",
    "Baggage storage",
    "Non-smoking hotel",
    "Private check-in / check-out",
    "Dry cleaning",
    "Laundry service",
    "Secured parking",
    "Wifi",
    "Ironing service",
    "Air conditioning",
    "Housekeeping"
  ],
  "reviews": [
    {
      "title": "Shockingly bad!",
      "text": "Room was described as 'Deluxe'... it wasn't!!1. Communication with hosts was poor   no information given on how to get into the room. Luckily I called in advance otherwise I would have been stuck in cabbagetown at 3am2. Free WiFi? Yes, but no information on how to access it was given. Luckily bumped into a maid next morning who gave me the code.3  sign at entrance said 'please take off shoes' you then had to walk on the most disgusting and dirty carpet ever - keep your shoes on!4. Various creatures walking around the room to keep you entertained 5. Room A had the noisiest bed ever. So squeaky,  you couldn't get to sleep6. Bathroom fixings were hanging off the wall7. Hosts claimed card had been rejected and demanded cash. Other reviews mention this. Card is fine and other accommodation has taken payment without issue.Not recommended!!!",
      "rate": 1.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Save your money!",
      "text": "Any complaints of service will result in them blocking or ignoring your phone calls after a bit of what would be a facade of trying to help you. If you give them the straight facts of what you will and will not accept they will block and ignore your calls. If you are stern or seem \"confrontational\" in any way you will be blocked and ignored by this hotel. I was in the process of making complaint of the hotel room to the staff, and the manager left the property before anything could be done and I had to leave without being refunded, and now that I am trying to take action they have told me its been too long and when I told them that that was unacceptable for the circumstances, they basically said sorry for the inconvenience and left the call as I was responding. I Cannot be more taken aback by the quality of customer service they provide.  Or lack there of. They completely ignore my calls as a way to avoid confrontation and in that, I believe they have a confirmation bias that their hotel is the end all be all of hotels.On to my experience of the actual room.  -The images they show, are completely out dated. I stayed in the studio suite and it is a very run down version of those images.     Any and all photos by other hotel goers that have been posted can be what you expect. Not the pristine clean white sheets and three tubes of whatever laid out for you when you arrive. You can expect the dark and dingy look of someones guest bedroom with the same quality as a forgotten backroom. -They do not sweep or wash your floors before you check in. (hair and dust bunnies under the kitchen dining table. (*Small table, extremely easy to sweep) -I read that they have minimal room service, which at this point I am to understand means they don't do anything besides tidying the covers and straightening them out. I have little reason not to believe based on their statement and my experience, that they are making any effort to actually change the blankets in this room prior to someone checking out. (another review seemed to mention the feeling that cleanliness was solely based on the state that the last tenant left it in)  -They do not wash the walls prior to your check in. (There was sauce Speckled up the walls and they could not be bothered to wipe it down before my check in)-They do not check to make sure you can use the A/C unit, stove that has been included in the kitchen, the fridge, and the lights, at the same time. (Power surg caused the breaker to blow and could not cook a frozen pizza picked up from across the street. Ended up having to throw it out and eat granola bars.) I was given the option to use the resident stove instead of the one I paid the hotel to make use of in the privacy of my hotel room. -Bathroom photo looks to be doctored as they were not as advertised in terms of quality. A lot to be desired with the state of the bathroom fixtures which, after seeing it in person, seems to have been blurred or has other pieces of the bathroom counter copied and pasted to mimic the look of a clean and luxurious bathroom. -Closet was filled with junk so I could not put my bags away and could not hang what I wished to hang. -The deck as shown in their advertisement is not clear but has an overturned blue sofa, also shown in their advertisement but not in the living space for your use, collecting leaves, rain water and the like so please enjoy the view, (its not nice) -There is no television in this room, this is not mentioned in the advertisement but do be aware that there is NO TV in the room for you to pass the time or ignore the messes surrounding you. -There was a toilet bowl cleaner still in the toilet upon my arrival which I had to pick out. (Not upset but as a person paying 220 to stay, I would assume my hands will not be soiled by cleaning utensils for a toilet that is used by many people) I am to understand that this hotel advertises itself as the end all be all of hotels, the luxurious room available to all. It is none of the things it claims to be, everything they say, is sugar coated to get you to book into their hotel with no way for a refund should you be upset for any reason and feel it best for you to leave.  In closing, Just check into some other hotel, this place is not worth your hard earned money. Even a Holiday inn is better than this place.",
      "rate": 1.0,
      "tripDate": " November 2018"
    },
    {
      "title": "Clean, quiet overpriced Chinese guesthouse",
      "text": "Quite expensive for what you get (a room to sleep in, with no TV).I was also kind of turned off by the fact that upon arrival, the lady talking to me on the buzzer only knew Mandarin.. suffice to say, this place is highly targeted towards Chinese individuals.",
      "rate": 2.0,
      "tripDate": " November 2017"
    },
    {
      "title": "Inexpensive guest house in Cabbagetown",
      "text": "If you're looking for inexpensive accommodation in the Cabbagetown area of Toronto, Taigh Ice at 259 Wellesley East is worth considering. We spent six nights there while visiting a relative locally. It's basic but quiet and has bathroom and kitchen facilities. There's no name on it, so look for the building's number. Around the corner is Parliament Street which has some good eateries (esp. The Pear Tree) while almost opposite is a supermarket.",
      "rate": 3.0,
      "tripDate": " September 2016"
    }
  ]
}