{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "The St. Regis Toronto",
    "url": "/Hotel_Review-g155019-d1985963-Reviews-The_St_Regis_Toronto-Toronto_Ontario.html",
    "priceRange": "$$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.5",
      "reviewCount": 2358
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "325 Bay Street",
      "addressLocality": "Toronto",
      "postalCode": "M5H 4G3",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2c/16/9e/47/king-guest-room.jpg?w=500&h=-1&s=1"
  },
  "description": "Rest easy at The St. Regis Toronto. Our hotel in Toronto, Ontario, is located near CN Tower, Scotiabank Arena, Rogers Centre, Toronto International Film Festival, and the city’s premier shopping. After a busy day, unwind at our spa and indoor heated pool, or enjoy on-site dining at LOUIX LOUIS and Astor Lounge.",
  "featues": [
    "Valet parking",
    "Free internet",
    "Fitness Center with Gym / Workout Room",
    "Pool",
    "Bar / lounge",
    "Books, DVDs, music for children",
    "Pets Allowed ( Dog / Pet Friendly )",
    "Business Center with Internet Access",
    "Wifi",
    "Fitness / spa locker rooms",
    "Hot tub",
    "Pool / beach towels",
    "Pool with view",
    "Indoor pool",
    "Heated pool",
    "Restaurant",
    "Breakfast available",
    "Breakfast in the room",
    "Complimentary Instant Coffee",
    "Complimentary tea",
    "Kids' meals",
    "Wine / champagne",
    "Conference facilities",
    "Banquet room",
    "Meeting rooms",
    "Spa",
    "Body wrap",
    "Couples massage",
    "Facial treatments",
    "Foot massage",
    "Full body massage",
    "Hand massage",
    "Manicure",
    "Massage",
    "Neck massage",
    "Pedicure",
    "Steam room",
    "24-hour security",
    "Baggage storage",
    "Concierge",
    "Non-smoking hotel",
    "Shared lounge / TV area",
    "Butler service",
    "Doorperson",
    "24-hour front desk",
    "Dry cleaning",
    "Laundry service",
    "Ironing service",
    "Soundproof rooms",
    "Bathrobes",
    "Air conditioning",
    "Additional bathroom",
    "Desk",
    "Coffee / tea maker",
    "Cable / satellite TV",
    "Bath / shower",
    "Interconnected rooms available",
    "Room service",
    "Safe",
    "Seating area",
    "Separate dining area",
    "Separate living room",
    "Telephone",
    "Bottled water",
    "Clothes rack",
    "Iron",
    "Private bathrooms",
    "Tile / marble floor",
    "Wake-up service / alarm clock",
    "Minibar",
    "Oven",
    "Refrigerator",
    "Stovetop",
    "Kitchenware",
    "Flatscreen TV",
    "On-demand movies",
    "Radio",
    "iPod docking station",
    "Complimentary toiletries",
    "Hair dryer",
    "City view",
    "Non-smoking rooms",
    "Suites",
    "Family rooms"
  ],
  "reviews": [
    {
      "title": "Very Comfortable (except the food options for us)",
      "text": "From the moment we arrived we were greeted with friendly faces, professionalism and they took care of us.They parked our car, plugged it in (Electric ⚡️ ), took our bags and gave us our room keys with the option of Digital keys via the Bonvoy AppLocation is fantastic, in the heart of the Toronto financial district, just walking distance to other restaurants, coffee shops, the Mall, subway TTC system and business towers.Unfortunately due to Toronto Covid protocols at the time; the amenities like the fitness centre and pool (and in person dining) were unavailable.  This has been ongoing for at least 3 months. I suggest the hotel offers some alternative such as a peleton in suite if requested. They've had time to plan.In our room suite we had two Large 4k or 5k HD smart TV's (LG) capable of streaming Netflix and Prime + HDMI connect and cable. Quality was great.Workspace:  a nice glass elegant computer station by the window on the 25th floor overlooking the towers of power in Toronto's financial districtFood:  Unfortunately their food is meat-centric and we were limited to ordering off the menu.  Considering this is a Category 7 hotel on Marriott Bonvoy I’m surprised at this oversight.  We’ve stayed around the world at various Category 7 Bonvoy properties and had much more flexibility to satisfy our healthier living vegan diet as a family. For example at the JW in Istanbul we met the Chef team who created custom culinary creations to our delight that were not only filling but very delicious.   During Covid here in Toronto; in-restaurant dining was ‘off’ the menu but room service was provided.A simple vegan menu would be the least the hotel could do offering breakfast items like beyond meat sausages, tofu scrambles, sautéed vegetables platter with vegan French toast or avocado toast and vegan pancakes for example.  Note that they do offer some non dairy almond milk.We were offered a free breakfast due to our Platinum elite status (Bonvoy) however if we were charged for it; we would have been billed $84 including an 18% room service 'tax' plus hst for potatoes,tea, coffee, oat meal and avocado toast. Very expensive considering the lack of options.Some side notes:Our fireplace in our Corner suite didn't work. Tried both switches, called front desk for instructions and yeah it just didn't work unfortunately.All staff were great however.Review would have been 3 * considering the disappointing food options for us; forcing us to use Uber Eats.Review would have been 5* had they made the effort.",
      "rate": 4.0,
      "tripDate": " February 2021"
    },
    {
      "title": "You MUST stay here",
      "text": "This is the second time we have stayed here, and it defines luxury. From the moment we pulled our car up and entered the hotel, you could see proper protocols and policies in effect against covid. I always look for this during these times and was impressed with the signage, and amenities available to make sure the environment was safe. When we entered our beautiful room, we saw a hand written note from the GM welcoming us back, with a whole covid kit including masks, wipes and hand sanitizer, the bed and pillows were so comfortable, and with the auto room darkening shades we almost slept in the next day! This hotel is impeccable. It was welcoming, friendly, safe, luxurious and perfect. We will be back again for sure!!",
      "rate": 5.0,
      "tripDate": " October 2020"
    },
    {
      "title": "Top notch",
      "text": "My partner and I stayed here for a staycation and to celebrate my birthday in one of the suites. The staff were phenomenal and very thoughtful. They had balloons and chocolates in the room waiting for us when we checked in, which was such a nice touch. They also allowed us a late check-out to work around a visit to the spa. If you need anything, it is easy to reach someone using the Marriott Bonvoy app. The room was spotlessly clean. The suite has a full bathroom with rain shower and a big tub, plus a powder room by the living room area. With the modern design, heated bathroom floors, 2 big screen TV's, Frette linens/robes/slippers, and Sloane teas, everything was as flawless as one would expect from St. Regis. We had their Canadian breakfast ($30) which was filling and delicious. I also had a RMT massage from Loreen at Iridium Spa on the 31st floor, which was excellent. Since the change rooms/pool/sauna/steam room are still closed due to COVID restrictions, massages are 20% off at the moment. Overall, we were so happy with our decision to celebrate here and pamper ourselves. Since we can't travel (yet), this felt like the closest thing to a real getaway. We can't wait to come back when all the amenities are back - e.g. Louis Louis bar on the 31st floor, afternoon tea, pool, steam room. I would highly recommend this St. Regis for some R&R/celebrating a special occasion.",
      "rate": 5.0,
      "tripDate": " June 2021"
    },
    {
      "title": "Good service, otherwise unremarkable",
      "text": "The service was quite good. For instance, the hotel had a rollaway bed and crib ready in our room before we arrived, just as we had requested. In addition, a diaper bin for the baby was provided, which was a nice touch we had not specifically requested. The valet, the concierge and other staff were friendly and helpful. Whatever we asked for they provided promptly. Room service requested for 9:15 was there at 9:15 on the dot. If we asked for our car (through the app) it was there just when we wanted.That said, our room (a 1 bedroom suite), was nothing to write home about. Supposedly we were upgraded to a nicer suite on a higher floor due to my Gold Elite status, but the room's decor was sparse and bland and it seemed a little on the small side for what we were paying. The tv in the bathroom was an oddity. The view from the 27th floor was just of the sides of other nearby skyscrapers, certainly not worth paying extra for and way worse than my old office view when I used to work in downtown Toronto. (to be fair, with so much construction going up in the financial district, I suspect nice views are becoming increasingly scarce no matter how high you are)The rest of the hotel was nice, but again not wowing. The lobby was nondescript. We did enjoy the 31st floor pool, but it was disappointing that there was really no view despite the high level (I was expecting a panorama view of the City from the water, but you can't really see anything out the windows). The restaurant did look quite beautiful, although we did not actually eat there. The food from room service was overpriced for what it was.The bottom line with this hotel is that it's a nice well-run hotel worthy of its 5 star rating, especially with respect of service, but there is little or no pizaz and for the price, you can probably find something a little more opulent. Don't expect much of a view, no matter what floor you stay on. I might return in the future as I like getting the Bonvoy points, but otherwise nothing I would go out of my way to return to.",
      "rate": 4.0,
      "tripDate": " October 2021"
    },
    {
      "title": "Excellent Stay. Busy Hotel",
      "text": "The St. Regis brand always lives up to its luxury reputation. This one is no different. The elegance in the details can be easily spotted in the lobby, room and restaurant serving breakfast.The Hotel is centrally located and is a walking distance to many of Toronto’s attractions.We stayed in a 1 bedroom suite and it was very spacious and nicely decorated. The furniture, however, can do with a facelift. That being said, it is not an issue at all. Sleep quality, in-room dining, cleaning service and concierge were right on spot!We traveled with a one year old daughter, and I can say the Hotel is baby friendly. The furniture, however, in our room can be tricky with all the corners and glass tables. Just need to be careful Finally, this is a very busy Hotel. Being in the downtown area, it is always busy with people going in and out, event happening day and night, and may get loud or congested in the lobby area and the elevators. Just something to keep in mind.",
      "rate": 5.0,
      "tripDate": " July 2019"
    },
    {
      "title": "Disappointing service",
      "text": "Stayed here for two nights prior to a trip elsewhere in Canada. The hotel is modern and rooms are lovely - newly renovated and very large and comfortable. Biggest issue came with breakfast - this was included in my room rate as clearly stated on the Agoda confirmation. The surly lady at the front house of the restaurant insisted it was not and told me to take it up with front desk as ‘the restaurant is separate to the hotel’. Front desk then claimed ‘breakfast is never included’ in their rates and proceeded to try and convince me for 15 minutes that ‘breakfast included’ just means the hotel offers breakfast, not that it’s included for free. Sir, this is a five star hotel, I think it goes without saying that breakfast would be offered! In the end I had to show them the different options on the Agoda site (different prices for breakfast included and not included) to convince them. Ridiculous to try and argue with guests over this when it’s clearly stated in the booking confirmation, making me feel as if I was trying to scam a free breakfast. A further issue came with the spa service. I had tried to book a treatment a week before arriving but there was already very little availability. I managed to book a massage, only for it to be cancelled on the day ‘due to Covid’ and they automatically booked me a manicure instead (which is in no way similar). I would expect that a five star hotel such as St Regis would have back-up plans in place if someone catches Covid or just hire more staff. No apology or compensation was offered for this or the breakfast fiasco, and I’m sorry but 2 years after the pandemic started it’s not good enough to use it as an excuse for poor service or poor performance (which to be fair I’ve seen in multiple hotels not just this one). Overall, I liked the room a lot but the service was not up to the standard expected and next time I will probably pay slightly more and stay in the Four Seasons instead.",
      "rate": 3.0,
      "tripDate": " October 2021"
    },
    {
      "title": "Cancelled next week's booking",
      "text": "Well we love this hotel's friendly personalized service, the rooms (thanks for the upgrades) and incredible service relating to the butler service and all the staff.Location is great too right downtown, walking distance to everything.But we have yet to fully appreciate the property because every time we come there as we are a vegan family of three, we have to have a lengthy conversation ahead of time with the chef/team about our breakfast the next morning (since there Still is no Vegan menu).  It's getting annoying at this point and Monday morning for breakfast we requested a few simple things including vegan pancakes which we were told were not possible hah.  I mean if you can't offer amazing food to all the guests then that's a big fail in my opinion.  We have more business next week and had a booking for Sunday also which i've not moved over to the rival property ending in gri-la' where I know we will be given a five star breakfast feast to start our day.  By the way the restaurant (Louix Louis)'s idea of accomodating us was that we could order from the menu and pay full price for say avocado toast even though it's missing the other cheese and egg non vegan ingredients.  Really appreciate everything else though.  Our 4-yr old son wanted to go swimming but we forgot his floatation arm bands and the butler went out shopping retail for us to get us a lifejacket for him.  AMAZING.Wish you all the best and maybe stay here again in the future but we'll have to bring our own food I guess.",
      "rate": 3.0,
      "tripDate": " November 2021"
    },
    {
      "title": "What were you disappointed about?",
      "text": "St. Regis Toronto, formerly known as the Trump Hotel Toronto, Adelaide Toronto. me and my girlfriend gave this hotel 10 out of 11 and I’ll tell you why. We arrived there around 4pm. I had noticed something immediately. Oh, that’s a tiny lobby. Consider the hotel is located in an expensive area in Toronto. The front desk table is a bit small as well, it only fits 2 people and it’s right in front of a restaurant. Oddly I don’t blame them, I blame Trump Toronto for designing such a small lobby. Let’s talked about the room, I booked a room with 2 double beds with the employee rate which costed me about $210 after tax. Guest what they did? They upgraded to a deluxe corner suite. You’ve gotta be kidding me! The room was fantastic, everything about it was brilliant. Room was very comfortable as well. I’ve got to mention about the butler service, our butler Grant did a magnificent job. Oh, have I told you about the actual price for the room, it’s about 1 grand after tax. As a fellow front desk Associate I’d never give such an expensive upgrade to an employee unless we oversold the room type, but hey that’s very nice of them.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Exceptional Visit",
      "text": "Stayed for three days in the fall. My wife was at a conference and I went along for the trip. All the staff at the St Regis were outstanding. Our experience was amazing from the moment we arrived. My wife’s service dog was welcomed and staff didn’t raise any concerns with him unlike some hotels. Drinks in the lounge were always as good as the atmosphere.  We had one minor issue which the staff took seriously and were proactive in professionally resolving. Overall, the service and atmosphere were the highlights of our visit perhaps best exemplified by Alejandra who always made extra effort to ensure we were comfortable and well looked after. We look forward to returning to the St Regis on our next visit to Toronto.",
      "rate": 5.0,
      "tripDate": " October 2019"
    },
    {
      "title": "One of the best in Toronto",
      "text": "Definitely one of our favorites. Location is great.Always welcomed here with professionalism and a comfortable stay.Thanks to Grant, George, Megan and everyone else we got to know by name and who always recognized us with a smile.The 32nd floor Pool is amazing (indoor) and the change-room there has a nice sauna.  Almost at par with my experiences at Four seasonsEV charging available; thanks for the plug in and top up; via valet parking.Meals:  still no vegan menu although the chef team here is definitely accommodating but you have to make a call and discuss your breakfast options because again; there still is no 'go to' vegan menu that the chef team can simply refer to and make no matter who's on staff.  In our experience with JW's and Four Seasons hotels of the world in our travels where there is vegan menus; I find this surprising that in 2021 there still isn't a menu here for people who don't eat meat/dairy for various reasons and that we have to call in our special requests.Sleep comfort: Bed and room was very good as expected :)*There was a few minor issues:  was a party in the hallway that woke us up late at night about midnight friday and two guys were smoke/vaping in the pool during our booked time from 8-8:45pm friday evening and we were missing one item we ordered for breakfast saturday morning but we didn't mention it because turns out we had enough food for us. Lastly; the mini  fridge in Room 2410 is not very cold and I suggest someone adjusts or replaces it.Staff gave us a stuffed animal for our 4yr old; thanks!Internet worked great; no issuesTV's were large LG's HD/4k at least and with streaming easily configured. Heated marble bathroom floor was nice.Very elegant, elevated experience here overall despite our constructive criticism above.  We will likely stay here again but maybe bring our own food next time.",
      "rate": 4.0,
      "tripDate": " July 2021"
    },
    {
      "title": "OUTSTANDING START TO OUR CANADIAN VACATION",
      "text": "Outstanding hotel in downtown Toronto.   This hotel, the spa, Louix Louis Restaurant, pool, fitness gym with spectacular 31st floor view, rooms, hotel staff, food, everything about St Regis Toronto reeked of Marriott 5-Star exquisite.   We were so pampered by hotel staff, food service and even our room service was outstanding.  Wet bar, towels with slippers left next to our bed each evening, accruements to make your stay so pleasant and memorable.  We thoroughly enjoyed staying at St Regis to begin our 21-day trip thru Canada.   It was truly the best start to a relaxing, memorable, trip.  Thank you St. Regis and staff for your kindness and professionalism in the hospitality industry.   You were all exceptional !",
      "rate": 5.0,
      "tripDate": " August 2023"
    },
    {
      "title": "Superb",
      "text": "St. Regis defines luxury and opulence. We were emailed on precautions before check-in, and thoroughly enjoyed the stay. Bathrooms had warm floor function which was great in this cold weather, king bed was large and comfy, and there are nespresso machine and sloane teas readily available on the snack/kitchen area. Love the convenient temperature and light controls, and staff were courteous and professional. It is too bad that we couldn't check the amenities, but this calls for a second visit.",
      "rate": 5.0,
      "tripDate": " December 2020"
    },
    {
      "title": "Good room, bad check out",
      "text": "The hotel was good and the staff was friendly. However, while checking out the doorman, Martin, recommended that they hotel had a black car to the airport for a flat fee. We took the offer and it turned out to be a regular taxi cab. We were a bit disappointed in the bait and switch and expected better from the hotel.",
      "rate": 3.0,
      "tripDate": " June 2023"
    },
    {
      "title": "35th wedding anniversary!",
      "text": "The St. Regis went above and beyond to make our 35th wedding anniversary stay memorable, comfortable and relaxed.  Thanks to the amazing front desk and butler staff who conspired with me at a distance and prepared a lovely surprise for my hubby when we arrived after a long flight.  Excellent service and beautiful accommodation.",
      "rate": 5.0,
      "tripDate": " September 2021"
    },
    {
      "title": "Excellent hotel",
      "text": "Beautiful hotel. Our room was just fabulous. Very large, very comfortable and really clean. The view over Toronto was wonderful. We had a lovely stay and would recommend it to anyone. The staff on reception were more than helpful, as were the guys who sorted out car parking when we wanted our relative to be able to park for a while.The only downside was the service from the staff in the bar. It took ages for us to get their attention, they were off hand and the food we ordered to ages - and was cold to boot. We ate out after that.That was just one blip in a very lovely stay though.",
      "rate": 4.0,
      "tripDate": " April 2023"
    },
    {
      "title": "I’ll be back!",
      "text": "The whole experience was awesome and all the staff went out of their way to make sure that we were well taken care of.  I have to say that a valet by the name of George quarterbacked the whole thing by seeing my needs and getting the right people involved to make the whole thing seamless. This birthday celebration was one to remember. BRAVO.",
      "rate": 5.0,
      "tripDate": " August 2021"
    },
    {
      "title": "One of the best!",
      "text": "This has to be one of the best hotels I have ever stayed at. We arrived hours after getting married. We were greeted, offered champagne, and assisted to our room. In our room we were delighted to find a beautifully decorated space, clean and a stunning view of Toronto. They even added chocolates on the bed as a little extra! At our hotel booked dinner we were offered wine and a free dessert. Upon return to our room we were brought a bottle of wine as a gift from the hotel. Truly dreamy experience, 10/10 would recommend. Only regret was that we only booked one night!",
      "rate": 5.0,
      "tripDate": " December 2019"
    },
    {
      "title": "1 Star Quality hotel not 5, Stay Elsewhere",
      "text": "Not a 5 star hotel, no 5 star service, including lack of help with luggage, turn down service, and butler service even when paid for. Food also took 3 1/2 hours to be prepared, even when it was raw seafood, and came out dry and uncleaned but still charged over $200 for dirty seafood platters. Young children seated at bar after 11pm, and managers of the hotel very disrespectful and discriminatory. Do not stay here, spend your money somewhere else of value.",
      "rate": 1.0,
      "tripDate": " May 2024"
    },
    {
      "title": "Top notch hotel",
      "text": "My partner and I spent two nights at this amazing hotel. Our room on the 24th floor was beautiful, clean and very well appointed. The bed was extremely comfortable and bathroom spacious. I liked the way the lights were controlled - the light intensity could be adjusted with one touch (morning, evening, night intensity). And what was very important for me, the room was quiet. We had breakfast at Louix Louis restaurant and it was just perfect. We really enjoyed stay at this top notch hotel.",
      "rate": 5.0,
      "tripDate": " December 2019"
    },
    {
      "title": "Fantastic hotel, amazing service and experience every time",
      "text": "It has been at least 4 times I've stayed at the St Regis and every time the experience is impeccable. Staff is extremely attentive, friendly and provide for any requests. For instance, we stayed one weekend for my girlfriend's birthday and they had a bottle of bubbles and macaroons waiting for us in the room. You can request for any missing amenities through the Bonvoy app and have them right away. It is extremely well located within downtown, and all services are great. I would recommend going to the spa at the top floor if you have time, or ordering room service for breakfast as it's excellent. Their restaurant Louix Louis is also pretty cool.",
      "rate": 5.0,
      "tripDate": " May 2022"
    },
    {
      "title": "Classy",
      "text": "After a tough week I booked a spa appointment at Iridium inside the St. Regis and decided to spend the night with our kids.  The hotel has a great central location in downtown.  The property and rooms were very elegant and high tech and had the largest TV I've ever seen in a hotel room.  Room service was delicious.  Every staff member we encountered from valet, front desk, room service etc was so polite and helpful.  We look forward to staying here again.",
      "rate": 5.0,
      "tripDate": " July 2021"
    },
    {
      "title": "The hotel is a mere shadow of its glory days under Trump Management.",
      "text": "Mediocre at best. Tried to have a fun little stayvacation given that we haven’t been able to travel since COVID-19. Waiting for the little one to be vaccinated. We had such fond memories of this place when it was a Trump branded property. While it was never owned by Trump, under their branding agreement they clearly had the staff trained to meet their standards. I am definitely no fan of Trump the man, I have to give credit where credit is due. Under Trump the property was a true 5-star hotel. Little things just make all the difference. A true 5-star hotel isn’t just about the property but the service, the way their treat you and the small amenities. Some things aren’t Marriott’s fault— yes hotels have gotten rid of printed materials and you must scan QR codes etc, but the room just felt sparse and not nearly as luxurious. For $1,200 CAD a night you would expect top notch service.",
      "rate": 3.0,
      "tripDate": " October 2021"
    },
    {
      "title": "A Must!",
      "text": "This hotel was simply amazing. Everything about it from the entrance to the Spa and restaurant Louix Louis on the 31st floor; it was all grand, plush, and extravagant. We went for our anniversary and the staff ensured we felt celebrated. The location couldn't be any more convenient; literally in the center of downtown and walking distance from all of the great restaurants, malls, and shopping areas. Don't walk but RUN to the spa. The spa is outstanding. It is so serene and posh, and the attendants remind you that you're at a 5-star property with the level of service they provide. We didn't want to leave the spa. We had 4 different services throughout our week there. We had a corner suite which again was absolutely fantastic. I was working some and the office area was far away from the bedroom so I didn't disturb my family. We plan on going back very soon!",
      "rate": 5.0,
      "tripDate": " November 2022"
    },
    {
      "title": "Below expectations",
      "text": "We first arrived around 8pm and was set up in a room which was still being cleaned. So they changed us to a new room. Our internet continued to lose connection throughout our 3day stay. We chatted with a few pet and had two people from IT reset the connection but it never took. It was constantly shutting down  and restarting throughout our stay. Finally the fire alarm went off at 7am in the morning which interrupted the only day we could sleep in during this visit. The only thing we received for these issues was how sorry they were for the inconvenience. The prices you pay to stay here u definitely expect top notch service!",
      "rate": 3.0,
      "tripDate": " July 2022"
    },
    {
      "title": "More like the Courtyard Marriot",
      "text": "I stayed for one night for New Year's Eve in a deluxe corner suite (you can image the price tag that came with that) and the experience was very disappointing.The room was not stocked properly - the tea box was nearly empty and missing some coffee pods. The bathroom toiletries were also not stocked properly (nor were the toiletries from a very nice brand either BTW). The powder room bathroom was without a hand towel and the wet bar was missing the garbage can. Not what one would expect from such a supposedly luxury brand hotel.We asked for something to be sent up to our room when we checked in and it never arrived. We called down asking for more toiletries and those never arrived either. Our room was supposed to include some sort of butler service and hot drinks in the morning. When we called to request those we were told it would be an hour! So much for butler service!!The staff themselves were lovely but the entire experience was extremely disappointing considering the quite considerable price tag it came with.Like I said in the title of this review, it certainly felt more like a Marriot Courtyard than a St. Regis.",
      "rate": 1.0,
      "tripDate": " December 2022"
    },
    {
      "title": "Expensive rooms with no view",
      "text": "The staff are friendly, the room was beautiful and well equipped. The problem is the view. All the rooms on their site state “city view” but what you get is a view of an office building directly across the street which blocks all light from entering your room. We stayed here during the weekend so the building was empty. I can’t imagine staying through the week. Wouldn’t come back or recommend",
      "rate": 2.0,
      "tripDate": " April 2022"
    },
    {
      "title": "Extraordinary experience, first class and more than 5 star!!",
      "text": "We have always wanted to try the St. Regis to spoil ourselves a little. We were on return from Jamaica, Westjet cancelled our connecting flight stranding us in Toronto. We were exhausted so we booked the St.Regis downtown. From the time we walked in, we were treated like a King and Queen. George, the bellman was  a true gentleman, not letting us lift a finger let alone a bag! We approached the check in counter and were greeted by Signoree Scully, the front desk manager. She greeted us with a smile and made us feel so special. My wife and I are Marriott members, our level allowing a room upgrade if available. Signoree went above and beyond, getting us set up in a suite with a tasty treat! This truly turned around all of the misfortune we experienced during this trip. Checking out, Pamela looked after everything, smiling every minute. Thank you Signoree, George and Pamela for making this a 5 star experience. Thank you for your kindness. If you are in Toronto, this is where you need to stay here.",
      "rate": 5.0,
      "tripDate": " January 2022"
    },
    {
      "title": "Special Shoutout",
      "text": "We visited Toronto to see the Chicago Blackhawks take on the Toronto Maple Leafs. The St. Regis was a nice hotel. it was conveniently located downtown within walking walking distance to all the sites and Union Station. Considering the St. Regis' staus, it was a bit outdated and was lacking in some ammenities. There were broken USB outlets on the desk and our shower leaked all over the floor. However, it's my understanding the hotel will be undergoing a renovation sometime soon. Much needed! Special shoutout to Bellman Martin. He was exceptional with his service and attention to detail. He gave us great tips for navigating dowtown. Made some recommendations for reataurants, bars, activities etc. He pointed us to the skating rink at City Hall, where we were able to skate for the first time in 30 years. Well done Martin, keep up the good work.",
      "rate": 4.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Terrific Hotel with Outstanding Service",
      "text": "I recently stayed at the St Regis on business, and found it to have among the best service I’ve experienced at a hotel.  I arrived bleary eyed from a red eye flight to Toronto, and I was incredibly grateful that the check in staff was able to accommodate an early check in.  The room was immaculate and extremely quiet.  Service each day was cheerful and helpful throughout my interactions with the team.  One example:  one evening I asked about getting my shoes shined, and they were picked up and returned within 15 minutes.  The one improvement opportunity I noted was the hotel restaurant appears to wake up at a more leisurely pace than their posted 7am opening time suggests.  But, the food and service is terrific.  Overall, I give the St Regis my highest rating and would happily return for another stay.",
      "rate": 5.0,
      "tripDate": " October 2023"
    },
    {
      "title": "Good quality hotel, still some areas for improvement",
      "text": "Very convenient location of the hotel, which is however linked to the noise from streets around the hotel. Large and nice rooms/suites with large bathroom. The hotel management surprisingly allows guests to organize a birthday party in the hotel room with all the noise related to such an event (loud music, screaming etc). However, the receptionist efforts must be appreciated to solve the situation. This should however be done in advance to prevent this to happen. Nice restaurant to have a breakfast. However in case of a complaint about the quality of the food some compensation would be expected. Very efficient check-in/out, high quality of the housekeeping service, however disappointing that the broken electric can was not replaced despite the hotel staff was notified or that the electricity light was not repaired in the bathroom. Still would recommend this hotel, especially for a shorter stay.",
      "rate": 4.0,
      "tripDate": " August 2023"
    },
    {
      "title": "Easily one of best hotels in Toronto",
      "text": "Great hotel, 3rd time staying here and no change in great service and top standard.Pool is stunning with views Gym is great with outstanding views and in the snowfall was something unique Location of hotel is perfect, unfortunately at the time of our stay there was a curfew so a lot of bars and restaurants nearby were closed early or were still permanently shut.Only negatives the restaurant in the hotel Louix Louis wasn’t a very welcoming environment, nothing the hotel did nothing wrong but the clientele there just be warned dress to impress(no matter what time of the day) and be prepared to be surrounded by people with very high  opinion of themselves even though most aren’t even staying in the hotel and most likely saving all month to afford the cost of a meal there, just to post on social media.Also the entrance of hotel is taken a little away by it sharing its entrance with the residents sharing the building. So always felt like some staff greeting you were there to look after us and the other half were there for the fulltime residents.Also the champagne toast in the evenings was a lovely touchLove Toronto and Love the St Regis Hotel (or even when I stayed there when it was the Trump hotel and Adelaide hotel) always great",
      "rate": 4.0,
      "tripDate": " January 2022"
    },
    {
      "title": "We L♥️VE2x it!!!",
      "text": "5⭐️⭐️⭐️⭐️⭐️ all the way. The service, the food & high tea are all great. I will definitely come back here again. The room is spacious, high tech & bathroom are heated marble floors( there’s a TV in a washroom if you want to catch the weather or news for when you get ready in the morning, we used the TV for that). The breakfast was superb & they also didn’t charge us for the breakfast of our little one, which is a plus. We have service butler 24 hours, clothes for ironing is free & restaurant of the hotel was well decorated & the food was really good. I will stay here again for sure. We love it here, we don’t even want to leave, we exhaust our stay up to the last second ( we checked out 4pm) I’m a Bonvoy platinum elite member, so I can actually do that ( it’s a privilege for platinum elite & up).  We will stay here again.",
      "rate": 5.0,
      "tripDate": " February 2023"
    },
    {
      "title": "Excellent Spa and generally very good hotel",
      "text": "The hotel is generally very good with many luxury touches as would be expected of a hotel of this type. Rooms The rooms are large and well appointed. The beds are very comfortable with ultra luxury bed sheets. The bathrooms are large and have everything you need. You will struggle to find a better room in Toronto! The SpaI have little more to say than everything about the spa was excellent. From the start to finish, not even one suggestion as to how to make it better!The Service The staff were generally very friendly and couldn’t do enough to help. We used the in room butler service a couple of times and they acted quickly to get us what we needed. The Gym and Pool For a hotel, the gym is really well appointed and the pool is huge for a city centre location. The IssuesWe had two issues while staying at the hotel which were as follows:1) I ordered room service which took over an hour to come. This is after them specifically mention on the phone when I ordered it that it would be 35 minutes. The server apologised when he brought it and was nothing but professional, however  in a hotel of this type I don’t think over an hour is a reasonable wait time. 2) On our second to last day, despite having the please make up the room button on, no one came. I had a courtesy call from guest services that evening and when I mentioned it they sent someone straight away. However, again, if you’re paying this kind of money for a hotel they should have systems in place to ensure all the rooms are made up. Food The hotel has two restaurants. The breakfast is ordered off a menu, rather than a buffet which suits me but I appreciate others are different. The quality of food was good and the pricing was reasonable for a hotel.They don’t serve proper food outside of normal eating hours though, I.e. not between around 2-6 in the afternoon. Conclusion To conclude, the hotel was generally excellent with one of the best spas I have been to. I would definitely return if I was visiting Toronto again.",
      "rate": 5.0,
      "tripDate": " August 2023"
    },
    {
      "title": "Awful experience",
      "text": "Paid 800 dollars for a one night girls weekend getaway for our 40th bdays.  We walked into the room and it was freezing - the thermostat was literally pulled out of the wall -was missing. One of the taps for the sinks didnt even work. The room was for 3 girls and there was only 2 of everything ready for us. For heating they called a service person to come but he couldn't do anything because thermostat was missing. No one ever followed up. In the evening when we called to complain again they said they would give us another room - but we were getting late for dinner. They just brought up a portable heater for us.  View was horrible. When I pay 800 dollars for one night the least I can expect is working heat and running water faucet.",
      "rate": 2.0,
      "tripDate": " April 2022"
    },
    {
      "title": "Great getaway",
      "text": "My husband and I have had the pleasure of staying here twice during Covid - once to celebrate our anniversary, and once to unwind after a hard week.  We have been incredibly impressed with the precautions taken by the hotel, and with the service received at the same time.  They have really found a way to balance an incredible experience with very strong safety precautions.  We also really enjoyed the ability to enjoy a fine dining experience in the comfort and safety of our suite - you really can't do better than 5 star dining but dressed in PJs :) We have been helped by Jonathan T during both of our stays and were completely impressed with attention to detail.  We are not VIPs by any stretch, but we certainly felt like the most important guests at the hotel during our stays. Thanks for these wonderful escapes, we hope to be back soon!",
      "rate": 5.0,
      "tripDate": " February 2021"
    },
    {
      "title": "Most amazing experience of a 5 star hotel here in Toronto!",
      "text": "Most amazing experience of a 5 star hotel here in Toronto. The staff we encountered and engaged with was amazingly friendly, attentive to our needs throughout our stay.A special mention is well deserved with Andrew at the front office, the concierge’s Xavier and Monika who made us feel welcome at home during and even after our stay as we had a package which had arrived after our stay (plus other requests).  Their attention of detail is amazing and unparalleled among a lot of hotels here in Canada. It’s also noted that this property has two Clefs d'Or on staff.",
      "rate": 5.0,
      "tripDate": " March 2022"
    },
    {
      "title": "Not quite up to standards",
      "text": "This is the 4th St Regis we’ve stayed at. Room: my husband booked a corner suite, beautiful room, nice city view with partial sea view, nothing to complain about. Food: good selection of breakfast, as bonvoy titanium members, you get a 60 CAD credit per day, which is enough if you want a continental style breakfast, however, it’ll barely cover any decent breakfast items on the menu. For what it is, I would say they charge a premium. Service: at breakfast, we find some servers were not quite well trained, missing cutleries, missing orders (green juice in our instance), and delivered wrong orders. One server in particular was behaving a bit interesting, he would attend to me and engage in small conversations, however, he would be rather dismissive to my husband. This hotel location for some reason has no designated butler assigned to you like other properties, also, the tea / coffee service is limited to 7:30-9:30am every morning, if you don’t order it during that time, you will miss out for the day, which again differs from other locations. I only found out about this when I called reception and asked, so if I didn’t call, I would’ve missed out on it everyday for the 7 days that I stayed. During the same conversation, I asked how much a pot of camomile tea is if I just want to order it before bed time (how I usually like it and how I have it at other St Regis), she said she will check and get back to me, never did. On another occasion, my husband requested for some ice via the bonvoy app, the team acknowledged it right away, half an hour later, still no ice, we called to follow up, and they showed up 6.5 minutes later. On the day before check out, the butler team finally called of their own accord, to check on us and see what they can provide, and then they offered us tea service, one day prior to us checking out, rather than on the day of arrival. Pro: we had consistently good service from valet. Gentlemen there were courteous, always had a smile on, greeted us in and out, and helped us with our bags. Overall, it’s a good property with good location, good infrastructure, and good valet service. However, the aforementioned areas were lackluster, and would definitely require improvement. I’ve stayed at 3 other St Regis at other locations, and sadly this location is currently sitting at the bottom of our list.",
      "rate": 4.0,
      "tripDate": " September 2023"
    },
    {
      "title": "Disappointment",
      "text": "I payed for a room with city view, the advertisement has a room with a beautiful view of the city, but, instead, they put me in a room with a terrible view of a really nearby office building, which is the only thing that I am allowed to see when looking outside from the window of my room. The shower has 2 douches, one at the celling and one at the wall, when using one of then the other one starts leaking a very cold water at the person that is using the shower, and, besides that, when using the shower, the door from the bathroom box doesn't closes properly, which causes the whole bathroom floor to be completely wet when we go outside. And, when we tried  talking to the guests services they didn't solve our problem, they instead tried to charge us a big amount to be moved to a new room, I am extremely disappointed with the St Regis hotel, this clearly makes this place to be far from being a five stars hotel.",
      "rate": 1.0,
      "tripDate": " January 2022"
    },
    {
      "title": "Stunning hotel in a great location",
      "text": "Lovely hotel in a great location to explore Toronto.I stay at this hotel for 6 nights with my sister and we thoroughly enjoyed our stay. From the Front Desk to the maids and doorman everyone member of staff we encountered was welcoming and very friendly. We stayed in a suite which was stunning!  The bed was extremely comfortable and the maid service was impeccable! If you are in Toronto this is where you need to stay!",
      "rate": 5.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Luxurious stay in a St. Regis suite",
      "text": "We were fortunate to stay in a suite with separate living room, wet bar, and a second toilet room.  Our son's rollaway bed was in the living room, giving us extra space from the bedroom.   One drawback, tho, was that we had to request the rollaway three times until we got it.  It was in our original reservation and we asked again at check-in.  It was not there and there was some doubt we'd get one upon the third inquiry, as they were in high demand.  However, the hotel came through with one starting with our second night.  The room was tastefully decorated with quality materials and was quite comfortable.  We enjoyed breakfasts in Louis Louis on the 31st floor.  Near the end of our five night stay, the Rogers widespread Internet outage struck, which affected our wi-fi access in the room and prevented the front desk from issuing our final billing until awhile after we had checked out.  The location of the hotel was excellent - walkable to tourist sites and stores on Yonge St both.  We recommend the St. Regis for a comfortable stay.",
      "rate": 5.0,
      "tripDate": " July 2022"
    }
  ]
}