{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "The York Boutique Suites",
    "url": "/Hotel_Review-g155019-d17605394-Reviews-The_York_Boutique_Suites-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "1.5",
      "reviewCount": 9
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "14 York St",
      "addressLocality": "Toronto",
      "postalCode": "M5J 0B1",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/18/21/7f/43/the-york-boutique-suites.jpg?w=500&h=400&s=1"
  },
  "description": null,
  "featues": [],
  "reviews": [
    {
      "title": "Definitely not recommending this one",
      "text": "We had booked this before the  krona pandemic started for our trip in September. 2020. We kept hoping the situation would clear up until then but unfortunately not and our travel agency cancelled our trip and we cannot travel to Canada. We ha dot cancel this accommodation as well. It had o be paid in full when we booked it and we asked for a refund as we actually cannot get to Canada. They did not respond to any emails. When asking for help from the site we booked at they finally advised hey will not give any refund or a voucher that could be used should we hopefully next year can do this trip we still want to do. This is the only accommodation we had to cancel that was so utterly unwilling.",
      "rate": 1.0,
      "tripDate": " July 2020"
    },
    {
      "title": "Do not stay here",
      "text": "We also booked a  weekend here and then when everything was shut down they gave us the total runaround about cancelling.  We tried to cancel more than 6 weeks in advance and still nothing.  They have never returned our phone calls and emails.  They kept saying that there is NOTHING they could do for us.  Standard hotel cancellations are like 48 hours out ...   And to boot they kept sending up bulk emails to find out when we were checking in .... total garbage...   never support businesses like this.  my 2 cents",
      "rate": 1.0,
      "tripDate": " April 2020"
    },
    {
      "title": "No Refunds",
      "text": "I booked this through Booking.com and due to covid19 our event was cancelled. Called for a refund and a rude girl said no refunds because there was no cancellation on my booking. Can’t get ahold of Booking.com either.",
      "rate": 1.0,
      "tripDate": " March 2020"
    },
    {
      "title": "Sens du service lamentable",
      "text": "Vols annulés pour cause de pandémie. Touristes interdis sur le sol Canadien.L’établissement refuse ne serait-ce qu'un simple petit geste commercial pour l'annulation de la réservation. Au final 1000€ net de perdu... Réponse abscons, sans aucune considération client. Surtout ne réservez pas dans cet établissement !!",
      "rate": 1.0,
      "tripDate": " June 2020"
    },
    {
      "title": "Awful customer service, unscrupulous management",
      "text": "Awful experience with this hotel. We booked before the covid-19 pandemic kicked in. When we could no longer travel to Canada, we proceeded to cancel all our travel plans, a total of 4 x hotels. Every other hotel was sympathetic to our situation. This is the only hotel that refused to refund any of our stay, not even a small gesture i.e. 50% of our stay. When speaking with their customer service team they proceeded to tell me their cancellation policy has not changed despite the challenging times and when I asked if they thought that was fair on travellers unable to visit their country, the guy literally ignored me, complete silence. I would not recommend this hotel at all, run by unscrupulous individuals who have no care for their guests.",
      "rate": 1.0,
      "tripDate": " March 2020"
    },
    {
      "title": "Do not stay here!",
      "text": "Stayed here in Nov 2019 as a solo business traveller (hotels were full). Was met on arrival by young man in cap who insisted I pay $500 security deposit for 1x night’s stay - which was not advertised in advanced. Stay was okay. However about a week later I happened to be reading my bank balance and saw $80 deduction. When I questioned the charge (after chasing them!) they sent me a photo as ‘proof’ of a chip/break in what looked like a rather cheap plant pot - photo attached. I had never seen this before in my life! The management company StayEffortless (ironically named and anything but) were worse than useless in trying to resolve and very unprofessional.Originally booked through Agoda - who credited an $80 (Agoda credit) refund after endless chasing of both them and the management company. Clear there is even less protection for guests than there would be at an Airbnb!I have stayed in various Apts in this building in the past, without any issue. Disingenuous naming (not a hotel) and pricing (low cost but bumped-up fees cleaning and admin) of this property.Boomers beware - don't stay here unless you want a headache and an expensive bill. Lots of good places to stay in Toronto but not here!",
      "rate": 1.0,
      "tripDate": " November 2019"
    },
    {
      "title": "Nightmare Stay",
      "text": "Fire alarm went off twice during 4 night stay.  Had to walk down 35 flights with elderly parents and with kids screaming \"we are going to die !!!\" Resident there says alarm goes off 3 times per week...he has been in building for 4 years.  NO PARKING AVAILABLE...despite advertisement.  No maid service. Had to park 2 blocks away and pay $35 per night.  Security gaurds are teenage boys that are clueless and asked to see my \"fob\" after i opened the door with it..he then proceeded to tell me...\"that is a fake fob\"...I asked him what the heck he was talking about and said \"it needs to have numbers on the back\"...needless to say I walked away at this point.  Checking in was very shady.  I called the number...they asked what I was wearing...and they would meet me in the lobby....(huh?) Guy showed up with bag of keys and informed me there is no parking...that was last contact I had with staff that knew about my stay.  I would NEVER stay here again or recommend it to anyone.  Oh...and there is no pool for \"guest\"...it is only for \"residents\"...and the location is \"top secret\" per boy wonder at the lobby desk.  Absolute NIGHTMARE !!!",
      "rate": 1.0,
      "tripDate": " July 2019"
    },
    {
      "title": "Location location compromise",
      "text": "This reservation put us in the ICE 2 condominiums, a 67 floor high rise condo in the heart of Toronto's entertainment district, in between Scotiabank arena and the CN Tower/Rogers center, with a 5 minute walk to each and 10 minutes to the waterfront, right on top of the PATH.  So the location is superb with easy access to everything.  But the condo itself felt like a failed development with low occupancy, judging by the few cars in the carpark, less than 50% full.  And a large number of residents are short term vacation stays instead of condo owners.  The facilities are in place, with an indoor swimming pool, lots of party rooms/lounges, and a fitness center too small for the size of building it serves.  Check-in was difficult - 4 calls placed to the service center went unanswered, and the guy was late meeting us, resulting in a wait of over 20 minutes outside the door of the building.The unit itself was a disappointment, a 55th floor very compact 1 bedroom condo with a view of the CN Tower and surrounding high rise condos.  It was hotel room sized, but they crammed a kitchen, living and dining area into it; as a result, we were always running into and tripping over furniture.  However, the kitchen was well-equipped with everything you needed for cooking.  TV could only watch Netflix and nothing else, and the windows were dirty, marring the view outside.  Overall, a decent stay and reasonably priced compared to hotel rooms in the area, but a hotel room will give you more space.",
      "rate": 3.0,
      "tripDate": " June 2019"
    },
    {
      "title": "Location, Location Location",
      "text": "L'emplacement était parfait. Vu sur la tour du CN à 10 minutes de la tour, Rogers stadium, aquarium. 5-10 minute du métro, une passe pour une journée coute 13$ et peut etre utilisé pour le métro, bus et tramway.",
      "rate": 5.0,
      "tripDate": " July 2019"
    }
  ]
}