{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "The Westin Harbour Castle, Toronto",
    "url": "/Hotel_Review-g155019-d183090-Reviews-The_Westin_Harbour_Castle_Toronto-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.0",
      "reviewCount": 5541
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "1 Harbour Square",
      "addressLocality": "Toronto",
      "postalCode": "M5J 1A6",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2c/00/fa/4e/exterior-property-building.jpg?w=500&h=-1&s=1"
  },
  "description": "Rest easy at The Westin Harbour Castle, Toronto. Our hotel in Toronto, Ontario, is located near Rogers Centre, Scotiabank Arena, the CN Tower, high-end shopping and delicious restaurants. After a busy day, unwind with our WestinWORKOUT™ Fitness Studio, or enjoy on-site dining at our Harbour Coffee Bar and Marketplace or The Chartroom Bar and Lounge.",
  "featues": [
    "Valet parking",
    "Wifi",
    "Fitness Center with Gym / Workout Room",
    "Pool",
    "Bar / lounge",
    "Table tennis",
    "Pets Allowed ( Dog / Pet Friendly )",
    "Car hire",
    "Paid private parking on-site",
    "Fitness / spa locker rooms",
    "Fitness classes",
    "Sauna",
    "Hot tub",
    "Pool / beach towels",
    "Swimming pool toys",
    "Pool with view",
    "Indoor pool",
    "Heated pool",
    "Shallow end in pool",
    "Coffee shop",
    "Restaurant",
    "Breakfast available",
    "Breakfast buffet",
    "Breakfast in the room",
    "Complimentary Instant Coffee",
    "Complimentary tea",
    "Snack bar",
    "Vending machine",
    "Taxi service",
    "Business Center with Internet Access",
    "Conference facilities",
    "Banquet room",
    "Meeting rooms",
    "24-hour security",
    "Baggage storage",
    "Concierge",
    "Convenience store",
    "Gift shop",
    "Newspaper",
    "Non-smoking hotel",
    "Outdoor furniture",
    "Shared lounge / TV area",
    "Sun deck",
    "Sun loungers / beach chairs",
    "Sun terrace",
    "Sun umbrellas",
    "Doorperson",
    "First aid kit",
    "Umbrella",
    "24-hour front desk",
    "Express check-in / check-out",
    "Dry cleaning",
    "Laundry service",
    "Blackout curtains",
    "Air conditioning",
    "Desk",
    "Housekeeping",
    "Coffee / tea maker",
    "Cable / satellite TV",
    "Sofa bed",
    "Bath / shower",
    "Interconnected rooms available",
    "Room service",
    "Safe",
    "Sofa",
    "Telephone",
    "Wardrobe / closet",
    "Bottled water",
    "Clothes rack",
    "Iron",
    "Private bathrooms",
    "Wake-up service / alarm clock",
    "Refrigerator",
    "Flatscreen TV",
    "On-demand movies",
    "Radio",
    "Complimentary toiletries",
    "Hair dryer",
    "City view",
    "Landmark view",
    "Non-smoking rooms",
    "Suites",
    "Family rooms"
  ],
  "reviews": [
    {
      "title": "Welcoming and helpful ",
      "text": "From check in to check out, the staff were very helpful and accommodating. All the staff I dealt with were very helpful and kind. Kimberly was very helpful at the front desk getting me a room with a view of the lake. Oliver at the front desk was very professional and kind. His help in helping me freeze my ice packs for insulin without hesitation or question was so appreciated. I have traveled to many places and have to explain why I need something so simple and am met with questions or hesitation. His handling of the situation was amazing! Catherine in the Mizzen breakfast cafe made me feel welcome every morning. The nice lady who came to clean my room was also very helpful keeping me hydrated with lots of water which is very important for a traveling diabetic. Overall, what really stood out for me was the staff. The hotel premises, facilities and rooms were great but nothing can compare to the genuine warmth of the staff. As many travelers will tell you, the people working in the hotel make a HUGE difference.  The Westin Harbor Castle staff members were outstanding and really should be commended for making people feel at home especially when we come from so far away. I'm an American living in the Middle East so coming to the freezing cold Canadian winter was really made warm by these great people.Thank you so much for a wonderful stay!",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Excellent Customer Service from Beginning to End!",
      "text": "The Westin Harbourt Castle delivers excellent customer service from beginning to end.  Even prior to staying three night stay in February, the level of service provided was top notch and addressed any specific need or concern that we had in the process.  It is rare when you genuinely feel appreciated by the level of loyalty in the Marriott Bonvoy program, but this place will definitely make sure that you are treated like royalty.  Being a Titanium elite member, I felt that everyone went above and beyond to make sure that our needs were met and our special ocassion was celebrated with details.  During my partner's 43rd birthday, we were able to stay in the Harbour suite.  Around 2,600 sq. ft. suite, the pictures listed on the Westin's webpage barely do any justice to the size and comfort experienced in it.  There are two bedrooms, one with a king size bed and another one with two double beds, each with its own sofa/mini living room.  The heavenly bed is great, the bathroom is quite spacious with a rain shower and separate bathtub.  In addition, there is a conference/dining room table spacious for a big family, with a microwave, fridge, and Nespresso machine.  All of these are complimented with an amazing living room that gives a panoramic view of the Toronto Islands.  Being on the penthouse or 34th floor certainly made our experience more than memorable and will always cherish this experience. We also got to enjoy the fitness facilties, where you can find a spacious heated pool and jacuzzi.  There is also a sauna, steam room in the changing room with other fitness equipment in the floor above the pool area.  I would definitely recommend this place if you want to have some exercise activity, but you will for sure be walking a lot in Downtown Toronto.  Finally, Mizzen restaurant was quite nice with its buffet breakfast, and would highly recommend that you get the breakfast package included in your reservation, since it is around 32 CAD per person.  Three individuals that I would love to recognize for their efforts are Emily Shewfelt, Oliver at the front desk area, and Carol in housekeeping.  These three individuals really made our second stay in Toronto unbelievable and will always be thankftul to them for all they did in this most recent three night stay.  The quality of service provided is at the level of a Ritz-Carlton hotel and it is great to see that you can still find this in a Westin hotel. For a special ocassion or a relaxing wonderful stay, this is a place to consider for a future stay in Toronto!",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Great Location, Questionable Service",
      "text": "Visited Toronto for a weekend away. The location was easily accessible from the Gardiner and perfect for taking walks along the water or catching the Ferry to Toronto Island. Check in was quick and easy. Received a room on the 6th floor. Was surprised to receive an accessible room when it had not been requested. Not a fan of when hotels use these rooms for guests when they don’t require in case someone who does need them could use it. Because it was an accessible room, the bathroom had minimal storage even for a toiletry bag and the shower was a roll in which would cause the floor to flood because the rubber strip wasn’t secured well to the floor.The room was also muggy and set to 24 when arriving which was very warm and not the best relief from a heat wave. The AC was running for 4 hours while I went for dinner and tour around the area and came back to a still hot and muggy room. Called the front desk who sent maintenance up who said this was a bigger issue the whole hotel was facing as they had shut off air conditioning to many floors and was trying to get it running again. Needless to say the first night was very warm and uncomfortable. Requested extra towels which were delivered promptly but stained. Took them back to the front desk and was told they could assure me they were freshly laundered and I shouldn’t be worried about the stains... I’m not sure who enjoys using towels with brown stains on them regardless of being laundered or not. A manager then brought up new towels that were not stained.The bedding also had a whole in it and was stained. Housekeeping clearly needs to pay more attention to the linens they choose to use and actually provide service. No housekeeping ever came to reset the room, refresh towels, or take garbage during the stay. Maybe this has to do with COVID but this also was never communicated. Overall, the hotel has a great location, and could have nice rooms if the service standards existed amongst the staff, but I probably wouldn’t stay here again and choose a different Marriott property as a Marriott Elite member.",
      "rate": 3.0,
      "tripDate": " July 2020"
    },
    {
      "title": "Disappointed stay & never returning",
      "text": "A friend and I decided to take a day off work, visit Centre Island and stay at Westin Harbour Castle.  It was a treat for us to get away and chill.  We left our luggage and went off to the island and came back at 5 pm to check.  We were given room 1840 and it had a lovely view of the lake.  The menu due to COVID  is very basic and I could not eat any of the options. That is okay as we are downtown and lots of eateries around. In the room, the TV remote did not work as the battery was used up. There were only 2 paper cups for tea/coffee and 2 tea bags, 2 coffee packs and ONE bottle of water for 2 people. We were paying $180.00 per night. Talk about being a cheap hotel.   One would think in light of COVID, the basic amenities would be a bit more to avoid calling room service and asking for new amenities and resanitizing over and over. Because adding 2 more paper cups or tea bags or coffee pack is at minimal cost.  We had to call and ask for a new remote that worked,  extra tea and coffee packs on Day 1 of check-in.    We went out and picked up munchies and hoped for a good nights sleep. At 12.30 am, I heard knocking on our door.  I woke up looked through the peep-hole. The neighbour, white female, '40s in a white bathrobe from room  1839 was asking, \"are  you playing music.\" I replied, \" We are in bed sleeping.\"  I call reception and reported the disturbance. The receptionist says, \"Shall I call security.?\" I said, Yes.  We heard a few minutes later, some voices, we think was security. But then 20 mins later this female was knocking on other rooms on the floor asking the same question. I am a light sleeper, so once I awake, it is hard to fall back asleep. I spend the rest of night counting sheep.  I have stayed in many hotels and travelled for work and pleasure internationally. In my experience, most hotels will check the next day and /or apologize for the chaos.  Not a word from Westin.",
      "rate": 2.0,
      "tripDate": " October 2020"
    },
    {
      "title": "Worth every penny!!!!",
      "text": "This is the first review I have ever written. I want to make a note of that as I went out of my way to create an account on trip advisor just to share how amazing my experience was. When we first arrived there was so many people checking in and out it looked as if it was at least 30 people in line; I thought we would be waiting a while to check in. Not only did every employee welcome us and guide us to where we needed to go; we were checked in within 5minutes! My boyfriend and I stayed here for Valentine’s Day as we heard good things about the hotel. One of the employees Nimesh had a bottle of wine and a fruit and cheese board waiting in our room when we got there. He also had the most amazing steak and salmon meals sent to our room later for dinner, and I have to say the steak is better than the keg and Ruth’s Chris combined; we were shocked. Later we went swimming and hung out In the hot tub it was incredible how there was something for everyone; toys in the pool for all the children, music playing on one end and spaces with lounge chairs for people who just wanted to have some quiet time and relax. Our valet Hailu went out of his way to contact us before his shift was over. He asked if we would need our vehicle ready out front in the next hour so that he can pass along the message to the next valet starting. In the morning we had the breakfast buffet and I know this may sound dramatic but I’m picky with my omelette and the omelette I had was made fresh Infront of me was the best I’ve ever had. have never taken note of the names of any employees at any other hotel but the customer service was so exceptional it is hard not to remember their names. Every single employee made us feel like we have been going there for years we felt so comfortable and will definitely be returning. Weather you are a couple wanting to have a mini getaway, travelling for business or with children of all ages, the Weston Harbour castle hotel (Toronto) is worth every penny and I would highly recommend it!",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "This is an Average Westin, with and Average Restaurant",
      "text": "Pros: Good location for tourists, close to the lake and harbour front, lots of amenities, comfortable beds, clean roomsCons: main restaurant is average at best, average service, decor in rooms is becoming a little aged and worn I've stayed at the Westin Harbour Castle twice in the last month. It's an average Westin with good sized rooms and comfortable beds as you would expect. The hotel has a large lobby, with lots of amenities.The location of the hotel is excellent for a tourist if you want to explore the lakefront, and stadiums with quite a lot within walking distance. However, if you're at the hotel on business there are better options closer to the business district and closer to the better restaurants. What was disappointing was the quality and service experienced in the restaurant in the main level. We arrived late and didn't want to have to travel for dinner. But the menu selection was very poor, and the service indifferent.The hotel is fine; I stayed here twice. But its not outstanding or memorable and I will search for better options in Toronto",
      "rate": 3.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Disappointing Stay - Dated and Dirty",
      "text": "I have stayed in this hotel many times in the past. The last few have been disappointing. There is nothing exceptionally bad about the hotel. There are just SEVERAL better options available in the area. The rooms are very dated. This is an older hotel and the rooms have a funky smell. We had to request a new room because the first one smelled like stale cigarettes. The front desk sent someone up with new keys for our new room and the smell of fabreeze in the new room was so evident that he had clearly gone to the room and sprayed it moments before we were brought over to the new room. Moments after we had moved into our new room, another couple walked into our room. Apparently, front desk had checked them into our room accidentally and we were called by the front desk and told that we would be required to move rooms again.The location of the hotel is great if you want to be down close to the water, but there needs to be a significant refresh done to the interior before I would ever consider staying at this hotel again in the future.",
      "rate": 2.0,
      "tripDate": " April 2022"
    },
    {
      "title": "Felt like a steal",
      "text": "This is one of those places that I feel like Americans are really gaining with the weak Canadian dollar. For our family of four, it was like $125 US for the night (we did the nonrefundable rate). I'm not sure there's any other major cities on Earth where you could stay for so cheap for a night. What is nice is that the hotel feels the opposite of cheap. My 9YO daughter kept asking if it was a five star because it was nicer than so many of the hotels she had been to and we go to a mix of hotels. Five star is a stretch but it is very, very nice. If you have kids, the pool is outstanding. I'm finding that those are strengths of Westins- really nice pools. We spent a lot of time in there. It is large and overlooks the lake. Just a great place to spend some time, particularly with kids. If you're going to a Raptors game, it is exceptionally close. Breakfast is so expensive but then oddly cheap because the kids are so cheap. Ours was very much a family trip. We spent our time swimming and then went to the Ontario Science Centre. I would definitely go back and I cannot believe what a great deal this is.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "The best!",
      "text": "Stayed for 3 nights to kick off our Canada East to West tour and we couldn't have picked a better place to start. Reception staff all very friendly and efficient. Our room (1919) was a corner suite which meant it was quite large and had a fantastic view overlooking the lake. Safe, fridge, Iron & ironing board, hairdryer plus a couple of handy charger pods each with 2 sockets and USB's. Bathroom was quite small in comparison to the room but there there was plenty of toiletries even mouthwash which were replenished daily. Plenty of options at Breakfast in a large Breakfast room and efficient staff, they couldn't do enough for us. (We later discovered that this was our best breakfasts on our entire tour)Didn't eat or drink in the hotel (Other than Breakfast) as it looked a little pricey but there are plenty of bars and restaurants nearby.",
      "rate": 5.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Worst Marriott Property I've ever stayed at, unhygienic and irresponsible",
      "text": "Do not let the pictures deceive you, this hotel is by far one of the worst Marriott properties I have stayed in.I was very disappointed with my stay at this hotel as I encountered numerous hygienic, cleaning and staff issues. This was our first visit to Toronto as part of an early birthday trip and we are now completely exhausted at our poor experience at this property. Starting from night 1, the hotel room had numerous blood and other stains on the bedding particularly the comforter. The desk, cabinet and furniture tops were not adequately cleaned as there were many fingerprints and dust all over them. When I first requested the comforter to be replaced, the staff only brought bed sheets which were also stained. After I asked for the comforter to be replaced, the staff unapologetically brought a duvet cover and asked us to remove the cover on the existing comforter to replace it ourselves. We did not want to touch the comforter or the filling so we slept with the few bed sheets that were clean and had a restless night. After we brought up the concerns from night 1 to the staff, the management team was able to move us into the Chairman Suite. We waited a few hours for the previous guest there to check out and for \"thorough cleaning\" to be done. When we entered the suite, it was in terrible condition. There were leftover noodle scraps on the carpet floor, more blood stains on the bedding, hair and various other dust particles in the bathroom sinks and on the floors. It took almost 2 hours for the housekeeping manager to come clean the room herself and our plans for that day were interrupted by the room change and me running around trying to get staff to clean our new room. That evening in the \"chairman suite\", we also noticed a strong cigarette stench coming from the A/C vents towards the entrance of the room. We are sensitive to second hand smoke so we woke up with sore throats. We brought this up with management numerous times but nothing was done. Most of my stay was spent back and forth trying to correct basic issues that the hotel failed to meet in the first place. When asked for a full refund, I was only given 35,000 Bonvoy points for my time which they believed was sufficient enough to cover days of no good sleep, time wasted and unsanitary conditions. Marriott customer service keeps telling me the cliche statement of \"this does not reflect our standards\" but this hotel is a reflection of how the quality of customer service is going downhill. Please rethink your choice before you stay at this property.",
      "rate": 1.0,
      "tripDate": " July 2022"
    },
    {
      "title": "a fine hotel on the waterfront",
      "text": "We were warmly greeted by staff and our reservation was adjusted once they knew it was our anniversary to offer us a \"room with a view\"  on the 11th  floor facing the harbour and thus, the lake.  It was clean and neat - very clear COVID procedures.  Unfortunaltely the pleasant looking lounge, restaurant and coffee areas were closed due to the pandemic.  At the same time, parking and wi-fi were free - a valuable asset.",
      "rate": 4.0,
      "tripDate": " October 2020"
    },
    {
      "title": "Great Return Trip to Toronto",
      "text": "It has been several years since I have been in Toronto, but it was so nice to bring my wife and daughter to my city where I was born.  After researching the hotels in the city we were so happy to have found the Westin Harbour Castle.  Such a great location on the water and we were able to walk to different restaurants, museums, and the CN Tower.  The ferry and water taxis are located right outside of the hotel and loved spending a day at Centre Island.  We found a great room with a balcony overlooking the lake and sunset. Although these rooms were located on the 5th and 6th floors we very much enjoyed having coffee and drinks outside each day.  There is a nice pool with a deck, good lounge for dinner, and restaurant for breakfast.  Was able to valet our car and even picked it up at 5 a.m. for our return drive to the U.S.  Special thanks to the Westin professionals who ensured our wonderful vacation.",
      "rate": 4.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Just as good as I remember it",
      "text": "This was our first stay back at the harbour castle in a few years and it was just as good as I remember it. I read some of the reviews before our arrival, so perhaps my rating is skewed because I came into our holiday knowing what to expect. Yes the restaurants are not open as frequently as they once were, but we were able to order room service (which is truly front desk pick up). Our food was delicious and ready quicker than the online ordering system indicated. Staff at the front desk called us to let us know that it was ready. Yes you may have to call front desk for added amenities during your stay (yes we had to call down for toilet paper)  but our needs were always met with friendliness and in a timely manner. This is travelling in a post Covid (during ongoing Covid) world. So you CANNOT expect everything to be the way it was before all this happened. During our check in the gentleman who gave me my keys made it very clear to just dial 0 if I needed anything and they would take care of it. And dial 0 I did, and they DID happily take care of every need we had. The views of the lake from the rooms cannot be beat! Our room was clean and we’ll appointed. Huge selling feature for our family was the ability to connect our Netflix and prime video accounts to watch movies together while enjoying our room service. The pool was fantastic, capacity limits followed, and we were always able to gain swim time in the pool. Yes the parking is all self parking now, again this is completely to be expected during Covid. My husband parked our family van easily and he did not find it an issue to walk down the ramps to enter the hotel. But if this is something that concerns you I do believe there is also an off site parking option that front desk will assist you with. We enjoyed our stay very much and even added a couple of extra nights because the kids were having so much fun!",
      "rate": 5.0,
      "tripDate": " August 2021"
    },
    {
      "title": "Dirty & Dated",
      "text": "The room was really not up to any kind of standard for cleanliness. We understand that it is trying times during Covid but they have completely let this place go. The room had a couple food stains through out it and the windows (outside) were so dirty you would think they were frosted. The room that the ice machine was in is straight out of a horror movie. Dirty sink, rusted pipes, old linens and a broken microwave. The staff were all very helpful and tentative and the lobby is gorgeous. It's location is also very handy. Had we paid the Pre-covid prices we would have been asking for a refund.",
      "rate": 2.0,
      "tripDate": " June 2021"
    },
    {
      "title": "I will be coming back 100%",
      "text": "The property itself is located at the Harbourfront area of Toronto and it's a beautiful location. The staff are very quick to address needs of the visitors and the hotel itself is very clean. The room is a great size with a seating area. We had a terrace room and the terrace view was of Lake Ontario and a bit of the Harbourfront area. Definitely coming back when I need some time away from home to relax and ease my mind!",
      "rate": 5.0,
      "tripDate": " October 2020"
    },
    {
      "title": "Very very bad experience",
      "text": "I booked 5 rooms, the service was awfull, the hotel is dirty, stains in the carpets, the elevators did not work, so the lines were eternal. They did,t tell us theat we have to request our room to de made, so when we arrived the room was not made, the towels were still wet.Next day we requested for the room to be made, we arrived in the afternoon and the bed was made, but it was dirty, they did not cleaned the nighstands and the bathroom, just changed the towels as we wouldnt notice it was poorly done.One of us got intoxicated with the food.Awfull one of the worst hotels ever. Dont recomend it to anyone.",
      "rate": 1.0,
      "tripDate": " June 2022"
    },
    {
      "title": "2 star hotel for five star price",
      "text": "This stay was seven nights and for a conference.The three issues I had were with regard to housekeeping and the level of cleanliness and the promptness (or more so lack of promptness to room issues I had),On arrival to my room (late Friday evening) I unfortunately had my bags delayed and so had minimal toiletries, so I thought that's fine I shall use the mouth wash provided to find it was opened and half used by a previous guest!! So I called and asked for a replacement and dental kit to aid my lack of delayed luggage, this took almost an hour to arrive and two further calls to followup on it.Second issue with room cleanliness was the attention to detail, no sheet changes just a making of the bed (it only does once during my seven nights) and garbage not taken on day number four and on day number five the room was not even cleaned, it seemed they just forgot. When I called to housekeeping I was told I could have a change of towels, but after insisting that no I wanted the room cleaned it was promptly done. This shouldn't have been something that happened, and no I didn't leave the do not disturb sign out accidentally.Third issue the key lock wouldn't open on evening number five, I went to reception, new keys given, no success returned to reception, another new set of keys, no success returned a third time and was advised engineering would look at the issue and to sit and wait in the foyer, after 30mintues I re approached the reception area and again went through the whole story (now the fourth person on the reception desk to assist) and was advised needed security, who then broke into my room and then had to reconfigure the door lock. This took almost an hour.My delayed luggage was delivered and for the delivery to the room I was charged a package handling fee of $16.95, with no explanation of why. Overall as a Marriot member this hotels service and cleaning was substandard and for $500p/n not what I was expecting. Everyone when approached was friendly however the room locked and housekeeping issues when raised almost seemed as though I was an inconvenience for asking for help?I wouldn't stay at this hotel again due to these issues, some of which were only evident due to the length of stay",
      "rate": 2.0,
      "tripDate": " May 2024"
    },
    {
      "title": "Great place & location for a Toronto stay & get-away",
      "text": "The upside: Greeted by very helpful Parking/Doorman. Checked in by the superb Oliver, Front Desk staff member.  Oliver was efficient, polite, and more importantly very warm, helpful, friendly and very welcoming: great start to our stay!  Next day when our son arrived to visit, Oliver too greeted and assisted him at the Front Desk, so much so that our son was moved to superlative descriptions of Oliver. Our room had a wonderful overview of the lake: exactly what we were looking for! COVID issues: separation, sanitization all handled with professionalism and efficiency.  We just had to be confident with the sparkling cleanliness of everything and all staff. The location is so convenient to the downtown sports, entertainment and financial areas.  The continental breakfast was surprisingly good, especially so given he COVID-restrictions having to be observed.Other: One bedside table had no lamp and no electric.  No switches above bed for turning room lights on/off.  No problems really arose, just observations as to what would have improved the comfort of the room.  Parking is being re-done and the construction is obvious but other than a distraction presented NO problems at all: the staff knew exactly how to handle it.",
      "rate": 5.0,
      "tripDate": " March 2021"
    },
    {
      "title": "Big pleasant hotel in good location",
      "text": "The hotel honoured our request and gave us adjoining rooms which were clean and tidy. We weren't prepared to pay double for lake views so we got the tennis court instead- not bad. Breakfast was 20$ for \"grab and go\" which seems excessive so we went out to Eggspectation instead which was great. Very good air conditioning on a hot day. Very big pool by hotel standards which was clean and pleasant. Tennis court half up the tower which would be a challenge, as well as a basketball hoop, seats and a herb garden with bee hives which gave it a bit of character too. We wanted to have a drink in the bar but found that there were so many weddings and conferences that we couldn't get in which was disappointing as we never saw the lake from the hotel  But overall good experience due to its good location right on the waterfront  and 10 mins walk from Union Station.",
      "rate": 4.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Overwhelmed,understaffed,  overpriced, and checkin time apparently merely aspirational",
      "text": "Chaotic and delayed check in, pumped in overly loud lounge music, no quiet spaces except minimal and tiny non private business center, pricy room not ready until 70 minutes late after check in time. Misleading promises about when room would be ready. Housekeeping apparently unable to keep up with a full hotel. They were \"in a meeting\" at 3pm check in time amd thus unavailable to even state when room might be ready. Not a good value. But spa well kept with excellent sauna and steam room and fully adequate exercise gym and pool. We rented a room with a view and while nice to have the view one result was a delayed check in as they obviously are having staffing problems. I needed to change and shower for business meeting and was urged to go to the gym since the room wasn't ready. A more appropriate solution would have been to loan us a room until ours was ready but they weren't about to do that. The common spaces lack any quiet sitting area. Management should consider turning down the continuously pumped in lounge music throughout the common spaces or at least turning the volume down. After several hours of waiting for the room, we found it maddeningly distracting preventing us from being able to think straight. Five stars for the spa, one star for unacceptable check in experience, lack of quiet space, and delay in giving us the room. They gave us $50 off the price due to their delay - that amounted to about 3 percent of the total price of our three night stay. Less than we spent in the lounge restaurant waiting.",
      "rate": 3.0,
      "tripDate": " April 2023"
    },
    {
      "title": "Disappointing Return Visit",
      "text": "We were going to Toronto to visit family. We were happy to have the opportunity to stay at this hotel again. Our previous stay was a wonderful experience . When we arrived at the hotel we were greeted warmly at check-in.It soon became apparent that Covid 19 had had its effect in major and minor ways.The lobby wqs dead !Nobody was there except security and the occasional guest. All restaurants were closed. Only the coffee bar was open briefly on Saturday and Sunday. This was disappointing bt understandable due to health concerns.Our room was in the older tower. There was a partial lake view but nothng like the tower facing the lake. We accepted that we hadn't requested a lakeview room  (just had hoped for one since they were not busy). The room was a good size but teh furnishings and the rest of decor was tired and slightly dingy looking. The thing  that really soured the visit was that our room was never cleaned, our bed was never made, and our towels were never changed the entire time we were there (3 nights).We were out every morning  by 10 am and did not return untill after 9pm. Surely, that should have provided sufficient time for someone to clean our room!I still rated the hotel at a 4 because I understand that these are difficult times. But I was extremely disappointd with this cleaning issue. I consider this to be an essential service, especially during a worlwide pandemic",
      "rate": 4.0,
      "tripDate": " September 2020"
    },
    {
      "title": "GRANDCHILDREN WEEKEND",
      "text": "The Harbour Castle is an upscale hotel on the Lake. It has a beautiful indoor pool, steam rooms and saunas. The room itself was lovely however the view overlooking the lake was impeded by filthy windows so that you couldn't even take a picture. Bottles of water and coffee are free and the beds were very comfortable.  There didn't seem to be a restaurant open for dinner as the revolving rooftop restaurant is closed. My only other complaint was that there was no info in the room regarding room service, where the pool was located, nearby restaurant etc.Nice touch was the little gift box they gave mother's for Mother's Day with a cupcake inside. I recommend that you join the Marriott to get specials such as free parking (normally $35)",
      "rate": 4.0,
      "tripDate": " May 2022"
    },
    {
      "title": "A disappointing Stay",
      "text": "I stayed here for  three nights since I was attending a convention.I was very disappointed with this hotel. I always loved staying at Westin every where I went and was never disappointed.First of all, the bed sheets were very stiff and rough, was not able to sleep on them. The duvet cover was filthy and looked like no one has changed it. The house keeping is absolutely a joke. I have requested a house keeping serivce to my room, no one bothered to show up. And when I called to inquire why they referred me to speak to the manger who never answered the phone. So I had to stay in dirty room for three days. I  asked if I can get a wine glass to my room, they want to charge a 2 dollars  plus tax to bring an empty wine glass to the room not to add on that there was no wine opener in the room either.The bathroom had no bath robe or a slipper. The hair dryer was not functioning either.I was so beyond disappointed for such poor serivce from this  Westin. There was no point to even call and complain.I will never return to this hotel ever again.",
      "rate": 2.0,
      "tripDate": " May 2022"
    },
    {
      "title": "Enjoyable City Property on the Water",
      "text": "I stayed here for a week on a solo trip. Overall, the property is very nice. The common areas, including lobby and elevators are very clean. The lobby staff wear masks and are available to answer any questions. The Front Desk staff are very helpful and courteous. Oliver, one of the Front Desk Agents, was very kind in helping with a currency exchange and getting around the local area. I did not eat in the hotel restaurants, but there are PLENTY of places to eat nearby. You can pretty much find any cuisine, including some that serve breakfast late into the day! The hotel sits right in front of the TTC, the streetcar light rail. It is very easy to get around to other sites. The property is also about a 10 minute walk to Union Station, which has shops as well as the subway. You are within walking distance of Ripley's Aquarium and the CN Tower. NOTE: rooms on a higher floor are best. I had a room overlooking the harbor on the 23rd floor. It was quiet and restful. The pool area and gym are nice too. The gym was nicer than expected. You have everything you need to get the job done while on holiday (free weights, machines, cardio equipment, stretch area, etc.). Being a Westin, the rooms are pricey, but I am partial to Westin properties so I budgeted for the week-long stay. Definitely recommend.",
      "rate": 4.0,
      "tripDate": " June 2022"
    },
    {
      "title": "How the mighty have fallen",
      "text": "I stayed one night. My room smelled stale, and the heater was very noisy. I could hear noise from another room. Overall my sleep was not good.The bathroom was the worst of many I've stayed in during my recent business trips to Toronto. Two decades overdue for an upgrade.The parking situation was nothing short of dangerous. I was directed to self-park in what was previously the valet parking area. When I went to retrieve my vehicle, I asked the front desk if it was possible to walk up to my car on a staircase - not the ramp, which wasn't built for pedestrians. I was told walking up the down ramp was the best route. This was a potentially perilous situation had an oncoming vehicle been travelling fast.Also, when I asked the front desk for directions to a nearby grocery store, the attendant seemed dumbfounded as if no one had ever asked that question. Overall, everything about the place was disappointing, especially since I had stayed there many years ago and had a wonderful experience.",
      "rate": 2.0,
      "tripDate": " February 2021"
    },
    {
      "title": "Not Westin Standard.  Depressing",
      "text": "I cannot really say much positive about this property. It’s completely lackluster.   The front planters of the property are completely barren. The entrance is under renovation and looks like a ruin.  The cavernous reception hall has zero life because not even the coffee bar is open.  Elevators are far from shiny and the room King Corner Lakeview) looked like housekeeping really hates their job. Bed was made poorly, lamp shades crooked, curtains and blinds randomly left open or closed.  Window sills were dirty.  The windows themselves are absolutely filthy.  For sure the windows have not been washed in at least 2 years.  Lake view is looking like a foggy day.  A nice long black hair on the bathrobe, fingerprints on the bedside table. Carpet looks grubby and the room didn’t smell fresh. Furniture is scuffed. At the moment there is no housekeeping so probably best to move to a new room or another property after one or two nights.  Breakfast is not available during the week.  Parking is free at the moment.  However, we decided to check out after the first night and the hotel kindly accommodated our request to leave early. This hotel should be closed for renovation but there isn’t even mention of work going on when booking.",
      "rate": 3.0,
      "tripDate": " August 2020"
    },
    {
      "title": "Couldn’t Fault this Big Corporate Hotel",
      "text": "Although this isn’t the type of hotel we normally book Trailfinders chose it for us and it turned out to be just the job. We had a lovely big light room with a harbour view which was brilliant! The bathroom was good having a bath which we like… one snag was I didn’t like the big dispensers for the toiletries as I couldn’t get anything out of them! Big comfy bed and good lighting  plus a chaise longue. A bonus was we were given a complimentary breakfast on one day which was good. It was walkable to Union station which was what we needed . Also convenient for CN tower and harbour cruise which were both excellent things to do ! There seemed a shortage of good mid priced restaurants nearby for dinner but we found a couple which were walkable towards st Lawrence market . The downside of the hotel was the noisy rowdy bar lobby area but that could be bypassed easily and there  were tacky hot dog stalls outside the entrance. Service was good throughout. No complaints!",
      "rate": 5.0,
      "tripDate": " October 2022"
    },
    {
      "title": "Wound not recommend",
      "text": "For a Westin, I was really surprised at the lack of service and how run down the hotel was. The rooms smelled musty and the carpets could use some cleaning. The pillows were extremely old and lumpy. The bed side tables were dusty and dirty. We stayed 3 nights and because of covid they don’t clean or restock the rooms (understandable). However, the garbages were overflowing and they gave you no bags to bag your garbage up. Ended up putting some in a bag we found outside the room, where it sat for almost the whole day before someone got rid of it. We attempted to use the hotel room phone multiple times to call the front desk, no answer. Had to use my personal phone to call long distance down to front desk and request new towels and coffee. An hour later and it never came. I call back and the supplies come 30 min later. And they brought decaf coffee. The coffee maker is some old, dirty sunbeam machine. And to top it all off, I received a bill and multiple credit card charges for daily parking even though we didn’t have a car or use it. Finding their email online is next to impossible so now I’ll have to call and have the charges reversed. I would spend a bit extra to stay somewhere cleaner and with better service. Really not impressed with this Westin.",
      "rate": 2.0,
      "tripDate": " October 2021"
    },
    {
      "title": "Decent hotel but showing its age",
      "text": "Stayed here a few nights for work and undoubtedly a great location easily accessible to the train station and major conference centres. I stayed here several years ago with my girlfriend for leisure and recall it having a more premium feel then. For the price you pay, you’re effectively paying for a great location and probably great lounge area for drinks (which I didn’t try but it seemed buzzing every night and looks nice). The breakfast was good and service excellent, and I was happy to be able to use the pool one evening which had all the great amenities. Where I focus my critique is largely on the room itself - while it was clean and maintained (essential), it showed its age with worn out baseboards and bathroom with somewhat grimy caulking. This is personal only, but I didn’t find the bed too comfortable and the pillows fell flat. Not the most restful sleeps to be honest. Overall, you will get a positive experience but the value proposition has diminished for me compared to several years ago. That said, they can probably charge the rates they do because of the location. I reluctantly rate this 3 instead of 4 because I find it harder to see how this compares more favourable to other places I’ve stayed at in Toronto over the years.",
      "rate": 3.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Just what we needed!",
      "text": "I brought the family to Toronto in August 2022 for a small city break before traveling to Niagara.We choose the Westin Harbour as it had a suite that would work for our family (2 adults 2 children), a good location and great views over the lake.The room was everything we expected, clean, good décor, and most importantly the space we needed.We enjoyed breakfast and the service was great and the food consistent and set us up well for each day of adventuring.The kids enjoyed the pool, we didn't use the gym or the restaurants for dinner though, so no comments in those.Location wise it worked really well for us, the ferry to Centre Island is right next door and the harbourfront is lovely. Union Station, the CN and the Aquarium were all close also.If I was looking for things to improve, a few more sockets would have been nice in the room (we have a lot of devices), and the bed would have taken better advantage of the view were it the other way around.I am non diary, so I pretty much always like to see a few more non-dairy options (like yogurt) but the staff were great with the Almond milk for my cereal and coffee, which is a lot better than many places I have stayed.Typically, I would look for an Airbnb for a city break, but I really enjoyed this stay in the Westin Harbour and can’t really fault it – its making me remember all the good things about hotels.",
      "rate": 5.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Staycation for the airshow! This USED to BE a nice hotel!!!",
      "text": "I have stayed in this hotel for over 40 yrs on & off and travel extensively. Let’s just say that you definitely can’t beat the lake view & premium downtown location but the hotel needs some pretty basic work! The entrance and parking are a full blown nightmare! Thank God Luis the valet was outstanding and got us sorted.  Then up to the room….The wallpaper peeling off the walls, the damaged walls and corners, missing blinds with the mechanism still affixed….and that’s just the obvious stuff! Don’t use the banking machine in the lobby, it isn’t reliable and any help from the customer service is in the USA.  If you book a terrace for the air show and pay a premium for it, you’re not guaranteed a room that’s not beside the huge building next door obstructing your view! Don’t order room service because it takes forever and half the order is missing when it DOES arrive! To be fair, they comped the breakie and ALLLLLL the staff were exceptionally friendly and super attentive. Just all in all not a thousand dollar weekend!",
      "rate": 2.0,
      "tripDate": " September 2021"
    },
    {
      "title": "Worry free stay",
      "text": "My husband and I stayed at the Westin Harbour last week, and we would not have wished to have stayed anywhere else in Toronto for the purpose our visit. Apart from feeling that we were already in an extremely clean and safe environment, so many additional measures have been implemented that we felt very reassured by it all. The attentive and genuine service that was available when needed, added to make this stay as comfortable and worry free as could have been possible.",
      "rate": 5.0,
      "tripDate": " December 2020"
    },
    {
      "title": "Not a typical Westin.",
      "text": "This hotel is, sadly, not up to Westin standards. The rooms are in need of an upgrade e.g. no plugs on or near the bedside tables for your devices, showers in desperate need of bleach, old flat pillows on the bed.  If this was a 3 star hotel, no problem - but this is the Westin.  All restaurants were closed. There were a few options you could pick up at the front desk, but otherwise nothing.  You would think “well, that’s Covid”, but no - the rest of the city is open (albeit with certain limits) so we couldn’t understand it. Also, it was the most beautiful weather to be in Toronto at the lakefront…but there was no outside seating at the hotel at all.  The hotel is right on the lake - another head scratcher.  There are lots of good restaurants in walking distance where you can enjoy a patio, but not at this hotel.  Final odd note, in this beautiful lobby, they had a ping pong table and a fuseball table. The head scratching continues.",
      "rate": 2.0,
      "tripDate": " August 2021"
    },
    {
      "title": "Overpriced, tired hotel in a good location. Don’t expect much.",
      "text": "We paid $733/night to stay in a two double bed balcony room which looked very tired and certainly did not justify that price. The balcony had a mysterious drip coming down from the balcony above it which you could hear every night. We had to phone each day upon returning to the room at 4pmish to request housekeeping service despite declining their ‘green offer’ which included fresh towels but no housekeeping during the stay (not that the towels had been replaced either way). The second night they cleaned the bathroom but didn’t make our beds or replenish our tea and coffee. The bath tub plug wouldn’t stay plugged to fill the bath for our children and yet somehow filled up when you took a shower so you waded in water up to your ankles while showering. The measly shower curtain didn’t do anything to stop water from flooding the bathroom floor either. The safe didn’t work which they helpfully replaced with another safe that didn’t work and of the 4 elevators servicing the 30+ storey building only 2 worked so you had to wait ages to go up or down to and from your room. Parking was advertised as $35 with valet parking for $45 yet when we arrived we were told the only option was valet parking at a rate of $55. Will never stay here again.",
      "rate": 1.0,
      "tripDate": " July 2023"
    },
    {
      "title": "Haggard hotel with terrible service",
      "text": "Can’t believe this is a Westin branded hotel. Every aspect of stay was at a motel level. Check in was done by a rude individual who gave wrong information about breakfast time and neglected to tell us we had to order house keeping service everyday of our 4 night stay. Never have I ever heard of having to order house keeping service. Got to the room which was outdated and haggard. The telephones didn’t work (1990’s phones) and the safe was locked. Curtains didn’t close properly and the refrigerator sounded like a generator. Had to use my phone to call front desk and waited 10 minutes before someone answered. After getting the room phone fixed, tried to call the “service express” number to arrange for house keeping service everyday and two of three days no one answered the phone after 5 minutes of being on hold. As part of my Marriott status, Ambassador Elite, which means next to nothing, breakfast was suppose to be included in the room charge. Did eat the breakfast for three days and the food was marginal at best. Then at check out was charged for breakfast. Took 30 minutes at the front desk  to get the bill fixed. Was so disappointed with the service and facility asked to talk to a manger on duty and was told he was too busy to talk to me. Oh yea, I was actually contacted by Marriott’s Ambassador Elite support team weeks in advance of checking in and they ask if I needed help with any dinner reservations. Was stoked to have this service. I picked a restaurant and asked for the service to make reservations for me and they said they would, but surprise, surprise, never heard back from the hotel or the AE support team.  Oh yea, rooms were CAD$400+ a night. Only thing that wasn’t like a motel",
      "rate": 1.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Not Like it Used to Be",
      "text": "It breaks my heart to write this review. I have been a die-hard customer of the Westin for many years and my most recent visit may be the last for awhile. My wife and I often visit Toronto and she has been asking for the past 2 years to switch to another hotel, but I am a routine guy and don't like change. From my experiences, the check-ins are great and have always had friendly employees. The lobby is nice and one of favourites is the lounge / bar. That is my relaxation time during the evening. The food has always been good and the employees serving us are long-term and you get to know them over time. The good times stop once you get into your room. Our most recent visit had us in a room that had a bad stench of everything including cigarette smoke and basically the room just wreaked from the carpet on upward. Most rooms we have staying in the past few years are dated. Unfortunately, we had one of those adjoining rooms where the doors separate the 2.  The tenants next door partied with music until 4:20 a.m.  We barely slept the night.  This was once an amazing hotel. It needs an update. On the bright side, the views from the rooms are amazing and I have always dealt with amazing staff. I love the Lobby and Lounge. Marriot needs to focus on getting the rooms updated because there are better options elsewhere downtown for the same price.",
      "rate": 3.0,
      "tripDate": " November 2021"
    },
    {
      "title": "Wow, wow, wow... love it here!! ",
      "text": "Where to begin.  We stayed a couple nights in the Prime minster suite and it was absolutely beautiful,  great views of the water being up on the 35th floor. Such a gorgeous suite with lots of room. The hotel itself is very nice too. Great restaurant and lounge and the gift shop off to the side was a nice added touch if you needed anything last minute.  A big thank you to Gener for being so wonderful during check in. The Westin property is very lucky to have someone like you on their team. You define what great customer service should really be like. It was a pleasure meeting you and I think I found my favorite spot in Toronto and I plan on being back very soon. Thank you again, Westin Harbour castle for a memorable stay. See you again soon.",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "great proximity to visit the city",
      "text": "The 33rd floor room was great, it had all the amenities that you would expect from a Marriott owned hotel but i was surprised to find a mini bottle of mouth wash waiting for me in the bathroom, a nice little addition. The best part about this hotel was its location to places to visit in the city. The hotel is about a 10 minute walk from the arena where the Raptors/Leafs play and 20 min walk from a few breweries and great places to eat. Another sneaky item was the very cool little bridge about a block away from the entrance that had an incredible view of the city and the lit up CN Tower.",
      "rate": 4.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Nice location - awful experience at front desk",
      "text": "Checkin & lobby are nice / bright / clean. I checked in on Sunday Aug 1, around 6pm, no issues. We did try and order room service, but internet charge of 20$, to see menu, was a bit much. I phoned front desk and person said just accept and there would be no charges. Which there weren't, just had problems trying to order food, I ended up going out for takeout, when I got back, there was a lineup at the elevator. so I asked front desk about where I could find the stairs (6th floor so not too far)  I had takeout bags in hand. Then front desk guy got confrontational. He asked me for ID,  I said I only have a credit card... I said you just checked me in an hour ago. He came around desk and scared me. Then he asked if I had a room key. I'm 56, dressed reasonably well, I felt like he was going to drag me out, but I showed him a room key, then he goes stairs are over there. I have stayed here many times before, never ever had a problem, but this was the first time I have stayed anywhere where I felt threatened. So, sure it's an anomaly, just a guy having a bad day I guess. I did try and leave this review on their website, you need to submit a review if you receive a Guest Satisfaction Survey following a completed stay, I didn't receive one, I called the hotel numbers, and nice guy on phone tried to direct me to website. This was the first time I have stayed in a hotel since pre-pandemic, feeling threatened, confronted... while front desk guy was likely having a bad day, he ruined mine. I was just trying to feel normal again. I feel like I should just stay home for a while longer.",
      "rate": 3.0,
      "tripDate": " August 2021"
    },
    {
      "title": "Greatly disappointed",
      "text": "Stayed here for two days for a work function. Considering they charged $270 night the room had wallpaper that was faded and had run marks all over it, stains on the furniture, broken lamp shades, pulls in the carpet. Overall not a great experience will certainly not be going back.",
      "rate": 2.0,
      "tripDate": " February 2020"
    }
  ]
}