{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "The Only Backpackers Inn",
    "url": "/Hotel_Review-g155019-d6153899-Reviews-The_Only_Backpackers_Inn-Toronto_Ontario.html",
    "priceRange": "$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.5",
      "reviewCount": 74
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "966 Danforth Ave",
      "addressLocality": "Toronto",
      "postalCode": "M4J 1L9",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/19/ab/18/86/kitchen.jpg?w=500&h=-1&s=1"
  },
  "description": "The best way to describe your new Home-Away-From-Home is relaxed.",
  "featues": [
    "Street parking",
    "Free High Speed Internet (WiFi)",
    "Coffee shop",
    "Bicycle rental",
    "Board games / puzzles",
    "Adults only",
    "BBQ facilities",
    "Laundry service",
    "Wifi",
    "Baggage storage",
    "Non-smoking hotel",
    "Shared bathroom",
    "Shared kitchen",
    "Shared lounge / TV area",
    "Sun terrace",
    "Non-smoking rooms"
  ],
  "reviews": [
    {
      "title": "Very Clean Good Value for Your Money",
      "text": "Stayed there for a week in August.  Location great 2 min walk to subway.  Kept very clean.  Staff friendly and welcoming.  Atomosphere is great.  To know:  can't check in until 2pm or later, 10 dollar refundable key deposit required, check out by 11 am.  No alcohol or food allowed in rooms.  Overall great...only things I would say are:  breakfast was only cereal toast danishes and coffee/tea when I was there it would have been nice to have some juice or some of the delicious baked options they offer at the cafe.  Also although the doors are all locked the only options were small lockers...can you make the lockers a bit larger so that I would feel comfortable leaving my laptop etc?  There are quire a few stairs so it wouldn't be appropriate for those with mobility issues.  Loved the decor very bright artsy and cheery.  Thanks had a great stay :)",
      "rate": 4.0,
      "tripDate": " August 2021"
    },
    {
      "title": "The Only Hostel for Me in Toronto!",
      "text": "In the rooms, the beds are pretty standard but rather comfy with you sinking into the mattress and not feeling the bedsprings under you like many hostels. Inside the rooms, there isn’t a huge amount to complain about other than the space and the lack of sidebars for the top bunks. There are some rooms with a great amount of space in them but there are also some where you feel packed in like you’re on a Japanese Bullet Train at rush hour, it’s just the luck of the draw. In every room, there isn’t a safety bar alongside the top bunk which gives you the burning fear that you’ll fall 6ft to your imminent death, or just a big boo-boo, even with you sinking into the mattress pretty deep.The hostel is rather small but not compacted where you’re suffocating over the lack of space. The largest space is the kitchen situated above the TV room but below the outdoor area. The kitchen is rather large with plenty of space to sit and eat your food whilst having plenty of room to cook your food. Everything about the kitchen is large in hostel size, including the fridge and food storage space. The TV room below is also rather intriguing with a creepy basement feel to it but not a Fritzl basement feel. It’s just rather dimly lit with some artwork and other bits and bobs packed away to the side along with what seems to be a heating system or something that seems very significant to the hostels’ livelihood. The basement TV room is genuinely the best if not one of the best things about this hostel. It’s perfect to watch the cable tv until 4 am but also perfect to chill out and do some work or watch Dora The Explorer on your laptop without people judging you too much. For full review check out the website in my bio (loser travels) and have a wee gander at this review and more!",
      "rate": 4.0,
      "tripDate": " September 2021"
    },
    {
      "title": "Great place for those on a budget! ",
      "text": "I stayed at this hostel while going to Toronto to visit a close friend. Finding a place to stay in Toronto is expensive, but this hostel offered what I need: a safe, clean place to stay for the night. I also enjoyed eating my breakfast outside on the porch. I'm 37 and sometimes feel a little old for hostels, but that was not the case at this hostel! Very diverse group of folks staying there, which made the experience all the more comfy. My only suggestion for improvement is considering adding another bathroom or shower to the building.",
      "rate": 4.0,
      "tripDate": " August 2023"
    },
    {
      "title": "My roommates and I (all strangers) definitely agreed it was the worst hostel we’ve ever used!!!",
      "text": "Not for solo travelers looking for a strong social scene or if you’re looking for organized activities. This is a hostel operated by the cafe/bar downstairs, and you can tell the cafe/bar is their number one priority. Don’t expect any organized activities to promote socializing between guests. In fact, you start to realize how reliant you are on a front desk (that doesn’t exist here) for advice for things to do, general help, tours to purchase, etc. Staff here veered between friendly and “just alive”. Lockers are very small, just enough to fit a laptop and valuables. Bedding was definitely old and my roommate complained of hair and bloodstains on her sheets. They charge you a $10 credit card deposit for your key, which they refund, but charged a $2 transaction fee for the refund. Weird in the little ways. My roommates checked out the lounge but complained it was small, TV didn’t work, and was dingy. It’s a somewhat affordable hostel in an expensive city. The proximity to the subway is the best thing going for it, but it’s an out of the way neighborhood. My roommates and I didn’t like that the showers looked into the guest only patio and the only thing separating it were window screens (so yes people outside can see into the shower room - great pressure though!). One night we found the door separating the downstairs bar patio open which would have allowed bar guests to enter the upstairs guest patio and look into/enter the showers. Definitely freaked us out.",
      "rate": 2.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Wonderful stay",
      "text": "We stayed at The Only Backpackers Inn from January 10 to January 14We stayed in the Superior Queen room Our time at the hostel was wonderful, the room was spacious and beautiful with a great shower. And a nice place to arrange  all our clothesThe adjacent living area with kitchen was a surprise.  Very spacious— with a couch, coffee table, large table and chairs and then a outdoor deck!?! Really!We felt we like we were staying in a boutique hotel!The staff was welcoming and helpful and it was great to be able to grab a coffee in the morning at the cool and groovy cafe downstairs, and continue to the subway around the corner.  I always want to stay in a place with a pub and coffee downstairs.  You get a real idea of the life of the area.We’ll definitely comeback again next time we are in Toronto Tal",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "think twice before coming!!!",
      "text": "Duo-travellers from Germany...We booked this hostel according to our budget and also after reading a few good comments on the internet. We thought we should give it a shot. The check-in was terrible!!! Although their website states that the check-in is in the café, however it was very hard to see one available Barista to help us or to welcome us. They were too busy with making coffee or receive the orders of the café customers. There was a door in the bar to the patio and to the hostel directly, which was open at all times.  Not safe at all for the guests staying in the hostel !!!! Some drunk old guy was, looks like an employee, working there , too, we heard him shouting at a guest \"get out!!!\" In a very crude and intimidating way, while she was helping other guests or the new comers. We witnessed this, shocked !!!! This old man, later learned his name--Jeff, in the hall of the hostel during our last night while  he wasn't even booked in, or staying thete, but was wandering around in the hostel while he was not even a guest....drunk...he was creepy. I am glad that we checked out today!  And you girl, the guest,  you were shouted and mistreated by this man, report this creepy guy for harassing you and other guests! Good luck! All in all, after 2 nights of stay, this place is terrible due to noise, verbal harassment of some drunk employee, poor cleanliness!",
      "rate": 1.0,
      "tripDate": " August 2016"
    },
    {
      "title": "Way below my expectations!",
      "text": "On a freezing Toronto day, we, with my girlfriends, chose this hostel based on the high ratings, unfortunately we were so frustrated by everything! The day we went in to the cafe where we were supposed to check in, the bartender didn't care to check us in, because he was too busy with making coffee!!! When we finally went upstairs, we were in awe to see the room in a terrible condition. Smelly, too small. On the Day1, Our food was stolen from the fridge, yes, our names were writtenm still !!!!! Like WTF!! had to go to the bar to have a pint. Their laborer man Jeff or Jeffry, we don't know, but  was too creepy, standing around us all the time, if not him, there was always another creepy man! We felt so unsafe! There was nothing to do in the hostel, no common room, no patio option 'cuz was too cold outside!  Seriously  guys just stay somewhere in downtown, breakfast is free everywhere, even in HI hostels. Girls, stay away from Jeffry or Jeff, and the homeless people staying in the hostel!",
      "rate": 1.0,
      "tripDate": " January 2017"
    },
    {
      "title": "Never coming back",
      "text": "They play play loud music downstairs every night until 2:30am. They then stomp around the halls every morning doing cleaning starting at 8am. The doors have large holes in the front of them. It's hot as hell with no ventilation in use despite ducts everywhere that seems to carry everyone's conversations in to my room with frightening clarity. The \"king size\" bed is two twins pushed together and was the proper length for a hobbit. Their free wifi is worse than rural countryside. I can't wait to leave.",
      "rate": 1.0,
      "tripDate": " October 2014"
    },
    {
      "title": "Def.agree with the negative comments about the terrible employee Jeff! GREAT GREEK TOWN AND BREAKKY, THOUGH,",
      "text": "As a couple, we stayed in this hostel in 2016 summer when we were travelling across CA and stayed this year, again on our way back home. Have been on roads for so many months, left several reviews on other websites, this is my first review here. Things were so vague in this hostel. I read the earlier reviews, and def. agree with the previous neg.comments about the old employee with glasses named Jeff. He was intimidating the guests, harassing them a lot, for no reason, his targets were especially the FEMALES or Girls!!I witnessed so many things, recorded, made photos, saved it all, in case any bad thing happens to any girl by this guy in this hostel!  I wanted to share it here.I witnessed and  saw he was after one particular girl, who was the kindest, smartest, and the nicest person I met there. She was respected among her friends. She was doing nothing, although others were violating the rules, he was catching her and shouting at her, he was telling her “I don't care, you were with the guys”, I heard this and saw this with my eyes at breakfast. He was clearly jealous! I saw him on the upstairs patio drinking the guests’ beers for free, next day I saw him banning the alcohol in the entire hostel, it was very hypocritical! He was drunk even when working!$30 per night to be harassed by this rude guy! The owner of the hostel should have refunded the money to the guest really!!! He will come to you pretending to be fatherly advise you that guy or this guy is hitting on you stay away from him, blah blah, and he will add he’s married with 2 kids , etc , DON'T BUY IT! If he was talking badly about other employees, he was really the only worst one there, not the other employees! In fact, we all loved Dimitri very much, so to speak!RECORD everything! Make a formal complaint to the police even if he shouts at you or other girls! Don't try to find the owner of the hostel, because he didn't care when this girl and many others was harrassed by Jeff, he cared $$$.Aside, the location was great, Greek town, loved it so much! So many great Greek tavernas and restaurants! Liked the waffle and coffee, but breakfast should really have savory options!, too!",
      "rate": 1.0,
      "tripDate": " July 2016"
    },
    {
      "title": "Not good if you want a quiet place to rest",
      "text": "I stayed at a 8 bed room. The room had a decent space considering it was shared.There was some shelves and a cabinet for storing stuff, but not enough for everybody, so you will need to leave something on the floor. The bed was also not very comfortable and a little shaky(I stayed at the top one of a bunk bed). The small shower was outside the room, and was a little dirty. There were people talking until pretty late, in spite of the silence hours.The hostel is far from Toronto main attractions, but near a subway station. There is a 7-Eleven across the street and some pizza nearby too.The best thing is the free waffle breakfast on the bar downstairs, pretty tasty. If you don't like waffles you can also pick something to eat there for free.",
      "rate": 2.0,
      "tripDate": " January 2015"
    },
    {
      "title": "トロント中心部から若干離れるが、手頃。A bit far from Downtown Toronto, but reasonable.",
      "text": "(ENGLISH FOLLOWS AFTER JAPANESE)こちらで２泊しました。とりあえず、ドンランズ駅からすぐというのは、かなりのプラス。大体20分でトロント中心部まで行けるが、本数の少ない時間帯とか少し辛いかもしれません。ちなみにこちらは一泊２０カナダドルだったので、結構手頃です。もちろん、日本のクレジットカードでも決済可能です。ただ、ベッドルーム自体はそんなに綺麗ではなかった。あと、こちらに泊まる場合は前もって自宅からタオルと石鹸類準備しておきましょう。ホステルとして珍しくそれらの提供はなかったです。あと、お手洗いも若干汚かった。しかし、この評価を３つ星にした理由は朝食でした！こちらの朝食はホステルにしては意外と豪華で、スタッフの方はワッフルを焼いてくれます。しかも、そのワッフルに旬のフルーツを盛り合わせてくれるので、最高な朝食でした。もちろん、本場カナダのメープルはかけ放題です。もちろん、宿泊代に込まれています。という事で、トロントを安く楽しみたいという方はこちらで一度泊まって見た方が良いかと思います。特に朝食目当てで！Stayed here for a couple nights. It's a quick walk from Donlands Station, so in terms of transportation it is convenient. However, if you take a train to Downtown Toronto during slow hours, it may take you more than 20 minutes to head there. (You can get there in 20 minutes during rush hour). It was 20 CAD per night, so I recommend here for people on a budget.However, the bedroom was not that clean comparing to my previous hostels I stayed at, and keep in mind to bring your own toiletries and towel, because they are not provided here. Also, the bathroom was a bit messy.BUT, there is a huge reason why I rated this place 3 stars, and it is due to their breakfast. As it is already included on your stay, the breakfast experience was quite a bit different than my previous hostels. The staff makes it for you! And the breakfast is waffles with a great amount of fresh fruits aside, as you can put all the real-Canadian maple you want on your waffles!If you are seeking a descent place to stay in Toronto with a nice breakfast, stay here!",
      "rate": 3.0,
      "tripDate": " July 2015"
    },
    {
      "title": "Great place to stay",
      "text": "Stayed here for one night before I continued on my travels. Upon arrival a bar staff member who was extremely kind supplied me a quick tour of the hostel. The hostel itself is nice, pretty clean, with two bathrooms, a shared kitchen space and a large balcony and also around 3 shared bedrooms with bunk beds. There is storage space for bags and lockers for smaller items. Note you have to pay a deposit for the room key which is refunded after your stay. The other guests staying there were all very kind and respectful of others, especially after 12:00am, when there was a conscious effort to tone down the noise. The free breakfast alone makes this place worth the visit. It's around 6 subway stops from downtown but it's really no hassle at all.",
      "rate": 5.0,
      "tripDate": " June 2015"
    },
    {
      "title": "funky, hipster-ish hostel",
      "text": "It's a very clean , colorful and funky hotel. I love how they decorate the hostel and the paint color they chose, it was bright, lively and energetic.The staff were extremely friendly and professional. We didn't have a chance to use the kitchen as we arrived late at night and left early the next day. There were 2 bathrooms and 3 shower rooms. All very clean and well equipped.The only couple things they might want to make a change is the time the music plays till at night. If I remember correctly, the music was still playing after midnight which we can hear clearly from our room. And also, If possible, we would also like the waffle breakfast to start earlier instead of 9 o'clock. The hot chocolate and croissant we had in the morning was delicious, but it's a pity that we would love to try the waffle breakfast.",
      "rate": 4.0,
      "tripDate": " December 2014"
    },
    {
      "title": "Welcoming, friendly and clean hostel.",
      "text": "I spent there the first week of my Working holiday visa in September 2014 and really enjoyed my stay. The kitchen is clean and has everything you may need, and I mean plenty of utensil and quality staff. Plenty of space in the (clean) fridge too. The kitchen was cleaned every day and I saw the staff deep-cleaning it at least twice that week. The rest of the spaces are really homey and clean, including two of the bathrooms which are individual, something that you welcome after a while living in hostels (Also saw the staff cleaning every day).It is a very good place to meet people, I'd strongly recommend it to working holidayers, or people who likes to hang out. Maybe it's not a good place if you look for calm & quiet, although I never had a problem to sleep, people generally keep it quiet after 11pm.They also have a cafe with good coffee and a lively bar where you have breakfast in the morning.My only complains are 1) the size of the room, I think my room was too crowded, it was just too small for 6 people with their baggage. and 2) The breakfast starts too late! Besides it is a good breakfast but I would have welcomed an option other than the waffle. It's awesome for one day but not for one week.Staff is friendly, helpful and welcoming, a special mention and thanks to the mexican guy working in the mornings.",
      "rate": 4.0,
      "tripDate": " September 2014"
    },
    {
      "title": "Inspiring and friendly - thanks a lot!",
      "text": "Very nice Inn, very clean and very good organized. Lots of good conversation and music - very inspiring. Toronto is a vivid city with a lot of interesting places.",
      "rate": 5.0,
      "tripDate": " April 2024"
    },
    {
      "title": "Great Place in Toronto with the best Breakfast!!",
      "text": "This is a very interesting hostel. It has a café and a bar downstairs. Two different doors to enter. Make sure you remember yours. The rooms are upstairs and quite small. You have a small locker and enough space on shelves for your staff. They have a deck on the back to sit with some green - this is a nice place to chat. The kitchen is very big and you find everything you can imagine. BEST kitchen in a hostel so far. I was not in the tv room. The breakfast was the BEST hostel breakfast ever. I stayed in many hotels and had many times breakfast that was maybe half as good!!It is a bit far from the center but super close to the subway so no problem to go everywhere.",
      "rate": 5.0,
      "tripDate": " October 2019"
    },
    {
      "title": "Fantastic backpackers hostel",
      "text": "A great backpackers hostel above a nice bar, near the subway, in an interesting neghbourhood. It's got everything you need: nice staff, big kitchen, big sun deck, about a bar and a coffee shop. The price even includes a great breakfast.",
      "rate": 5.0,
      "tripDate": " October 2019"
    },
    {
      "title": "Great hostel in great location",
      "text": "My brother & I loved our stay at the Only Backpackers - the twin room we had was perfect & ti was wonderful to have the balcony space. The hostel was v clean, staff friendly, & great coffee for breakfast. The location in Greektown is great - especially for the food! (we particularly recommend GreenEarth restaurant, just down the street from the hostel)",
      "rate": 5.0,
      "tripDate": " August 2019"
    },
    {
      "title": "Cozy fun hostel",
      "text": "A hostel, and a bar at once, This only backpackers hostel is one of the funniest hostels in the city.Plus:- Cozy basement for lounging, which had a TV- Awesome and sizable evamped kitchen - Quite affordable relative to other similar hostels- Located a few steps from Greek Town, and  very close to a subway station.Cons:- The rooms are a tad bit small- While it mostly was not an issue, the place can get a little noisy at times.All in all, this is the best value for money hostel in Toronto. I've been here at least 5 times and no regrets so far.",
      "rate": 4.0,
      "tripDate": " February 2018"
    },
    {
      "title": "Great Atmosphere, comfortable bed and excellent service",
      "text": "This was my first option to stay in Toronto before moving to a condo to start my life in Canada, I like it a lot, I stayed here for 1 month, I often go there to have a Cooffee or a drink.It very close to subway st and 15 min to downtown Toronto. People that work here are awesome and always keen on assist you.Defo a hostel that you must choose.",
      "rate": 5.0,
      "tripDate": " February 2017"
    },
    {
      "title": "Colourful funky place",
      "text": "Clean, lively, friendly staff, Best WAFFLE BREAkFAST!, 1 minute walk to donlands station, great funky cafe and bar underneath, with good food and drinks. Stayed here many times and met many wonderful people. Made lifelong friends and memories. Great not to small place to meet people.",
      "rate": 5.0,
      "tripDate": " August 2014"
    },
    {
      "title": "Bohemian awesomeness.",
      "text": "I stayed here in September 2013 with a couple of friends, and then again in December that same year. Why did I come back to stay a second time? Because, pure and simple, it is one of the best hostels I've ever stayed at! The staff is friendly and helpful, and the place itself is like a color explosion, inside and out. If you're on a budget this is the place to be, because it's cheap. The dorms are nice, there's a cosy café and pub downstairs, and a nice big balcony where you can hang out. There's also a kitchen where you have the opportunity to cook your own food if you want. And let's not forget the waffle breakfast, which is for FREE! It's a welcoming place that you want to come back to! I did, and I keep telling people that if they're headed for Toronto, this is the place to stay!",
      "rate": 5.0,
      "tripDate": " December 2013"
    },
    {
      "title": "Great hostel",
      "text": "This hostel is perfectly placed, right by donland subway station and has some really nice restaurants and bars and shops nearby. Perfectly suited for solo travel, groups or long term stays and pretty decently priced for Toronto. The bar downstairs is home to the brekkie in the morning and 24/25 rotating tap craft beers and ciders so if you like beer you are sorted. The only downside to this is that it stays open to 2 am every night. The hostel is well equipped the rooms and a generous size and they’re plugs by every bed! Great hostel and if I’m ever back in Toronto I know where I’ll be staying.",
      "rate": 4.0,
      "tripDate": " September 2019"
    },
    {
      "title": "Great hostel for the price and location despite cons",
      "text": "PROS:- Hostel is in a great location, literally a 30 second walk from the Donlands station and located near Greektown- Free breakfast, simple but good- Nice bar and cafe on 1st floor- Overall nice facility and staff- Comfortable facilityCONS:- 2 of the showers were out of order when I visited- Some of the bathrooms seemed dirty- Hostel has a strange layout. In order to reach the lobby at night to rent towels for the shower, one would have to leave the hostel and go into the busy bar. It would be nice if towels were simply included (or if there was a more centralized spot to rent them). - Hostel is still relatively far away from downtown - essentially you will need to use public transport to easily reach it. - Rooms seemed quite small- Pillows were VERY uncomfortable Overall: I would recommend this hostel and I would stay here again.",
      "rate": 4.0,
      "tripDate": " January 2019"
    },
    {
      "title": "The room is small and very noisy at night",
      "text": "The room is very small for 6 beds (they should have placed maximum 4 beds), and we did not have enough room to place our suitcases on the floor because otherwise there is no space to walk.Also it’s not sound proof, which makes this hostel the worst that I have visited. You cannot really go to bed at 12am because the bar next door plays non stop music which you can listen from inside your room.",
      "rate": 1.0,
      "tripDate": " February 2018"
    },
    {
      "title": "Nice little place",
      "text": "My buddy and I needed a cheap place to stay for the night since we were in  Toronto for two concerts and it was a great place to stay. I would recommend this place for anyone. Rooms were really good and quiet as well with two great patios. Great pub down stairs so if you are a beer fan it's a great place to drink.",
      "rate": 3.0,
      "tripDate": " July 2017"
    },
    {
      "title": "A Simple Hostel",
      "text": "This is a very simple hostel with lots of colors. If you are looking for a cheap place, it is okay. I arrived a bit too early before check in and had to find somewhere else to hang around, unlike most hostels I've stayed in where they will let you store your luggage and allow you to rest in the common room, but not this one. I wasn't offered that option.The staff were friendly, though, you have to wait for them to serve customers at the cafe before attending to you (too much work for them).They offer free breakfast with lots of varieties to choose from. I find this very impressive.This hostel may not be located downtown, but the street is very busy and lively (close to Greek town with lots of restaurants). It is also a short bus ride to downtown if you don't want to take the subway. It is also very easy to meet with other travelers and make friends. This is a good place to stay if you don't expect too much.",
      "rate": 3.0,
      "tripDate": " May 2017"
    },
    {
      "title": "Cheap hostel with small rooms and free breakfast",
      "text": "Stayed in this hostel for 2 nights. When I wanted to check in, the barista was too busy to help me - he had to help people in the espressobar first. He apologized for that and showed me the hostel afterwards. The rooms are small, I don't know what my roommates were doing with their stuff but it looked like they had taken everything out of their suitcases and put it in the stores - not much room for my suitcase and stuff. Since I had a 24-people room in Reykjavik, a 6-people room here wasn't that bad. The window was open because of the temperature in the room, but there's a lot of noice from traffic outside on Danforth Ave.The hostel is not downtown but the subway is just around the corner. It has a common room and a big kitchen with everything you need. There also is free breakfast, nothing special (no waffles! like everyone reviewing here). The showerroom was clean. It's a good hostel if you travel on your own, if you're just staying for 1-3 nights and if you don't wanna spend much money.",
      "rate": 3.0,
      "tripDate": " April 2017"
    },
    {
      "title": "Interesting place",
      "text": "This hostel has an interesting vibe. There is a bar/cafe downstairs which is very convenient. The hostel has a pretty diverse group of people staying at the hostel. It has a cool outside deck on the second floor for hanging out and meeting people. You can drink, grill and smoke on the deck. The bedrooms can be cramped but still comfortable. The bathrooms are cramped too. The location is interesting. It's in the Greek town part of Toronto. Its residential but still urban. It's not exactly downtown Toronto but it's close and the hostel is right around the corner from the train. You actually are right behind it when on the cool deck. Which reminds me for being above a bar and close to public transport I never found noise to be an issue. You do have to pay a key deposit as well as a towel deposit. This place is a true backpacker hostel. It's not the nicest/modern hostel but I would stay here again. It's clean and safe and has a nice, chill vibe.",
      "rate": 4.0,
      "tripDate": " May 2016"
    },
    {
      "title": "Great breakfasts and great location!",
      "text": "The waffle breakfast was awesome! and they were for free ^^people at there were friendly! and this hostel is near metro stop, so we can visit downtown really easily!but the bedroom i didnt really like it, there is a little bit dark.",
      "rate": 4.0,
      "tripDate": " December 2015"
    },
    {
      "title": "It has its good and bad sides",
      "text": "My opinion about this hostel was quite mixed. The staff was friendly and there was a kitchen with equipment, a large living room with a lot of couches and even an Xbox. The room I slept in was, however, bad. It was too small for six beds, there were no windows and I counted only two sockets. Although it was november when I stayed there, it got way too warm inside the room, resulting in the fact that my roommates left the door open a lot of times, which I did not like very much due to possible theft. The facilities are okay, however, except for the fact that, every day, I encountered dirty toilet paper in the trash bin covered with traces of number two. Because of the fact that this was a recurring phenomenon, I'd strongly recommend that the hostel should put up signs in the toilets, instructing people to throw their dirty toilet paper into the toilet and not in the trash can, because the smell was horrible and since the bins didn't have a covers, I had to watch the dirty toilet paper as I was using the toilet myself. Not very nice indeed.The café of the hostel is very nice though, absolutely no complaints about that! Breakfast was okay but there were no waffles and since the hostel praises itself for their waffle breakfast on the internet and on the posters in the hostel, it's a bit of a letdown to get a very basic breakfast instead. On my third morning they added a variety of breads and scones though, which was very nice, but I guess you shouldn't count on that.So the hostel is basically okay, with some positive aspects but also negative ones. It's a bit far away from downtown Toronto, but the subway is right around the corner, which is very convenient.",
      "rate": 3.0,
      "tripDate": " November 2016"
    },
    {
      "title": "Best hostel in Toronto by far!",
      "text": "Stayed there for a while so I know what I'm talking! Might not be the biggest hostel, but that just makes it better. And the bar/café downstairs are the greatest. Oh, and the breakfast! The breakfast! I think I miss the breakfast almost as much as the people I met there!",
      "rate": 5.0,
      "tripDate": " October 2013"
    },
    {
      "title": "Nice spot with more cons than pros!",
      "text": "I stayed in this hostel 2 times, 21 days in between, during my trip to North America! This was a nice spot with pros & cons!! I will tell why.Pros: normally, they charge $5 per night for luggage storage when you are away, but the employee didn't charge me anything because I was coming back 21 days later :) saved $$, big kudos to her, if she is reading this!❤      Location- lovely blue-white little greek town on Danforth! Cons: Rooms were small. Bar was loud at night. Breakfast was insufficient, loved the waffle&maple syrup though.  Kitchen was OK. Nothing special. Some employees were lacking respect, were very rude, too, especially Jeff--he was too rude and intimidating the women guests, shouting at everyone, for no obvious reason. In my opinion, an employee like him shouldn't be working in a hostel or be around the guests, for the guests’ safety and peace! I said good morning to him few times, he was belittling and never greeted me back!  We decided with the other guests to avoid him completely. Avoiding him completely helped us!Pets were forbidden, but Jeff  was walking with a black dog in the kitchen while the guests were cooking!  Everywhere was full of notices  threatening the guests n  asking the guests to check out if they attempt to drink a glass of wine or beer or any alcoholic drink   on the hostel’s patio!!!! Whaa…??? Sooo weird!Due to these cons, I rated this hostel with 2* to improve themselves until I go back again  2017 summer!",
      "rate": 2.0,
      "tripDate": " August 2016"
    },
    {
      "title": "Really nice hostel",
      "text": "Really enjoyed my stay here at the hostel. The staff are friendly and there are plenty of showers and bathrooms available. The kitchen is also nice, everything you need is available. The only downside was that some of the rooms are quite small (I stayed in the 10-person dorm), but everything else makes up for that. Would definitely recommend this hostel!",
      "rate": 4.0,
      "tripDate": " July 2014"
    },
    {
      "title": "Small and new but perfectly designed",
      "text": "Took a private room here for Pride weekend. The building is obviously a recent refurbishment and the spaces, though small, are impeccably designed and very comfortable. Spacious balcony and spotless public kitchen. Charming coffee house/ bar downstairs. Rooms very secure and extremely clean. Warmly helpful staff (the first thing we did was get the dead battery on our car jump-started with their help) and a lovely waffle with syrup and fruit, served with big cups of coffee and tea, thrown in. Highly recommended.",
      "rate": 5.0,
      "tripDate": " June 2014"
    },
    {
      "title": "Ok Hostel!",
      "text": "This hostel is overall not bad and an ok place to stay in Toronto. Travelling to the hostel from the airport on the bus/subway is quite long but the hostel itself isn’t far at all from the subway stop - literally only round the corner so that was useful when it came to travelling downtown into main Toronto. The room I stayed in (4 bed female dorm) was fairly decent. There are shelves to put your suitcase and small lockers to store personal items. The only negative I found was that it can be really noisy because the rooms are off from the main area that people walk through to get to their rooms and there are sinks that people use to brush their teeth etc. I heard a lot of noise (doors slamming, conversations etc.) when I was trying to sleep as it was literally just on the other side of the room door, but on the next nights I just used earbuds which solved the problem! Breakfast was a little disappointing as I had read reviews and on the website that they had waffles. I didn’t get this for any of my three mornings, it was just a basic breakfast (cereals, bread, boiled eggs, fruit etc.) The staff overall were helpful when I interacted with them; giving recommendations of where to go to eat in the nearby neighbourhood etc. Overall I found the hostel a little on the cramped side and improvements could be made in the facilities - some things were a little worn/tired/dated, particularly in the bathrooms I used. However I really liked the decor. I personally wouldn’t stay again as I’d probably look for a place that was actually in downtown Toronto but if you are just looking for a basic place to stay and don’t mind about being out of downtown then it would do the job!",
      "rate": 3.0,
      "tripDate": " August 2018"
    },
    {
      "title": "Travelling",
      "text": "I stayed here for 1 month, staff is very friendly, hostel is clean, the location is good only 15 min in metro to toronto downtown or 1 hour walking, free breaakfast and great atmosphere and nice coffee. Definitly a great recomendation.",
      "rate": 5.0,
      "tripDate": " January 2017"
    },
    {
      "title": "Bohemian kinda place, they shouldn't invade the guests' privacy too much!",
      "text": "I chose this hostel because it was cheap, close to the subway. The moment I stepped into this hostel, I didn't feel comfortable. The employee looked to me they were there for gossiping behind the guests, even if you do it, don't do it in front of the new guests. I heard all their chit chats in the cafe. It also bothered me that the same bartenders and baristas were the same people showing your room, therefore they were getting too much close invading my personal space! I didn't understand how many people were staying in the hostel or working for the hostel. To me, they shouldn't allow the people to stay too long, it was like they were renting the whole hostel to those who were there for a year or more!Beds were smelling per, as if those guests slept on the bed for years non stop and was never changed...it wasn't a clean one! Breakfasts are free everywhere, so the breakfast at this hostel wasn't big deal! All in all, didn't like it!",
      "rate": 1.0,
      "tripDate": " January 2017"
    },
    {
      "title": "Just OK .....nothing special!",
      "text": "Stayed in this hostel last year, I'm not sure of if I'm willing to stay this year, though! I found the walls of the hostel were too much painted in colors in such a way that they wanted to distract the guests attention from important factors! The beds were uncomfortable, too old, pillows were smelly, the blankets weren't new, either. The employees were disrespectful, suddenly entering the room staying in the room too much, causing too much noise. There was this employee with tattoos and dreadlocks girl, she was too rude , not approachable at all! I never understood why she was working in a hostel with that attitude! Breakfast wasn't the best, just waffle! Location was too far from downtown cost me too much money everyday to commute. They were forcing the guests to drink in their bars, never understood that , either! Not recommended!",
      "rate": 2.0,
      "tripDate": " August 2016"
    },
    {
      "title": "OK",
      "text": "I spent 3 nights in this hostel, it was OK but it does not reflect all the good reviews that made me pick this place. I was in a 6 bed dorm, the room is really small and the place is noisy with the bar just downstairs. The staff is nice, as well as the location (just a few steps from a subway station, so it takes like 10 minutes to get to the city center). Bathrooms weren't really clean and unfortunately, the so-called delicious breakfast isn't good at all...",
      "rate": 3.0,
      "tripDate": " October 2016"
    }
  ]
}