{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "The Percy Bed & Breakfast",
    "url": "/Hotel_Review-g155019-d2084712-Reviews-The_Percy_Bed_Breakfast-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "5.0",
      "reviewCount": 29
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "6 Percy St",
      "addressLocality": "Toronto",
      "postalCode": "M5A 3M8",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/01/d4/01/81/the-lounge.jpg?w=500&h=-1&s=1"
  },
  "description": "The Percy is a two bedroom cottage, renovated with an Art Deco meets Queen Victoria flair. During your stay with us, David and I here to pamper you and to assist in making your visit to Toronto most memorable. We are within walking distance to the downtown core and a five minute drive from Cherry Beach! Room rates are $200 for either the East or West Room/night. Or, $300/night for both rooms.",
  "featues": [
    "Free High Speed Internet (WiFi)",
    "Wifi",
    "Free breakfast",
    "Beach",
    "Non-smoking hotel",
    "Kitchenette",
    "Non-smoking rooms",
    "Suites"
  ],
  "reviews": [
    {
      "title": "Can't wait until next time!",
      "text": "This was our second stay at the Percy with Kali and David. We were so confident from our previous experience that we invited our good friends to come along. From the amazing breakfast to the handmade lotions it was a delight. Once again it did not disappoint. The proximity to the Distillery district, the free parking, and the freedom to come and go made it the perfect set up for us. Include a meal at Ruby Watchco and a coffee at Cluny and you will have a perfect downtown weekend!",
      "rate": 5.0,
      "tripDate": " March 2015"
    },
    {
      "title": "Exceptional stay in Toronto",
      "text": "Our family of 4 (2 teen kids) stayed for 4 nights. The hosts are amazing and made us feel at home immediately, introducing us to their home where we had the place to ourselves. We were on the last leg of a 10 week trip all over Europe and where we rented houses and were cooking for ourselves. We were at The Percy because of the location (walking distance to downtown) and we like to have a kitchen. So when we arrived we told them they didn't need to make us breakfast since just do something simple. They insisted, and are we ever glad they did! Each day they asked us what time we would like breakfast and they showed up at that time to cook for us. Everyday we had a breakfast that topped the previous. They use the best, local, fresh, organic ingredients and cook and bake from scratch. David is an excellent cook. I left inspired to try to elevate my morning routine at home to remind me of my stay at The Percy. It was nice to have their expert advice each morning on that day's activities. We talked about where we might go and they always had ideas of what else we could do nearby or what we should make sure to see. When I think back on the previous 10 weeks in Europe I wish I had someone local like them, and if I had, how much frustration could have been avoided. The neighborhood is full of trendy cafes, restaurants, and bars, parks and public transportation is good, We took public transport all over Europe and were happy to not have a car in Toronto. One block from tram. If I was going to live in Toronto, this is the area I would want to live in, and I would want to have Kali and David as friends. They are wonderful people and made our stay.",
      "rate": 5.0,
      "tripDate": " July 2014"
    },
    {
      "title": "Pampered at the Percy",
      "text": "I have not travelled for about 10 years and was quite apprehensive about being in Toronto to visit my daughter.  Staying at the Percy was the perfect solution. Easy to find your way to and from The Percy is situated on a short, no through street so there is no traffic noise.  It quickly became my \"happy place\".  Beautifully appointed, totally comfortable, bright and cheerful with understated luxury.  The best part was the thoughtful and respectful attentions from my hosts Kali and David.  They are absolutely the perfect team and provide everything you could want in a B & B. It was like an oasis - a quiet nest in a busy city.   I look forward to my next visit.",
      "rate": 5.0,
      "tripDate": " December 2013"
    },
    {
      "title": "Toronto's Bed & Breakfast Winner !!",
      "text": "My husband and I travelled to USA and Canada for our first overseas trip and Toronto was our last stop. Our hosts were extremely hospitable and keen to make sure our visit was very memorable. Our room was very comfortable and we looked forward to our breakfast every morning - outstanding and very yummy. We shall miss our breakky chats and Toronto friends...",
      "rate": 4.0,
      "tripDate": " May 2013"
    },
    {
      "title": "Fantastic vacation at \"The Percy\"",
      "text": "\"The Percy\" , that couldn't be considered a \"simple\" B&B, is located at few meters from the Sumach street car stop. Very useful to many services situated on this area. You con easily join the centre of the city with public transports. The owners are two fantastic hosts. We spent a week with them and for me it was like to be in a family. Our vacation was fun also because we could practice our english with them. The service was better than a 4 stars hotel. At Percy you can use whatever you need: washer, dryer, kitchen..... They had many attentions for our allergy problems. They prepared some amazing gluten free muffins for my celiac daughter. And she is still remembering them. In case we needed they also provided every kind of things and informations. Nothing more to say, just try to believe.",
      "rate": 5.0,
      "tripDate": " July 2012"
    },
    {
      "title": "rest and renew your sole",
      "text": "i recently may 10 2011 stayed at the percy and my experence was aw inspiring i need medical testing done i recieved a not so great turnout but from the moment i stepped into the door until i had to leave i was treated like like i was family from the late nite soul healing chats with callie to davids amazing lunches i felt like a warm loving embrace my sister also came with me and felt much better when we left so even if you can only stay one night i urge you to book your soul  healing mind bowing experence at the percy you will not be disapointed  i am going back with my teenage daught for a mother daughter weekend and i cant wait",
      "rate": 5.0,
      "tripDate": " May 2011"
    },
    {
      "title": "Visit with our Son",
      "text": "The Percy's Bed and Breakfast made our visit to Toronto very special. We were greeted as if we were family from afar. The hosts Kali and David made our stay very enjoyable as they are very warm and caring people. They created beautiful breakfasts (picture of  one of their beautiful creations) for us daily including fresh baked goods and great fresh ground coffee and teas. As if this were not enough when we arrived after a fun filled day, they had prepared fresh baked goodies with fresh lemon water for us to enjoy, very thoughtful ! We have been on many Cruises and this food and service was as good if not better. We could not have asked for better accomodations. Thanks to Kali and David, we had a wonderful visit !",
      "rate": 5.0,
      "tripDate": " June 2015"
    },
    {
      "title": "Very Good",
      "text": "Great place...we just walked over from hotel after a 15 hour drive...there is not a dress code but we would have loved liked to have been dressed differently rather than shorts & tee's...crossiants with honey butter YUM...Great atmosphere!",
      "rate": 5.0,
      "tripDate": " July 2015"
    },
    {
      "title": "Superb Bed and Breakfast",
      "text": "Our family (2 adults and 2 teens) stayed here on a road trip through Canada and New England in July 2014. The accommodation was one of the highlights of the 4 week trip. Since we had booked both rooms, Kali and David had relocated for the duration of our stay, allowing us their home to ourselves. However, they would come around in the morning to make the most wonderful breakfasts and have a chat, giving us hints and ideas on what to do in Toronto.Kali and David are excellent hosts and share with you a great home where you are welcome as a friend. We'd definitely stay here again next time we come through Toronto.",
      "rate": 5.0,
      "tripDate": " July 2014"
    },
    {
      "title": "Amazing couple with an amazing home!",
      "text": "My fiancé and I stayed at the Percy on a Saturday night in May for a \"stay-cation\".  Being Toronto locals we were happy to feel right at home with Kali and David.  Their home was incredibly clean, with unique and modern decor.  The company for breakfast is what has put this B&B over the top!  We could not have asked for a more delicious breakfast (thank you chef David)! Kali and Davids company felt like that of old friends-  what interesting and warm people!  Can't wait for another stay at the Percy!",
      "rate": 5.0,
      "tripDate": " May 2014"
    },
    {
      "title": "Beautiful oasis in the downtown - super attention to detail",
      "text": "My partner and I stayed here for one night while we were in town for a family event - and couldn't be happier with the welcome we got at the Percy. The B&B itself is stunning, renovated from top to bottom with funky-but-welcoming decor and all the little touches to make you feel at home (right down to house label bath amenities!) and spoiled (rain shower, bathrobes, espresso!). The whole spotless townhouse is cleverly designed to make the most of every inch of space, and feels at once cozy and modern. The beds are super comfy to ensure a good night's sleep before a great homemade breakfast. Location-wise, everything is close at hand, including access to streetcars to explore the city, but the B&B is enough off the beaten path to feel really relaxing. Can't wait to return!",
      "rate": 5.0,
      "tripDate": " August 2011"
    },
    {
      "title": "Wonderful place with awesome hosts",
      "text": "We had a lovely stay for 3 nights at the Percy. It is completely renovated and beautifully furnished and provided  indispensable special touches like bath robes and closet space.The hosts were the best part of the experience of our stay here. They went out of their way to make us comfortable and they even prepared vegan breakfasts for us as we are vegetarians. The hosts, Kali and David were so warm and friendly that we look forward to staying at the Percy whenever we are back in Toronto.",
      "rate": 5.0,
      "tripDate": " August 2011"
    },
    {
      "title": "A little oasis in the downtown desert",
      "text": "My partner and I wanted a little staycation in the city and liked the online vibe of the Percy. We loved the decor and cozy feel of the place and the breakfast was above and beyond our past B+B experiences.Loved the exclusive tenants concept. The very European-style backyard was a bit close to the expressway but all in all- a charming little getaway.",
      "rate": 4.0,
      "tripDate": " May 2011"
    },
    {
      "title": "Funky and fun - great pad for hanging out in Toronto",
      "text": "The Percy is a funky, fun space that has obviously been thought out meticulously.  Despite the small size, everything is functional and if you are a design junky you will love the aesthetic.  The beds are super comfortable and breakfast was delicious.Also - the location is quiet and yet perfectly central for downtown, and all the major sites.  The streetcar that runs by the top of the street has you downtown in minutes.We had a great stay, and have already recommended this to friends who are heading to Toronto this summer.",
      "rate": 5.0,
      "tripDate": " April 2011"
    },
    {
      "title": "A cottage in the heart of downtown",
      "text": "The Percy's a winning bet if you're doing business in the downtown core. I was a guest for three nights in early April and despite it's proximity to Bay St, staying at Percy feels like a getaway to the maritimes. It's short cab or streetcar ride downtown, or a quick walk if you feel like seeing a bit of the city during your stay. Kali and David were the perfect hosts. Attentive without being overbearing, they gladly accommodated my early mornings, and left a fridge well-stocked with breakfast necessities. I had the calm and privacy of a conventional hotel without the depressing anonymity. The space is warm and exceptionally well decorated. I was also very well directed to local restaurants which, being slightly outside the downtown core, I wouldn't have discovered on my own. Overall it's a terrific stop for the business traveller looking for sophistication, character, and calm. A terrific find!",
      "rate": 5.0,
      "tripDate": " April 2011"
    },
    {
      "title": "The Perfect Get-Away",
      "text": "My Wife and I visited Toronto for a four day \"get away\" at the beginning of April. Staying at The Percy is like staying at your own individual luxury hotel. We were glad when it rained on one of the days as we had the perfect excuse to stay in all day and really enjoy this little gem.  The Percy is on a delightful and  quiet street and is immaculate inside.  The beds are very comfortable and we had total privacy,  only seeing  the owner, David, at breakfast time when he prepared fresh  and amazing fare, a real treat for the taste-buds. Great hosts, great location, great place. We will definitely be back.",
      "rate": 5.0,
      "tripDate": " April 2011"
    },
    {
      "title": "Hidden treasure in the big city",
      "text": "Our family recently spent a weekend at the Percy. Not only was the B and B well appointed and all we could hope for, the hospitality of Kali and David made us feel very much at home. The food was amazing and the breakfast conversation stimulating. We all hada great time and would heartily recommend it. We will be returning!",
      "rate": 5.0,
      "tripDate": " December 2013"
    },
    {
      "title": "Expections - exceeded",
      "text": "Recently spent 3 weeks at the Percy B&B in Nov.2013.  We could not have made a better choice to suit our needs.  We like to have all the comforts of home when travelling (we are spoiled) and The Percy supplied them.  Also, lots of extras to enjoy ...too many to list.  Only regret is that we didn't get to spend enough time with Kali and David (our fault for being too busy).   As hosts, they could not have done a better job.  We are looking forward to returning for more marvelous muffins, quiche and a leisurely breakfast with Kali and David.",
      "rate": 5.0,
      "tripDate": " November 2013"
    },
    {
      "title": "A Great Stay",
      "text": "We recently stayed at The Percy and had great experience.  The place was clean, quiet and nicely decorated.  Kali and David were exceptional hosts.  Not only would my wife and I stay their again I would recommend it to anyone looking to stay in Toronto. It was everything we expected and more.",
      "rate": 5.0,
      "tripDate": " July 2013"
    },
    {
      "title": "A Delightful Stay",
      "text": "Hosts Kali and David are beautiful people who are genuinely interested in meeting people and providing them with a home away from home.  My partner and I were there for just under 24 hours for a \"stay-cation\" and we felt as if we had known the two of them for years.  They are both so open and authentic. The B and B is a renovated house (circa 1860's) located on a small lane way in the historical district of Corktown.  While the house is small, David and Kali have ensured that there is lounge space in which guests can relax before or after outings in the city. All the comforts are available and the house is organized and very clean.  Great location in an up and coming part of town and a short streetcar ride or a moderate walk into the downtown core and many sights and places of interest.",
      "rate": 5.0,
      "tripDate": " April 2013"
    },
    {
      "title": "A fantastic stay",
      "text": "I stayed at the Percy for 2 weeks while on Business in Toronto.  Kali and David where absolutely fantastic and thoughtful hosts.  A day after I checked in, I got sick with a terrible flu and Kali  kindly offered to pick up medicine for me.  The house is extremely comfortable, and contains everything you need to feel at home.  The Percy is situated on a very quaint and quiet street in a safe area of Toronto.  The King Streetcar is less than a minute away and takes you downtown in less than 10 minutes. The hosts provided great restaurant recommendations in the area. Fusilli restaurant on Queen Street (a couple of blocks away) had one of the best past dishes I have experienced in a long time.  The space is also a 10 minute walk from the Distillery District where you can find many unique shops and galleries.  The St. Laurence Market is also only a few minutes away where you can shop for Fresh produce and meats, or stroll through their Sunday Antique Market.  I highly recommend the Percy.  Thanks Kali and David for a lovely stay.",
      "rate": 5.0,
      "tripDate": " January 2013"
    },
    {
      "title": "Ashot Zohrabyan @ Family , ARMENIA",
      "text": "\"The Percy\" B@B is located at few meters from the Sumach street car stop, taxi sevice, food markets on the Front and Qeens Strs. and amazing Market with seafood and different fresh fruits and vegetables. Only walk distance to all Downtown public amenities. The owners are two kindly peoples. The service was best. Freezer was full. At Percy you fill like at home: use washer, dryer, kitchen, phone, Wi-Fi, TV, backyard. Good design and furniture, fantastic windows and outdoor. You don't need to  keep any key. Just need remember four digits (as you set) and you are safe. The owners had many attentions for our all problems. In case we need support  they provided every kind of care and informations. We went together to have dinner, talk about meny different thinks and practice our english. Be sure it is the BEST choice for you!",
      "rate": 5.0,
      "tripDate": " October 2012"
    },
    {
      "title": "Every Detail",
      "text": "The owners of this B&B thought of every detail possibly to help make guests' stay perfect. We had our family of 5 stay there for 1 week and it was like being at home. It was a truly wonderful and affordable option for us. The location was great too. Walking distance, or a very quick streetcar ride to most attractions. I highly recommend The Percy for anyone coming to Toronto.",
      "rate": 5.0,
      "tripDate": " September 2012"
    },
    {
      "title": "Awesome place!!!",
      "text": "Kali and David made our two visits to Toronto such a nice experience that we are already planning our next visit.  The house is beautiful, well located not far from downtown Toronto.  A warm and very convenient place.  Kali and David really do their best to make you feel not only welcome, they want you to feel you're back at your home and they succeed at it.  Highly recommended for a couple or group or friends looking for a great place to stay in Toronto and enjoy their B&B as a place where they can also cook a nice meal and relax.",
      "rate": 5.0,
      "tripDate": " April 2012"
    },
    {
      "title": "Amazing place, incredible people.",
      "text": "Firstly the pictures do not do this beautiful place justice. From the moment you walk in the mood lighting frames a stylish and elegant home. This place feels like a home away from home, Kali and David are wonderful and gracious hosts who made me feel like a friend rather than a guest.Delicious food which was specifically catered to my likes, little touches like organic body wash to home made preserves create an enchanting and unique environment. Lovely bed and a great shower completed a great stay.The Percy is in the oldest neighbourhood of Toronto and is within walking distance of everything the city has to offer.Without hesitation would recommend you stay with Kali and David. The best b&b experiance i have had. I was truly sad to leave.",
      "rate": 5.0,
      "tripDate": " March 2012"
    },
    {
      "title": "Home Abroad",
      "text": "The Percy Bed and Breakfast is more than one can ask for.  A bed and breakfast are the bare bones of my experience.  Kali and David are warm, friendly and more welcoming than most family (of which mine is great).  They are very engaged and receptive, always ensuring that you are taken care of... offering great ideas of things to do and allowing you to share in their Toronto life.  Staying in this bed and breakfast felt like living at a home.  The whole house is open to you, books, movies, the freedom to cook your own meals, and last but not least a family of friendly feral kitties that graciously share the backyard with you whilst providing ample entertainment with other wildlife.  Last but not least, Kali and David are extremely accommodating with meals, always ensuring your culinary tastes are met.I stayed for ten days during the Toronto International Film Festival, ten days in which I felt so at home the only reason I knew my stay was over was because the festival ended.Amazing stay, amazing experience... I look forward to my next stay with my new friends.",
      "rate": 5.0,
      "tripDate": " September 2011"
    }
  ]
}