{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "The Avalon",
    "url": "/Hotel_Review-g155019-d8804431-Reviews-The_Avalon-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.5",
      "reviewCount": 42
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "574 Sherbourne St",
      "addressLocality": "Toronto",
      "postalCode": "M4X 1L3",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0b/f3/6c/89/the-avalon-tourist-suites.jpg?w=500&h=400&s=1"
  },
  "description": null,
  "featues": [
    "Free High Speed Internet (WiFi)",
    "Internet",
    "Non-smoking hotel",
    "Air conditioning",
    "Desk",
    "Iron",
    "Wake-up service / alarm clock",
    "Coffee / tea maker",
    "Kitchenette",
    "Bath / shower",
    "Complimentary toiletries",
    "Microwave",
    "Refrigerator",
    "Kitchenware",
    "Hair dryer"
  ],
  "reviews": [
    {
      "title": "Good location but a couple of disappointments",
      "text": "We stayed at the Avalon for 4 nights in July 2016. We found the hotel fine and it's very close to one of the subway stations too. The instructions for gaining entry all worked fine and the hotel is keyless which was helpful. The hotel is in a converted house and has loads of character, some real care and attention has gone into designing it. The room was on the first floor and was decorated nice. It had a little kitchen with fridge and microwave, plus plates etc. There was also a TV and air conditioning. The rooms are generally fine, however the issue we had was with the bathroom as it isn't a sealed room and the door doesn't actually close, so you can see and hear anything that might happen in there. This caused a little logistical issue at times but we found a way around it. Also generally you can hear everything else that goes on in the house. The sound really travels from room to room and around the corridors too. It was clean and tidy and had a good location so generally we were happy with it. However the above points did just knock it down a little for us. There is also a supermarket nearby, plus a place for breakfast and the place has WiFi.",
      "rate": 3.0,
      "tripDate": " July 2016"
    },
    {
      "title": "Great place, close enough to downtown Toronto",
      "text": "Looking for an affordable place not too far from Toronto city centre i found this place. Really liked the idea of having a studio instead of a hotel. I was not disappointed. It's quite easy to reach by public transport. Sherbourne station on subway line 2 is only a 2-minute walk from the studio. Supermarket is also around the corner.A few days before arrival you receive instructions with codes to checkin. Worked perfectly! The studio itself was pretty small but had everything you need: A good bed, great shower, big tv (didnt use it), microwave etc. Only thing i missed a bit was a good chair to sit on plus a small table. I had my dinner sitting on the bed. But i'm not complaining, i would recommend this place to everyone!",
      "rate": 4.0,
      "tripDate": " September 2017"
    },
    {
      "title": "Average",
      "text": "The rooms were clean but need some maintenance. The stairs to the rooms are narrow and the carpet needs a good clean. We stayed in the deluxe suite which had a spacious living area but the bedroom and bathroom were tight. It would've been good to have some bedside tables in the bedroom. The bathroom was ok but could've done with a mat outside the shower.",
      "rate": 3.0,
      "tripDate": " September 2017"
    },
    {
      "title": "The Dungeon",
      "text": "I booked this hotel for my parents to stay as they were on a budget. The pictures looked fine. Read other reviews it seemed fine. It was not even close to fine. They stayed in the \"Kelly Suite\". My mum calls it the dungeon. To start with they asked the cleaner to show them how to work the washing machine. You insert 6 quarters and use as normal she said. She did not explain that there is a drawer to pull out to get your money back, is your maid taking money from every guest who stays? Doesn't seem like much but for a few guests every single day it would be quite the tip jar. The room was dirty even after the cleaner had just left. The tv didnt work. One of the chairs in the room was broken. They heard scurrying in the roof above them at night obviously rats or something. The room was so sloped and tiny that my dad couldn't stand upright. All in all it very close to ruined my mums holiday. DO NOT STAY HERE.",
      "rate": 1.0,
      "tripDate": " July 2016"
    },
    {
      "title": "Absent staff",
      "text": "With hotel prices very high in Toronto, I booked this apartment for three nights. The Avalon is a 45 minute walk away from downtown or 20 minutes by public (line 1) transport. It all started well. I had an early flight, so arrived at the apartment at 2 pm knowing that check-inn wasn’t till 4 o’clock. But the entrance code to the building send to me by mail worked, so I entered and went up two narrow stairs (I carried only a small bag, but these stairs will certainly be difficult to navigate with larger bags) to see if I could drop off my bag and head into the city. I was met by a lady who was cleaning my room ((Kelly Studio) and she reminded me that check-inn wasn’t till four (fair enough), but let me drop-off my bag anyway and even was kind enough to show me around the room and bathroom and explain how everything worked. Room and bathroom were clean and large enough, but because this room was in the attic with a sometimes very low ceiling decending, space was limited. I thanked the lady for the tour and went into the city. This was the last time I encountered any of the staff during my stay. Upon return, I noticed that some of the wood of the bed supporting the mattress was lose. I send a mail to the same address that I had received my instructions from and a separate text to the telephone number in this mail asking the staff to fix this. But I never got any reply. I have stayed in apartments without a reception before, but the staff there always could be reached. Not so at the Avalon. I ended up having to get down on the floor and repair the bed myself. The apartment showed some signs of wear and tear and the floor board is in desparate need of a lick of paint. The building is old, made of wood and therefore badly insulated, so any noise can be heard. In the night I could hear animals (rodents?) walking above me. Ammenities like television, airconditioning and shower were working alright. There is free Wi-Fi, but the signal is weak and I had to connect my device again and again to use it. A couple of times my neighbours woke me up in the mjddle of the night with loud music and shouting. Inconsiderate guests are everywhere, but the absence of staff means that they can not be corrected. Fortunately there wasn’t an emergency, because there is no call back after leaving a voice mail message and no one replies when you send a text or e-mail. If you run a business, you should have some way of being available to your customers. The staff at the Avalon is not.",
      "rate": 2.0,
      "tripDate": " June 2018"
    },
    {
      "title": "Best of the worst award 🥇 Rude staff. Terrible service. Small room. Unfriendly.",
      "text": "I booked this room months in advance and they gave me the worst room in the building in the attic  with inclined ceilings, the whole area was smaller than the other rooms, there was no space to take a shower, water was always on the floor, the bathroom sink is so tiny you cannot even wash your face, you are going to get all wet on your feet. Wi-Fi and the shower was out of function for few days and when I asked the owner if he’s going to give me any rebate for that, he never answered back. Vicky is the one in charge on the property looking like a psycho. They don’t provide extra towels unless you provide the reason why!! I felt like a child controlled by his mean parents or a Prisoner.  Location wise it is 30 minutes walk from Eaton Center. I killed two insects in the room, one of them was a big spider and the owner told me it’s normal because it’s an old building. He claimed he told Vicki to send me spray to kill the insects but I never had any delivered.  The owner was nice enough to provide me late check out though. They hang from the ceiling a huge big TV over the bed so if you don’t like to have anything hanging on the wall while sleeping this is not the place for you.  I cut my finger as opening the door with their bad location of lock and  door knob, I let them know, they did not do anything about it.  So if I was you I would stay somewhere else .I attached few pics so you see the quality of the room.",
      "rate": 2.0,
      "tripDate": " May 2018"
    },
    {
      "title": "CRIMINAL ENTERPRISE.... STAY AWAY!!!!!",
      "text": "This property lies and tries to cheat people out of their money... stay as far away as possible! I booked to stay at this property on booking.com and unfortunately had to cancel my travel plans. I called them to cancel my plans in advance and their refund policy stated that I should receive most of my money back by cancelling prior to the date of check-in. They still charged my credit card the full amount, and I am now involved in a dispute to get my money back as they lie and pretend that I never cancelled though their agent confirmed it directly over the phone several times. They do not answer phone calls, and seem to have some random shady agents working for them. There seems to be miscommunication among whoever is working there. Whenever I have spoken with them over the phone, they have no customer service skills and it seems to be some random guy whose name shows up on my call log like he is calling me from his own cell phone. I don't even think they are a true company. There are much more reputable and trustworthy places to stay with much better customer service. This place is a sham and I would recommend avoiding at all costs.",
      "rate": 1.0,
      "tripDate": " January 2018"
    },
    {
      "title": "not nice",
      "text": "Had problems with the shower, couldnt contact anyone to help us. No Iron or ironing board when we needed it, had to wait till the following day. Cleaners were unpleasant and rude. Had to ask for clean towels and noone emptied rubbish or took away towles used. They were left to pile up in the bathroom.",
      "rate": 1.0,
      "tripDate": " September 2017"
    },
    {
      "title": "Average",
      "text": "Stayed for 2 nights while strolling in Toronto .  It´s an old building that need some restauration specially on the outside . Inside looks much better , rooms are not so big , but enough for a short stay . Even nicely decorated and clean , again , the rooms as well need maintenance/restoration . The stairs are VERY narrow , may be a problem for the elderly , or if you carry large/heavy bags . Parking is on the street , you must buy a permit . I went in low season and I had no problems at all in finding a space , but in high season surely is a pain . The owner is very kind and helpfull , whatever you need . Average price , good  cost/benefit relation .",
      "rate": 3.0,
      "tripDate": " April 2017"
    },
    {
      "title": "Everything was good but after service was terrible.",
      "text": "We stayed 3nights at the Avalon Suites everything was good. Room was clean and nice specially It's very close to one of subway station only takes 3mins by walk. During 4days never changed towels.When I came back home realized I left something in the room. First time I tried to call them but no answers so I contacted by email  I'll pay delivery fee and they said will send it. I though I live in Canada so may be it takes 2weeks. But Still i didn't get it. I contacted with him a month ago. I really want to contact them so I sent email more than 5 times and call , they just keep ignore me.I already told him that is really important to me but they keep ignore. No reply emails and call.I can't trust Avalon suites at all.",
      "rate": 1.0,
      "tripDate": " April 2017"
    },
    {
      "title": "Really cool little place!",
      "text": "Room was spacious and very clean. Stairways are a bit battered but it kind of adds to the charm. Decor is really good! Parking was a nightmare but that's nothing to do with the apartments itself and Tony the owner was really helpful.",
      "rate": 5.0,
      "tripDate": " December 2016"
    },
    {
      "title": "OK but could be a lot better",
      "text": "4 stars for the very convenient location (2 min walk to metro station, eateries and grocery store) and room facilities eg. kitchenette. But one star knocked off for the ill-fitting bed.Stayed 3 nights in a standard studio (Brando) on the 3rd (top) floor at Avalon Suites. The accommodation is more like a type of airbnb place than a guesthouse as it's self-service - you are emailed door security codes before arrival and don't actually meet anyone though you can email or phone the owner if necessary which worked out fine for me.The room was cosy for 2 people but had space for a sofa and small coffee table. The general decor of the property is nice but there are bits in the room which seem unfinished/DIY eg. bathroom door had an old metal back and can't close properly as it pushes right against the wash basin top, unfinished skirting board, no grouting between tiles etc.  The furniture also starting to show signs of wear and tear. The two bedside shelves leaned forward so anything you put on it slid off.No housekeeping in the room during my stay which was not a problem for a few days except that I like the bin to be cleared daily so I ended up taking it to the outside refuse bin myself on the third day.The main negative for me was the bed. It was creaky and the mattress was too big for the bedframe - about half a foot too long and too wide.  So I had to take care not to lean on the edge, which was difficult when you get up in the middle of the night as the space on one side of the bed is tight with wire baskets next to it.  The room has no window, just a bare roof light above the bed - a blind would have helped to block out the morning sunshine.I can only feedback on the room I stayed in, not sure what other rooms are like.  In summary, there are definitely a number of improvements that would make the accommodation a lot better but I don't think I can really complain because it met our basic requirements for a short stay and was value for money given the downtown location and the relatively low price for Toronto.",
      "rate": 3.0,
      "tripDate": " October 2016"
    },
    {
      "title": "Great stay at the Avalon Tourist Suites",
      "text": "The Avalon was confortable and secure and everything was well organized inside the Taylor Studio we rented for 10 wonderfull days. Although it is located near where downtown ends, the Sherbourne station is just a few steps and it is also within walking distance of bus stops that provide access to either side of the fantastic city of Toronto. In our case, we didn't need to use the help of the staff because they provided us a contact for any need. Before our arrival, everytime we needed something, we received a satisfactory response. Just days before reaching the hotel, the staff provided us with a path and entrance code to access the hotel. If you plan to visit the city of Toronto and staying at this hotel I encourage you to use Google Maps and explore its surroundings so that you can make the most of the things that are nearby. If you like nature an animals, just a few steps ahead you'll find The Riverdale Farm which is located in Cabbage Town.I hope you enjoy your visit at the Avalon.",
      "rate": 5.0,
      "tripDate": " July 2016"
    },
    {
      "title": "Average but a few unacceptable flaws",
      "text": "There were no blinds on 4 out of 6 windows so woke up when the sun came up. The TV hangs from the ceiling and banged head twice on it. The shower has a knack to use it, we needed to email on instructions on how to work it. Someone came into out room on the first night as we lay in bed due to the owner giving someone else the entry code by accident. The area is ok but of you walk down towards the city you will come across crack houses and dodgy looking folk. There is nowhere secure to leave luggage, the owner says just to leave it in the reception room but this is unattended.",
      "rate": 2.0,
      "tripDate": " June 2016"
    },
    {
      "title": "Wonderfull Moments",
      "text": "We have visited Toronto this year and we were hosted at the The Avalon, was a very nice experiend, the suites are wonderfull and the roll building is fantastic and also close to the metro station and the reception is very friendly",
      "rate": 4.0,
      "tripDate": " April 2016"
    },
    {
      "title": "Affordable and comfortable accomodation in central Toronto",
      "text": "We had an excellent stay at the Avalon Suites and highly recommend it to travellers visiting Toronto for about a week or so. The location near Sherbourne station is convenient for subway travel across the city as well as walking to Jarvis, Church, or Yonge.We stayed in the Superior Double Studio. The room was excellent. The kitchenette had the basics that we required to make a few simple meals and the apartment's proximity to NoFrills and Shoppers made it easy to quickly get groceries. The bed was very comfortable and the shower was luxurious. The management and housekeeping were very responsive, attentive, helpful and accommodating. Tourist information for Toronto was provided in the lobby and our room. Using codes to access the house and room was easy and it was nice to avoid having keys. All of the services were exactly as described on their website and I would certainly stay here again or recommend the Avalon Suites to others travelling to Toronto who want a reasonably-priced comfortable urban stay.",
      "rate": 5.0,
      "tripDate": " January 2017"
    },
    {
      "title": "Very nice!",
      "text": "This guesthouse is located at a classical building, a short walk from subway station Sherborne. We received mail from owner, it gave us detailed information about self check-in. The room is named by movie stars, & there is a drawing room in the same floor. The room is separated two parts, one part, one can use desk for business or rest on sofa, the other part is the bed. Also there is a small kitchen for guest to prepare snacks. The bed is comfortable, the owner prepared coupon for a nearby restaurant, guest can get discount. If you are not seeking the high end hotel, this guesthouse is a good choice.",
      "rate": 5.0,
      "tripDate": " October 2018"
    },
    {
      "title": "Fair enough for the price ",
      "text": "Don't expect shining new decor or whiz bang facilities,  do expect a place with character and all you would need for a short stay. Longer stays may prove claustrophobic but we found it to be an honest representation of the price paid. The house keeper took plenty of time to show where everything was and how it worked. Recommended for short stays.",
      "rate": 4.0,
      "tripDate": " August 2018"
    },
    {
      "title": "Guest house close to downtown Toronto, with good facilities",
      "text": "My husband and I spent 3 nights at this guest house and we were not disappointed.The subway station is about 150m away. Downtown (Union Station) is about 30 min walk away. The guest house has self contained bedsit rooms, plus there is a common sitting room. There is information about the city and the immediate locality.Although it did not trouble us, and we were aware on booking- there are stairs and there is no elevator.We would stay there again if we visit Toronto again.",
      "rate": 4.0,
      "tripDate": " May 2018"
    },
    {
      "title": "Nice place",
      "text": "The location is very good. It's downtown just 2 blocks from a metro station. Room was clean and nicely furnished.  Bathroom was clean also. Soft, fluffy towels!  Stairs are steep and can be difficult to navigate with suitcases.",
      "rate": 4.0,
      "tripDate": " April 2018"
    },
    {
      "title": "You pay for what you get",
      "text": "This hotel is quaint, the decor is very bright and interesting which is why we booked it. It’s unmanned which is a little disconcerting but it was easy enough to get in and up to our room. The room itself was as colourful as advertised! Nice and clean and warm. The bathroom had obviously been updated recently and the shower was hot and had good pressure. The floor in the main part of the room was original which basically just meant it was super squeaky! One of the lights was one a sensor we couldn’t work out how to turn off which basically meant if you got up in the middle of the night the combo of light and squeaky floor would wake anyone else up!The walls were also quite thin and we could hear people moving around outside the room and in the next room.Still, overall, not a bad couple of nights",
      "rate": 4.0,
      "tripDate": " March 2018"
    },
    {
      "title": "Convenient",
      "text": "It is clean and tidy, and when we had a problem with a blocked drain it was promptly fixed.  Convenient to city, we walked as not a lot of parking in city.  Walking took us about 40 minutes.The negatives are the lounge was uncomfortable, carrying our bags up 2 flights of stairs was difficult, parking was awkward, with only paid street parking available.  The cooking facilities were minimal, although some utensils were supplied there was no stove top or pots/pans to use them.  The apartment was noisy with the sound of squirrels in the in the walls & ceiling and snoring from neighbouring apartment.",
      "rate": 3.0,
      "tripDate": " October 2017"
    },
    {
      "title": "Disappointing stay in Toronto",
      "text": "Prior to the stay I attempted to contact the hotel to discuss the parking situation and my calls were roundly ignored. I attempted to do this on a number of occasions and got nothing but an answering machine and never received a call back which is frankly a fairly unacceptable level of service. I was incredibly disappointed that the hotel had listed itself and appears under searches specifically requesting parking as this is frankly not the case at all. The 'parking' that the guest house 'has' is simply a very run down public car park further down the road which was fairly expensively priced and had very little security which meant an anxious stay wondering if our car would still be there in the morning. Frankly I was astounded that the guest house lists itself as having parking at all and believe this should be more adequately described on the expedia page and they should remove themselves from the search criteria for having parking as a facility as this is untrue and would stop anyone else being duped as we were. We were given the Dietrich suite which at first did seem nice and had adequate storage and a kitchenette. However the quality we soon saw to be fairly poor. The ceiling was peeling with falling paint and the shower did not work. We were presented with at first glance a very modern shower with 2 heads and side jets. However the only part that worked was the jets which meant my thighs got a reasonable wash but little else. Overall I would not return.",
      "rate": 1.0,
      "tripDate": " November 2017"
    },
    {
      "title": "Disapointed but has potential",
      "text": "We found this Guest House, a few weeks before departure to Toronto via Hotel.Com. About a week prior to our departure, we received an email stating that we should receive an email with our access codes to get in the building and our room. We never received such an e-mail. The day prior our departure, we sent a first email to obtain these codes but did not receive a reply. I send another email while on our way to Toronto and this time we were given the needed codes as there is nobody to receive you. We arrived late at the Guest House, only to discover the room had not been cleaned after the previous guest had left. After sending an email to the contact person, we were told to use a different room located on the 3rd floor but just for the night. The Dean Room (every room is dedicated to a movie star). This room was not bad. Some issue I had with it was that at some places in the room, the ceiling was coming quite low. The TV is located midway above the bed so you basically have to be lying down in the bed to watch tv. There are no curtains for the shower so it is hard not get the floor wet. Coming back from breakfast the day after, we saw the cleaning lady working in our original  room. Not long after, she told us it was time to move back to our other room (Dietrich) as she needed to clean this one (Dean room). Apart from some water damage seen on the ceiling, it looked ok. More scrubbing would not hurt. Getting in the shower the day after was very disappointing. Basically, only the body jets were working with a very faint drip coming down from the wand. Asking to get access to a room with a working shower, we were told that no other rooms were available and that at some point a plumber had somehow fixed the shower so that both the jets and wand were working. They are also expecting a replacement part to fix it at some point but not while we are there. If the room does not have a working shower, why rent it? As for being a full house, as someone else points out in its review, we can hear neighbours and it did not look like there were a lot of people in the building. As far as security, I would not leave any valuables in the room as I don't believe the access codes ever get changed. Some good points are close to little shopping mall with Grocery store. Close to Shoppers Drug Store. There is also a small Breakfast and Lunch place close to it.With all the problems we had, I would be surprise that we go back to this place.",
      "rate": 2.0,
      "tripDate": " November 2017"
    },
    {
      "title": "Packed with Charm",
      "text": "We stayed 2 nights at The Avalon for our 5 year anniversary. The building is quaint and has a lot of charm. We stayed in the Marilyn room. It was perfect for our needs, we enjoyed the kitchen that was stocked with everything you would need for a simple breakfast. The shower was awesome and things were clean. Don't think it's a luxury type of stay however, its pretty rustic and the walls are a bit thin. We loved that you could check in and check out easily with a keypad as we arrived pretty late the first night. It's really close to the metro too so it was pretty convenient. If you like quirky and interesting places to stay, this place would work for you, plus SO affordable.",
      "rate": 4.0,
      "tripDate": " January 2017"
    }
  ]
}