{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "The Parkway Place",
    "url": "/Hotel_Review-g155019-d6772841-Reviews-The_Parkway_Place-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.0",
      "reviewCount": 24
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "501 Oriole Pky",
      "addressLocality": "Toronto",
      "postalCode": "M5P 2H9",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0a/7f/25/7a/20160227-200559-largejpg.jpg?w=500&h=-1&s=1"
  },
  "description": null,
  "featues": [
    "Paid private parking on-site",
    "Free High Speed Internet (WiFi)",
    "Wifi",
    "Non-smoking hotel",
    "Shared kitchen",
    "Laundry service",
    "Air conditioning",
    "Kitchenette",
    "Refrigerator",
    "Family rooms"
  ],
  "reviews": [
    {
      "title": "Last Minute Stay",
      "text": "It was a last minute decision for my boyfriend and I to stay at the Parkway Place. I was skeptical at first because the only room available had a shared bathroom, so I brought my flip flops to wear in the shower just in case. We were greeted by the owner (I forgot her name) who was very friendly and made us feel at home. She gave us a tour of the common area, the bathroom and our room. I was plesantly surprised at how clean everything was, since I'm very picky about cleanliness. We stayed in room 2A which is perfect for solo travelers and couples. It had its own TV, a small walk in closet and the room was sound proof. The WiFi was good and there's free parking at the back. I would definitely stay here again.",
      "rate": 4.0,
      "tripDate": " February 2016"
    },
    {
      "title": "Cheaper option with questionable business practices",
      "text": "They are not straightforward regarding payment and are not running a 'hotel' in the conventional sense. It looks much more like someone is trying to run a quasi-airbnb while avoiding paying the airbnb fees and business taxes. They require a 200$ deposit in addition to the room fee, which must be paid in full upfront. The staff on site first told us that they accepted debit, credit cards or cash for payment. We said we preferred credit.  However, he then said he needed to speak with his manager and after texting with someone for a bit, he then informed us that they could only accept cash or etransfer because their debit machine 'does not work after 3pm'. Right. It all seemed very sketchy. After we sent the etransfer which included both the damage deposit and room payment, the manager kept hanging around and knocking on our room door. We had to ask them to leave us alone, which I've never had to do anywhere else, even in hostels. There is very little regard for privacy, customer convenience, or standard business practices in this place. While it is a good value compared to other nearby options, I would not recommend giving money to people who run their business this way. They definitely give the impression they are doing something that is illegal or at least a bit shady.",
      "rate": 2.0,
      "tripDate": " April 2018"
    },
    {
      "title": "Good location north of downtown Toronto",
      "text": "My wife and I wanted a moderately- priced overnight accommodation in central Toronto near the Granite Club. Our room at the Parkway was modest but clean and well- equipped. The host was friendly and very helpful in pointing out features we needed( banks and small places to eat), and these were plentiful and nearby.The neighbourhood is pleasant, and on- street parking is available. If you do not need or desire conventional motel/ hotel type accommodation, the The Parkway is a very good choice.",
      "rate": 4.0,
      "tripDate": " November 2015"
    },
    {
      "title": "WORST HOTEL STAY. EVER.",
      "text": "WORST. HOTEL. NIGHT. EVER.I wrote the review below the -- line before going to bed, and i am compelled to come back and update you all on my experience over the last few hours. Basically, you have a choice between leaving the window open and sleeping (and I use that term lightly, because I got about 90 minutes of sleep) with the noises on Eglinton, or closing the window to get some quiet and having to breathe in stale, disgusting, foul smelling air. The standup fan doesn't help at all, merely circulating the stale, disgusting, foul smelling air around. Another guest, with whom I am SHARING A BATHROOM (surprise!), is sleeping with his door TO A COMMON AREA partially open... possibly due to similar smells. (I'd take a photo, but that'd be creepy...)The woman I met on \"check in\", Jane, laughed when she said \"you won't need air conditioning, you'll need a blanket tonight.\" Obviously this is a joke to her and to Frank, presumably related somehow. It's June, Jane. Do you think that you can simply put up some walls, go to IKEA to buy beds and the lowest quality sheets and bedding, and magically call yourself a hotel? No way!! I am pissed off, and that's why, at 5:56am, I am here telling you all about it, because I don't want you to have to live through this ridiculousness. Keep reading for my initial thoughts BEFORE even trying to sleep, on how The Parkway Place lied in the advertisement of their accommodation. --I feel outright lied to. Booked this place on Priceline.com for what seemed to be a good price, but I didn't realize that I was being fed only the information they wanted me to know, namely that the room had a queen bed, free wifi, and access to a shared kitchen. What they left out was that:- the room has NO BATHROOM! I would have to share with another room, but to access the bathroom, and the shower, I would have to walk through the kitchen and common sitting area. - the ROOM IS TINY, barely large enough for the bed. The room measures 8 feet by 7 feet. That's all. - the room has NO AIR CONDITIONING. Just a fan. - the \"flat screen tv\" they advertise as \"featured\" in the room is ONLY 13 INCHES wide. Can hardly see the picture. I showed my wife while we were skyping and she asked me which was bigger, the iPad I was using to talk to her, or the tv. She actually called it a \"larger iPad\". Size matters, folks.NOWHERE on the confirmation does it say anything about a shared bathroom. NOWHERE. When I shared my concerns with Frank Wang, he responded by blaming me for not seeing the mention of shared bathroom. Hmm.. Maybe I didn't see it because it wasn't there. Once again, I have booking.com's confirmation email to prove it. It's possible that they added the shared bathroom mention in the 3 weeks since I booked the room, but it wasn't there when I booked. Again, I have the confirmation to prove it.  Photos don't lie. Anyway, needless to say, I won't be back. And unless you don't mind being squeezed into tight quarters (and forced to spend the night choosing between bad smells or loud noises) to save a few dollars (the Eaton Chelsea is only a few dollars more on Priceline), then I recommend you STAY FAR AWAY from here too.",
      "rate": 1.0,
      "tripDate": " June 2014"
    },
    {
      "title": "Backpack quality at high price",
      "text": "There are no obvious signs pointing you where to check in.  Stairs to main foyer/door are steep and no handrails are available.  Despite booking three weeks in advance, the host(s) where not prepared for our arrival and had us wait for a hour as they sorted out what key went to the doors to our room.  They instructed us not to use the one door as it was wedged closed to cut down the noise of the other guests. We ended up with three keys to use to gain entry to the room. The hosts did not speak english fluently so there was difficulty being understood and understanding them. The host did not provide the internet password upon check in.  They only provided a phone number to be reached at (which could have been long distance if not covered on cell phone plan as there was no phone in room)They watered down the hand soap in the bathroom to the point it did not even lather.  They did not clean the room in our two day stay (garbage was not emptied). Bed was not the most comfortable and had two poor quality pillows.There was no air conditioning available so we had to sleep with the windows open which let in the constant blaring sirens of emergency vehicles, so wasn't very restful. Website misleading as we thought we were getting a mini apartment, but it was shared kitchen and dining.  Food placed in fridge could have been potentially \"shared\" by other guests. So basically for the same amount of money we could have stayed at a hotel and had a mini fridge,microwave, air conditioning and a more restful stay.",
      "rate": 1.0,
      "tripDate": " June 2014"
    },
    {
      "title": "Will never book again",
      "text": "Girlfriends and I booked this for a bachelorette party. We arrived at 5 for check in and couldn't figure out how to get in as every door was locked. Finally got in and they still weren't done cleaning the room (check in was 3). The owner lingered for about 45 minutes in our room after we said we were alright.  The next morning we were told check out was 11am. We were cleaning up and getting ready to leave and one of the owners barged in the room without even knocking at 10:35. She was talking on the phone very loudly and continued to walk around the apartment. We said to her that we were almost ready and she said we needed to go because she had people outside waiting for the room... Even though check in wasn't till 3 and we we're suppose to have the room till 11. I will never go back based on how rude it was when they walked in this morning. No other hotel could you ever do that.",
      "rate": 1.0,
      "tripDate": " August 2014"
    },
    {
      "title": "Home Away From Home",
      "text": "The Parkway Place is our regular place to stay when we visit Toronto. My brother lives very close & I grew up in the area. The location is extremely safe for visitors and has a beautiful family oriented park nearby as well as good restaurants and shopping which is a 15 minute walk to Yonge & Eglinton . Parkway Place is a newly renovated house. Many types of accommodations are available depending on your needs and budget. We prefer a room with a private bathroom but other rooms do share bathrooms. We have stayed in 1a and 2b. Both rooms were lovely with lots of natural light and extremely clean. The beds are comfortable and we always sleep well. These rooms share a 2 communal kitchens which are well equipped. Everyone has a cupboard and space in the refrigerator assigned to each room. We have stayed there twice and have not seen another guest using them.I have read the reviews about management only accepting cash. I cannot speak on their behalf but we always prefer this since we try and keep our credit debts low. You have to remember that this is not a hotel but hardworking individuals running a guest house. If you want to pay high prices with room service then this might not be the place to stay. There is a minimal fee charged for parking ($10) as opposed to at least $45.00 for a hotel. The staff are wonderful!!! We have always had a most gracious welcome upon arrival. They go over everything for you and have contact numbers and Wi-Fi passwords posted. There is a special keypad lock on both outside doors so I feel safe. Just remember the code...lol.  I must address the reviews concerning communication problems. We have never had a problem with this. Like with any business transaction please have \"a meeting of the minds\" . We will staying there again in 4 days which will be our 3rd visit and we are looking forward to many more pleasant stays. If you have questions, the staff will be more than willing to answer any of your questions. It is our home away from home. I always enjoy seeing my new family.NOTE: There is major construction at the intersection of Yonge and Eglinton due to subway upgrades. To get into the subway you have to access it from the southeast corner. This is not handicapped friendly. Stairs going down then up and no escalators or elevator. For visitors that will find this a hardship, my sister-in-law advised me that there is another access south of the subway. Please google the Toronto Transit Commission (TTC) for advice. It might be easier to get on a bus at the corner which go directly into the station. We get 4 bus tokens for $10.We are looking forward to our next visit next week.",
      "rate": 5.0,
      "tripDate": " March 2018"
    },
    {
      "title": "very comfortable and pleasant hotel",
      "text": "The hotel was in good location,  well equipped  with acess to kitchen and dinng room, containing new and clean equipment. The hotel personell were very pleasant and  eager to help with any need.It felt almost like being at home...",
      "rate": 4.0,
      "tripDate": " August 2014"
    },
    {
      "title": "They try",
      "text": "Great for younguns. We retired people used to hotels, not so much. Great location for the bus and subway. Kensington area was pretty neat. Loved the pasta place down in St. Lawrence market. Try out the Fat Lamb.",
      "rate": 3.0,
      "tripDate": " October 2019"
    },
    {
      "title": "Do not recommend ",
      "text": "This is definitely not a hotel or a bed and breakfast. Just a very expensive room with no privacy. First off, be expected to pay up front for your whole stay (I stayed 5 nights) as well as a $150 deposit. I was able to pay credit card though, unlike some above reviews. The room is falling apart. Drywall mud still on walls and clear signs of water damage on ceiling awaiting repairs. I stayed in the deluxe king room with own bathroom. The bed was incredibly uncomfortable to the point I hurt in the morning and hard to get to sleep on at night. VERY hard mattress. You could hear EVERYTHING from inside and outside...no privacy. Also, the shared kitchenette was awkward because the owners of the building sat in there the entire time and made and ate every meal there.",
      "rate": 1.0,
      "tripDate": " September 2018"
    },
    {
      "title": "Do not stay here",
      "text": "We lasted 5 minutes after arrival for a 4 night stay sep 20 to sep 24. The photos on the website were clearly taken the day they opened years ago and it is dirtyPhoto shows gleaming hardwood on booking sites but mine below shows a filthy carpet that represents the cleanliness of the entire unit. For this they wanted 280 a nighUpon arrival within seconds they wanted payment in full and a 200 deposit (clearly those deposits are not being used to clean!). I had no intention of handing over $1000 plus for this dump and the manager who could not explain the difference between the booking photos and the reality was more then happy to see us leave with no cancellation penalty. Luckily I grew up in Toronto and knew of the roehampton hotel and we were able to get in at $189 a nite with breakfast. The Roe is an older hotel but the rooms are comfy and clean and like a palace compared to parkway. I have travelled all over the world on all 7 continents and this is the only total misrepresentation of accommodation we have had and in my hometown to boot. Be warned.",
      "rate": 1.0,
      "tripDate": " September 2018"
    },
    {
      "title": "good place if you do not want a hotel",
      "text": "very clean, very quiet, the staff explain everything about the emergency exits, how to use the premises, phone, internet, access, park everything, very well.the place seems new, it is very comfortable and the room is nice",
      "rate": 5.0,
      "tripDate": " September 2017"
    },
    {
      "title": "Definitely one to avoid",
      "text": "Thought I'd paid online but they don't accept credit cards. Woke us all up at 11pm for the cash. Ruined our holiday.Staff are friendly but rather disjointed. Think that's part of the problem. Can't recommend this.",
      "rate": 1.0,
      "tripDate": " April 2017"
    },
    {
      "title": "Terrible customer service over the phone",
      "text": "This place's customer service is terrible. First, they can't even speak English. Then I spent 30 minutes on the phone, confirming the room's rate, price, and parking. She confirmed $109 for my queen bed with private washroom, and parking overnight. Then I even offered to provide my credit card information over the phone as a deposit for the reservation. She then told me oh sorry the rate is actually $115 because it's a weekend rate and she cannot process it. Then she tells me she is about to sleep and she's very sleepy, so sorry about the mistake. Wow! Seriously? I would not stay at a place with such terrible reception.",
      "rate": 1.0,
      "tripDate": " November 2016"
    },
    {
      "title": "clean, convenient and welcoming",
      "text": "We chose the location due to its proximity to where we had to take our exams. It ended up perfect for our needs.  Was a quiet area, other guests were really nice, everything was clean.  The owner was very keen to see that we were comfortable, in fact, just that day she had installed an A/C in our room that was top of the line and super quiet.(room 2A) We shared a bathroom which wasn't a problem.  Some other rooms had their own. We walked to the subway (10min) and the Eglington bus was only a couple of doors away. Excellent value, will stay again.",
      "rate": 5.0,
      "tripDate": " June 2015"
    },
    {
      "title": "No A/C as noted/VG location",
      "text": "We had one of two bedrooms (room 2A) with shared bathroom. The house type of building is like a Bread and Breakfast without the breakfast. The two shared bedrooms have the use of a nice kitchen and TV seating area. Other higher priced rooms have their own bathroom. Booking.com site shows A/C for this room type but that was not accurate. It is a convenient location about  1/2 mile or about 10 minute walk to Eglinton Subway Station. The owner is very nice and keeps the rooms and all common areas meticulously clean. Similar to a Japan Ryokan or Korea Hanuk, it is shoes off inside the main entry with slippers available for use. Parking is  in the back for additional $10. CDN. Numerous eating places and restaurants at Eglinton intersection and for several blocks east and west on Eglinton. Eglinton corner is about 200 feet north. Has very good Wi Fi signals. The area around is a nice leafy (many trees) established neighborhood of single family and duplex homes with the commercial area along Eglinton Street.  We were lucky we hit a cool weather period otherwise we would have suffered during the summer season when Toronto is hot and humid (like our own Chicago) without air conditioning.",
      "rate": 2.0,
      "tripDate": " June 2015"
    },
    {
      "title": "Excellent accommodation",
      "text": "Very clean, modern and spacious apt with new appliances and comfortable beds. We were a family of four and the two queen beds with an extra cot (extra $25) suited us perfectly.Excellent location, close to subway and Eglinton Ave.",
      "rate": 5.0,
      "tripDate": " March 2015"
    }
  ]
}