{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "The Hazelton Hotel",
    "url": "/Hotel_Review-g155019-d656431-Reviews-The_Hazelton_Hotel-Toronto_Ontario.html",
    "priceRange": "$$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "5.0",
      "reviewCount": 1588
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "118 Yorkville Ave",
      "addressLocality": "Toronto",
      "postalCode": "M5R 1C2",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2b/24/61/6c/caption.jpg?w=500&h=-1&s=1"
  },
  "description": null,
  "featues": [
    "Electric vehicle charging station",
    "Free High Speed Internet (WiFi)",
    "Fitness Center with Gym / Workout Room",
    "Pool",
    "Bar / lounge",
    "Highchairs available",
    "Pets Allowed ( Dog / Pet Friendly )",
    "Airport transportation",
    "Valet parking",
    "Paid private parking on-site",
    "Wifi",
    "Fitness / spa locker rooms",
    "Personal trainer",
    "Indoor pool",
    "Heated pool",
    "Saltwater pool",
    "Restaurant",
    "Breakfast available",
    "Breakfast in the room",
    "Outdoor dining area",
    "Special diet menus",
    "Wine / champagne",
    "Car hire",
    "Taxi service",
    "Business Center with Internet Access",
    "Conference facilities",
    "Banquet room",
    "Meeting rooms",
    "Spa",
    "Body wrap",
    "Couples massage",
    "Facial treatments",
    "Foot massage",
    "Full body massage",
    "Hand massage",
    "Head massage",
    "Manicure",
    "Massage",
    "Neck massage",
    "Pedicure",
    "Salon",
    "Steam room",
    "Waxing services",
    "24-hour security",
    "Baggage storage",
    "Concierge",
    "Currency exchange",
    "Newspaper",
    "Non-smoking hotel",
    "Butler service",
    "Doorperson",
    "First aid kit",
    "Umbrella",
    "24-hour check-in",
    "24-hour front desk",
    "Express check-in / check-out",
    "Private check-in / check-out",
    "Dry cleaning",
    "Laundry service",
    "Ironing service",
    "Shoeshine",
    "Allergy-free room",
    "Blackout curtains",
    "Air conditioning",
    "Desk",
    "Dining area",
    "Coffee / tea maker",
    "Flatscreen TV",
    "Walk-in shower",
    "Soundproof rooms",
    "Air purifier",
    "Bathrobes",
    "Housekeeping",
    "Private balcony",
    "Room service",
    "Safe",
    "Seating area",
    "Separate dining area",
    "Separate living room",
    "Sofa",
    "Telephone",
    "VIP room facilities",
    "Wardrobe / closet",
    "Bottled water",
    "Clothes rack",
    "Private bathrooms",
    "Tile / marble floor",
    "Wake-up service / alarm clock",
    "Minibar",
    "Refrigerator",
    "Electric kettle",
    "On-demand movies",
    "Radio",
    "iPod docking station",
    "Bath / shower",
    "Complimentary toiletries",
    "Hair dryer",
    "City view",
    "Bridal suite",
    "Non-smoking rooms",
    "Suites"
  ],
  "reviews": [
    {
      "title": "One of our best hotel stays ever!",
      "text": "Location was simply perfect for our first visit to Toronto. The hotel design was spectacular in every way (but honestly for the price I was expecting nothing less). What sets this hotel far apart from its competitors, locally and globally, is the service. From pulling up to the valet and from every moment beyond we were simply blown away by the attention to detail. Our pillow preference, the way we like the temperature set, the COOKIES, the fact that we have 3 last names in our family and they addressed us all properly (no easy fete), help with everything and anything, welcoming our brand new granddaughter with as much excitement as we had and on and on and on!The ONE restaurant also truly exceeded our expectations. We are extensive travelers and former food industry employees (a lifetime ago but the passion is still there) and frankly tend to not favor hotel restaurants. Even at the highest end they are usually necessary amenities and nothing ultimately exciting.  You must ignore the price point (which is very high) and dive in. The menu is thoughtful and current without being trendy and is executed to perfection. We had 5 meals there in our 4 days and honestly couldn't even rate which was best.Special thanks to Angela and Alejandra who made us feel more like family, (very honored and treasured family, mind you) than simply hotel guests.  Regards to the entire team, day, night and everyone in between as well. We are forever grateful and look forward to coming back.",
      "rate": 5.0,
      "tripDate": " August 2022"
    },
    {
      "title": "The best place to stay in Toronto!",
      "text": "I have had the privilege of staying at the Hazelton several times over the past few months, and it is hands down my favorite hotel in Toronto and, in my opinion, the best value of all of the luxury hotels in the GTA. The hotel is super conveniently located, with several top notch restaurants, bars, and attractions like the Royal Ontario Museum a very short walk away (and in some cases right across the street!). The hotel itself boasts immaculate amenities, including a pool and spa, as well as a delicious room service menu. The rooms themselves are the best home away from home one could ask for in Toronto. I've stayed in several types of rooms and suites offered at the Hazelton, and they have all been gorgeously appointed and well furnished with comfortable beds and sofas, and televisions in the living area and built into the mirror of the bathroom. Every room I've stayed in has included a soaking tub and rainfall shower in the bathroom, so you've got your choice of how to freshen up after a night out on the town, and I also appreciate that every room has patio-style doors that open into the room and make you feel like you've got your own outdoor space in the room (and the suites actually do have balconies!). More than anything, the staff at the Hazelton stands out, and to call them phenomenal would be an understatement. I genuinely appreciate Aline at the front desk, and Dean, Daniel, and Robert at the concierge, who go out of their way to make me feel welcome anytime I stay at the hotel. On my most recent trip, which was for my partner's birthday on New Year's Eve, the staff went out of their way to help us celebrate her big day, which included arranging two delicious cakes for us and our party and allowing us extended time to use the room. I am excited to stay here again and recommend this hotel strongly to anyone looking for a place to stay in Toronto!",
      "rate": 5.0,
      "tripDate": " December 2019"
    },
    {
      "title": "Magical stay with family of four.",
      "text": "We spent three spectacular nights at the Hazelton over New Year’s. Upon arrival, our children were greeted warmly by all staff (thank you Sarah and Sarah). Kid-sized bath robes were sent up to our room and cozy trundle beds were set up for the kids, It was a perfect set up. We had originally booked a suite for our stay and were able to upgrade upon checking in. The suite that we received was very spacious for our family and we were able to enjoy family dinners around a table, bubble baths in a soaking tub and plenty of space for the kids to play. Special thanks to Dean, Padma, Raymond, John and the Sarahs for making our stay so memorable. We look forward to returning soon.",
      "rate": 5.0,
      "tripDate": " December 2019"
    },
    {
      "title": "Swanky and Sweet",
      "text": "What's not to love about this hotel. The Hazelton has a sultry, sexy, sophisticated feel. the rooms are generous and the bathroom with the beautiful dark marble, deep soaker tub and separate rain shower are hard to beat. They provide the salts and essential  oils for a relaxing soak, they will have your room service to you in record time.. their salt water pool is a must. All of that aside, the service from the minute you walk up to the entrance to the moment you leave is on point and stellar. They take every opportunity to make sure you know how much they value you as a guest and to provide you with unparalleled service.its what you would expect from a 5 star..but impressive nonetheless..we will be back.",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Relaxing Birthday Staycation",
      "text": "We stayed at The Hazelton recently for a staycation to celebrate my birthday. We live in the city and have spent a lot of time at the hotel's restaurant throughout the years.The service at The Hazelton is always top notch, and staying overnight is no exception. Check-in was a quick and easy experience, which included a temperature scan. The common areas were extremely clean and all staff wore PPE, we always felt safe on the property. Everyone who works at the hotel is welcoming and friendly, it feels very homely for a luxury hotel.We brought our two small dogs with us for the stay (bonus points for being dog friendly). In the room they had all supplies needed for our dogs including beds and bowls for feeding and water. Yorkville is also a dog friendly area with nearby parks and residential streets for walks. So if you have to travel to Toronto with your dogs I highly recommend considering staying here. The Hazelton was so kind and had a cake and wine waiting for us to celebrate in the room. There was also a bar area stocked with snacks and beverages including coffee. Room service was also wonderful as usual and the staff wore PPE at all times when entering the room. Recent renovations in the rooms and lobby did not disappoint either. The hotel has always been beautiful, but the changes felt bright and fresh which we loved.We cannot wait to return to The Hazelton Hotel in the future!",
      "rate": 5.0,
      "tripDate": " February 2021"
    },
    {
      "title": "We Love The Hazelton",
      "text": "We have visited The Hazelton Hotel on a few occasions over the last year, for a change of scenery and a bit of an escape during COVID times. The staff are always incredibly welcoming and do their best to make every interaction special and memorable. On our most recent stay on Superbowl weekend, the team sent up a huge bowl of the most delicious popcorn during the game, which was such a treat.They have, by far, the best room service menu. The food is always incredible, and the people who take your order and deliver the food are so kind and accommodating, and always make you feel safe and cared for. In general, the hotel's COVID protocols are fantastic and you feel both like you're able to escape from the current situation, but also incredibly safe, with the cleanliness and sanitation standards being always top-notch. The rooms are also perfectly equipped, with all of the glassware, living space and in-room amenities that you may need. The bathrooms feel like mini-spas, and with the deep soaker tubs and effervescent bath cubes, it just further lends itself to a total escape. Thank you so much to the whole team at the Hazelton for always being so sweet and accommodating. We can't wait to come back soon!!",
      "rate": 5.0,
      "tripDate": " February 2021"
    },
    {
      "title": "Romantic Staycation!",
      "text": "I would highly recommend a romantic getaway for any couple living in Toronto! The Hazelton Hotel exceeded our expectations of what a luxury hotel offers.  We requested a room with a balcony and they obliged (we were covered in sun on the comfortable balcony the entire day)!  Our arrival was nothing short of perfection (our uber driver was very rude-but the check in process was so relaxing, that it instantly improved our mood).  As we entered our room there was a complementary bottle of Champagne and chocolate covered strawberries, we were very impressed. Since we are still on lockdown, restaurants are completely closed;  Room Service was very accommodating to our needs (and even shell fish allergy) and the food tasted delicious!  We took a relaxing bubble bath and it felt like we were in a whole different world!  Even the available toiletries (I forgot mine at home) were endless and made of organic ingredients so very gentle on my sensitive skin.  In my opinion, the value was great. We were offered 'spending money' with our room reservation which essentially paid for our in room dinner-an unbeatable value! I want to go back!",
      "rate": 5.0,
      "tripDate": " May 2021"
    },
    {
      "title": "A Total Luxury Experience ",
      "text": "In the passed year we spent a lot of time visiting some of the most highly rated hotels in Toronto. Our experience at The Hazelton Hotel was absolutely exceptional, and a true 5 star experience!We were greeted by Robert the concierge, who was very informative about the area and the hotel. Robert explained what amenities were available to us (limited during covid). We discussed the in room dining menu, which is extensive compared to other hotels in the area. Robert was incredibly polite and articulate during all our interactions. He expressed how great the neighbourhood is during “normal times”. But he did let us know what is open and available to us. Sarah checked us in and we very polite and welcoming. The checkin was covid friendly and sanitary. She offered to send a newspaper in the morning (we asked for a New York Times) which arrived early and was nice to read with our morning coffee.Robert brought us to our rooms and assured us that his team was available for anything we would need throughout our stay. He was absolutely right! Dean was the concierge the next day and it was apparent that he knew we were staying in the hotel. He was ready to assist with anything we needed and always greeted us by all our names. Dean was happy to send us extra towels and shampoo and helped by giving us some Hazelton bags to carry home some of our shopping. The rooms were very large, newly renovated and obviously cleaned and sanitized with covid precautions in mind. The suites had incredible views of yorkville with oversized tubs and an in-room theatre experience. We were spoiled with all the amenities and snacks that were left for us to help celebrate our birthday. We spent most of our time enjoying the rooms and the in room dining. The entire team at the Hazelton hotel always greeted us by name with every interaction as we exited and entered the hotel. We never had to open the door ourselves, the doorman was very attentive and polite.Congratulations and thankyou to the hotel for providing such a luxury experience to their guests. We can’t wait to return and we would recommend The Hazelton Hotel as one of the best hotels in Toronto!",
      "rate": 5.0,
      "tripDate": " March 2021"
    },
    {
      "title": "Feels like home!",
      "text": "After this past year, filled with difficult times and away from my family and friends, I decided to treat myself on my birthday with a luxurious staycation. I must say, I don’t think any hotel in the world would have made me feel more like home than the Hazelton. And although we were celebrating my special day, the staff also made sure that my husband and Mr. Beans (our cat) had a wonderful time as well. From the start, Aiden, Ana, Vivien and Robert made sure to welcome us with lots of smiles and warm bday wishes. We felt like royalty! All the details to guarantee that I felt special on my bday were just very impressive. We had a bottle of wine and the most delicious boston cream donuts I’ve ever tasted waiting for us in our beautiful room. There even was a set-up for Mr. Beans, with treats, bowls and a bed, and his own welcome card! So thoughtful!!The bed is very comfortable like a giant hug and the bathroom is so incredibly spacious and beautiful, all in dark marble, that my husband said he would be happy to sleep in there. The deep soaking tub itself is worth the stay.Our Spa appointments were also a highlight on our stay. It was the most relaxed I’ve been in a long time!! The cleanliness and atmosphere of relaxation were incredible!From the Front Desk, Spa, Housekeeping, Room Service and Concierge teams, everyone went out of their way to make us feel comfortable. The service in the Hazelton is the best I have ever experienced!",
      "rate": 5.0,
      "tripDate": " February 2021"
    },
    {
      "title": "Superb location, beautiful hotel, comfy beds & very dog friendly",
      "text": "We were travelling with our 13 year old labrador and the hotel made him feel as welcome as any human guest. Water & food bowls, a proper size appropriate bed (we have been given beds suitable for a small breed in other hotels), fresh bottled water & even a bag of treats were waiting for him in the room. They greeted us and him by name.The hotel is central Yorkville so well located for wandering out shopping and enjoying fine dining.  Not cheap but definitely recommend.",
      "rate": 5.0,
      "tripDate": " July 2021"
    },
    {
      "title": "Outstanding, one of the best hotels anywhere",
      "text": "We booked a block of rooms for our daughter’s wedding weekend, including for ourselves and our daughter and her new husband, as well as the boardroom and screening room for pre-wedding preparations. The Hazelton Hotel and its staff were exceptional throughout and went out of their way to accommodate all of our needs. They graciously dealt with the needs of all of our various support people, such as party planners, hair and makeup artists, photographers, etc. Our guests who were staying at the hotel were also given total red-carpet treatment. We were truly treated as VIPs, which added an additional level of pleasure to what turned out to be a perfect wedding weekend for us and our group. We could not be more pleased with the entire experience.",
      "rate": 5.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Birthday Weekend",
      "text": "Spent another birthday weekend at the Hazelton Hotel and it was fabulous! I was a bit worried due to COVID issues however, the Hazelton did not disappoint! The service is impeccable. Rooms are spotless and cleaned twice per day. All the staff including front desk, parking services, cleaning staff are extremely personable and provide the best personal service! One Restaurant is also terrific! We ended up having both lunch and dinner there as the food and service was exceptional. Will always return to the Hazelton as our TOP choice for hotels in Toronto. Thank you to everyone at the Hazelton for making our weekend so special!",
      "rate": 5.0,
      "tripDate": " August 2021"
    },
    {
      "title": "Toronto's best!",
      "text": "My wife and I spent one night at The Hazelton as an anniversary celebration. From check-in to check-out, the staff took such great care of us. At check-in we recieved a complimentary room upgrade followed by delicious chocolate covered strawberries when we walked into our room. The room was exceptionally well appointed with a fantastic bathroom and deep soak tub that was definitely put to use during our stay.The staff provide an elevated level of service that truly sets the Hazelton apart. In the morning, we enjoyed a delicious full breakfast in our room before returning to reality! Staying at the Hazelton will likely become an annual anniversary tradition for us.",
      "rate": 5.0,
      "tripDate": " December 2020"
    },
    {
      "title": "In room table service YES!!!",
      "text": "What a great mini-staycation we had at the Hazelton last weekend. I’ve always considered doing a hotel getaway in the past but when it finally worked out it exceeded expectations. From start to finish the attention to detail was exceptional. We were granted both early check in and late check out to extend the experience. A little assortment of treats greeted us in our room which kept us going through our afternoon walk and then for dinner, it felt so wonderful to have that restaurant like experience from our own room while still being able to feel part of the action happening outside.  I hope the in-room dining is not just a COVID add on, but a staple. The full menu of ONE restaurant was available, allowing us to order the absolutely scrumptious lobster spoons that we hadn’t previously tried. We opted for a tapas style dinner ordering multiple apps. The smaller menu curbside take away is also a great touch for a lunch time snack. I left on Sunday feeling pampered and refreshed (and wondering when I can do it again!). Totally worth it!",
      "rate": 5.0,
      "tripDate": " May 2021"
    },
    {
      "title": "The best first stay in a hotel after months",
      "text": "I had the opportunity to stay at one of my favorite properties in Toronto as I was traveling for work and it was the best choice I made. I have always had an exceptional experience at the Hazelton however even with the transition of opening in these times their service was still at the upper opulence and excellence. The team took care of all my needs during my visit and my room was nothing less than gorgeous as I had the chance to stay in one of the newly renovated rooms. Hazleton will now always be my second home when I am in Toronto.",
      "rate": 5.0,
      "tripDate": " September 2020"
    },
    {
      "title": "Fantastic Getaway",
      "text": "The Hazelton Hotel provided luxury accommodations in the heart of Toronto’s Yorkville neighborhood. Spacious rooms, spa services and a fabulous restaurant added to the amazing experience. However, the greatest asset of this chic boutique hotel is the staff. We were immediately greeted by the friendly doormen who swept our luggage away and led us to the front reception desk. Check in was a breeze…no waiting around for a room. The Concierge team put together a complete itinerary for us. Dinner reservations, event tickets and a private tour of the Niagra region. Dining at their restaurant and bar called One was an amazing start to every morning. Coffee on the restaurant’s open air patio while watching the city wake up was perfect. Evening cocktails prepared by experienced mixologists was our way to wind down after exploring the city. Our stay at the Hazelton was a fantastic getaway from our busy lives!",
      "rate": 5.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Believe The Hype",
      "text": "We had the pleasure of staying at The Hazelton when I booked it as a surprise for my wife’s 40th birthday celebration in June. From the moment I’d made the booking I knew I’d made the right choice, as within a few hours of making it a member of the hotel concierge staff (Dean Voon) reached out to enquire about any special arrangements required in the room. I advised a cake would be nice and most good hotels would simply stop there. Not the Hazelton – they asked me to provide three digital photographs that meant something to my wife and they would have them printed, framed and placed in the room…all complimentary and part of the service they provide. It’s touches like this which truly separate a great hotel from an exceptional hotel. As soon as we arrived, and just like other reviewers have mentioned, the valet and front desk staff all knew our name and wished my wife a very Happy 40th Birthday. You truly felt like you were the most important visitor in the world and the service was truly outstanding…there really is a reason why this hotel rates more highly than similar properties in the area such as the Ritz Carlton and Four Seasons…it is truly exceptional. Room service in the room was amazing and we enjoyed dinner one of the evenings in One Restaurant where the food was great but service wasn’t quite up to the standard experienced in other parts of the hotel (they had set the bar exceptionally high, it has to be said). Unfortunately my wife and daughter had to return to the room prior to ordering desserts and I had something special planned…I went and spoke to the concierge and advised that we’d be ordering dessert to our rooms so anything they could do would be appreciated. We call for room service and in addition to what we had ordered were some of the hotels famous Boston Cream Doughnuts with a personalized birthday message and candle which the gentleman who brought it to our room, promptly lit upon arrival. Without fail, every single person we encountered was exceptional in the service they provided and would remember our names and say hello. From Dean in the Concierge area, to Sarah and Rishi at the front desk – my family would like to thank you and the entire Hazelton team for our truly memorable stay. It was that good that if we’re ever in Canada for my wife and daughters birthdays again (we would usually go away) we will be making a birthday stay at the Hazelton our annual tradition!To anyone reading all the amazing reviews and being somewhat skeptical before they book…I simply have three words for you…Believe. The. Hype…this place is extraordinary!",
      "rate": 5.0,
      "tripDate": " June 2021"
    },
    {
      "title": "Very Comfortable Rooms and High Quality Service",
      "text": "Staying in hotels can be hit or miss, but any time we have stayed at the Hazelton Hotel in Yorkville, the experience has been top notch. Rooms are spacious with warm and modern decor. Front desk and door staff are attentive, professional and make you feel welcome. The spa consists of a gym with everything you would need along with a heated indoor pool. If you expect superior service, this is the place you will enjoy.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Spectacular Stay!",
      "text": "From the moment you drive up to the hotel, you are met with the most courteous and professional team. Daniel in valet was absolutely wonderful and ensured all of our luggage made it right up to our room. The room was spacious, very clean and included all the comforts you could possibly need. I loved the be, so comfortable! In-room dining was exceptional (we had items from the breakfast and dinner menus), and our room service attendant Himanshu provided us with the most exceptional service.The location is the best in the city- Yorkville is the best shopping destination in Toronto with all luxury brands  and small boutiques right outside the hotel doors and a great selection of amazing restaurants within a five minute (or less) walk! Everything was absolutely perfect and the Hotel exceed our expectations!  If a 10 star rating were possible, I would gladly give it to this property! I am not surprised that it is rated as the #1 property in Toronto- STAY HERE!",
      "rate": 5.0,
      "tripDate": " December 2021"
    },
    {
      "title": "Ditto",
      "text": "After reading all the extremely positive reviews about The Hazelton I decided to book this hotel for my holiday. Short version: ditto! I can only agree with every positive review.Long version. From checking in to checking out the staff of The Hazelton will do everything to deliver service above and beyond. Perfection isn't good enough, it should exceed every expectation. Some examples: the staff will learn your name and greet you properly every time. There are cookies waiting the room, but when I said I am a vegan they were promptly removed and later replaced with vegan cupcakes. This isn't just service, it is making sure every single guest will not doubt for a moment when booking a hotel for their next stay.The hotel is rather small with only 4 floors, giving a very different feeling from the \"factories\" that many chain hotels have turned into. My room (#404) was large and somewhat dark, but this is not a bad thing. The small window and ambient light gives it a cosy, reclined feeling in the big city. The bathroom is large and the shower is powerful. A word of warning to Japanese guests: no washlet toilet here. The balcony is a nice place to absorb the vibe of this ritzy neighbourhood, without having to mingle.Of course everything is of the best quality, clean and complete. For example I found a converter to plugin European devices in the outlet. The wifi isn't based on a bothersome system with names, room numbers and vouchers. One enters the hotel password and has access (similar to a home network).The Hazelton Restaurant seems to be more popular than the hotel itself, with long waiting lines at dinner time. No preferential treatment for hotel guests here.  After a wait, the restaurant offered to turn existing dishes vegan, but that's not good enough. So I had breakfast (\"Kupfert & Kim\" and \"Calii Love\") and dinner (\"Planta\") nearby.I do have one point of critique: about half the stations on the television don't actually work. They show up in the on screen program guide, but when selected only an error message appears. The stations that do work display so many commercials, that it's just unbearable to watch (this is a Canadian / American thing not caused by the hotel).",
      "rate": 5.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Romance and Fun at Hazleton Hotel",
      "text": "What a fabulous Hotel , we usually stay at four seasons , very good but large . Hazelton hotel  is a Boutique style Hotel , with over the top personal service , the Concierge team as well as the front desk , valet ,bar and dining staff,  room service and housekeeping  took care of all of our needs and more. IT DIDNT STOP Dining was exceptional, elevated transportation, Reservations and tickets to a show we’re all taken care of. We will definitely be making this our number one hotel in Toronto. Can’t wait to go back.",
      "rate": 5.0,
      "tripDate": " October 2021"
    },
    {
      "title": "BEST HOTEL IN ONTARIO - CANADA",
      "text": "The best hotel in Toronto -  Great location - very good size rooms- comfortable furniture  and top of the line concierge service . Specially thanks to Ronaldo & Dean.The value is worthed specially when you compare with other five star hotels in Toronto. The restaurant patio is the place to be when the weather is nice & warm .",
      "rate": 5.0,
      "tripDate": " February 2021"
    },
    {
      "title": "Where Customer Service Reigns! ",
      "text": "The Hazelton is located in the trendy Yorkville neighborhood of Toronto, located in the hub of great shopping and restaurants. Everything is steps away. Expansive modern rooms. Tons of conveniently placed outlets for all are devices.  A DEEP soaking tub and rainfall shower. Plenty of closet and draw space is another plus.  There is no sound transfer between rooms. We could barely here hallway noise. Great for my husband who sensitive to noise while falling asleep.We never saw housekeeping anywhere yet our rooms were cleaned in the morning and again in the evening. Stealth team! We were treated like royalty by every Hazelton staff member from the valet drivers, guest services, management, room service servers, et al! The Concierge made getting a car service effortless. We wish we could have stayed longer but we will be back. Next time we are hitting the spa!",
      "rate": 5.0,
      "tripDate": " November 2019"
    },
    {
      "title": "100% TORONTO'S BEST HOTEL - BY FAR",
      "text": "The service of this hotel is impeccable. Every single detail was taken care of right from the moment you pull into the valet. The valet and bell man were ready and waiting to help me with my carry-on bag right from the moment you get there. The check in was so smooth and the girls at the front desk were awesome and always greeted you with a big smile. The rooms are spotless and beautifully decorated. It's  really ultra luxurious. The location can't be beat either. The boutique nature of the hotel really adds to the overall service that you get. Of course, the food you get to the room is top notch and you can order off the ONE Restaurant menu. The server was polite and always mindful to ask before he entered the room. The housekeeping staff made the room look immaculate every day and the room was always turned down. Even the gentleman that opens the front door as you come and go knows you by your last name. My car was always waiting for me when I called down for it. Robb and his staff do such a great job keeping this hotel the best one in Toronto even with the new 5 star hotels that have popped up around the city over the years. The other big name 5 star hotels here in Toronto are poorly managed and don't hold a candle to The Hazelton Hotel.",
      "rate": 5.0,
      "tripDate": " January 2022"
    },
    {
      "title": "Fantastic location and property with stand out service",
      "text": "My boyfriend and I booked the Hazelton on a last minute weekend staycation and every part of our stay exceeded our expectations. We called ahead the night before to ask if our room had a balcony, and although the room we booked did not, we were very happy upon checking in to learn they had accommodated our request. The service is superb, and everyone we encountered during our stay was warm and welcoming. Since there are still pandemic restrictions, we were limited on options for dining and activities, but we were content to soak up the beautiful weather on our little terrace. In room dining was quick and delicious both times we ordered, and we also were able to enjoy the pop up bbq menu being offered as takeout. Rooms are spacious and well appointed, with everything easily operated by the touch of a button. We will definitely be back again, and hopefully will be able to enjoy the patio and more amenities once the restrictions lift!",
      "rate": 5.0,
      "tripDate": " June 2021"
    },
    {
      "title": "Hotel Definitely Earns its 5 stars!!!",
      "text": "We had a wonderful stay for our birthdays. The hotel and amenities are all gorgeous. All the staff in the hotel, spa, and restaurant are all top shelf and obviously care alot making guests feel welcome and happy. We stayed in a Luxury King Room with juliet balcony that overlooked Hazelton Lane. The room is huge by Toronto standards and the bathroom is beautifully decorated with marble floors and walls. We told them in advance that it was our birthday and they left us a beautiful little cake, wine bottle, wine glasses, and a nice card in our room for when we arrived. It was such a nice surprise upon checkin :) We definitely have not had that type of present waiting for us before even at other 5 star hotels. We both booked massages at the spa which were also great and relaxing. We had dinner at One restaurant and both had plant based options, both were great! Our favorite part was our breakfast via room service, which was delievered in 15 minutes. The food was all awesome and we swear it was the best breakfast we ever had. I recommend the Full Breakfast ($39) as it comes with everything and you will be filled up. I spent time at the pool and steam room, which were always quiet, clean and well maintained. Looking forward to returning some day :)",
      "rate": 5.0,
      "tripDate": " December 2023"
    },
    {
      "title": "Birthday Celebration to be Remembered",
      "text": "What can I say about this hotel, other than the word AMAZING!!!! The staff was very welcoming, warm and attentive to our every need. We were celebrating my boyfriends birthday so I wanted the room to have a very special feel. I sent the team and email ahead of time and when we arrived it was decorated perfectly. There were flowers and balloons, a special song he likes, a birthday cake. It was so wonderfully done he was pleasantly surprised. It was so wonderfully done and meticulously crafted we both smiled from ear to ear. The staff wished him a happy birthday the entire weekend when they say him walking the property. They called us by name when asking if we needed help or to just say hello. They have a pillow menu if your special person tends to snore at night or if you need a special pillow to help make your night’s sleep restful. Did I mention the bed was super soft. If you are looking for the gem hidden in the heart of Toronto, if you are looking for a place that makes you feel at home and offers an EXCEPTIONAL level of service, lol no further than The Hazelton!!!!!",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Above and beyond",
      "text": "The staff here at the hotel are the best. We had a wonderful, friendly checkin. Allie (Elsa) at the front desk walked us to our room and even surprised us with some cookies and a cake for my husband’s 40th birthday. It made the trip even more special. Everyone on staff from the front desk to housekeeping and room service were so helpful and attentive. At the hotel bar in One restaurant, Chantel, Dave and Dylan among others met us with a smile and made us feel like we are gathering among friends while away on vacation. It was our first time in Toronto and Hazelton hotel is a must stay! The atmosphere in and around the hotel was so beautiful and the room was so luxurious. We had Swedish massages at the spa and the staff there made us feel so comfortable and relaxed.Everything here is top notch! Beautiful, clean hotel with wonderful, friendly service.",
      "rate": 5.0,
      "tripDate": " August 2022"
    },
    {
      "title": "The Cherry on Top of our Covid Wedding",
      "text": "My wife and I wanted to have an amazing wedding night experience, even if it was during Coronavirus so we reached out to the Hazelton. The staff replied almost instantly and were beyond amazing in accommodating us. Even though our plans had changed so dramatically due to the pandemic, they everything in their power to make our evening incredibly special. We arrived at the hotel after our socially distanced outdoor dinner and were greeted with congratulations by the staff, waters when we arrived at the front desk and even more special, a handwritten note and chocolate strawberries in our room. We were floored by the special touches and kindness.The hotel itself is absolutely stunning, the room was beautiful and well appointed, and the bathroom HAD A TV IN THE MIRROR! I felt like Tony Stark taking a shower. There was controls for the lights and blinds accessible from bed and I suddenly became extremely jealous I didn't have this at home :). When we ordered breakfast (Avocado Toast and Buttermilk Pancakes w/ Bacon) in the morning, the staff was incredibly nice while they set up the dining experience and the food was absolutely delicious. We will always remember how the Hazelton and it's staff (Thank you Parnian, Jessica & Sara) went above and beyond to make our wedding night a memorable one in the age where the stay-cation is safest! We cannot recommend you stay here enough, you will not regret it.",
      "rate": 5.0,
      "tripDate": " October 2020"
    },
    {
      "title": "The best Toronto hotel - superior customer experience",
      "text": "I live a little North of the GTA and had some business to take care of in Toronto - I chose the Hazelton for it's incredible reviews and perfect location. I was greeted by courteous staff who tended to my every need. From valet, front desk to concierge, all of the employees treated me with the utmost respect rooted in luxury customer service. The entire hotel smelled incredible and was so clean. My room was beautiful. The deep soaker tub was my favourite, the washroom was very spacious even with a tv on the vanity mirror. The dressing area was large and the room had such a special view of Yorkville Avenue. You will not be disappointed in your stay. Thank you so much, Hazelton Hotel Staff!!",
      "rate": 5.0,
      "tripDate": " January 2022"
    },
    {
      "title": "Our new favourite place to stay in Toronto",
      "text": "We just stayed at this beautiful boutique hotel in the heart of Yorkville for our 33rd wedding anniversary getaway. I can’t give the staff from every facet of the hotel enough praise. From arriving and being greeted by the valet to the front desk staff, housekeeping staff and everyone in between, they were all extremely attentive to our needs. The spa treatments both my hubby and I had were one of the best we’ve ever had and we found everyone there also very attentive and engaging. We didn’t get a chance to eat at the restaurant however we did have room service and the baked goods were fresh  and delicious. The turndown service was still a very nice touch as was the pillow menu. The macarons and cookies placed in our room upon arrival were also a very nice touch. The rooms are a good size especially the well appointed bathrooms and changing areas and the soaker tub for two was just perfect after a day of shopping in our favourite Toronto shopping district. We will definitely be back again for our next anniversary getaway! So glad we chose this hotel over any of the larger chains. You can’t compare the amazing service we experienced!",
      "rate": 5.0,
      "tripDate": " October 2021"
    },
    {
      "title": "All embracing luxury",
      "text": "We spent the weekend at the Hazelton, Taking  2 rooms.We had initially booked 2 rooms as a Deluxe king. Upon arrival 1 of those rooms received a complementary upgrade to Luxury King, and the second room we opted to pay for an upgrade to Luxury room - 2 queens.The rooms were impeccable and so spacious. Comfortable beds, lovely bathrooms.The staff is superb - so well trained - they are unfailingly polite and attentive.Can’t wait to return!!",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Birthday Weekend",
      "text": "Very welcoming from the beginning, from the team at the door to the front desk staff. Very pleasant and informative. Was showed the details of the hotel and the room by Aiden who was very helpful and friendly. All staff were attentive and quick with any requests or room service. They even provided a vase for some flowers that were laying around while cleaning the room. All interaction showed that they value each guests and take care of the little things. Can't wait for the next stay.",
      "rate": 5.0,
      "tripDate": " March 2022"
    },
    {
      "title": "A Great Staycation",
      "text": "My partner and I attended the Hazelton last weekend for our anniversary and have nothing but positive things to say about our time at the property.The Hazelton fully deserves it's 5-star status, and the level of quality and service exceeds the standards of a luxury boutique property.The concierge and reception team were extremely attentive to our needs, and offered great service. It is a refreshing feeling during these crazy times to feel like there is a team waiting at the ready to help you out with anything that can improve your stay. Robert, Ronaldo, Maira and the team were excellent.The cleanliness and maintenance of the property was stellar. We felt comfortable at all times. Padma from housekeeping deserves recognition for her excellent work.We also enjoyed the spa and were extremely pleased with the service and quality of treatment we received. The entire spa team deserves recognition for going above and beyond to offer us such a relaxing and comfortable afternoon.We ordered room service several times during our stay and were happy with the great breakfast offerings. One small comment would be that things would be missing from the meals. Staff were always pleasant and helpful to correct these mistakes.We were really happy that cartons of water were readily available and provided at all times.In sum, we thoroughly enjoyed our \"staycation\" weekend and look forward to returning for another soon. We will certainly be coming back this year.",
      "rate": 5.0,
      "tripDate": " March 2021"
    },
    {
      "title": "Wedding Stay",
      "text": "We chose the Hazelton for our wedding staycation and it was the best choice. The luxury King room was more than enough space for us to get ready for our wedding. The bathroom and dressing area were huge and well used for our purposes. The hotel staff were so gracious every step of the way - from the moment I booked to the moment we left. Everyone was polite, helpful, smiling and welcoming. We stayed for three nights and everything was perfect. The in-room amenities were great - the turn down service was noticeable and so thoughtful. On our wedding night, my husband asked for some nice touches in the room and we came home to petals leading us to our bed. Candles around the tub, bubble bath and more rose petals. Our friends sent gifts and everything was brought to our room and tastefully placed. Room service was spectacular and always quick. Upon arrival we were greeted with a lovely dessert and card congratulating us. It was all lovely and thoughtful. We stayed during covid and it really felt like a holiday. We wanted the privacy and luxury to get ready for our ceremony somewhere nice and it was just us and it was perfect.",
      "rate": 5.0,
      "tripDate": " June 2021"
    },
    {
      "title": "The Hazleton Hotel, Toronto - what a place!!",
      "text": "My husband and I stayed here  last weekend and it didn’t disappoint...in any way! After researching online, we knew the area we wanted to stay in was definitely Yorkville. The two hotels we had it down to were on the same road, The Hazleton and The Four Seasons.  The Hazleton won and were so glad! The location was amazing, perfect for multiple coffee shops, amazing restaurants (Kasa Moto and Cibo) and lots of designer shops.  The staff were so friendly and helpful. The doormen all remembered our name and greeted us every time we came in and out of the hotel with “Good Morning Mr & Mrs xxxx”, it was so lovely.  The front of house, concierge, valet, spa, bar and breakfast staff were all excellent too.  The room was incredible. As we’re a member of the ‘Leading Hotels of the world’ club we were eligible blue for a free room upgrade if one was available, we were very lucky as it was and were given a suite.  Lots of room, huge comfy bed, huge swing-out wall-mounted TV, the biggest bath I’ve ever seen, walk in wardrobes, L’Occitane toiletries, the list goes on, it was incredible.  Breakfast is served a la carte style and it was delicious.  Yummy coffee and fresh pulp juice too.  The spa was amazingly relaxing and my massage therapist was so skilled. Then a dip in the underground pool and a sauna/steam to finish the relaxation.  We wouldn’t hesitate to stay there again should we return to Toronto, it would always be our first port of call now!",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Beautiful with great service!",
      "text": "The Hazelton Hotel is in a great location, near the University of Toronto (my alma mater), the Royal Ontario Museum (definitely worth a visit) and upscale shopping. It's also close to the subway, which makes getting around super easy. Our room was large and beautiful! Ditto the bathroom, which had a very deep tub as well as a separate shower and a heated floor. The room was made up early in the day, which made it so lovely to come back to. We ate in the hotel several times, both in the restaurant and in the bar. For breakfast, we had croissants and scones which were excellent, as was the coffee and fresh OJ. Dinner was also a treat. Moreover, the maitre d' remembered we liked a window table and seated us accordingly. The staff was lovely throughout and went out of their way to ensure we had an enjoyable stay. We wound up flying out in a snowstorm, and the concierge checked the weather, alternative flights and seat availability for us. He also left messages for his colleague who would be on the desk the next day, so they could follow up without our going through all the details again. And, the front desk was very helpful in terms of directions and transportation locally.We would definitely stay at the Hazelton again! It was a pleasure!",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Best Hotel in Canada!",
      "text": "Many thanks to The Hazelton Hotel Team for the extraordinary customer service and making my hotel experience outstanding every stay. Recently, I had the good fortune of dealing with Alejandra, Angela, and the rest of the team at the front desk and the amazing concierge team of Ronaldo, Rob, Maíra, and Tony who were all welcoming, most helpful and went the extra mile to make my stay most pleasant and memorable. As an entire team, they have a unique and special way to make guests feel at home and always comfortable. The entire team stands out because of its superior warm, kind, and genuine customer service. In addition, the housekeeping staff is also exceptional and provide attentive details to ensure that the rooms and common spaces are spotless and shining. The housekeeping and rest of the support staff check up on guests to make sure that they have everything that they need in the room. The turn down service is also second to none and the extra attention including the water by the bed and pillow spray are added nice touches.  The rooms are spacious, and the beds are most comfortable and heavenly. It is a pleasure dealing with each and every staff member at the Hazelton.  The hotel is situated in an amazing location - close to all the great shops and many top restaurants.",
      "rate": 5.0,
      "tripDate": " May 2022"
    },
    {
      "title": "Amazing Experience during Quarantine Birthday",
      "text": "We had a fabulous stay at the Hazelton Hotel in January 2021 during Covid shutdowns. My partner and I decided to book a room as a birthday celebration given that there were not many options during Covid to celebrate a special occasion. The staff at Hazelton went above and beyond to make our stay exceptional. Small touches were everywhere, such as leaving chocolate covered strawberries and wine in our room with a lovely birthday note from the staff. Everyone we interacted with was incredibly kind and professional. The Covid safety measures were very reassuring and we felt safe throughout our stay, with easy access to masks and sanitizer, and staff was very respectful of maintaining distance and were always masked when we interacted. We were able to order room service from One Restaurant which was delicious and made for a special birthday meal. While the facilities of the hotel were closed, we were able to enjoy a lovely spacious room with a giant soaker bathtub. Overall the stay was wonderful and we had a romantic weekend to celebrate a special occasion during extremely stressful and difficult times.",
      "rate": 5.0,
      "tripDate": " January 2021"
    },
    {
      "title": "perfect retreat after medical procedure",
      "text": "Above and beyond customer service, everyone is polite and cleaning staff even goes out of their way to greet you in the hallways and make sure your stay is just perfect.. The atmosphere is very lux and high end, nothing is overlooked. The furniture and decor are modern and is maintained to look new. Overall very clean and could not find one thing that was not perfectly clean in my room (except the room menu but totally fine and normal). Checked in around 11am and within an hour had a room ready with my luggage already waiting for me in the room. The room is spacious and have a beautiful balcony type windows that overlook Yorkville avenue and make it great having while having drink. Had the staff bring up more L'Occitane toileteries while i was away and they left a note and a plate of fresh macaroons and cookies, they were possibly the best ive ever had and so kind of them. The floor to ceiling marble bathroom is well prepared with a rainshower and very large bathtub (think basketball player friendly), an exfoliating mitten, some bath bombs and the usual shampoo conditionner and moisturizer, all L'Occitane. The little TV built in the mirror is a nice finish too. Toilet paper is alright, sort of like the hospital kind which could be better. Mini bar is fully loaded with complimentary snacks (best ive seen, think chips and granola bars) with Flow Water and Nespresso machine and plenty of space for personal use. The steam room on the spa floor is never busy and is a delight to use and fully loaded with toiletteries and Flow water. Pool is salt water is usually not too busy either and very clean. One restaurant on the lobby floor is by far my personal favorite restaurant in Toronto for the service and quality of food. Nothing too wild and exotic but always really good quality and most nights the patio attracts a crowd of locals and is kept warm with heating towers. Prices are very reasonable and has something for everyone. The breakfast is also very impressive and worth the visit. Lastly the Concierge was also lovely and set up a driver who also went above and beyond with their service. This hotel is just the perfect size for a private and personalized service that other 5 star just cannot beat in Toronto. Overall the Hazelton Hotel has surpassed every expectations and is a good pick for location and if you want a true luxury 5 star experience.",
      "rate": 5.0,
      "tripDate": " September 2022"
    }
  ]
}