{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "The Republic Delsuites",
    "url": "/Hotel_Review-g155019-d2243411-Reviews-The_Republic_Delsuites-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.5",
      "reviewCount": 7
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "70 Roehampton Ave",
      "addressLocality": "Toronto",
      "postalCode": "M4P 1R2",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/10/74/33/b9/the-view.jpg?w=500&h=-1&s=1"
  },
  "description": "The Republic Delsuites is an excellent choice for travelers visiting Toronto, offering a family-friendly environment alongside many helpful amenities designed to enhance your stay. Rooms at The Republic Delsuites offer a fully equipped kitchen providing exceptional comfort and convenience, and guests can go online with free wifi. A fitness center will also help to make your stay even more special. Given the close proximity of popular landmarks, such as Toronto Harbour (2.1 mi) and Spadina Museum (2.1 mi), guests of The Republic Delsuites can easily experience some of Toronto's most well known attractions. Best of all, The Republic Delsuites makes it easy to experience many great Toronto attractions like Toronto Island Park, Bluffers Park, and High Park, which are some popular parks. Enjoy your stay in Toronto!",
  "featues": [
    "Secured parking",
    "Free High Speed Internet (WiFi)",
    "Fitness Center with Gym / Workout Room",
    "Billiards",
    "Kids stay free",
    "BBQ facilities",
    "24-hour front desk",
    "Washing machine",
    "Wifi",
    "Bathrobes",
    "Air conditioning",
    "Dining area",
    "Room service",
    "Coffee / tea maker",
    "Cable / satellite TV",
    "Sofa bed",
    "Bath / shower",
    "Separate dining area",
    "Separate living room",
    "Sofa",
    "Telephone",
    "Iron",
    "Dishwasher",
    "Microwave",
    "Oven",
    "Refrigerator",
    "Stovetop",
    "Electric kettle",
    "Kitchenware",
    "Flatscreen TV",
    "Non-smoking rooms",
    "Suites"
  ],
  "reviews": [
    {
      "title": "Perfect home away from home",
      "text": "I stayed with Del Suites at the Republic at 70 Roehampton Ave for 6 weeks in Jan and Feb of this year and absolutely loved my stay! It was a complete life saver as I was renovating my condo at the time. It was competitively priced to other furnished rental places that included louse keeping once per week, parking, cable and Internet, AND were pet friendly, accommodating of my small dog. Below is a breakdown of certain parts:THE BUILDING - was amazing! The amenities were great, building security was awesome, there were enough elevators so that you never waited too long and the underground parking was plentiful and organized. My suite included parking and it was very close to the elevator. Gym was massive and pool great, and I also booked the games room many times during my stay for a place to work with some more space.THE SERVICE - Every person I encountered through the booking process and the stay was professional, courteous and prompt in getting back to me. Housekeeping was professional and prompt, and did not chat or lolligag while cleaning. Special requests were accommodated and also I kept extending and they accommodated that too.THE SUITE - this was the best part. I was in unit 1720. It's a corner two bedroom two bath unit with a dedicated work space. The views were incredible and the layout was perfect for two people. Del suites had a welcome package of essentials ready for me and also toiletries for the first night. Furnishings were modern, mattresses were high quality and had waterproof covers on them, and the suite condition was amazing. Everything I needed. THE AREA - literally at the corner of the Rio Can centre, so steps to the subway, movie theater with VIP seats, a good life, grocery stores and a shoppers just to name a few. The area is amazing and vibrant and is awesome to explore if you are from another part of Toronto.I highly recommend anyone staying here, as it allows you to be home away from home and is comparable to a hotel on a night by night basis. It's comfortable and the area is amazing. I even miss parts of it when home now!",
      "rate": 5.0,
      "tripDate": " January 2016"
    },
    {
      "title": "Home Away from Home",
      "text": "We stayed at this property for the month of November having sold our home in Toronto and before heading South for the winter months.  The one bedroom unit was perfectly equipped for the two of us, and even had a very comfortable sofa bed for my daughter who lives in NY when she visited for a few days. The high ceilings and open plan make the unit feel larger than it's actual size.  We were most comfortable and found any request we made was responded to immediately.  We may need to rent short term again in the Spring, and if so, we will most certainly choose The Republic Delsuites.",
      "rate": 5.0,
      "tripDate": " November 2014"
    },
    {
      "title": "Spacious and comfortable accommodation in a great location",
      "text": "We, a family of four, stayed at Del Suites Republic on 70 Roehampton Avenue in a one-plus suite (with pull-out sofa bed in the living area) for 7 weeks in July-August. The suite was large with good quality furnishings, lots of closet space, a very well-equipped kitchen, bonus foyer-cum-office room, and lovely balconies to enjoy the summer sun. Building amenities include a gym, lap pool with water jets, sauna, visitor parking, etc. Excellent location with subway station, supermarket, restaurants, movie theater just a few minutes' walk away. Unobtrusive but efficient housekeeping, friendly concierge. Very clean and well-maintained premises.I would highly recommend this place for business and tourism visitors to Toronto who don't mind paying a little extra for a good place to stay (ie, this place is a bit pricey!).",
      "rate": 5.0,
      "tripDate": " July 2014"
    },
    {
      "title": "Premium rental suites...some caveats",
      "text": "Pros- Central location, very convenient midtown - Well built--quiet building.  Trident is a great builder- Great amenities in terms of gym, pool, bbq area, easy parking in building Cons- Dishwasher is subpar, you will have to pre-rinse before loading- They will give you enough detergent, laundry soap, toiletries just for a few days. Stock up beforehand.- The sales reps can gave us 'wrong pricing' over the phone and then claim the call never  occurred when you try to go through with your booking. The bump up was about $1k but we had little flexibility as we needed an emergency place to stay.Biggest gripe!!!We paid about $5k for a 30 day stay in a 1 bedroom suite. Inclusive with that is supposed to be biweekly cleanings. We gave advanced notice and explicit instructions that we needed the cleaning staff needed to be masked due health reasons of the occupants in the suite and were repeatedly ignored via phone call and email regarding this, and given empty promises that it would be addressed. Quite bizarre and irresponsible.It is ruining an otherwise very good stay. Something to consider if you are dropping thousands of dollars on what is supposed to be luxury accommodations.",
      "rate": 2.0,
      "tripDate": " June 2023"
    },
    {
      "title": "If there was a 6th star, they would have easily earned it!!!",
      "text": "Bravo! This has def been one of my best stays in a home outside my home. everything was just perfect. these guys know how to please their customers.I stayed at my apartment for 2 1/2 months. here's a brief:-Staff (customer care, concierge, etc...everyone!!!) were super helpful and sweet-Free airport pickup OR drop off...i chose pick up-Location was fantastic (Yonge and Eglinton). Everything is a walking distance. Neighborhood is ideal, especially that I had 2 kids with me-Apartment was spacious, well furnished with super fast internet-Football field right by the building had a great track for running or for kids (bikes, etc)Need i say more???I especially wanna thank Nova (who I bombarded with emails and calls for many months) and Eli (the coolest concierge!)I had one small suggestion...the weekly cleaning service could be better. Given the \"beyond 5 star service\", i think the weekly cleaning should leave the apartment \"spotless\"Otherwise, i can comfortably say i fond my home in Toronto. Can't wait for my next visit!!!",
      "rate": 5.0,
      "tripDate": " May 2017"
    },
    {
      "title": "5 stars guest service",
      "text": "Our stay for the last six months with Delsuites was a better experience than I hoped for. The apartment was well furnished. The location is one of the best locations in toronto, close to the downtown but not too close. As for the exact location of the building, it's a 3-4 minutes walk from Yonge street and about 8-10 minutes to Eglinton avenue, and less than 15 minutes to Eglinton station. The location is great because everything you need is in walking distance (shops, restaurants, subway station ...etc.) but at the same time it's located on a fairly quiet street. The staff was friendly and everyone would help with a smile. The guest service's communication is extremely fast and professional. They send help as fast as possible no matter how small the problem was. They take every request seriously. They sometimes would fix small things that I didn't even notice needed fixing. When you see attention to details, you know you are dealing with a very good hospitality management and very professional staff. 70 Roehampton ave. was our home away from home. If we went back to Canada in the future, Delsuites would be our choice, and I would for sure recommend them to my family and friends.",
      "rate": 5.0,
      "tripDate": " August 2016"
    }
  ]
}