{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "The Westin Toronto Airport",
    "url": "/Hotel_Review-g155019-d183112-Reviews-The_Westin_Toronto_Airport-Toronto_Ontario.html",
    "priceRange": "$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.0",
      "reviewCount": 434
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "950 Dixon Road",
      "addressLocality": "Toronto",
      "postalCode": "M9W 5N4",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2c/15/3f/e3/exterior.jpg?w=500&h=-1&s=1"
  },
  "description": "Recently renovated and brimming with modern style, The Westin Toronto Airport offers a gateway to the best of the area. Our hotel in Toronto, Canada is at Toronto Pearson International Airport (YYZ), and we offer a complimentary 24-hour shuttle, ensuring that you never miss your flight. We're also just moments away from some of Mississauga's most popular attractions, including Canada's Wonderland; Toronto's downtown core is 25 minutes away. Make yourself at home in our sophisticated guest rooms, which offer contemporary amenities and perks including our signature Westin Heavenly® Bed. Stop by one of our sleek new restaurants, which offer flavourful cuisine, great cocktails, and convenient to-go items. Or plan your next airport-area event in one of our hotel's intuitively designed venue spaces, which include an elegant banquet hall and a scenic outdoor space.",
  "featues": [
    "Valet parking",
    "Wifi",
    "Fitness Center with Gym / Workout Room",
    "Pool",
    "Bar / lounge",
    "Free airport transportation",
    "Conference facilities",
    "Banquet room",
    "Paid private parking on-site",
    "Paid wifi",
    "Indoor pool",
    "Heated pool",
    "Restaurant",
    "Breakfast available",
    "Breakfast buffet",
    "Breakfast in the room",
    "Free shuttle or taxi services",
    "Airport transportation",
    "Shuttle bus service",
    "Taxi service",
    "Meeting rooms",
    "Baggage storage",
    "Concierge",
    "Currency exchange",
    "Non-smoking hotel",
    "24-hour check-in",
    "Dry cleaning",
    "Laundry service",
    "Ironing service",
    "Air conditioning",
    "Room service",
    "Safe",
    "Iron",
    "Flatscreen TV",
    "Non-smoking rooms",
    "Suites",
    "Family rooms"
  ],
  "reviews": [
    {
      "title": "Pleasantly surprised and wowed!",
      "text": "Spent one night prior to  trip out of town. From the moment we arrived, we were blown away by the service and hospitality we received. The check-in process was quick and easy, and we were even given a complimentary upgrade to an airport view room. Not a big difference, but certainly I nice gesture. Upon entering our room, we noticed the message light flashing on our phone. The front desk had left a message that they were going to slide a complimentary breakfast voucher for two under our, as a way of saying thanks for my loyalty (I'm a Silver Bon Voy member). About 30 minutes later, there was a knock at our door, and room service was there with a charcuterie  board of meat, bread and cheeses, and some bottled water. We thought that they had either got the wrong room, or we were being punked! However, it came with a very nice hand written card again thanking us for our loyalty.  The room was spacious, clean well appointed. The bed was very comfortable. Overall, this was a great stay and we will definitely be back.",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Best place to stay by Pearson",
      "text": "Super friendly and accommodating staff.  One of us has a feather allergy, and housekeeping promptly came to de-feather the room.  Shuttle drivers were super accompanying, reception desk was so friendly.  We have stayed at this hotel many times while in the Toronto area. Shuttle to the airport and took the UP Express to downtown Toronto.  Will definitely stay here again during a visit to the city.",
      "rate": 5.0,
      "tripDate": " March 2020"
    },
    {
      "title": "First Class Service from the minute we arrived!",
      "text": "My wife and I were at a conference on the weekend of March 6-7.  From the minute we arrived in front of the hotel the service was first class.  From the helpful doorman to the check-in staff.  We had a light dinner in the Restaurant (Crosswinds Bar & Grill) which was good, but a bit overpriced for what is offered, but again very near the airport.  We also had Breakfast in the morning, which was a buffet, again no issues.Check out was very efficient and parking was a good value as well, again location has a factor in price.My famous Sink Drain Score (SDS) which is the speed of water draining from the sink came in at 8 out of 10, just made it under 60 seconds.  I use this to judge the maintenance level of the hotel.All in All - 5 stars for this hotel.",
      "rate": 5.0,
      "tripDate": " March 2020"
    },
    {
      "title": "Understaffed",
      "text": "Usually have a great time here. Lately you can tell staffing levels are not where they should be. Typically receive an upgrade as a gold member and my preferences for a quieter room away from an elevator are accomodated. Not this time. Room directly in front of the elevator and on same floor as a bachelor party. Took quite a while to ressolve. I know the pandemic hurts hotels quite a bit but thought these were pretty basic things to take care of. More of a management issue I figure as theres only 1-2 staff on a time. Probably have to look elsewhere for now.",
      "rate": 2.0,
      "tripDate": " November 2020"
    },
    {
      "title": "Some fantasy flair",
      "text": "Check in Desk was upside down on the ceiling, and goblins and gremlins were running all over, including some that sneezed on me (not every sanitary). Restaurant just served wet wipes from the washroom garbage cans seasoned with salt. P.S Wicked witch of the west was the check in agent",
      "rate": 1.0,
      "tripDate": " August 2021"
    },
    {
      "title": "Lack or Recognition and attention to detail",
      "text": "As a Lifetime Titanium BonVoy member, I've stayed at this property quite often.  Excellent business travel hotel.  Close to the airport.  This time my stay was plagued with issues starting right from check-in.  I'm a pretty easy going guest, but I always appreciate a room upgrade when they are available.  If it's not available I understand, but when the hotel \"chooses\" not to upgrade you even though a suite is available, that speaks volumes to me.  I was then told the hotel was busy and nothing was available.  So I went on my BonVoy ap and found several upgraded rooms all available.  If they wanted to ...they \"could have\", but they \"chose\" not to.  Therefore, I would recommend to others to \"choose\" to stay elsewhere with this kind of status recognition.  The rest of the issues were all fairly minor but just added up to an unpleasant stay.  Keys were not coded to exit parking, I used a food delivery service and they would not allow them to bring it up to the room.  Note to Management:  We understand the need for safety, but when I guest orders delivery (or room service for that matter) it's about convenience.  How is it a security risk to have a food delivery service such as Skip or Uber eats deliver to the room, when they entire transaction is available to follow online?  Instead of making your guests come down (which defeats the whole idea of ordering in) why not allow the delivery service up?  (It's not like the elevators need a security key). Or better yet, if it's really about security, \"escort\" them up!   ...or have your staff deliver it.Opted not to have my room serviced during my stay with a DND sign a well.  Yet, 2 mornings in a row, I had housekeeping tapping on my door. When I returned later, the room had been cleaned.Finally could not exit parking again due to the exit begin blocked by delivery trucks.  This is fairly common at this property and not usually an issue, as they will open the entrance gate to allow you to exit.  This time, I had to go into the hotel 3x to ask them open the gate to allow myself and others to leave.  Details mean everything.  Just not here.",
      "rate": 3.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Conference",
      "text": "Hotel was very nice, checkin was easy and friendly. Lobby bar could have had a better staff our waiter wasn’t very friendly or personable. Rooms very clean spacious and modern. The bed was extremely comfortable. Conference center was average the food was average during the conference all in all an above average Saturday but the cost reflected that. Cheers,",
      "rate": 4.0,
      "tripDate": " February 2020"
    },
    {
      "title": "No Food At The Hotel…..Seriously!",
      "text": "Arriving at 21:20 I checked in, deposited my bag in the room and went to grab some dinner and a drink. I was told that the restaurant and bar was closed; at 21:30 in an airport hotel with flights arriving until late at night! The response was tough, we can’t do anything about it.The Duty Manager said he could give me a bottle of water! The same Duty Manager that checked me in 10 minutes earlier and couldn’t be bothered to say “by the way the restaurant will be closing in 10 minutes. If an airport hotel is not going to offer any service after such a time then at least say so on your website rather than leaving people exposed like this, it is appalling.If you are planning to arrive after 20:00 then grab a sandwich at the airport because you won’t get anything here!",
      "rate": 1.0,
      "tripDate": " November 2021"
    },
    {
      "title": "Park and Fly Stay",
      "text": "Stayed here the night before flying out. Check in was quick, super close to lots of restaurants within walking distance.  Enjoyed a few drinks in their bar area in the early evening and also ordered a glass of wine to the room later evening.  Clean and comfortable room.  Shuttle service to the airport was quick in the early am (although cramped as the van was packed).  Upon return and once the shuttle was called they picked us up within 8 minutes and dropped off right at our car in their parking lot.  Will stay again for certain!",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "A Fantastic stay ",
      "text": "In the last 4 days I've stayed at 2 Westin properties and my last stay was at the Westin ( Airport ) from the moment I walked in, I knew I was going to love staying here. The doorman was quite friendly and cheerful which is always nice to see. Tony at the front desk was such a pleasure to deal with, its nice to see someone that enjoys their career but yet so easy going and friendly. I stayed in one of there suites and I was pretty shocked how stunning the room looked. A spacious livingroom area with a beautiful dinning room table off to the side, nice big windows which gave of nice views of the city. It had 1 full bathroom and one half and a room with a nice big king size bed, a sofa couch and a working desk. The suite was beautifully decorated in modern furniture and had a nice feel. The breakfast buffet was a nice added touch to the morning as it had a little bit of everything and everything was fresh too. I can't say enough about the staff here, everyone here is so friendly, nice, and certainly accommodating too. Also, I just wanted to say Thank you to Ingrid, the little issue that occurred was really nothing but I do truly appreciate you going over and beyond to make sure my stay was fantastic and bright. It's just those little things that make everything else shine and you definitely did that. Thank you Tony and Ingrid for making my stay a lovely and comfortable one. See you again soon. :)",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Perfect hotel to stay, close to the airport.",
      "text": "What I truly like about this hotel is that it's location is great in terms of convenience. Located just minutes away from Toronto Pearson International Airport, this hotel offers a free shuttle bus to and from the airport terminals. The hotel looks very new and has a modern design. We were staying at the suite with king size bed. The room was spacious and perfect to stay with the baby. Shower was good too with hot water.There are awesome amenities like swimming pool and fitness.We had fantastic breakfast. And if you want to have latte with oat milk they will bring it to you too! We could even enjoy vegan omelette and vegan sausages!If you arrive late definitely order some food from the bar. We've tried delicious cheesecake! My favourite meal was salas with salmon. Very delicious!",
      "rate": 5.0,
      "tripDate": " August 2023"
    },
    {
      "title": "Shutting water off with no notice.....",
      "text": "Checked in this afternoon, after 3pm.   After making a few business calls, went down to bar/restaurant for an overpriced mediocre steak and drink.     Came back to room,  was going to take a shower...and a few minutes before 7pm they slide a notice under the door that the water is being shut off from 7pm to 9pm.     No mention of this when I checked in,,,,and I see a notice in room they shut the water off yesterday as well.  A professionally managed hotel would tell guests this at checkin!    Will not stay here again.",
      "rate": 1.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Horrible staff(like the other reviews noted)",
      "text": "Staffing challenges to say the least! I arrived at the airport at 9 pm and at that time the shuttle leaves on appt only. Thus you must phone the hotel shuttle number which was supplied to me specifically by the hotel, I called the correct number and over and over the phone rang  and nobody picked up. I gave up and waited for a taxi. Eventually I arrived back at the hotel and told my story to the stone faced rude lady behind the stand up check in. I specifically informed her that nobody answered the phone. She by rote told me in no uncertain terms that it fact ii DIID NOT call. I then  showed her my phone and proved I had called.No apology and still the same grim face. I then demanded to speak to the manager who conveniently was in the back area and would not come to visit one of their customers. I then demanded a voucher to compensate for my taxi fare.To their credit they produced a $20 voucher for food and I suggested I would prefer a drink. They changed the voucher. I went to the bar and yet another stone faced unfriendly bartender took my order and when I presented my voucher he stated it was invalid. I said no and then he had to consult with another staff member. He then begrudgingly took the  voucher and accepted it.Pls note nobody apologized for anything. I have travelled all over the world and am always impressed by the Westin standards and the superb staffing.This hotel is the exception. I would avoid at all cost. There are plenty of good hotels nearby like the ALT",
      "rate": 1.0,
      "tripDate": " October 2023"
    },
    {
      "title": "Awesome staff and great stay",
      "text": "I spent 10 days there and i had a really comfortable stay.The staff is amazing with a great attention to details and a genuine willingness to help and make the stay as comfortable as possible.The bed is super comfortable and the breakfast is rich and varied.The gym facilities are top notch and very well looked after, including the peloton and the swimming pool.The grill bar serves a good selection and good food.I cannot fault this place and i cannot recommend this enough.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Good business stay",
      "text": "I recently stayed here for 2 nights while on business in Toronto.  The hotel is quite close to the YYZ airport which is nice and has a free dedicated shuttle every 30 minutes.  The rooms are nice with the standard Westin amenities, but a bit dated.  The lobby is nice and I enjoyed watching sports at the bar and their cocktails.  For a fee there is a nice breakfast in the lobby as well.  I did find the hotel to be a little loud at night with people partying and slamming doors but perhaps it was just the nights I was there.  I would stay here again with business close to the airport.  An Uber to downtown took about 45 minutes with traffic.",
      "rate": 4.0,
      "tripDate": " November 2022"
    },
    {
      "title": "Good conference hotel",
      "text": "We stayed here three nights while attending business meetings on site. The room (919) was comfortable and clean. The bed's mattress needs to be replaced. It slopes the one side due to the wear of people sitting and sleeping on that side. Surprisingly, for a hotel so close to the airport, we did not hear any planes. In fact, we found the hotel very quiet.  The food that was provided at our meetings (breakfast and lunch) was very good. It was much better than you'd expect and there was good variety. Several of our participants had special dietary issues, and were easily accommodated.The staff are very friendly and helpful. The shuttle service to and from the airport is very fast and on time. Remember to tip the driver!",
      "rate": 4.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Mildew and mold… gross",
      "text": "I normally enjoy staying at the Westin however, the smell of mildew and mold was so overwhelming in the bathroom, I didn’t want to shower. If we hadn’t arrived super late, after a long flight, I would have changed rooms but with two young kids it was a hassle. We left early the next day. With so many other choices in this area, I will not be coming back.",
      "rate": 2.0,
      "tripDate": " April 2022"
    },
    {
      "title": "The Westin brand is not what it used to be,it is now a budget hotel with quality hotel prices.Dark and dingy room.",
      "text": "The shower was a death trap in a bathtub out of the 60,s.The so called cookies given at the front desk were crumbs that fell out of the bag, better not to serve them.This hotel is a $120 a night not $288.If you are a senior the fourth floor rooms can be a long walk from the elevator’s and the lighting in the room is dismal.Westin Airport is a two star hotel at best.",
      "rate": 2.0,
      "tripDate": " November 2022"
    },
    {
      "title": "Incredible staff!",
      "text": "We unexpectedly had to stay in TO after missing our flight. The staff at Westin turned the very stress and confrontational experience at the airport into a more positive one. The front desk was amazing and searched high and low for a crib for us when all of theirs were already in use. Belinda, our server at the restaurant, took our 10 month old baby for a walk so we could enjoy our breakfast. The the chef, Andrew, was so pleasant to talk to while cooking our omelettes (the best omelettes I’ve ever had), and he introduced my dad to vegan eggs and taught him how to cook them which revolutionized my dads breakfast from now on since he is allergic to eggs. Andrew even offered him a carton to take home but unfortunately we couldn’t bring it on the plane. Everything at breakfast tasted absolutely amazing.  Turan from the front desk also took a shining to our baby and wanted to hold her, he also went out of his way to make us feel special. Would definitely recommend staying here!",
      "rate": 5.0,
      "tripDate": " December 2022"
    },
    {
      "title": "Nice Airport Hotel",
      "text": "I stayed at the Westin one night for a friends wedding. The hotel is super busy and pretty big. The service was great - every associate I interacted with was helpful and friendly. The room was okay - spacious but very dark as there weren’t any overhead lights. The beds were comfy and the room was clean, although showing wear on the walls and doors. I can’t speak to any of the food because we ate off property but there are plenty of options around / lots of delivery options too. Parking was easy enough and no problems getting in or out of the lot. I’d recommend this hotel if you are looking to stay by the airport!",
      "rate": 4.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Hotel ok but personal service crap",
      "text": "I am on a final leg of a longish journey home and decided to stay near Pearson overnight. Part of by decision to stay at Westin was that it was close to the airport and provided a free airpot shuttle back and forth. I ordered a place in the shuttle for 06:00 am and was told to arrive at the lobby 5min early. I did so and as I got ready to board, I was told that this shuttle was not for me and another one would arrive soon. Several airline pilots boarded the 06:00 shuttle and I was told I could not go with them. So I waited for 20 minutes, and when it was clear no second shuttle was coming I asked when the second shuttle was coming. They gave some excuse about the weather and that he is delayed. Anyway, it sis not show and I ended up waiting for the 0600 shuttle to return to the hotel. It was now about 0630. Then they put me in a full shuttle with airline stewards - a very risking situation in these days of Omicron. OK, here's what the hotel should have done. If it was clear to them that I would not be leaving the hotel in a shuttle at 0600 as promised, they should have booked me a taxi or Uber. They didn't. I will for sure avoid this hotel if I ever have to lay over at Pearson again and I would advise you to do the same.",
      "rate": 2.0,
      "tripDate": " January 2022"
    },
    {
      "title": "Enjoyable stay",
      "text": "Great breakfast buffet with a good assortment of food.  I enjoyed the pool. I was pleased that the pool stayed open till 11pm. My  room had a large screen TV and my bed was very comfy and warm. I would recommend this hotel to anyone. The only complaint I have is that parking is too expensive at $28 a day.",
      "rate": 5.0,
      "tripDate": " April 2022"
    },
    {
      "title": "Had to move to another hotel mid stay. Needs work.",
      "text": "There were issues with no water or no hot water in the rooms for the 4 days I stayed here. No notice other than random written notices pushed under the door? Reading other reviews seems to be a persistent problem with the boilers. Couldn't get a hot shower for 3 days and the water pressure, when on, was low.Heater in room was noisy and hard to sleep as it cycled on and off continually.Meals were good but expensive compared to other hotels in the area.I finally checked out and moved to another hotel on the 4th day of my 2 week stay in Toronto.I will confirm the staff were professional, the hotel was clean but a little dated and the bed was comfortable.",
      "rate": 2.0,
      "tripDate": " March 2020"
    },
    {
      "title": "Relaxing overnight stay at elegant hotel",
      "text": "A one-night stay at an airport hotel is not always relaxing and productive, but my recent experience at Westin Toronto Airport was really delightful in every way.  I felt welcome, secure and cared for. The hotel is immaculately clean, food was great (excellent Starbucks coffee and Eggs Benedict) and every employee I encountered was gracious and helpful, without exception.  The location is super convenient, with handy parking, easy in/out from Dixon Road and great access to hwys 427, 401 and the airport.  Thanks to the team at Westin Toronto Airport for making my overnight stay feel like a mini vacation!",
      "rate": 5.0,
      "tripDate": " September 2021"
    },
    {
      "title": "Westin bed??",
      "text": "Ignoring the used facecloth that was hanging in the shower and the inability to control the temperature in the room, the worst thing about the stay was the bed. We specifically selected this hotel because of previous experiences with the amazing westin bed. This one was hard and the cheap sheets left our skin raw by morning. Couldn’t wait to get up after a horrible sleep.",
      "rate": 2.0,
      "tripDate": " February 2020"
    },
    {
      "title": "COCK ROACH IN THE ROOM",
      "text": "Cockroaches!!! yes , i never thought i would encounter these at the westin!  this you expect in warmer climate areas .the staff are really nice , but when you step out of the shower to find two cockroachs running across the vanity room (532) i managed to kill one in the towel. i called right away reception,they came up apologized moved me to the top floor and gave me a couple of free vouchers for breakfast . that was it,, i wanted out of there but had to go to work and never had time to move to another hotel, i had asked for some kind of refund but nothing, when i checked out i told them i would never return , i was told by the nice reception guy  someone would send me a email to apologize. but to this day nothing, i understand these things happen , but in westin?? i noticed that even the new room the bathroom was not that clean either,,so this is just heads up , even in the westin , they have cockroaches! too bad the staff are sooo kind and to have to find something like this in the room just dont do it ! i always thought westin was one step above ! i am  very dissappointed",
      "rate": 1.0,
      "tripDate": " February 2024"
    },
    {
      "title": "The lounge from hell",
      "text": "My family and I recently stayed overnight on an AC voucher after a missed connection. We arrived late, were very tired and tried to get a meal at the bar and grill. It was a zoo: understaffed and out of control. We gave up getting any service after about an hour. I often stayed at Westins while on business and found their service to be of the highest quality. Whether because of the COVID era in general, or that particular Friday night in particular, this experience was awful.",
      "rate": 2.0,
      "tripDate": " November 2022"
    },
    {
      "title": "Did they clean room?",
      "text": "First, we noticed hotel amenity were missing. nothing in bathroom. No tissue, no bath mat no cups. Only few towels. Also we found foods prices on floor.  The freezer was broken and phone didn’t work. So we have to go back to front desk to get a new room.They send mechanic to fix freeze but we ended up to change the room which was beside broken air conditioner made really loud noise all night and we have to stay 3 nights. Housekeeping forgot to clean the room 2 days.  We always had great experiences to stay with Westin in other cities and countries. But this is worsted Westin we stayed. Definitely not a 4 star hotel.",
      "rate": 1.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Tired and a bit dated",
      "text": "Truth be told, I haven’t stayed at many properties in the Dixon Road area apart and from the Sandman, so perhaps my comments need to be qualified. Nevertheless….1) I stayed here at the end of March, and the temperature control in the rooms was bizarre. Couldn’t get mine below 74-75 degrees F — ended up having to move on the second night to a room on the 9th floor that had a bizarre door to some weird space that was something between a closet and an outdoor patio. Freaked me out.2) Front desk staff was friendly and helpful, but constantly seemed overwhelmed. Took more than 10 minutes waiting at the kiosk to buy a few items from the market (which was poorly stocked, I’d add).3) Everything in this hotel screamed ‘tired.’ Finishings were completed by folks who obviously had no pride of work, and many of the more recent updates were showing signs of early deterioration. I’d suggest this property is below what you’d come expect from most Westins.4) While the group catering / Banquet food was passable, it wasn’t by any means excellent. The pizza was cold and the breakfast sandwiches were on the bland side. It’s an airport hotel — so whatever — but the entire bar and restaurant area just seemed out of place.Instinctually, peering out down the strip, I have to imagine there are better places to stay that deliver commensurate value. That said, if it’s just a night or two, there was nothing that would prevent me from at least considering this place again.",
      "rate": 3.0,
      "tripDate": " April 2023"
    },
    {
      "title": "Excellent airport hotel",
      "text": "Stayed at the Westin to get a good night's sleep before a 25+ hour travel and this hotel was perfect.  The bed was so comfortable, so I sleep so well the long flights I had the next day were a little easier.  Eddie at the front desk was so helpful with any question and suggested dinner options and parking. Will for sure stay here next time I fly out of Pearson airport.",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Park n fly",
      "text": "Excellent service, close to airport. Shuttle was 5 minutes.    Very large secure outdoor parking to leave your vehicle while you travel.   Subway next door for quick takeout, Keg across street and Lone Star a minute walk.  View of runway, Pearson across street. No hot food served due to Covid.   Starbucks in lobby which is super expensive.  $25 for 2 coffees and a breakfast wrap. Parking for 15 days and an overnight was only $130, which is an excellent deal.  From desk staff, very polite and efficient. Rooms are nice and the bed super comfortable.   Sheets, heavy cotton, and pillows to die for!!100% I’ll stay again.",
      "rate": 5.0,
      "tripDate": " January 2021"
    },
    {
      "title": "This was a nice hotel, once…",
      "text": "Waiting for a connecting flight, we decided to stay two nights at the Westin hotel at Toronto Airport. It is conveniently located a few minutes away from the airport. The hotel even offers a shuttle service.We decided to book the prime minister suite. The suite has a very nice size. However, like the hotel, it should be renovated. We had some issues with the heating system as we were not able to get the temperature we were looking for (and it was snowing outside).We are cold for 3 days, impossible to increase the temperature.Each lighting device had another type of bulb (cold light, warm light, high lumen, low lumen, aso). The lighting was therefore not really comfortable in the evening. This should definitely be changed, especially for the hotel’s top suite… No safety box  in the room, again I don’t understand for a prestigious and big suite.The airport proximity is a good point. However, the windows are not really insulating the rooms. You can here everything from the outside…Upon arrival, we visited the room and found an empty coke can on the meeting room’s table. This should not happen too…The bathroom had a nice size. You can choose between a shower and a jetted bathtub to relax. We had however some issues with the bathtub jets. I guess, it would be interesting to change the whole system, which might be from the 90’s…No room service at this time, because of covid (I guess). You can however order some food at the restaurant downstairs. There is also a small Starbucks if you need some coffee. We would have loved to have some more drinking water in the room as well as a tea kettle (there is only a coffee machine). A friendly staff from the hotel got us some hot water from Starbucks in order to have some tea…To sum up, the hotel is quite convenient because of its proximity to the airport. It is aging but still ok for one or two nights.",
      "rate": 3.0,
      "tripDate": " December 2021"
    },
    {
      "title": "Hotel refuses to remove a restaurant charge I did not incur",
      "text": "I let the hotel know twice before check-out, and then again by contacting Marriott directly, that the $80 restaurant charge on my folio was not mine. The property has not followed-up, and I am now disputing the charge with my credit card company. Careful if staying at this property, watch your folio carefully.We were initially given room keys that did not work. The lamps in the room were unplugged. As a Titanium member, I expect much more from a Marriott property.",
      "rate": 1.0,
      "tripDate": " March 2022"
    },
    {
      "title": "Horrendous stay",
      "text": "Our family stayed here for 2 nights with our child's hockey team. The hotel was beyond horrendous. They had a large party happening in one of the ballrooms woth loud music until 5am. Patrons of the party all over the 3rd and 4th floor yelling/screaming and having loud intercourse until 6am. Multiple calls to the front desk by multiple guests only to be told they had no security working and the party would be doing at 5am. Went back to the desk this morning to be told the party goers would be here all weekend until Monday. When we told them we would check out, we were advised we had to commit to a min q nights stay and would lose the cost of our 2nd nights stay. We are loyal Marriott Elite member and have never had such an awful stay. These kids need rest and sleep. Shame on you Westin",
      "rate": 1.0,
      "tripDate": " May 2022"
    },
    {
      "title": "Nice renos",
      "text": "I have stayed in this hotel in the past and was glad to see it was renovated when I was looking for accommodations by the airport for my latest trip to Toronto.  The lobby and dining area looked fantastic, very modern to keep up with the times. My room was nice, the carpet was replaced by hardwood-like flooring with an area rug in between the 2 double beds (wished they were queen beds, but it is what it is). The bathroom needs another upgrade. The countertops looked burnt. It looked like someone took a match to it on a couple of spots and there were little gaps between the wall and the counter on both sides and my kids kept dropping things in it (not on purpose of course).  Parking was $30/night!  It’s a busy gated, outdoor parking lot, we had to park further than anticipated but it’s not that far of a walk but it was windy and cold so it felt like walking across the Tundra. Lol. We saw a security guard walking around the first night we were there. The second night, there was a sketchy guy smoking pot in the corner, don’t think he was suppose to be there because he had his “home” with him. This usually doesn’t bother me, but it might bother others. There are lots of nice restaurants around this hotel, and most are opened until quite late so we had no problems getting a table. Front desk was very pleasant as well as any workers who walk by.Overall, I would recommend this hotel.  It’s 4 mins away from the airport, I didn’t hear any airplane noises. Had a great view of the Antonov parked outside the airport from my room. Got a history lesson of this plane from the husband!",
      "rate": 4.0,
      "tripDate": " December 2022"
    },
    {
      "title": "Really are you kidding, pure greed",
      "text": "So I booked a cruise for the end of January that I have to cancel because of Covid, the cruise line is giving me 75% back the airline is giving me 100% back and the Hotel I am spending 1 night in is giving me zero back. This is ridiculous during covid times, do you think I'm canceling cause I want to? This is pure greed on the hotel, I'm sure you have many rooms available, and this is costing you nothing to cancel.You won't see my business again",
      "rate": 1.0,
      "tripDate": " December 2021"
    },
    {
      "title": "Elegant without attention to practicality.",
      "text": "The room refrigerator was warm, about 60 degrees. There was no overhead light so I had to switch on floor and desk lamps as I went into the room. There was no nightlight, Temporary parking on arrival is very limited- all marked with “FireLane” signs; it could be more welcoming.    The lobby and desk staff were very upscale. The parking lot was gated and had lots of parking places but the parking spaces were narrow. I saw a security vehicle patrolling it at 5:00 am.    I fell asleep, eventually after listening to a child screeching in the next room and woke up to hear the adults talking loudly.      There was no good place to work on my computer; the “desk” is not very deep and the chair is needlessly heavy.     Minor house keeping issues:   The king- sized bed had a queen sheet that didn’t hang down on the sides and wasn’t tucked in at the bottom. The duvet cover was huge and heavy. I wrestled with it all night.    I selected it because it offered a “one night stay, 8 day park” package so I could fly out and leave my car there. Very convenient. Airport Shuttle was Punctual.",
      "rate": 3.0,
      "tripDate": " July 2023"
    },
    {
      "title": "So many other great options, stay elsewhere",
      "text": "The hotel itself was comfortable, clean and very standard. It’s definitely in need of some updates and more of a 2 star.  ...the restaurant looks and feels like a cafeteria. The concierge was friendly and helped us print off some documents for our trip as their printers for guests had been out of service for some time. We booked our shuttle for 7am the following morning. We arrived in the lobby at 6:56am, the shuttle driver approached us and asked if we were waiting for a shuttle. He directed us to sit in the lobby and wait. At 7:15 he was still standing in the lobby, I approached him and mentioned I had an international flight leaving at 9:15am. The shuttle did not leave until 7:36am. The shuttle driver asked which airline we were flying with. He dropped us off at the WRONG terminal. This left us (myself and 12 year old child) sprinting (not running) to our gate. We were the last to board our plane, and would’ve missed our flight had they not held the gate open for us. A highly embarrassing and stressful way to start a family trip.Upon return we spoke to the front desk about this experience. They said they would follow up with us. 17 days later I have yet to hear from them. I called yesterday, explained the situation again and they offered a 10% discount for our next stay. There are so many better options in the area with great customer service and reliable/competent shuttle services. Hilton, Hampton, Sheraton etc. We’ve stayed at them all and have never had any issues.",
      "rate": 1.0,
      "tripDate": " October 2021"
    },
    {
      "title": "Great choice on Airport Rd/Dixon",
      "text": "I have tried numerous hotels in the vicinity of the airport; Gateway Sheraton, The Hilton, Airport Marriott, Sheraton Toronto Airport Hotel & Conference Centre, The Sandman. As I'm in the area a few times a year I switch it up for variety and to be close to different restaurant choices.This was my first trip to the Westin Toronto Airport and it will not be my last. All the common areas were kept neat and tidy, well decorated, bright and pleasant. The lobby bar/restaurant was vibrant and service was excellent. I stayed on the 15th floor (can't recall my room) and was in a standard King bedroom. The room was clean, well appointed and comfortable. I know that the building is not new and there has been extensive renovations over the years. This hotel certainly doesn't show it's age and is a great choice. Bonus features are; beside Lonestar Grill, across the street from The Keg and directly beside Ruth Chris. All great choices. I will certainly be back on my next stay.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Great stay",
      "text": "My first time at the Westin Toronto Airport, From the start as we countered issue, Sal set the the tone from the start, was very professional, friendly and helpful. Made sure that we were satisfied with the room and also offered to relocate, however we decided to stay and he assured us that by next day it will be fixed and passed on the notes to Puja to make sure we were taken care of.On a daily base i was dealing with Eddy who is professional yet friendly and very helpful. there is a couple of ladies and couple of gentlemen that i have not mentioned the name are also very professional and helpful.In housekeeping Chanel and the rest of the team very friendly and helpful in all our needs which was much appreciated.There was Prince and Blaine who were also very curtious. I believe Prince who is very professional and very attentive of all guest, even though he was not at the front desk he listened to all guest  that had any concern.",
      "rate": 5.0,
      "tripDate": " August 2020"
    }
  ]
}