{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "The French Connection",
    "url": "/Hotel_Review-g155019-d256274-Reviews-The_French_Connection-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "5.0",
      "reviewCount": 29
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "102 Burnside Dr",
      "addressLocality": "Toronto",
      "postalCode": "M6G 2M8",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-s/00/11/11/7f/the-living-room-a-relaxing.jpg?w=500&h=-1&s=1"
  },
  "description": "Toronto: a diverse, multilayered, multicultural, sophisticated, exciting city. The French Connection, a delightful hideaway, a peaceful environment, in the shadow of a castle, in the heart of it all. An environment where fine art, classical music and excellent food provide an exceptionally restful backdrop to your stay in Toronto, be it for business or romance.",
  "featues": [
    "Free High Speed Internet (WiFi)",
    "Internet",
    "Air conditioning",
    "Non-smoking rooms"
  ],
  "reviews": [
    {
      "title": "Long live The French Connection!",
      "text": "Diane Richard has designed and maintains one of the lovliest B & B's in all of North America. She has an irresistible personality which is why most visitors - in addition to the warm furnishings, quiet neighborhood, close proximity to the city center and delicious Canadian breakfasts - keep coming back and recommending the place all over the web! I have stayed at The French Connection twice now and have been absolutely pleased with Ms. Richard's attention to detail, kindness and wit. I would highly recommend this B & B to anyone visiting Toronto.",
      "rate": 5.0,
      "tripDate": " December 2005"
    },
    {
      "title": "Excellent, Friendly Service",
      "text": "Im a student from Scotland and in my quest for somewhere to stay in Toronto this summer I came across The French Connection. I emailed the hotel to find out prices, which unfortunately were out with my current student budget (although very reasonable!). I spoke to Diane at the hotel who was very helpful and kind in trying to reduce the price for me, although I still could not stretch my budget. Diane was very helpful in offering me alternative accomodation for my stay, which I was extremely grateful for. She offered to get in touch with a friend of hers that does 'home stays', although she already had a student staying during the summer. After that, Diane asked where in Toronto I would be working so that she could suggest places in the area. She suggested the University of Toronto Residences, which turned out to be perfect for me and I am currently awaiting a reply from them. I was very touched by how kind and helpful Diane was and intend on keeping a bit of money aside to have at least one night in The French Connection as I am sure it will live up to all my expectations, especially if the excellent, friendly service I have recieved so far is anything to go by!I would definately recommend having a look at The French Connection when considering where to stay in Toronto. I would also like to thank Diane for all her help!",
      "rate": 5.0,
      "tripDate": null
    },
    {
      "title": "Hostess with the most to offer...",
      "text": "Located a few minutes away from downtown Toronto, \"The French Connection\" offers the visitor a warm and pleasant atmosphere.  This is largely due to the well travelled and well read Diane Richard, who can entertain you with her experiences abroad all thewhile preparing croissants for breakfast!  As a well read and travelled doctoral scholar who loves to cook, being in the company of Diane was a humbling experience. I couldn't ask anything more of a hostess! Diane, a native of Ottowa and an architect by training, has made sure that each room has a \"personality\".  This is particularly the casein the kitchen and dining room, where the morning sun lights up these two rooms and naturally invites visitors to join Diane for breakfast.  I highly recommend everyone and anyone visiting Toronto to schedule a stay at The French Connection.",
      "rate": 5.0,
      "tripDate": " December 2005"
    },
    {
      "title": "The Place To Stay In Toronto",
      "text": "I visit Toronto regularly and have been staying at The French Connection for several years now.The French Connection is located in a beautiful neighborhood, minutes from a subway station, next to many historic sites such as Casa Loma castle and several excellent restaurants within walking distance.A warm welcome by an outgoing hostess awaits you on arrival. A hostess that is attentive to your every need during your stay and always willing to help.The house is beautifully decorated. The large sitting room on the main floor makes the evening very pleasant and relaxing. It is an excellent place to catch up on some reading or keeping up with email using the complimentary WIFI.The daily breakfast of freshly baked croissants and muffins served with butter and jam, cereal, orange juice, coffee and eggs prepared to your liking make breakfast a truly enjoyable experience while listening to the sounds of classical music.The furniture in the bedrooms is new. The new mattresses make for a pleasant, restful and comfortable sleep.My stays at The French Connection are always a truly pleasurable experience and I am recommending it to anyone who visits Toronto and desires exceptional and first class accommodation. You will be happy with your choice.",
      "rate": 5.0,
      "tripDate": " January 2006"
    },
    {
      "title": "Home away from home in Toronto",
      "text": "I was in Toronto on business (and a bit of sightseeing) for about ten days and am grateful to have found Diane's charming and cozy bed and breakfast. I get tired of hotels, but did not think to consider a B & B until I saw how many glowing reviews this place had. So off I went, to find a warm and inviting home in a quiet neighborhood, yet close to downtown Toronto via a ten-minute walk to the subway, then a quick ride to the downtown neighborhood of my choice.If you want to feel like an invited guest rather than a tourist, Diane's B & B is perfect for you. She cooks wonderful breakfasts, which came with wonderful conversations! The neighborhood is safe to walk at night, and the rooms, all of which have their own theme, feel like home right away. I don't need to look anywhere else; this is where I will stay any time I am in Toronto.",
      "rate": 5.0,
      "tripDate": " May 2006"
    },
    {
      "title": "Highlight of Toronto Vacation",
      "text": "Recently, my mother and I took our family vacation to Toronto.  Having never stayed at a bed & breakfast before, we had nothing to go on except previous glowing reviews for the French Connection on this site.  Any doubts we had evaporated immediately when our hostess Diane greeted us warmly and showed us her inviting accommodations.  Our bedrooms were clean, as was every room in the house.  The very new mattresses gave us a sound sleep every night.  The decor was bright and attractive.  The bedrooms followed single color themes.  In terms of decorations, they were minimally decorated with an asian flare, including bamboo shoots, origami, and japanese prints.  The bathroom was always very clean.  It featured a beautiful vanity, hairdryer, and a spacious shower.On the main floor, there was a bright sitting room, beautifully decorated without being garish.  I sat in one of its excedingly comfortable chairs each night, in the presence of the fireplace and the piano, and used Diane's complimentary WiFi with a fast connection.The highlight of our stay there was breakfast every morning.  A full spread of pastries, cereal, fruit, juice, and delicious dark roast coffee accompanied the various main dishes.  All of the previous reviews mentioned the crossaints, the praise of which I echo fully, but I wish to point out another pastry.  Every morning I enjoyed a still-warm-from-the-oven chocolate-filled puff pastry.  The chocolate was dark and not too sweet.  They were hands-down the best pastries I've ever had.  On top of being an excellent chef, Diane is also a delight at the table.  Her wit, warmth, and knowledge were just as important in starting our day well as the food itself.All that is topped off by The French Connection's prime location in a beautiful neighborhood, five minutes from a subway station, many historic locations, and several good restaurants, which are discussed further on The French Connection's website.I would never think of staying elsewhere in Toronto!",
      "rate": 5.0,
      "tripDate": " August 2005"
    },
    {
      "title": "A class by itself",
      "text": "I had a large group of friends visiting from abroad who were nervous about making their first trip to North America.  I spent the greater part of two, very stressful weeks trying to find comfortable accomodations with a trustworthy proprietor.  I believe it was luck that brought me to The French Connection. The house is beautifully appointed without an ounce of pretence, the food is amazing and Diane, being the gracious, magnanimous host she is,  went out of her way to help me resolve the many headaches that arose with my friends and their travel arrangements.  She is a consummate host and I highly recommend her and her establishment.  You won't be dissappointed!",
      "rate": 5.0,
      "tripDate": " June 2005"
    },
    {
      "title": "Recommend to stay at The French Connection, Toronto",
      "text": "I am a French business woman living in Paris and have visited The French Connection more than once. I can confidently recommend The French Connection to you. You will receive a warm welcome from the very charming owner, Diane Richard. The French Connection is a comfortable and refined residence which combines style and elegance: pleasant, cosy guestrooms, comfortable beds, lovely soft sheets and towels, quiet sitting room and fine dining room where delicious breakfasts are served daily with \"très chic\" blue and white fine china that looks very French complete with warm croissants that are as good as the best in Paris.  The six bedroom 1920's house has been perfectly restored and modernized by the owner who has an architectural background. The kitchen is beautiful. The  bed rooms, individually decorated, all have a desk, a telephone, with free local calls and free wireless high speed Internet access, perfect for staying in touch with office and friends. Several bedrooms have king size beds and private bathrooms. My room had a jacuzzi tub and a private terrace which I loved! At night, I very much enjoyed the lounge with piano and the fire place!  Also available to guests is a common area with tea and coffee making facilities, a microwave, wine glasses and fridge. Guests are free to use the living room to receive their own guests or the garden to relax, in good weather. There is also a library where guests can borrow books on a variety of topics, in particular, books and magazines on art and design. Staying at The French Connection felt like staying in a private club as a guest with privileges. I enjoyed good company at breakfast and also the feeling that I was staying in a fine place that felt good to come home to.When I told the people I met in Toronto where I was staying, they were all impressed. That area of Toronto is where many \"rich and famous\" Canadians live, they said. It was important to me as a woman travelling alone to know that I had chosen to stay where the \"connaisseurs\" of Toronto also chose to live. I always felt safe and secure at anytime and it is always comfortable to travel and to feel confident about where you are staying.Yes! I do recommend you to stay at this place, you will not regret for sure!Monique-Jeanne",
      "rate": 5.0,
      "tripDate": null
    },
    {
      "title": "The French Connection made my connection a success!",
      "text": "As a bed and breakfast connoisseur, I did not stumble on to the French Connection in a normal “bed and breakfast” way. The French Connection came to my rescue in the way of my business. The homiest, home away from home is located new downtown Toronto and offers all the amenities and comfort of your home, minus the responsibility. As a film producer/director, I needed to feel comfortable so I could create and conduct business as usual. I had meetings in a bright, beautiful kitchen with fresh coffee and cookies. I screened my work in a large, yet cozy, basement on a big screen TV. As the host, Diane and The French Connection offered comfort, sophistication and close access to a fine city. Simonee Chichester",
      "rate": 5.0,
      "tripDate": null
    },
    {
      "title": "A Wonderful Stay",
      "text": "The French Connection bed and breakfast is a great place to stay if you're planning on visiting Toronto for any reason.  Located very near Casa Loma in a beautiful neighborhood, it offers a perfect starting place for sight-seeing and serves as a comfortable retreat during the day or night.  Excellent restaurants are within walking distance and public transportation is readily accessible and easy to navigate.The entire house has a gorgeous modern decor and is very warm and welcoming, with all modern conveniences, and offers everything a guest would need, from the relaxing bedrooms to the cozy living room that includes a grand piano. The best part of my time at The French Connection was the breakfast: freshly baked croissants and muffins with butter and jam, cereal, orange juice, coffee, and a delicious herb and cheese omelet -- all to the sounds of classical music.  What a way to start one's day!Overall, my stay at the French Connection was a truly pleasurable experience and I recommend it to anyone who visits Toronto and desires truly first-rate accommodations.",
      "rate": 5.0,
      "tripDate": " February 2005"
    },
    {
      "title": "Excelllent B&B",
      "text": "Our recent four day stay at The French Connection was nothing short of fabulous! The owner and hostess Diane was well informed about the area and offers a B&B facility which is elegant, unique and historic. The house has been restored, yet it maintains its original character in appearance while at the same time offering all the modern amenities without being obvious. Diane's attention to detail is phenomenal - she goes where few others do in terms of freshly ironed excellent quality bedding and service. She is an outstanding cook and the freshly made hot croissants and other tasty treats offered in addition to a different breakfast menu each day were beyond description good. It is evident she is a seasoned hostess and has not lost touch with what is important to her guests and that is a spotlessly clean and warm atmosphere accompanied by friendly, gracious unobtrusive service.",
      "rate": 5.0,
      "tripDate": " May 2008"
    },
    {
      "title": "French Connection Tops!",
      "text": "Our family just returned from another wonderful stay at The French Connection in Toronto.  The French Connection has been our preferred lodging provider for more than six years.  This beautiful B&B is conveniently located near the bus and subway lines and is within walking distance to many of Torontos finest restaurants and attractions.  Diane Richard, the owner/operator of The French Connection, goes above and beyond the industry standards to make certain her guests feel right at home.  We come and go as we please, sun on the terrace and even tickle the ivories of her baby grand!   Ms. Richard is completely fluent in both English and French and speaks other languages as well making it comfortable for nearly all guests to converse.  She is a first-rate concierge with regard to Toronto's art scene, dining spots, city-wide attractions, etc.  Her personal recommendations are outstanding whether one is in search of the perfect little French Bistro for a romantic dinner or the most appropriate play for family entertainment.  Breakfasts at the French Connection are one of the highlights of our stay!   Diane Richard is well educated and well traveled.  Our conversations around the breakfast table are always interesting and enlightning.   And.....her croissants are the absolute best!  They are made from an old family recipe and  baked fresh daily.  All breakfasts are superbly prepared and eloquently presented at convenient times for guests.  The French Connection is truly home away from home.  We wouldn't consider staying anywhere else!The Hoffmann FamilyColumbus, Ohio",
      "rate": 5.0,
      "tripDate": null
    },
    {
      "title": "The French Connection Bed & Breakfast - A True Home Away from Home - Loved It!",
      "text": ".: I stayed at the amazing French Connection B&B in Toronto the weekend of 26-28 October recently.  I highly recommend this B&B if you are interested in such accomodation.  The house is warm in every way - you feel *welcome* as soon as you enter the first time.  Diane Richard is a most gracious and accomodating hostess, and you are made to feel as if the house is yours during your stay.  I stayed in the downstairs room, and felt like I was in my own private world - television, mini-fridge to store groceries, incredible king-size bed, free wireless, very friendly cats!  The house is one of much character, the morning breakfasts delicious and efficient.  The location was perfect for me, as I was visiting someone a few blocks away.  But if I return to Toronto for a similar-type visit, I would not hesitate to book a room again at The French Connection.  I cannot emphasize enough how much at home I felt almost immediately.  Diane, your B&B rocks! :-)  (Oh, and please note that her name is pronounced dee-YAN ree-SHARD - it's French!)",
      "rate": 5.0,
      "tripDate": " October 2007"
    },
    {
      "title": "Different to the normal B and B",
      "text": "Stayed in Toronto for 3 days at this B & B. The house is found close to a subway station St Claire (8 min walk). The subway is currently being renovated and so if you want to purchase a day subway pass, you need to either buy it from another station or, persuade the ticket inspector to let you travel to the next station without having a ticket. The house is well decorated and inviting. Unfortunately, although it is on a side street, it is near the junction of  a mjor road and so can be quite noisey.The house has 6 rooms of which the owner lives in one depending on which rooms are rented out. She usually only rents out 3 rooms at a time and so make sure that what you are being offered is the cheapest rooms available.The gourmet breakfast varies from day to day (e.g. french toast) and daily croissants / danish.Things to be aware of:-Although the bed is made each day, the toilets and room are not cleaned daily. There is no a/c - only fans so in the summer it can get hot. As she provides a gourmet breakfast, dont expect saussages and bacon. There is room for parking on the driveway but let her know in advance. She likes sitting down with you at breakfast and so if you like privacy for breakfast, then you need to be aware. The toilets fail to flush well from time to time so be aware.Overall, if you like living in a bed and breakfast, then this is an alternative to your traditional options. However, we have stayed in cheaper and more better and comfortable hotels in downtown. We do not plan to stay there again",
      "rate": 3.0,
      "tripDate": " June 2007"
    },
    {
      "title": "Home Away from Home",
      "text": "Walking in the front door for the first time, we felt like we were at home. Such a beautiful home and so warm and peaceful to walk into - hearing piano music playing lightly throughout.  The French Connection had everything we were looking for: Beautiful, comfortable rooms with an elegant bath and relaxing whirlpool batch.A safe neighbourhood full of gorgeous, Victorian homes close to the subway and all Toronto transportation.Appetizing breakfasts that energize you for the adventure in the Toronto area during the day.And a warm, friendly, helpful host.We just spent 2 nights there and Diane Richard - the owner/ hostess, made our stay feel as if we were visiting with an old friend. The breakfasts were superb and the conversation over coffee the first morning lasted for hours; we could have chatted all day. We really hated to leave there this morning.",
      "rate": 5.0,
      "tripDate": " October 2008"
    },
    {
      "title": "Excellent choice for business",
      "text": "I stayed at the French Connection during a business trip to Toronto. Everything about my stay was fantastic - the room was beautiful and comfortable, the house was beautiful, breakfasts were tremendous, and the people were friendly.This B&B is about a 7 min walk from the St. Clair West subway, so it's a breeze to make it downtown or uptown. Prices are very good for what you get, so I'd recommend this for any business traveller.",
      "rate": 5.0,
      "tripDate": null
    },
    {
      "title": "Best pastries ever!",
      "text": "My first time back in Toronto in twenty years and was happy to find this charming B & B on Trip advisor.  The house & rooms are decorated with taste and enjoyed hearing about the history of the house over coffee and homemade pastries.  My husband & I both enjoy our breakfast meal and were well satisfied with the best homemade pastries and light omelette.  The rooms were well appointed with some finishing touches (percale sheets, chocolate on pillow).  Diane can tell you about Toronto and indicate interesting areas to visit.  Thank you so much for a great weekend getaway!  As for the previous review, I would like to comment to the fact that Diane does sit with her guests because she is being a true hostess, but if anyone do wish to be alone or it is a romantic getaway, you can let her know and she will respect that.  She can also serve breakfast on the terrace in one of the rooms.The only small downfall was the water pressure in the shower wasn't  the greatest, but the house was built quite a few years ago.",
      "rate": 5.0,
      "tripDate": " October 2007"
    },
    {
      "title": "Great location, lovely surroundings",
      "text": "Found this place by total fluke on trip advisor when trying to find somewhere to stay in Toronto.  This place is so nice, it is literally, as someone described previously, a home from home.  Conveniently located near a subway station that takes you straight into the heart of Toronto.  Also, there are lots of cafes and restaurants near the B& B.  Diane the owner is really friendly and nice to talk to.  So glad we didn't opt for a hotel.  Worth every penny.",
      "rate": 5.0,
      "tripDate": " September 2007"
    },
    {
      "title": "Friendly atmosphere",
      "text": "It was my family's first trip to Toronto.We stayed the French Connection on my friend's strong recommendation.We shared Terrace Suite and The Blue Room, enjoyed Jacuzzi , neat beds.There were lots of paintings at the public space. And French-style breakfast! Strong coffee and  omelets.In addition I've never tried such a delicious croissant in my life.If you love a croissant, you should not go to Paris but the French Connection.  Thanks, Diane.",
      "rate": 5.0,
      "tripDate": " January 2005"
    },
    {
      "title": "Ambience Galore!",
      "text": "All the guest rooms have their own color theme. Very nice touch. Very comfortable rooms with excellent mattresses, fluffy pillows and an enveloping comforter. Couldn't ask for a  better sleep! Breakfast offered a good variety of items all served with a smile and a sense of warmth and humor!",
      "rate": 4.0,
      "tripDate": " January 2005"
    },
    {
      "title": "Best Toronto B&B",
      "text": "I visit Toronto all the time and have tried many B&Bs there. This one is where I'm going to stay from now on. Nice area, easy access. The B&B is CLEAN, bright and classy. Good value. Superb complete breakfast cooked just for you and served between 8:30 and 10:30 am - Your choice!The owner is really nice and helpful when you need her but gives you all the space you want. Check the pictures at:http://uk.f2.pg.photos.yahoo.com/thefrenchconnectionbandbSee, I told you!",
      "rate": 5.0,
      "tripDate": null
    },
    {
      "title": "Best Breakfast!",
      "text": "After many disappointing searches online, I came across The French Connection Bed and Breakfast website (which I think is linked to this page, if not click: http://www.*********************). Now I'm glad that it's been kept a bit hidden on the web! What a beautiful space (well-decorated--no overwhelming flower bouquet comforters and curtains) in a very convenient location! The innkeeper, Diane, was so helpful and attentive. She made dinner reservations for us (recommended great restaurants) and made probably the best breakfast I've ever had (omelets, french toast, baked croissants and muffins directly from the oven to the table). So many personal touches at this B&B! It was nice to walk in to a room that had a few roses waiting for me. If you'd like a romantic weekend in Toronto, I strongly recommend the French Connection.",
      "rate": 5.0,
      "tripDate": " February 2004"
    },
    {
      "title": "Best B&B",
      "text": "The French Connection offered so many special things to make our stay pleasant.  To mention a few Diane and her assistant were both very pleasant and helpful, it was a pleasure to speak with them both.The rooms were neat and clean, everything was very comfortable and inviting.  Diane strives to make your stay as pleasant as possible.  The french connection B&B is like an oasis in the desert.  It is such a relieve to step inside the door after the hectic hustle and bustle of toronto city life.We thoroughly enjoyed the wonderful (fresh home made breakfasts) and fun and interesting conversations with other guests and Diane and her assistant.  It was a pleasure to have these friendly chats at the breakfast table.",
      "rate": 5.0,
      "tripDate": null
    },
    {
      "title": "...the path better traveled",
      "text": "I just returned from the opening weekend of the Toronto International Film Festival.  I didn't see any films, but I stayed at a sweet little b&b called \"the french connection\".  This may be billed as \"the path less traveled\", but I'd like to suggest that it is \"the path better traveled\".  The french connection is located in a nice little neighborhood, just a five minute walk from the subway station.  Diane, the proprietor, is a nice lady.  She is very knowledgeable about the individual neighborhoods in Toronto; she's also got many tips on how to enjoy the City, like how to avoid the long lines at CN Tower [hint: make dinner reservations at the 360 restaurant, and go to the head of the line].  She also serves up great French-iinspired breakfasts.  I could go on, but I shall stop.  Check out this little gem for yourself.  You'll love it and save money too.",
      "rate": 5.0,
      "tripDate": " September 2006"
    },
    {
      "title": "Without a Doubt, THE Place to Stay",
      "text": "If you ever think big cities lack personality, warmth, charm or other kindhearted characteristic, then you must visit Diane at the French Connection to have your faith renewed.  Our recent stay at Diane's B&B was so comfortable and enjoyable we completely forgot about siteseeing and spent hours chatting after breakfast!  Her home is warm and inviting, and provided us with a perfect night's sleep.  Truly a must if you're planning a trip to Toronto.",
      "rate": 5.0,
      "tripDate": " June 2007"
    },
    {
      "title": "Loved the French Connection, Diane's warm welcome and wonderful breakfast",
      "text": "We have just returned from a stay in North America which began at Toronto.We spent four nights there at The French Connection  where we received a warm welcome from Diane ; don't hesitate before your stay to ask her any advice you need. Diane is really a trustfull person and she gave us all the information we need before our stay which was really helpfull. Moreover, she answered each time via email very quickly and efficiently.Regarding the bed and breakfast itself, we can really say that it is close to perfect.We had two differents rooms (one for the parents and one for our children -20 and 17 years old-) which were both really nice and very confortable : a special mention for the king beds...The whole house is really nice and it was a great pleasure to enjoy reading at the end of the day in the living room.Breakfasts... oh breakfasts : there were really the best ones we never had during our whole August trip (although we experienced other great breakfasts in other places).We have to talk about the location which is nice and convenient thanks to the subway station, about a five minute walk from the B& B.What else can we say ?Don't hesitate to ask Diane about the quietest room available : the two rooms we had were both very nice but one was really very quiet and the other one a little bit noisy.Last but not least : you have to know that Diane have two cats which might be a potential issue for some allergic guests.",
      "rate": 5.0,
      "tripDate": " August 2007"
    },
    {
      "title": "Lovely Neighborhood B&B",
      "text": "The owner, Diane, runs an updated and lovely B&B just a few miles north of Bloor Street.  We were impressed with the room, and modern bathroom.  Breakfasts were well prepared.  We used a Toronto Transit day pass to ride the subway, trams, and buses all around central Toronto.  The subway station is a five minute walk from the house, and frequent bus service runs down Bathhurst to the University and Chinatown areas.The only potential issue for visitors to the B&B are Diane's two cats.  They are both friendly pets, but might cause an allergic guest some problems.",
      "rate": 4.0,
      "tripDate": " July 2007"
    },
    {
      "title": "wonderful B & B experience",
      "text": "We spent three nights at this wonderful Toronto B & B. We really felt like Toronto residents, rather than tourists, during our stay. The French Connection is a lovely home on a residential street. The B & B is in a safe neighborhood within easy walking distance of public transit. However, we enjoy walking and Toronto is a pedestrian friendly city so we chose to walk everywhere during our stay -- the University area, Yorkville, Little Italy, Chinatown, Downtown.... Diane, our host, was very helpful and directed us to good restaurants and interesting sites. The breakfasts were delicious and very satisfying and we enjoyed Diane's company during these morning meals. Our rooms and bathrooms were very clean, pleasant, and uncluttered. We were made to feel right at home. We would be happy to stay again on future visits to Toronto.",
      "rate": 5.0,
      "tripDate": " August 2008"
    }
  ]
}