{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "The Rosemont Residences",
    "url": "/Hotel_Review-g155019-d1758995-Reviews-The_Rosemont_Residences-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.5",
      "reviewCount": 39
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "50 John St 2nd Floor",
      "addressLocality": "Toronto",
      "postalCode": "M5V 3T5",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/1c/37/db/d2/the-rosemont-residences.jpg?w=500&h=-1&s=1"
  },
  "description": "Our Executive Furnished Suites strike an ideal balance between indulgence and convenience. With monthly leasing options on a variety of bachelor, one bedroom and two bedroom suites with full kitchens, we are a blissful alternative to hotel living.Situated in the trendy Theatre District of Downtown Toronto, the Rosemont is in walking distance to restaurants, entertainment, shopping and the Financial Core.",
  "featues": [
    "Paid private parking on-site",
    "Free High Speed Internet (WiFi)",
    "Fitness Center with Gym / Workout Room",
    "Game room",
    "Billiards",
    "Kids stay free",
    "Pets Allowed ( Dog / Pet Friendly )",
    "Business Center with Internet Access",
    "Secured parking",
    "Wifi",
    "Patio",
    "Meeting rooms",
    "Rooftop terrace",
    "24-hour security",
    "BBQ facilities",
    "Concierge",
    "Non-smoking hotel",
    "Shared lounge / TV area",
    "24-hour check-in",
    "24-hour front desk",
    "Clothes dryer",
    "Laundry service",
    "Self-serve laundry",
    "Washing machine",
    "Air conditioning",
    "Desk",
    "Dining area",
    "Housekeeping",
    "Coffee / tea maker",
    "Kitchenette",
    "Cable / satellite TV",
    "Bath / shower",
    "Private balcony",
    "Sofa",
    "Telephone",
    "Clothes rack",
    "Iron",
    "Private bathrooms",
    "Wake-up service / alarm clock",
    "Dishwasher",
    "Microwave",
    "Oven",
    "Refrigerator",
    "Stovetop",
    "Electric kettle",
    "Kitchenware",
    "Flatscreen TV",
    "Complimentary toiletries",
    "Hair dryer",
    "City view",
    "Non-smoking rooms",
    "Suites",
    "Family rooms"
  ],
  "reviews": [
    {
      "title": "Loved it!",
      "text": "Called this place home for a few months already. The concierge and building management is very courteous and often helps with ad hoc requests. Totally not the experience i've had in other buildings downtown. They don't just do their duty, they actively help you out, which kind of feels like I am in a hotel. I like that the concierge helps the delivery guys out instead of delaying our food. :PThey sometimes have a cleaning service too, or provide a vacuum if needed.  :)The rooms are really spacious and very well furnished, the bed is super comfy. My friends who've visited have commented often that the rooms are bigger in general and the whole place has a nice open feel. I absolutely love my study desk. It's massive compared to the places i've stayed or seen in downtown. The bathroom has sufficient linens & toiletries, the only the thing I purchased was a bath bomb for the tub!The location is super convenient, with all major stuff in walking distance. Anything between 0-20 mins is gonna take you from grocery to Eaton on foot. Plenty of good restaurants, LCBO right around. The building also gives discount coupons for restaurants.",
      "rate": 5.0,
      "tripDate": " October 2020"
    },
    {
      "title": "An excellent  short term residence that feels like a very good hotel",
      "text": "I am staying here for four months and can only echo the great reviews of other guests. The business manager, Brian,  and guest services staff are extremely pleasant and accommodating as are all the concierge and cleaning and maintenance staff. I recently had a problem with a small maintenance issue in the evening, and the concierge on duty and the maintenance supervisor, Andrew, had the issue resolved immediately. The apt is  large and comfortable, very clean and very well equipped, including a washer and dryer , and there are many amenities including a rooftop lounge and barbecue area overlooking the city and the lake. If you enjoy Sports, the Skydome is at one end of the street, and both The Princess of Wales theatre, the Royal Alex , the Tiff Lightbox and the Scotiabank Cineplex theatre are at the other. Lots of excellent restaurants. Despite all the attractions, the building is very well built and almost totally soundproof. The King St streetcar and the St Andrew subway stop also provide easy inexpensive access to anywhere in the GTA.  I would highly recommend this property to anyone who needs a comfortable apt to either visit or work in Toronto.",
      "rate": 5.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Luxury with the warmth of home",
      "text": "This building checks each box. The location is perfect and just a stone’s throw from the popular bars and clubs on King St without the noise and crowd interfering with your sleep. The layout of the units are very nice, very spacious and utilize the rooms very well. The finishing is excellent and the quality speaks for itself. But it’s not the stunning interiors of the building, the easy accessibility and the luxurious amenities which made me feel right at home, it’s the people. The concierge as well as everyone working in the management office is an absolute delight to interact with. No matter what your day has been, just cross the glass doors and you won’t be able to help the smile on your face. They made my move absolutely seamless, have been beyond helpful and the way they handle any issue or assist you, the speed at which they get things done for you, it’s absolutely awe-inspiring. Thank you for everything you do. Rosemont Residences exceeded my expectations and is an absolutely beautiful experience",
      "rate": 5.0,
      "tripDate": " June 2021"
    },
    {
      "title": "Best rental building in downtown Toronto!!!",
      "text": "Building management, security, concierge, and the entire staff are extremely professional, polite, ethical, and very customer-focused. I really enjoyed staying at this building. These guys should be a role model for other neighboring buildings... it's been a pleasure staying at Rosemont :)",
      "rate": 5.0,
      "tripDate": " August 2020"
    },
    {
      "title": "Excellent service",
      "text": "This is my first stay at Rosemont Residences and definitely not the last!The suite was clean when we arrived with modern appliances and a complete set of kitchen utensils.Another important feature is the location of Rosemont Residences as it is near to the underground station and important streets such as King Street and Front Street, in addition to being close to a variety of cafes, restaurants and super markets.What sets Rosemont Residences apart from others is their personal care and excellence service given to guests from the beginning of the reservation process until the end of your stay and departure.During our stay, we are greeted every day with a smile and a warm welcome.My family and I would like to thank all the team members at Rosemont Residences for the excellent service.",
      "rate": 5.0,
      "tripDate": " July 2022"
    },
    {
      "title": "''Timeless elegance in a relaxing setting''",
      "text": "The concierges are professional and friendly, willing to help with whatever you need. That's  what peaked my interest . Then off to see Alisha,💖 Patricia,🌹 and Nilesh🌹 for more information. They were so nice , professional and very helpful. Next office was Brian Pereira the Business Development Manager who was simply extraordinaire ! Brian has such a nice personality and very professional in his approach. He showed me several units and I settled on 1904, a cozy one bedroom condominium. Late night BBQ's, rooftop views of the CN Tower , Rogers Centre and all other close by attractions … Hockey Hall of Fame , etc.. I spent seven months at the Rosemont and would recommend it to any /all visitors  long or short stays in the Entertainment District of downtown Toronto.",
      "rate": 5.0,
      "tripDate": " September 2021"
    },
    {
      "title": "Home Sweet Home!",
      "text": "I have been staying here since March 2020 and  I  feel so privileged to live in Rosemont. The concierge and building management is very  friendly,courteous and helpful that I always feel we are a big family here  and  taking care of each other!!  The units & rooms are decent sized with great  in-house maintenance. And  it is super centrally located which makes your life really easy and comfortable .Besides it's a pet-friendly building:)Overall it has been a great experience to date and I am hoping to keep staying here for a long term. Special thanks to Brian,Paloma, Miles  and others for all the help& support!! You  are doing an amazing  job !! Thank you so much!!",
      "rate": 5.0,
      "tripDate": " March 2020"
    },
    {
      "title": "Mrs",
      "text": "Great place to live. The concierge are professional and friendly, willing to help with whatever you need. I had issues with my fridge and they came an hour later to fix it. Newly renovated unit finished with top of the line finishes.",
      "rate": 5.0,
      "tripDate": " July 2021"
    },
    {
      "title": "Great Location, Great Service!",
      "text": "Clean, well planned spacious furnished units with excellent service. I spent a few weeks here with my children and we had a very happy experience. All the staff we interacted with were helpful and solution oriented. Everyone I spoke to with a question worked to get me an answer, and provide a response to my request. The units were clean, sensibly furnished and well equipped.Very conveniently located close to public transport, lots of good eats and entertainment.",
      "rate": 5.0,
      "tripDate": " May 2020"
    },
    {
      "title": "Awesome Team Rosemont",
      "text": "The entire team is my family here. This feedback is a small gesture to express my gratitude towards all that Aliesha, Agape, Lisa, Brian, Amir, Nilesh, Nora, Fady, Jean, Andrew, Anushka have done towards making my stay here so comfortable that I couldn't have asked for a better place than Rosemont. Not to forget, Nora and the housekeeping team do a fabulous job every 2 weeks in my apartment. I don't have to worry about anything as long as you guys are here looking after.In the peak of summers, I was provided with a fan to manage the heat. I dont think even a full service hotel could have provided the kind of service and help i got from the team here. Kudos to everyone for being so empathetic and helping really when it was needed.Today was another housekeeping cycle and I have to say that my apartment is shining and looks fantastic and splendid especially after returning from a long busy day at work. I am running short on words to express that yet again Lisa and Nora did a fabulous fantastic work in cleaning and maintaining my apartment. So so grateful and thankful from the bottom of my heart to everyone. My sincerest gratitude for everyone. I have advised 2 of my friends that if they ever want to change their accommodation, they should consider Rosemont. Its the safest building with the best facilities any resident could have experienced in town.Thank you Team Rosemont, keep up the awesome work you do, you guys are the best and you guys rock it as always. The fact that Residents are so happy here including myself speaks crazy volumes about your team work. Onwards and upwards always.",
      "rate": 5.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Great experience",
      "text": "My fiancé and I had a great stay at the Rosemont. The staff were all very accommodating, especially Brian P. He was very responsive and attentive to all my questions and needs! We will miss staying here.",
      "rate": 5.0,
      "tripDate": " May 2022"
    },
    {
      "title": "An excellent place to stay in downtown Toronto",
      "text": "Had a most wonderful stay at the Rosemont Residences. Checked in on 01May and was supposed to stay only for a month but had to extend our stay by another 45 days.  Brian Pereira - the man in charge - is super nice and accommodating. He ensured that we continued to stay in the same apartment. Our 2 bedroom apartment was nicely furnished, very clean and had all the basic amenities for a long and comfortable stay. The concierge staff - Jean, Fady, Perry, Andrew and Raj are most warm, welcoming, helpful and knowledgable. They always greet you with a cheerful smile. Even the building maintenance team of Brian and Andrew (yes, there are 2 Brians and 2 Andrews in this building) are very cooperative and helpful. The building is very well lit, super safe and has some great music playing in the lobby. 04 fast elevators mean you do not waste time waiting for your elevator and they also have a special service elevator for heavy stuff like your furniture etc. The location of the building is also very central. You are surrounded by eating places, the theatre district, cinema halls, shopping, Rogers Centre, CN Tower, Ripleys Aquarium etc. and there is even a coffee shop, massage parlour and a dentist in the building annexe. Overall, it was a truly delightful stay at the Rosemont Residences and we shall make this our home away from home, whenever we visit Toronto. My sincere thanks to Brian x 2, Nilesh, Agape, Aamir, Andrew x 2, Jean, Fady, Perry, Raj and all the others for making our stay in Toronto a truly happy and memorable one !!",
      "rate": 5.0,
      "tripDate": " May 2022"
    },
    {
      "title": "Not a hotel, not an apartment - something better.",
      "text": "I moved into a furnished 1-bedroom unit in Rosemont Residences back in Feb 2019. What initially started as a temporary visit unexpectedly turned into a 2.5-year stay (partly thanks to, of course, what happened in 2020), and I could not be happier with my choice to call Rosemont Residences home.Personally, what was most important to me was that Rosemont Residences offered the flexibility and service usually provided by a hotel (when it comes to booking, extending stay or housekeeping), along with the comfort typically associated with an apartment complex (e.g., amenity, in-unit kitchen/washer/dryer). Due to my special circumstances, I had to renew my stay on a month-to-month basis. Gladly, with the help of Aliesha, Patricia and Nilesh, it was never a problem.Location was also a big plus. It was ~10-min walk away from Bay St, TN Tower or subway. There were plenty of restaurants and grocery stores to choose from. Some of the Toronto International Film Festival (TIFF) 2019 events took place right outside the building. It was located, quite literally, at the heart of downtown Toronto.The staff were all nice and friendly. Maintenance requests were usually completed within a day. Incoming packages were properly taken care of by the concierge. I would like to give a special shoutout to Mr. Miles, whose enthusiasm at greeting everyone at the lobby always made my day.In short, I recommend Rosemont Residences to both casual visitors and those who are looking for a long stay in downtown Toronto. It has a lot of nice things to offer: flexibility, comfortableness, location and a helpful staff.",
      "rate": 5.0,
      "tripDate": " July 2021"
    },
    {
      "title": "Rosemont residences",
      "text": "Its our 3rd time at rosemont residences at john st., toronto. This is a very convenient place to stay - near entertainment and financial districts, cn tower, toronto aquarium and lots of restaurants to choose from in walking distance to d condotel. Clean, bright and well managed.",
      "rate": 4.0,
      "tripDate": " May 2017"
    },
    {
      "title": "Put up here... wasn't too bad",
      "text": "The Canadian version of an Oakwood... a little dead in spirit, glitzy entrance, basic but clean rooms. Stayed here with work for about 6 weeks. Served it's purpose well and I pottered along.Cleaning maids do attend rooms on a somewhat random schedule but not being a messy person that wasn't an issue. In the heart of Toronto, which is hard as Toronto doesn't really have a center but it's close to lots of grey depressing buildings and winter battered trees. Overall a good place to stay, even with family. But there are much better options just down the street if you can afford a little more $.",
      "rate": 4.0,
      "tripDate": " August 2015"
    },
    {
      "title": "Great location, exceptional value, spacious apartments , friendly staff",
      "text": "Best location for Toronto Visit as tourist or Business. Great Value as apartments are very large for a Downtown Building. We walk to the best rated Top Restaurants. TIFF, Theatre, opera, classical music CNTower Blue Jays, Acquarium , ACC , Subway, Hop on Bus, eat Greek, Indian, Chinese ,French, Italian , Spanish, German , Canadian. The longer you stay the better the rate.",
      "rate": 4.0,
      "tripDate": " July 2016"
    },
    {
      "title": "Awesome stay",
      "text": "I have stayed at this place along with my friends. This a is great place which gave me very good memories which I would cherish for my lifetime. The lifts are great the securities are great. It is very conveniently located.",
      "rate": 4.0,
      "tripDate": " February 2016"
    },
    {
      "title": "Amazing view from a great space",
      "text": "I have just started making reservations with premiere executive suites and I can't imagine doing long stays another way. I love that I can provide my family with home cooked meals cooked in exquisite kitchens. When you are away from home as much as we are you really appreciate not eating in restaurants. In addition, I have the option of hosting gatherings in a luxurious space that i know others would feel comfortable The suite is furnished with plenty of comfortable seating. The dining table is board office length. The kitchen is totally outfitted. There are two bedrooms and two bathrooms. Our stays are long enough that being able to do laundry within the suite is great. The bedding is top quality and the mattress is extremely comfortable.",
      "rate": 5.0,
      "tripDate": " March 2013"
    },
    {
      "title": "Super place",
      "text": "Excellent location - everything within walking distance. The apartments are very well furnished and have a fully equipped kitchen. The service is excellent and any request is immediately attended to. The staff is very courteous and friendly.We were on the top floor (20th floor) which had a good view of the street.",
      "rate": 5.0,
      "tripDate": " November 2015"
    },
    {
      "title": "Gem of Gems",
      "text": "I was at the Rosemont for over a month beginning middle of May.  I found my newly reno'd condo exceptionally clean and well appointed with a balcony.  Given that the Rosemont is in the Entertainment District, I found it quieter than most would expect given all the restaurants/cafes nearby.  Once the balcony door is closed, it is almost sound-proof!  Big plus for me as I was in T.O. on business as well as play/fun.  The R.R. is near the lake which was great.  Everything I needed was in the immediate area: groceries, Shopper's Drug Marts, subway, streetcars, etc.....Jean and Fadi at the desk were very professional, always friendly but not invasive, helpful in every way.  Upon arrival, Fadi helped with the many pieces of luggage my friend and I came with.  Fadi also made wonderful suggestions re possible attractions in the city.  Jean also helped with luggage upon our departure even placing luggage in cab!!  Always a smile on her face and at the ready to assist in any way she could.  The Staff is wonderful.  Can't complain about anyone.  Good hiring - Mgr. (Brian) is tuned in for sure.  I am fussy about where I stay and what to expect.",
      "rate": 5.0,
      "tripDate": " May 2023"
    },
    {
      "title": "Home away from home",
      "text": "Been staying here in a furnished 1-bed suite since September 2020. It has been a great experience. As I had to quarantine for 14 days, I couldn't have done without their help as they ensured that all the possible services were offered at my doorstep. Advantages of staying at Rosemont include: 1) Great in-house maintenance 2) Friendly concierge and building management 3) Free visitor's parking 4) Rooms are decent sized (as per DowntownToronto standards) and well-equipped 4) Centrally located (close to major tourist sites, cafes, and restaurants, walking distance to  Union Station/St. Andrew and all bank HQs) 6) No waiting time for lifts 7) Flexible payment terms Given it's a pet-friendly building, I think common area cleaning can be improved slightly. I haven't used the heating at all (at least to date), which does save electricity, but the bedroom can get warm at times.Can't comment on amenities as I haven't been able to use them due to Covid restrictions but looking forward to using them in the future.Overall it has been a great experience to date and am hoping to keep staying here until work makes me relocate. Special thanks to Paloma, Jana, Brian, Nilesh, Miles, Aliesha and others for all the help :) You guys are doing a great job!",
      "rate": 5.0,
      "tripDate": " September 2020"
    },
    {
      "title": "Convenient, clean, nice amenities and good service",
      "text": "I was worried due to the reviews, but I can only speak highly of the Rosemont Residence, quiet and peaceful stay, very convenient with the path right across the street, view of CN tower, and everybody was very nice and attentive.",
      "rate": 5.0,
      "tripDate": " July 2019"
    },
    {
      "title": "Mismanaged - Overpriced - Not worth it!",
      "text": "I had read some bad reviews for this place before staying there for 6 weeks but also saw that they seemed to have improved some. Not true! Bad communication - poor / cheap appliances - constant fire alarms (6-8 a week) - Rude (!!) staff - and the list goes on. Do yourself a favor and stay somewhere else.",
      "rate": 2.0,
      "tripDate": " October 2018"
    },
    {
      "title": "Everything perfect",
      "text": "The location in downtown is excellent, the views from the dinning room of a 13th floor apartment (including the CN tower) breathtaking, the customer service always helpful (particularly Rebecca). During our family stay all went smoothly, the wifi, the weekly cleaning service, everything... The only negative point for us was the fee, but we understand is not overrated for Canadian standards.",
      "rate": 5.0,
      "tripDate": " June 2013"
    },
    {
      "title": "Great staff, especially Rebecca",
      "text": "My wife and I travel for business all over the world, and have experienced all levels of quality of customer service.  Its rare that we are so impressed that we write a review, but our experience with one specific person at the Rosemont was so special, that we decided to write.  I called the front desk to get some help ordering flowers and was completely impressed by the service I received from Rebecca.  She gave me extraordinarily outstanding customer service.  She's quite special!",
      "rate": 5.0,
      "tripDate": " November 2012"
    },
    {
      "title": "Perfect Suites Location",
      "text": "I recently stayed at the Rosemont for business and plan to return on my next trip to Toronto.  The units are superb.  Anything you could possibly need is already in the unit for you.  The close proximity to the business district made commuting to work in a new city a breeze.  Staff was always helping when needing directions, dining suggestions, etc.",
      "rate": 4.0,
      "tripDate": " March 2012"
    },
    {
      "title": "A GEM",
      "text": "I was at the Rosemont for over one month on business as well as vacation.  I found the common areas to be super clean as was the condo I rented with a friend.  Requests were met with a smile and with efficiency.  The staff is very professional, efficient and friendly.  I felt that all my needs were met and beyond.  Jean, who is at the front desk in the mornings was a treasure.  She was professional while not being invasive yet was so ready to accommodate any requests/inquiries with a smile.  She was super efficient even assisting with luggage on departure and accompanying us to our waiting cab to the Airport.  Fadi checked us in, also helped get the luggage unto a cart (lots of luggage and heavy!!!).  He was warm and friendly as he was throughout our stay and making suggestions as to tourist highlights in T.O.  We found all the staff competent, congenial and warm in fact, including housekeeping staff who did a great job too.  Brian Pereira, mgr., seems to hire the right people for the job!!  Thank you all at Rosemont Residences with fondness!",
      "rate": 5.0,
      "tripDate": " May 2023"
    },
    {
      "title": "A gem in Toronto’s ost pandemic maze",
      "text": "I located this property after getting a refund from VRBO  whose host who lied in response to questions about nearby construction on Yorkville and Yonge, refused to answer some questions.  Brian at Rosemount went out of his way to arrange for a rental accepting an urgent call on Sunday his day off. I needed a substitute premise pronto as I had non refundable plane arrangements and business meetings scheduled.I am so pleased to have found Rosemount. It is in a good location in the entertainment district near the CN tower and many cafes and with easy access to the waterfront and public transit. The staff are friendly, helpful and respectful. Jean is especially attentive as a concierge opening doors even when busy and assuring excellent music as one enters or exits. Each other concierge is helpful so someone trains and supervisesnwell.Everything advertises lives up to what is stated from the exercise room to the business Centre to the large meeting room with sofas and fireplace. The rooftop common area is large and has three or four areas so that individuals can find quiet spots and small groups can socialize.We did have difficulty with the TV remotes and would have appreciated cleaner windows and removal of blue paint on the balcony floor and red smear on a balcony window given we were in a premium suite newly renovated at a considerable cost. Premises were clean and housekeeping responded to our requests for natural cleaning products. All requests were met in a timely fashion. There was much nearby street construction because of pandemic delays to needed infrastructure work. Also thereIs a laneway where trucks back up and are noisy. Shutting windows and patio door does assist but the no fresh air. All in all the pros far outweigh the cons  it is a better value than the nearby Marriott or even Ritz Carleton,",
      "rate": 5.0,
      "tripDate": " May 2023"
    },
    {
      "title": "Always Great!",
      "text": "I've stayed at the Rosemont now 4 times for one month and 6 week periods over the last 2 years and all I can say is, I don't want to stay anyplace else!  Staff is very accommodating and has always taken care of me.  This was especially true during the lockdown when hotels really weren't the best move.  Staying here feels like home.Thanks to Brian and the entire staff. I'll be back!",
      "rate": 5.0,
      "tripDate": " March 2022"
    },
    {
      "title": "My Stay at the Rosemont Residences",
      "text": "I arrived in toronto end of Sept 2021. It was my first time in the city ; I needed an apartment fast and I couldn't find anything I liked. Then I went to rosemont residences and met Mr Brian Pereira. He showed what was available ,and was very professional and patient with my demands . I had a small issue with my bank ,Mr Pereira was swift to guide me through the process and we managed to get around any problem I had .He was very helpful and attentive.Then I met Miss agape fernadz who helped me sign my lease and showed me around the project.  Throught my 6 month stay she has been always available for any queries and issues I had and happy to help with anything I needed.Great team and a 5 star stay !",
      "rate": 5.0,
      "tripDate": " March 2022"
    },
    {
      "title": "Rosemont, outstanding hidden gem!",
      "text": "When every staff member is courteous,kind and friendly, you know the work culture is excellent.Rosemont Residences is your cozy, beautiful home conveniently located in downtown Toronto. The furnished apartment was spacious, with every thought given to what you could need. They even added a bed in the den on request! My absolute first choice over a hotel in Toronto.Thank you Patricia, concierge, maintenance at Rosemont for an awesome stay!!",
      "rate": 5.0,
      "tripDate": " March 2020"
    },
    {
      "title": "Wonderful experience at the Rosemont Residence ( 50 John st)",
      "text": "I wanted to take a moment to express my gratitude for my recent stay at Rosemont Residence. We truly had a wonderful experience during our time there, and I appreciate the efforts of the entire team in making it such a pleasant stay. I hope to have the opportunity to visit again in the near future.",
      "rate": 5.0,
      "tripDate": " September 2023"
    },
    {
      "title": "Rude Upper-level Staff",
      "text": "Residences? Should be called Rosemont Slums ! Terrible service, nothing gets fixed, and the upper level staff is downright rude ! The best thing about my stay was the service I got from a charming young girl named Rebecca. Stay here if you want to be utterly disappointed and have your trips/stays in Toronto ruined ! You'll end up paying for an overpriced room with deteriorating appliances and dirty dishes. Enjoy !",
      "rate": 1.0,
      "tripDate": " November 2012"
    },
    {
      "title": "Very over-rated",
      "text": "I was told that the Rosemont was a good place to stay...not a place I would stay again. The rooms are nice but the noise in the hallway from other guests was over-whelming...especially after midnight! I made a comment to the staff an they said 'that there was nothing we could do'! I selected the Rosemont because of their fitness facility...again, another major disappointment! The equipment needs replacing and supervision. Most of the cardio equipment needs maintenance or is out of order...I made a comment to the staff an they said 'that there was nothing we could do'! I had a relative visiting me and the front line staff did not know how to obtain a visitor parking permit and how to buzz people in from my room.There is no information in the room about the facilities and services available i.e. room service, location of gym, internet access, parking, etc... I made a comment to the staff an they said 'that nobody else has made a comment'. This poor customer service has unfortunately left me no choice but to find alternate arrangements for my colleagues and I for future visits.",
      "rate": 2.0,
      "tripDate": " July 2011"
    },
    {
      "title": "Excellent Suites in Downtown Toronto",
      "text": "Wonderful location and quality furnished apartment. Excellent for business visitors. Close to CN Tower, Eaton Center and all major commercial and business establishments. Walking distance from bus terminal leaving for Niagara Tour. Unlimited number of eating places and nightclubs in the area.",
      "rate": 5.0,
      "tripDate": " December 2013"
    },
    {
      "title": "Great condo!",
      "text": "We stayed at the Rosemont on last April, we rented a 2 rooms/2 bathrooms apartment as we were 2 couples and a single friend. They put an extra bed in the living room. The apartment received lots of natural light, was very clean, excellent bedding, the kitchen was equipped with all basic cooking appliances.The Rosemont is located in the Financial/Theatre District, near buses and subways just round the corner, just 2 blocks away from the famous CN Tower. We loved the place, but didn´t like the fact that when we needed talk to someone from the administration we just had to leave a message on their answering machine, and nobody got the call back, makes you feel so lonely!!! Besides, they gave us only 2 card keys, it was complicated considering we were 5 people, when we asked for at least another key they refused to give it to us. Anyway, it was a small matter, the place is ok, a good deal, considering we payed just usd 43 pp/day. I`d stay there again.",
      "rate": 4.0,
      "tripDate": " April 2010"
    },
    {
      "title": "Not bad but too many false fire alarms from tenants cooking improperly!",
      "text": "I stayed here in 2007 back in the furnished suites and it was very nice. I am back here temporairily in an unfurnished suite. The building is tired and worn looking now however they are renovating but it will not be done until mid 2017. The appliances are still older white ones and not stainless but I hear they will be upgrading those too and there is older carpet in the bedrooms and laminate throughout. The kitchen has nice granite type tiles.. I think with this building you pay mainly for the location as it is almost $2000 for 650 sq feet but it is right downtown Toronto and that includes utilities and amenities such as a fairly good gym and rooftop patio. No pool or whirlpool. It is a pet friendly and lots of dogs here so that is one reason I returned as I have two little dogs.One main issue is the fire alarm keeps going off constantly. This was an issue last time too in 2007. I heard it is from people cooking in their suites and opening their apartment door to filter the smoke out which sets the alarm off. It happens alot.Another issue is, I find there are alot of younger people (teens and twenty year olds in here) now. Not sure if their parents co sign and pay as I cannot understand how they afford it but I have had to call security a few times as of constant running down the hallways on weekend nights and loud parties. Last weekend the police had to come to stop the party at midnight and get all the people out of the condo two doors down.My advice is, if you want this location, then check this place out, if you can put aside the fire alarms, potential for parties and a younger crowd, and like a pet friendly building and do not care about construction or an older suite with appliances. I am here only for a year as I plan to buy a place nearby so needed something quick and just for short term but living here long term for me, would not be ammenable. I have been here since Oct 2016. The staff is great though and very accomadating which is a plus.",
      "rate": 3.0,
      "tripDate": " October 2016"
    },
    {
      "title": "Nice Apartments - Rude security staff",
      "text": "The apartments are nice here and the office staff very helpful. The location is great. There is a rooftop which closes too early, but there are BBQ for guests to use.One of the security members is one of the rudest persons I've had to deal with, making our experience much less than what it should have been.The hall ways are much too cold in summer, but that's minor compared to employing such a security guard.",
      "rate": 2.0,
      "tripDate": " July 2016"
    }
  ]
}