{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "The Palmerston",
    "url": "/Hotel_Review-g155019-d19764656-Reviews-The_Palmerston-Toronto_Ontario.html",
    "priceRange": "$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "2.0",
      "reviewCount": 16
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "650 1/2 Queen Street West",
      "addressLocality": "Toronto",
      "postalCode": "M6J 1E4",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2a/dc/6d/44/caption.jpg?w=500&h=400&s=1"
  },
  "description": null,
  "featues": [],
  "reviews": [
    {
      "title": "Poor Customer Service",
      "text": "Two of us stayed in this hotel for three nights. Not only was the bed so uncomfortable and noisy, we were only provided two bath towels. When I asked for a face cloth or hand towel I was told I could pay five dollars each. So were we supposed to use our bath towel to wipe up the counter and sink? The location is above an A&W restaurant, and the last evening they had an emergency & they were drilling throughout the night and kept us awake. when I communicated to the Palmerston, the gentleman said he would get back to me… And then totally ghosted me. I emailed them back asking for compensation for part of the night, and was told that there would be no compensation: and that the noise was only for a few minutes and that was not their responsibility. I didn’t lie about this, and was very annoyed that they basically told me I was telling a lie.I even recorded a few of the instances of how loud the drilling was, but they certainly didn’t care. The only thing going for them was the location. I’ve done a lot of traveling throughout the country and around the world… And I’ve never had such poor customer service. I would advise anyone to be on the alert and avoid this place, unless you’re just staying one night and don’t care about any comfort or service.",
      "rate": 1.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Must not be picky about the ensuite bathroom",
      "text": "Cheap place and location is not bad with supermarkets and plenty of different food options. Toronto is v safe to walk around. Note that the toilet/shower is en-suite with just a shower curtain/glass door so I'm glad I chose a female dorm (check out the pics on booking platforms before you book). Could they consider building a properly enclosed bathroom instead? Thanks to the chinese gentlemanly staff for offering to help with the luggage down the steep flight of stairs :)",
      "rate": 3.0,
      "tripDate": " June 2023"
    },
    {
      "title": "Location is everything",
      "text": "If you are a low maintenance person who values location over hotel comforts then this \"hotel\" will suite you just fine. It's in the middle of the Fashion District along Queen St West so there's plenty of food, fun, and access to the light rail in the neighborhood. Everything is quite walkable from this hotel. Check-in was odd and very hands-off but the location is everything.",
      "rate": 3.0,
      "tripDate": " October 2022"
    },
    {
      "title": "Poor",
      "text": "Hello, I had paid for the bed in the hotel room on March 17 and 18, and I arrived in Toronto on the night of the 18th because I sent them a message that I would not be arriving on the 17th. A gentleman who was there despite my insistence in the cold and snowy night, they were so tired and exhausted that I could not go anywhere else, and they refused to let me go. I am very unhappy with the room until they took the money again for the 18th day",
      "rate": 1.0,
      "tripDate": " March 2023"
    },
    {
      "title": "Shady…",
      "text": "Ridiculous. I booked a great deal September ‘22 for May ‘23 and just got canceled out of the blue. Nothing available anymore while last week the same room was still available it was only 300€ more expensive… shady place and doesn’t respond to anything. I am actually happy that I found another place to stay now… don’t hop on a plane and expect to have somewhere to stay if you book here via other platforms…",
      "rate": 1.0,
      "tripDate": " February 2023"
    },
    {
      "title": "Cancell policy not real",
      "text": "I booked this hotel and tried to cancel it within an hour of making the booking.  They would not cancel the booking.  I understand they have a no cancellation policy, but they also had a policy that I could cancel up to the 28th of April.  This was not honored.  I called several times to talk with someone - never called back - no cancellation,   they had lots of notice to rebook and showed no consideration - so I am out $178 bucks and have a bad feeling about this hotel.",
      "rate": 1.0,
      "tripDate": " May 2023"
    },
    {
      "title": "URGENT: IF YOU ARE A WOMAN, REVIEW THIS COMMENT BEFORE BOOKING",
      "text": "We are two women, PhD students who stayed in this place to attend a Conference. We found this hotel deal to be convenient and close to the Conference Center. However, we felt so disrespected that I have decided to share our experience point by point below:1. The hotel owner does not respect refund policies; he does not answer emails, he does not answer calls, and his presence in the place is relative. On the days we were there, he was not present during the entire office hours. He arbitrarily kept $100 simply because he didn't want to return the money.2. The place is a hostel, not a hotel. The room we slept in was extremely hot, and the window did not work. We had to hold the window with one of our suitcases.3. The first night, we woke up at 4 a.m. after a man entered our room. Even after kicking him out, we could not continue sleeping, given our vulnerability. No one in the hotel could have helped us since there is no manager present during the night. 4. We waited until the next day for the hostel owner to explain the situation, but we couldn’t find him. We had to leave because he was already half an hour late and we had already lost almost three hours of our conference. Although we tried to resolve the problem with a local worker, he responded that the situation was going to be investigated and that “we should go to work.” We didn't feel safe about anything.5. When we finally found the owner, he had already “solved” the problem by kicking this man out of the hostel. He didn't give us evidence; he didn't listen or care about our version of events; he blamed us for not closing the door properly, saying, \"In Canada, people close the doors.\" What he didn’t mention was that the door’s lockset wasn’t intuitive; you must pull the handle down to turn the deadbolt in. This, together with other phrases such as “You are the first in this hostel who do not know how to close a door”, and “If the man did nothing to you then there is no harm and the situation is resolved,” did nothing but increase the damage to the that we had already been subjected. What started as a drunk's mistake turned into xenophobic, racist, sexist, and discriminatory insults from the owner of this hostel. We did not understand why a person preferred to listen to and believe a drunk instead of the two female victims who were there since purely academic matters.The owner of this hostel will probably respond to this comment by saying that he did show us the security cameras. And yes, he did. But he did it after we insisted that he do it and once all this damage had already been done.We could go on and on about the whole situation, but for what? Although he may not have understood anything, the important thing is that any woman who reads this information knows that her body and her integrity are in danger in this place.",
      "rate": 1.0,
      "tripDate": " November 2023"
    },
    {
      "title": "Shady place",
      "text": "I booked my room,everything was paid for. I provided a passport for my i.d. The same passport I registered with them online and they said was ok. My passport was expired for less than one month unknowingly on my end. When I showed up I had my credit card with my name on it. My airmiles card which I booked my room through and my passport.first of all this shady guy would not even let me in the building to resolve the problem. He left me outside for 45 mins never bothered coming back down to talk to me again. I got a phone call from expedia saying the palmerston cancelled my room with no refund. Don't go here.",
      "rate": 1.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Stole your money",
      "text": "The place is a horrible place  and ran by terrible people , and they stole people's money in the way you did expect.Find all possible way to black mail your money !!!!  When you call back to question,  they tell you to call back at any time or any day, and then not answer.",
      "rate": 1.0,
      "tripDate": " February 2024"
    },
    {
      "title": "must be a money laundry",
      "text": "I truly believe this is sort of a fraud or a stolen identity case. I called them over the phone to book, and before I could even finish my question, a man (I think his name was Ahsan) interrupted saying \"We are fully booked. And it's only for female\". He didn't ask when i was interested and for whom I was booking.I called again saying that it was for my wife and asking when they have anything free for her. Then he hung up on me without any other explanations. All my following calls have been dropped.Let alone that it's a pure discrimination (I don't know if it's by gender or anything else), it is also a blatant lie, as nowhere in their description they don't claim it to be for women. And they have many reviews from men on google (fake?). They also claim that the cost is $32 which is obviously a suspicious price. Sounds very fishy. And definitely it was very unpleasant for me.",
      "rate": 1.0,
      "tripDate": " June 2022"
    },
    {
      "title": "DO NOT BOOK - SCAM",
      "text": "DO NOT BOOK - FRAUD.We booked 3 months prior to our stay, looked at the reviews which were pretty good at the time. We got an email a few days before saying we needed to update our credit card information by calling them, otherwise our reservation would be cancelled. I called many times (about 15), no one ever picked up. Was able to let one voicemail since it was full the other times I called. Sent 2 emails with no reply. Now I just saw they actually charged the full price and even more, 2 weeks prior to our planned trip on my card.",
      "rate": 1.0,
      "tripDate": " July 2024"
    },
    {
      "title": "nice, very useful",
      "text": "Excellent, very happy, tidy clean simple room with an excellent friendly host....would def stay again if need too, shower is great, location is great, having to write 200 characters for the review is kind of annoying tho..still got 16 letters to go!!!",
      "rate": 5.0,
      "tripDate": " March 2024"
    },
    {
      "title": "Scam, horrible",
      "text": "Be careful, this hotel is a scam, unfortunately I did not see the comments before, the hotel does not correspond to the description in the photos on all the travel sites, I paid twice, once with hôtel.com and the other time on site I canceled when I saw the catastrophic state of the hotel but I did not receive a refund since he lied to me and when I called the hotel on the 2nd day they hung up on me on nose, already the reception is not good, the person speaks badly with the customers, fleeeeee please",
      "rate": 1.0,
      "tripDate": " March 2024"
    },
    {
      "title": "The best is the location",
      "text": "Functional hostel...Just for sleeping.There is no kitchen or any rest or leisure area, no TV.Rooms and bathrooms cleaned daily by well organized staff.The room has 2 bathrooms and 2 showers.And the strong point is the location, close to everythingMarkets, bars and restaurants etc...Very safe place and after all you are in Toronto.There are a few minutes walk to the center and CN Tower.",
      "rate": 3.0,
      "tripDate": " November 2023"
    },
    {
      "title": "Better than expected!",
      "text": "The staff working here is great - so cool and friendly and helpful! Super safe place and easy to find. Also, don't listen to the negative reviews you can find online, you'll be getting very clear instructions about everything, you just have to read and follow it, seemingly some people have lacked a little in that area and not understood neither the opening hours, the concept of this place nor have they paid any attention to or followed instructions. So, even though they themselves are the ones in the wrong they have left not so good reviews here. But don't worry, you'll be good here, just read the hotel's messages wherever you book when the hotel sends them. There's also absolutely no cleanliness issue at all and only really efficient and good people working here as mentioned. And, last but not least location is excellent and it's the best value for money overall in Toronto. Thank you for making me feel comfortable during my stay. I suggest you reading this go and stay here too!  Frida, Sweden",
      "rate": 5.0,
      "tripDate": " October 2023"
    },
    {
      "title": "À fuir !!",
      "text": "À Fuir !!Logement correspondant aux photos sauf qu'ils oublient de dire que les fenêtres ne ferment pas ! Je n'ai pas dormi de la nuit car je sentais tout le vent et j'avais tellement froid. Sans parler du bruit par conséquent. Je leur ai envoyé un message afin qu'ils viennent voir et pour avoir une couverture (juste un petit drap fourni alors que j'avais demandé au préalable)Jamais eu de réponses... J'ai hésité à aller passer ma 2ème nuit ailleurs mais l'achat d'une couverture me revenait moins cher ! Aucun respect des utilisateurs. Le garçon partageant ma chambre est rentré à 1h30 du matin. Il a allumé la lumière et ne l'a pas éteinte en voyant que j'étais la. J'ai du moi y aller.. Il a fait plein de bruit pendant 30 minutes, pris une douche à 2h, bu des bières. Autant dire que si vous y aller vous ne dormirez pas ! J'ai passé les 2 pires nuits.",
      "rate": 1.0,
      "tripDate": " May 2023"
    }
  ]
}