{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "The Parkdale Hostellerie",
    "url": "/Hotel_Review-g155019-d12816893-Reviews-The_Parkdale_Hostellerie-Toronto_Ontario.html",
    "priceRange": "$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "2.5",
      "reviewCount": 19
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "83 Elm Grove Ave",
      "addressLocality": "Toronto",
      "postalCode": "M6K 2J2",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/13/a3/c1/89/the-parkdale-hostellerie.jpg?w=500&h=-1&s=1"
  },
  "description": null,
  "featues": [
    "Free High Speed Internet (WiFi)",
    "Pets Allowed ( Dog / Pet Friendly )",
    "Baggage storage",
    "Non-smoking hotel"
  ],
  "reviews": [
    {
      "title": "Average hostel",
      "text": "Me and my friend stayed here for 1 week in a 4 bed dorm. Outside of the hostel looks very rundown. Room was very nice wouldn’t have any faults with it. Showers are very shabby. The rest of the hostel is very old and could do with some work. Public transport is right outside which can be noisy at night but also very handy if you need to get somewhere. Overall I’d probably stay here again but only because it was a lot cheaper than other hostels in the city.",
      "rate": 3.0,
      "tripDate": " July 2019"
    },
    {
      "title": "Mediocre",
      "text": "The sheets and bed were good, but the hostel itself could have been a little cleaner. The area isn't too good, but the low price makes up for it. If it's only for 1 or 2 nights and all you need is a bed, then go for it.",
      "rate": 3.0,
      "tripDate": " June 2019"
    },
    {
      "title": "It’s an alright place",
      "text": "This is a really nice hostel if you don’t mind being around people all the time. I had a private room but there was still people around. I liked it except for these theee things. 1. No air conditioning. This was a really big dead because it was HOT. It was constantly humid and very sticky. 2. The stairs. Once you get in the building you have to climb two flights of stairs. It was very tiring expectialy carrying a big heavy suitcase. 3. My WiFi didn’t work the entire time. I was on the top floor but they only gave me the password to the main floor so it didn’t work because I was so far away. I emailed one of the workers and they never answered. If you can look past these details I’m sure you will have a good stay.",
      "rate": 3.0,
      "tripDate": " May 2018"
    },
    {
      "title": "Filthy Establishment",
      "text": "It was against my better judgment to stay here after reading so many bad reviews but all other hostels were full. The owner needs to either employ more staff or train the ones they have on how to clean. While my bed appeared clean nothing else did. The carpets are disgusting and need to be ripped out. The bathrooms while seemingly fairly new are disgusting with mould, soap build up and general dust & dirt. This could be a great place with some effort as the location is interesting and on a good public transport route.",
      "rate": 1.0,
      "tripDate": " September 2023"
    },
    {
      "title": "They do not always honour your booking. Sketchy",
      "text": "They gave the pre-paid room to another guest and then hoped that I would be ok with staying at another address. Not safe, very sketchy. The waiting room, entrance and hallways were filthy.  I waited for hours for the owner to show up to find a solution. She never showed or called. I was with my son and he didn't feel safe there, so we had to find other accommodation. Still waiting for a refund for not honouring the pre-paid room.",
      "rate": 1.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Good location, clean rooms and bedding",
      "text": "Good place to stay, useful location, lots of places to eat and drink around. Check-in person was nice. The interior is well worn, but the rooms and bedding are clean. Toilets, sinks, showers were ample, and they were separated so there was never any waiting. I'd stay again for sure. There are not a lot of great options in Toronto since the HI closed.",
      "rate": 5.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Best deal around.",
      "text": "We enjoyed our stay. It was conveniently located and our room was comfortable and clean. The entranceway was a bit questionable, as in it needs some paint perhaps, but the hostel was clean and the people I encountered were friendly. We would totally stay here again. Did I mention the price was a fraction of the rates at local hotels?",
      "rate": 4.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Overnight stay",
      "text": "We stayed here while visiting family.  You have to buzz to get in but are subsequently given the key code and keys for your room.  It had appeared to be recently refurbished with paint and new plumbing.  Our room was adjacent to common toilets and showers.  There was a fridge and microwave in the common room.  Downstairs there was a big kitchen abutting an even larger common room.  Pretty good deal for the location and the guided tour.",
      "rate": 4.0,
      "tripDate": " December 2017"
    },
    {
      "title": "First, and maybe last time I’ll stay in a hostel",
      "text": "I understand it’s not fair to judge all hostels based on one experience, but damn this one was rough. Before I give my brutally honest opinion on the stay, I’ll say that the people (other guests) were pretty awesome and came from all over and it was cool meeting them. The common area layouts were pretty cool as well. The balcony was nice but it wasn’t very accessible as you had to go through someone’s room to get there. Now time to be honest. As soon as I walked in the door, there was an issue. The woman that was working answered the door, we told her we had a reservation and after her saying “um, uhhhh” about 22 times she let us in to check on upstairs. We got upstairs, gave her our names and she directed us to a 10 person room which would have been nice, but that’s not what we booked at all. We booked an 8 person room and I told her that I would accept what I asked and paid for. She didn’t have a clue what was going on and said that we needed to wait for the manager of the hostel who would return in about half an hour but we were welcome to wait upstairs.An hour and a half later... I walked downstairs to see if the manager had returned yet just in time to overhear her saying “If they don’t want to stay in the room they can just leave!” I thought this was pretty uncalled for considering I’m not the one who messed up my reservation which I expressed. After talking to her for about 20 minutes, and showing her our confirmation email for what we booked, she conjured up some excuse about how we stated there would be mostly females in our group (which we certainly did not) and put us with another group that was all female. I stated that wasn’t ok and I wanted what we paid for, to which she said she’d already given our room away to another group. Awesome. I wanted to leave but the rest of our group wanted to at least stay the night so I decided to brave the poor service and tough it out. One of the managers selling points on the 10 person room was that the two bathrooms were “brand new”. I’m not sure what her definition of brand new is but I can assure you they weren’t in any way shape or form brand new. It looked like it hadn’t been cleaned in maybe a week or more. And there were toiletries everywhere on the shower. They’d just installed A/C units that same day but the room still felt it was about 85 degrees. The beds were pretty small which I expected but they were comfortable enough. The kitchen was mediocre at best. There were 2 refrigerators one of which doesn’t look like it ever had been emptied. We stayed there for about 5 days, which was definitely 5 days too long. Overall I’d rather pay the extra money for a hotel and be comfortable and have everything clean than to save.",
      "rate": 1.0,
      "tripDate": " August 2018"
    },
    {
      "title": "The worst in the world",
      "text": "My friends, under no circumstances should you ever call, make a reservation or even think about staying in this terrible, undeserving, trashy dump they call a hostel. The fact is that you will get a huge negative experience from communicating with employees and guests this establishment. And your disappointment from the quality of service.And the services provided Will last much longer than the joy of a low price. Moreover, inside you can meet many troubles, complexity problems and even diseases. And your wonderful stay in the city of Toronto will be overshadowed. Communicating with various drug addicts, idiots, racists.Very narrow-minded people and extremely uneducated, uh, also arrogant and very, very narrow-minded. The animals that work there and at the front desk, I can't even call them people in particular. I'm talking about a. Chief managersAmong other things, this hotel is a so-called hotel, although in fact it is a homeless shelter just for a lot of money. So in this crappy little shelter, there are a lot of prohibitions and some idiotic conditions. They're really just looking for a reason to kick you out and take your money, which you pay, that is, they steal clients' money, then kick them out and keep it for themselves. In the end you pay.Because you live on the street, the scheme is very simple.This happens to everyone and everyone. Moreover, in this hotel, as I want to warn you, there are a huge bunch of spiders, cockroaches, mice, mold, unpleasant odor and even bed bugs, so stay away from this place, under no circumstances even think about going there. Thank youAnd moreover, things still disappear there, money, and documents, and you will never find them. Every day the police come, there are fights, conflicts and people live with very disturbed psyches and serious drug addiction. I have photo and video evidence there and my personal experience, so I know what I’m talking about, I’ve already traveled halfway around the world and a more terrible, more crappy place, and I’ve never seen it on our planet, and for that kind of money. It's just a disaster.",
      "rate": 1.0,
      "tripDate": " May 2024"
    },
    {
      "title": "Dodgy, poor location, strange",
      "text": "I stayed one night in this hostel and will never return. At 7pm, I arrived at the address and had no idea where the hostel was located. There was a number 83 on a door of an old building. There was no sign or anything to indicate that this was the right place. I walked further up to the door and noticed “Parkdale Hostel” written on the door bell. I pressed it and no one came. I stood there for 10 minutes in -9 degree weather waiting to be let in. I then walked inside and it looked like a building site. There was no indication of a hostel at all. I walked up the stairs, still unsure if it was even the right place. I found reception on level 2. The lady at the desk seemed very uninterested in her job but did show me around the hostel and helped me with my bags. I stayed in a private room but I was placed on an all-male level, where I was he only female. My room was unexpectedly nice. Probably the nicest hostel room I have ever stayed in. But it didn’t have a light on the ceiling, only a very dim lamp. The street noise came right through the window and there was also no blind on it so all the street lights shined in the room as well. The showers were terrible. It was one room with 3 showers and no cubicles. I didn’t feel safe showering there. Lucky I had already showered that morning and I was leaving the next day. The area itself was scary! There were homeless people yelling at each other everywhere. I will never return to the Parkdale Hostel. Spend a little extra and stay somewhere safe and closer to the city.",
      "rate": 1.0,
      "tripDate": " March 2019"
    },
    {
      "title": "Really Enjoyable Stay!",
      "text": "I stayed here for four days alone this June while I was job hunting in the city. I would highly recommend the Parkdale Hostellerie if you're looking for a good hostel! The staff were incredibly friendly and helpful, the place was clean and nice, and the location was excellent. The beds were surprisingly comfortable, and there were fans in all the rooms and on each individual bed so I was never too hot, even in the boiling summer heat! I was worried about the internet connectivity after reading other reviews, but the WIFI was very strong and I had no problems! I could even watch videos at night. They have three different routers in the hostel, so no room is out of range. Very wonderful! Unless you opt for a private room (I didn't sleep there but I saw them and they looked very clean and comfy!) you will be sleeping in a bunk bed in a room of 16 or so other people. As I mentioned, the beds are comfortable and clean. Pillows, sheets, and towels are provided. This may be unique to my experience, but all the other guests were very polite during my stay. There was no excessive noise at night and no one ever touched my things or stole from me. There are no lockers, so I slept with my bag at the foot of my bed. I took my valuables with me during the day, but I left items like my clothes, toiletries and phone charger, and no one tampered with them. A tip - if you're on the top bunk (you don't get a choice, but the staff are very kind and might accommodate you if you ask) you should pack a long phone charger if you want to use your phone in your bed! The outlets are near to the ground. There are no curtains on the windows, so a sleep mask is recommended. There is some noise from streetcars at night and other guests will come to bed/shower after you, making some noise, but overall it is very bearable. Bring earplugs if this bothers you. I was able to sleep without them. Lots of bathrooms and options for showering. Shampoo, conditioner, body wash and face wash were provided in all the bathrooms, used by everyone. I still packed and used my own, but if you're limited on space and staying for a short time you might get away without bringing it. There are two common rooms and a lovely outdoor deck. They are comfy and well decorated. The amount of privacy you have will depend on how many people are staying there with you. The location is right on a streetcar line, and lots of amenities very close by! There's a public library right on the corner, also with very friendly staff who let you use the computers and printers even without a Toronto library card. It is within walking distance to some lovely independent grocery stores and a dollarama, which is where I purchased most of my food. Another tip - if you like Harry Potter, the hostel is right next to a harry potter themed store on queen street! The communal kitchen was a little tricky, because it would get so hectic at mealtimes. There is a fridge where they allow you to store your own food, but it is very full. I would not expect to be able to cook for myself for every meal. Eat fresh or eat out. However, if you're willing to be inventive and have a lot of time to cook, you will get by! Despite this, the kitchen was clean and had lots of appliances, such as a stove/oven and microwave and kettle. I can't say how well they worked because I didn't cook. As I mentioned, the staff are incredibly helpful and kind! For my short stay, this had everything I needed and it was very enjoyable!",
      "rate": 5.0,
      "tripDate": " June 2018"
    },
    {
      "title": "Ok, wouldn't stay again.",
      "text": "Firstly it was very difficult to find, the entrance is in a back alley and there is a big letter P graffiteed on the door. When it was eventually answered the person didn't look up from her phone to acknowledge us. We were then told that we hadn't made a booking (we had, weeks ago) we hadn't paid (again, we had weeks ago in full) and that we had only booked one bed (we hadn't, it clearly said 2). We are a mixed sex couple and had requested a mixed sex dorm, so we're put into a male only dorm. The beds we were shown to were next to each other, the top bunk was empty but they said someone was there so we couldn't have the same bunk. 15 minutes later as they are showing someone around they show him the top bunk that we were told was already occupied. It would have been no problem on their part to swap the new person to the other one of our bunks so we could be together. Lastly, another couple showed up having booked a private room, the management had forgotten about this and put their friends up in that room instead. The couple ended up leaving and having to find somewhere else to stay. DO NOT BOOK VIA HOSTELWORLD. Facilities wise 14 beds shared a single toilet/shower which was located in the kitchen. The shower was filthy and covered in mold but the toilet and sink were clean and soap and a single towel were provided. There was a fridge in the kitchen but this was not plugged in and there were only 2 rings to cook on. In terms of space the only place to eat your food was the table which doubles up as the managers office.There were also large holes in the ceilings, broken showers and the whole place was unwelcoming. We left feeling that the owners only care about how much money they make from maximum amount of people staying. If you like arty vibes and sparse amenities you will enjoy it, if you want a good night's sleep and to feel clean after a shower find somewhere else.",
      "rate": 3.0,
      "tripDate": " May 2018"
    },
    {
      "title": "Great price, staff & location but noisy.",
      "text": "We stayed here for a few nigts when travelling through Toronto and it met most of our needs for our short trip.The staff are super friendly and helpful. They went above and beyond to offer us information, advice and even emailed us with transport options to Niagara Falls. Really couldn't fault the service there at all. The room was clean, well kept and had a nice vibe to it. We arrived late (10pm) and the room wasn't ready for us. I think it had been forgotten bit staff quickly sorted it for us and there's a nice common room to wait in. The location is good. Short walk to Queen Street and King Street trams and plenty bars and eating options in the surrounding area.   My only grievance was the noise. I'm usually a deep sleeper but the noise here really travels. It doesn't help when another lodger is blow drying their hair at 4am in the common room! Our room was next to the communal toilets too so footfall was a plenty during the night. Take earplugs if you want a decent sleep. For the price we paid we couldn't expect much more though and would consider it again if in Toronto.",
      "rate": 3.0,
      "tripDate": " April 2018"
    },
    {
      "title": "Not fully up and running yet",
      "text": "A decent choice for the price and location, reasonably clean - but a few issues.Firstly - the positive. Beds were clean and comfortable. It feels like a lived-in home, cozy, and has quaint and unique furniture. It's a bit maze-like, but it has a big living space to socialize in and very high ceilings. Huge kitchen and all the amenities. Easy to access wifi and friendly staff and patrons.The okay: it's not dirty, but definitely has a 'lived-in' or rough look. It's a hostel though - but from the website photos I was expecting something more like a BnB. Check the Instagram photos for more accuracy of what it is like. They are a new operation and not fully set-up so things are piled all over the place and it looks (and feels) a bit chaotic. Also no signage outside so I wasn't sure that I arrived at the right place.The bad - sound REALLY carries in this place. There were people up talking and laughing in the living room until 1 or 2am some nights and the only way I could sleep was by putting noise-cancelling headphones in. Bring earplugs otherwise no sleep for you.If you want a female-only dorm book ahead and in person.",
      "rate": 3.0,
      "tripDate": " March 2018"
    }
  ]
}