{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "The Avalon Yorkville",
    "url": "/Hotel_Review-g155019-d14066447-Reviews-The_Avalon_Yorkville-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.5",
      "reviewCount": 76
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "155 Yorkville Ave",
      "addressLocality": "Toronto",
      "postalCode": "M5R 0B4",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/24/04/22/ea/the-avalon-yorkville.jpg?w=500&h=-1&s=1"
  },
  "description": null,
  "featues": [
    "Free High Speed Internet (WiFi)",
    "Fitness Center with Gym / Workout Room",
    "Washing machine",
    "Air conditioning",
    "Kitchenette",
    "Dishwasher",
    "Refrigerator",
    "Kitchenware",
    "Non-smoking rooms",
    "Suites"
  ],
  "reviews": [
    {
      "title": "Nice and sweet stay at the Avalon Yorkville",
      "text": "A friend and I stayed at this property end July / early Aug 2023. This property is in a great location in close proximity to anything you’d need - restaurants, shops and supermarkets. The suite was nice and clean. We had a few issues with our dishwasher and washing machine which was a bit uncomfortable but upon contacting the Avalon staff they tried to help us out and get things working quickly. Also when we arrived, early check in was not possible so the staff offered to keep our bags for us at no extra cost so we could have a stroll in the neighborhood until the suite would get ready. This is a practical and convenient property to stay at especially for longer stays.",
      "rate": 4.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Clean and Well-Appointed Apartment in a Great Location",
      "text": "I enjoyed my stay at the Avalon Yorkville. The location was fantastic, while the apartment itself was very clean and well-appointed. The only drawbacks were the shades not being fully blackout and the tv not having many channels and being difficult to use. If you don't care much about the tv and bring a sleep mask, you will have a wonderful stay here!",
      "rate": 4.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Not as advertised",
      "text": "This apartment was listed as a hotel, but it is really part of a suite of apartments held in a condo. Consequently, though there was a concierge, it didn't offer concierge services for the hotel guests. We were told to call the company. The company's phone said the phone was out of service. Texting the company did yield results, but often hours after we tried to contact them, long after the answer to the query could impact decision-making (for example - availability of another room, or fees for checking out late).  They had no standard hotel amenities, such as room service or daily room cleaning (though you could purchase that online...that didn't register with me that if you didn't purchase it you had no cleaning service over the course of your stay. Wasn't a dealbreaker for me, but was a surprise.) Further, you couldn't leave your luggage with the concierge of the condo, which turned out to be a major inconvenience. That's perhaps the most basic hotel amenity, and its absence created some problems.  The bedding was beautiful, but the linens in the bathroom were substandard. One towel and facecloth was great, the other towel had a hole in it, and the facecloth was very aged. The bathroom was not fully clean.The apartment itself was beautiful, a small bachelorette, but with everything you'd need. But the walls were badly scuffed and the whole place needed a paint job.  The location was superb, which was the primary reason for picking it; and if you were higher up, you'd get a beautiful view of the city.The place served my needs, but it is not as advertised. I was hoping, if it worked out, that I could have this as my go-to during repeat business trips over the coming months; but I will not return.",
      "rate": 3.0,
      "tripDate": " November 2019"
    },
    {
      "title": "Great location and Secure building",
      "text": "This is my second time staying at Avalon Suites.  I was in Toronto for two weeks.  You are right in the middle of Yorkville and within walking distance of a lot of restaurants, shopping, and grocery stores.  You are about a block away from Museum subway station.  The building lobby is a secure entrance that you need a key FOB to enter as well as key FOBs to get to the individual floors.  It gave me piece of mind as I was traveling by myself and felt completely safe that there was not random people roaming the hallways outside my suite.  Avalon suites was just a phone call away for any problems and if any additional supplies was needed.  There is an in suite washer and dryer.  I do recommend bringing earplugs or a headset in case you are a light sleeper. My first stay, my suite was on the 20th floor.  This stay however, my suite was on the 6th floor and was closer to street level so I got a lot of street noise in the evenings especially the weekend nights.  The street noise did not bother me.   The suites itself was soundproof so you do not get noise from the neighbors.  Overall it was a great stay and I will definitely look to book with Avalon Suites again should I need to return to Toronto in the future.",
      "rate": 5.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Nice Location Lousy Service",
      "text": "Despite the great looking website this is some sort of knock-off Air BnB except the host is a ghost.  Parking, as other reviewers have noted, is very confusing. The concierge in the building wants nothing to do with you. Coffee & tea (and water) are supposed to be included but 3 coffee pods with no sugar isn't going to last long in a multi-day stay (there is no housekeeping). No dish soap or dish cloths or towels to do the limited # of dishes with. They only get the basic TV channels (CBC, CTV, NBC) - if you want to watch sports or news you have to open an account for a month with the provider then apply for a refund when you leave. As if?  Some surfaces had not been dusted in awhile.",
      "rate": 2.0,
      "tripDate": " June 2021"
    },
    {
      "title": "Amazing trip in he heart of Yorkville",
      "text": "My stay at Avalon Suites Yorkville was amazing. The hosts were super helpful throughout my entire stay. The suite is beautiful and came with a kitchenette, including pots and pans. Anything I needed, they were able to provide it for me. The location is perfect; so many restaurants and activities in the area. Would definitely stay again.",
      "rate": 5.0,
      "tripDate": " April 2022"
    },
    {
      "title": "Great stay in Toronto",
      "text": "We stayed in this condo while visiting in Toronto, perfect for my husband and me and our daughter, who slept on the couch. Yorkville is a great location close to many restaurants, coffee shops, shopping, the Royal Ontario Museum (ROM) and the TTC (multiple stations). Tracy was wonderful, met us upon check-in to ensure that we had everything we needed. When we requested some things, she was able to get them to us quickly and always with a smile! We didn’t use the small kitchenette but the unit was well stocked with plates, glasses, cooking utensils, etc. The building was very secure. And the view from our unit on the 27th floor was great! We would definitely stay here again!",
      "rate": 5.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Friendly staff, luxury stay, amazing experience.",
      "text": "I went to celebrate my son's birthday in Toronto with my family. Everything was arranged perfectly and the staff went above and beyond to ensure we were  comfortable.It was high season (beginning of June) when we visited Avalon but didn’t surprisingly bring any discomfort. Overall high level of service, staff are very nice and accommodating.The location is great, there are lots of very nice bars and restaurants rights downstairs on the same street the building is located. On the next street which is a minute walk there were lots of high-end shops and department store. My family and I ended up spending all of our time within walking distance of the property. The furniture of the apartments are new, high quality and comfortable. They had provided us with all we needed from kitchenette to detergents, shampoos and extra linen. My husband had to work on some days, the unit had work desk, TV and separate room. So, we were very comfortable. The view from the room and the living room is amazing. I highly recommend this hotel and cant wait to go back!",
      "rate": 5.0,
      "tripDate": " June 2021"
    },
    {
      "title": "Terrible Service",
      "text": "Overall, very bad expirence here at the Avalon Sweets. This is my fourth and last time here due to the terrible expirience I had with new staff. Our stay starts off by getting to our room and noticing that we were put in a standard room after booking a suite with a city view. I immediately notified the people dowstairs and they came up to check. A man named Moein knocked at my door and I told him this is not the “Superior Sweet” that I booked and he replied with “i know this is not is a regular room” he instantly started off with some kind of attitude. Then he would go on to tel me there was a switch the day before and his way of reasoning the issue was by repeating to me “it was not me that made the switch”. Then after alot of attitude he told me to take out my calculator to “do math” in order to calculate the difference to which I told him that im the guest and he calculate it. After that I told him I probably wont stay here again to which he rwplied “Good, I dont expect you to”, that is where my mouth dropped. And to top it off when I told him to bring up the difference he owed me for the rooms he told me that I can come down and get it myself. I went down later that night to Moein disappearing until the next day at 3pm meanwhile our checkout is at 11am so we will not even see him. Ive never experienced such a rude and uncomfortable staff member and and hotel in my life. Moein is one of the worst people you can hire to run a hotel. Such a terrible way to spend our valentines day I was very upset.",
      "rate": 1.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Perfect spot for a couple to stay",
      "text": "The room was clean and the view was amazing in the morning, day and night.  The kitchen was really well stocked, dishwasher, coffee maker and washer/dryer all worked well.  The neighborhood has everything so close by. We will be back!",
      "rate": 5.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Week in Toronto",
      "text": "We had a very comfortable and enjoyable stay at this property.  The location is excellent and the apartment was well equipped, clean and functional. The hosts were responsive and accommodating. In summary this apartment is an excellent option to visit Toronto!",
      "rate": 5.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Unfortunately not good standard",
      "text": "Unfortunately the room was not at all clean, furniture was not in good shape and the standard in general was poor. We rented three rooms and two of them was not in good standard. I was lucky that my 83 old parents at least had an average experience. I will not go back to this apartments thou the area has everything u want and offers good shops, restaurants and nice surroundings.",
      "rate": 2.0,
      "tripDate": " December 2022"
    },
    {
      "title": "Beautiful clean condo with amazing city views!",
      "text": "Professional and courteous staff every step of the way! Great location with nearby restaurants, shopping and points of interest.  Condo was really clean and well designed.  Everything worked great in our suite.  Wish we could have stayed longer!",
      "rate": 5.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Vacation",
      "text": "I enjoyed my stay there and the Host was helpful, great communication and instruction. It is right I. The middle of everything we needed. We had a Lots of restaurants on the street and the night life there is fun. Love it so much. I am coming back for sure!",
      "rate": 5.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Beatiful place",
      "text": "Great location and service from the host. They are working on making the experience better. It’s my second time staying. Definitely a recommended suite for anyone travel for work or leisure. Hoping to stay here again soon.",
      "rate": 5.0,
      "tripDate": " April 2022"
    },
    {
      "title": "Great experience",
      "text": "Great hospitality by the lovely team. And the view was fantastic, and the location was great. Clean place, easy parking. Big room space. And it’s literally in the middle of everything  I’ll absolutely come back again soon . Thank you",
      "rate": 5.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Weekend in Toronto",
      "text": "We stayed in this place for the weekend. The staff was super friendly and very helpful. Location is great close to subway station and plenty of restaurants and cafes. Bed was comfy. Quiet building. We’ll stay here next time we are visiting Toronto.",
      "rate": 5.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Great stay",
      "text": "Great location and excellent view! Many luxury stores nearby. Easy to access to museum, UT, and restaurant. Clean apartment and lobby. Polite owner and concierge. Walking distance to get to Whole Foods market. Great stay.",
      "rate": 5.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Worst Experience Ever!",
      "text": "Lets start with1) Arrived at 2:15 and wanted $50 for the key before 3p even though it was empty2) room was not as presented3) filthy4) bed is more like a futon with no fitted sheet which exposed mattress when sleeping5) Customer Service Horrible6) my 10 year old daughter found a open CONDOM wrapper beside the bed7) taking a shower was an experience since the water did not drain8) Customer Service made the experience even worse.9) STAY AWAY AT ALL COSTS!!!!!!!",
      "rate": 1.0,
      "tripDate": " October 2019"
    },
    {
      "title": "Avoid Avalon Suites Units",
      "text": "I traveled to Toronto for a wedding, and booked a 6-night stay in a unit managed by Avalon Suites.  Upon arrival I discovered that there was no hairdryer.  I called Avalon's customer service line and asked them to send a hairdryer, preferably by the following morning.  The following evening there was still no hairdryer in the unit.  I called and emailed daily, but over 6 days no hair dryer ever appeared.  A hair dryer is a basic amenity which is promised in their promotional material.  With no hairdryer in the unit, I was forced to book 2 appointments with local hair salons at a cost of more than $100.  Avalon's failure over 6 days to respond to my requests to deliver this simple promised item demonstrates a total disregard for their guests.  I frequently travel to Toronto and was attracted by Avalon's superb location and moderate price, but I'll never book another Avalon Suites unit.",
      "rate": 1.0,
      "tripDate": " June 2019"
    },
    {
      "title": "Amazing stay, great location and excellent customer service",
      "text": "I stayed at Avalon during a business trip I had in Toronto. I stayed there for a couple of weeks and had a great experience. The building is located in the most luxurious neighbourhood of Toronto, you have many shops and restaurants within steps from the building. They have staff available for service from morning to night, I contacted them a few times for different matters and they always attended to me immediately. Their staff is very professional and helpful.They have many additional options available such as early/late check outs, luggage room, shuttle to and from hotel and etc. The uni itself is very modern and luxury, the view of my unit was also amazing. I had a huge window with a great view. Overall, my experience during these few weeks were amazing and I would highly recommend it. Look forward to staying at this property on my next trip to Toronto.",
      "rate": 5.0,
      "tripDate": " April 2022"
    },
    {
      "title": "Home away from home",
      "text": "Wonderful location in a lively neighborhood. Great building and a comfortable suite. Service level was great by the host, accommodating and accessible. We asked for extra hangers, amenities and help with appliances and the answer was always positive. We enjoyed our stay and recommend staying here.",
      "rate": 5.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Perfect place if you like to walk around",
      "text": "Great apartment at a great location. All worked fine and their staff was friendly and fast. I felt like home in Toronto. Beds are confortable and wash-dry machine Helped a lot. BTW they provided Nespresso capsules for the machine every Wednesday.",
      "rate": 5.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Fantastic place!",
      "text": "Our room could not be more ideal! Beautiful unobstructed view over Yorkville. The building is so secure. The host was uber responsive with respect to everything - very professional and could not have been better! We would certainly stay here again and recommend to others.",
      "rate": 5.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Top apartment in a top area!",
      "text": "I read the negative reviews.  And I have found the opposite. Maybe change in manager. We were greeted by Corinne who was very polite. The apartment is clean, modern, and fantastic location. We spent lunches watching the beautiful cars and people pass by in restaurants that are 30 seconds away!!  This is a top area in the middle of Toronto. All top brands are in Yorkville!!  Honestly a luxury apartment in a luxury area.",
      "rate": 5.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Steer clear - dirty and broken",
      "text": "Stay away! We found green and black mould in the bathroom, blood stains on the mattress pad, and clothes dryer didn’t work - hello damp clothing. Avalon was unapologetic (robotic employees and not real people). AirBnB saw our photos and processed a partial refund - but this was an awful experience.",
      "rate": 1.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Great stay at Avalon Yorkville! Jul 2022",
      "text": "Stayed at the Avalon Yorkville for 3 nights. It is in a great location and a very clean apartment. It felt like a very safe area, with a lot great restaurants and shopping nearby within walking distance.",
      "rate": 5.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Top location in Toronto ",
      "text": "Excellent Studio flat in the heart of Yorkville, Toronto. Top restaurants, high street shopping all around, ran in to several Hollywood stars. Couldn't ask for a better location, apartment is clean, very secure and hosted exceptional well. Will definitely be staying here again.",
      "rate": 5.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Clean space in a Great Location",
      "text": "Great location, comfortable room and very accommodating staff. They were responsive.  We were able to unpack and put all our clothes away.  Appreciated that.  Ideal location to anywhere in Toronto and very close to a subway stop. Nice little kitchenette and table and chairs overlooking the area.  Clean building with quick elevators.  All in all we were very pleased with our stay.",
      "rate": 5.0,
      "tripDate": " October 2022"
    },
    {
      "title": "Outstanding place in a beautiful city",
      "text": "The building has a very organized concierge, it’s clean, safe e very well located. The neighborhood is outstanding and the apartment is comfy with modern appliances.The Subway is quite close, which helps and make transportation easy. The subway is also remarkable in Toronto.It’s a beautiful city and this location makes the experience even better.",
      "rate": 5.0,
      "tripDate": " May 2022"
    },
    {
      "title": "Amazing Stay Will Be Back",
      "text": "Checkin was easy. The guest service agent was easy to reach and very responsive. She helped me move my luggage to my suite and showed me around. The suite is very quiet, so it was easy to relax and unwind. It's also stocked with more than just necessities, which made everything very convenient. The location is also beautiful and everything you'll need is nearby (Whole Foods, Rexall, plenty of restaurants, etc.)! Will definitely come back.",
      "rate": 5.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Great room, area and service",
      "text": "The location is great as it is right in the middle of Yorkville with a grocery store nearby and a large amount of great restaurants.The room was exactly as described and had everything I needed during my stay. I really appreciate the level of service as the staff was highly responsive whenever I sent them a text and they were very helpful!",
      "rate": 5.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Good place to stay",
      "text": "When we arrive, the lobby is clean. The elevator requires my room key to access my room. The room has kitchen, so it is very convenient for us to cook dishes. Overall, it is a nice place to stay. We can easily go out.",
      "rate": 5.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Don’t ever stay at the Avalon Suites!!!  Terrible.",
      "text": "I’ve stayed in thousands of hotels over the years and have never had such a terrible experience like with the Avalon Suites.  Beware of this terrible hotel!   We arranged for a 6 night stay in the Avalon Suites and when we got to our room it was stiflingly hot.  The air conditioning did not work.  We kept trying to turn the heat down and have the fan on but the fan just blew hot air.   We opened the only tiny window and it didn’t cool the room at all.  We barely got any sleep.  When we booked the Avalon Suites the advertising was clear - air conditioning was included.  We spent most of the next day trying to get assistance but were generally ignored by the staff.  They rarely answers the phone.   At one point they promised us a different room.  At another point they said they would fix the AC but then said it was off for the winter.  We told them we would like them to refund the remaining nights of our stay (we had 5 nights left) if they could not fix the problem.  They didn’t even attempt to fix the problem and we finally gave up later in the afternoon and booked another hotel and left the 30 degree sauna.   No one could tolerate a room like that.We politely asked for W refund and hers’s the response we got:“I know how frustrating it was since we didn't meet your expectation. We, Avalon Suite Yorkville are apologizing for all of the hassle and inconvenience that it caused you and your partner, and this is not the service that we want you to experience in Avalon Suite.Sorry about not changing your suite. We decided not to change your suite because it's useless due to all of the AC is centralized to all of the building and you will experience the same issue with one resolution and open the window so the room temperature will get cold.  With regards to the refund, unfortunately, we will not offer any refund on this matter. It is firm and non-negotiable. Hoping for your understanding. Best regards, Avalon Management”So we are out $1100.   Don’t ever stay there people!",
      "rate": 1.0,
      "tripDate": " April 2023"
    },
    {
      "title": "If you’re a woman that values her safety STAY AWAY!!!!",
      "text": "The manager of the building is not friendly & the rooms were so bad - not like the pics and not worth the price. Trust me go elsewhere. Others didn’t have a bad experience but when it’s bad - ITS BAD!!!We stayed here in fall 2020. We opened the door with our bodies because covid & the manager locked us out of our room saying we kicked the door (not true), held our stuff hostage, completely lied about having footage of everything (he tried to convince us that we kicked it as we were saying to him \"no one kicked anything in the video\"). Tried to kick us out in the middle of the night - if you’re a woman & value your safety STAY AWAY!!!!Thankfully we were fully refunded by Airbnb.",
      "rate": 1.0,
      "tripDate": " September 2020"
    },
    {
      "title": "Overall excellent",
      "text": "We enjoyed our 2-week stay at Avalon Suites in late May and early June.  The unit was exceptionally clean with all of the kitchen items we needed for our stay.    The staff were very responsive to any questions that we had before and during our stay.  The location is excellent.   I would highly recommend this to friends visiting Toronto and we will look to stay again on our next visit to Toronto.",
      "rate": 5.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Amazing Stay",
      "text": "Our suite had a spectacular view. It's spacious and clean, perfect for longer term stay. The staffs were very nice and helpful. The building is very safe as the doors and elevators are unlocked by fob. It is in the heart of downtown Toronto, just steps away from all the popular attractions and surrounded by a large variety of restaurants.",
      "rate": 5.0,
      "tripDate": " July 2021"
    },
    {
      "title": "Such a nice place!",
      "text": "When I got to the building, the host was very quick to respond to my questions for check in.  She met my friend and I in the lobby and gave us very clear instructions and was very helpful with suggesting places to eat and things to do.  The building was in a fantastic part of town with tons of shopping restaurants and attractions all within a 10 minute walk.  The unit was very clean and exactly as shown in the ad.  The only issue I had was that the garbage chute wasn’t letting us put our garbage in.  But other than that, for the price I paid, I would definitely consider staying here again",
      "rate": 5.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Very pleased",
      "text": "I booked this place for my partner for his business trip. The communication was prompt and professional. The check-in was easy and they happily accommodated me booking on behalf of my partner without any issues. The space was clean and modern and the location was superb. Would book again!",
      "rate": 5.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Fast communication and reasonable cancellation policy.",
      "text": "The host was very reasonable about an accidental booking and gave me a refund. Fast response and quick resolution. I contacted the host through Airbnb and they replied with in minutes and were patient through out the process. I would definitely consider staying when I visit the city.",
      "rate": 5.0,
      "tripDate": " July 2022"
    }
  ]
}