{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "The Annex",
    "url": "/Hotel_Review-g155019-d15326716-Reviews-The_Annex-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.0",
      "reviewCount": 67
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "296 Brunswick Ave",
      "addressLocality": "Toronto",
      "postalCode": "M5S 2M7",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/16/8c/b4/48/the-annex.jpg?w=500&h=-1&s=1"
  },
  "description": "The Annex is more than a place to lay down and rest. We're a home away from home for those who want to experience real city life. We’ve collaborated with the neighbourhood’s best to make sure you get to live like a local. Don’t just sleep here–live here. And discover what hospitality was always meant to be.",
  "featues": [
    "Paid public parking on-site",
    "Free High Speed Internet (WiFi)",
    "Bar / lounge",
    "Highchairs available",
    "Pets Allowed ( Dog / Pet Friendly )",
    "Baggage storage",
    "Non-smoking hotel",
    "24-hour check-in",
    "Street parking",
    "Wifi",
    "Coffee shop",
    "Breakfast available",
    "Happy hour",
    "Snack bar",
    "Wine / champagne",
    "Umbrella",
    "24-hour front desk",
    "Express check-in / check-out",
    "Private check-in / check-out",
    "Allergy-free room",
    "Blackout curtains",
    "Air conditioning",
    "Desk",
    "Housekeeping",
    "Refrigerator",
    "On-demand movies",
    "Walk-in shower",
    "Safe",
    "Seating area",
    "Clothes rack",
    "Iron",
    "Laptop safe",
    "Private bathrooms",
    "Wake-up service / alarm clock",
    "Electric kettle",
    "iPod docking station",
    "Complimentary toiletries",
    "Hair dryer",
    "City view",
    "Non-smoking rooms"
  ],
  "reviews": [
    {
      "title": "Trendy!",
      "text": "Stayed here twice while on a recent trip to Toronto, picked the hotel because of its proximity to the Annex neighborhood. No front desk, check in via text, and doors to hotel and room are by codes sent when check in is completed. Very different!Room was large, light,  very clean, minimal décor but some special touches such as a record player complete with several albums and art pieces from local artists scattered about. Shower was also large, overhead rain shower feature and lovely thick white towels.Although the bed was very comfortable, getting into the bed was a bit difficult as the mattress is on a large raised platform against the wall.  Not the easiest for the person sleeping against the wall to get in or out of bed and even more so if you're over 30!There is paid parking very close by but it was expensive.We had breakfast and coffee in the morning at the cafe located within the hotel - breakfast options were limited but the coffee was very good.",
      "rate": 4.0,
      "tripDate": " July 2021"
    },
    {
      "title": "LIVE LIKE A LOCAL IN TO",
      "text": "The Annex is a hidden gem in a vibrant Toronto neighborhood. We have stayed there twice as locals and would highly recommend everything about the place (fantastic location with easy access to local shopping, culture, and restaurants, as well as great rooms, and very helpful staff). As a Torontonian, I can verify that The Annex is the real deal. It is exactly what I would look for when visiting other cities.",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Like staying with a friend in a cool neighborhood",
      "text": "The Annex is like if you went to stay with a friend who has a place in a really cool part of Toronto and has great taste in decor. The king size bed is more like a platform with a futon. There is a long shelf that serves as a table. There are more than ample electric outlets for our gazillion devices. The luxury toiletries come in large bottles, the bathroom has double shower heads. Even though the hotel has a bar next to it and downstairs, the sound proofing was good enough that we heard nothing in our 2nd floor room. Breakfast was included with a barista making our coffee in the morning. The only downside is there is no elevator so my husband had to lug our 40 lb suitcase up a flight of stairs. Not a deal-breaker - but it might be something to consider if you are planning to stay here. Scott Pilgrim vs the World is set in the Annex neighborhood, so my husband totally geeked out over the location. We felt like we were having a local experience. Everything is within walking distance that for the first couple of days we didn’t even get on to public transport.",
      "rate": 5.0,
      "tripDate": " May 2023"
    },
    {
      "title": "Don’t stay here if you want an early night",
      "text": "Don’t stay if wanting early night sleepYou enter hotel by back alley which is not that good or clean. The front door, which is near the bins, is a Security coded door, you get this code and the code for your door to your room via email before you arrive.You then have to carry your cases up two or three flights of stairs, no lift and no reception.  Rooms are standard and very clean, no TV or telephone.There’s extra bedding, towels, kettle etc in a cupboard along corridor, you help yourself if need extra towels etc. Biggest issue of why I wouldn’t come back here or recommend it, there’s a wine bar down stairs directly under the hotel rooms and there’s an adjoining night club which is also directly under your bedroom. The entrance to the hotel is in between these two function rooms. You have your breakfast, in the wine bar area, which is clean, staff are very pleasant and helpful. However there’s nothing in any literature or on social media about them running private parties till 1am in the wine bar and the night club on till 1.30. I was informed this is quite regular on Friday and Saturday evenings. The company emailed us early Saturday morning saying wine bar is closed today as they booked a private party in, but didn’t inform us it was on till 1am, not that the night club was also on at the same time, but finished 1.30-2am After a full day out, back to hotel, we just wanted to go to bed, but couldn’t sleep due to the beat, beat, beat of the music which vibrated through our room, also  people shouting, it’s now 12.30 and was told it was winding down at 12, it’s going just as strong as it was when we came in.   This company don’t seem to take in to account their hotel guests when they agree to book private parties. There’s more noise outside below everyone’s windows as party goers are outside chatting (shouting) and the staff don’t seem to be asking the party goers to respect their residents.The next morning, we were offered a one free drink voucher each for the inconvenience. That evening when I wine bar ordering our free drink, another two couples turned up, also with vouchers, so this proves, the management of hotel know they have guests complaining about the noice, but would rather have them  put up with the party noise, lack of sleep and give out drinks vouchers to say sorry. It’s a shame, as it is a nice place, but I would certainly look for alternative accommodation, unless you like the feeling of being in Ibiza.In the picture, the green wall is where  hotel, wine bar and night club entrance, the wine bar is to the left of green wall, the nightclub is to the right, above these are the two floors of hotel, we were right above night club.",
      "rate": 2.0,
      "tripDate": " October 2022"
    },
    {
      "title": "The Interior Designers Need to Stay the Night!",
      "text": "The minimalist idea behind the hotel, the downstairs lobby, the location and the hosts were all great but there were a number of details that really wrecked it and would stop me from returning.The biggest issue was the the blower for the heating seemed to be an industrial grade fan and made a huge racket so we slept with the heating off and woke up to a freezing room.There were no reading lights and no light switches near the bed which made it a pain to read before falling asleep.Another stupid design issue was the light beside the mirror at the sink. It went down one side of the mirror putting the other side of your face in shadow. Not an easy way to shave...Finally and this should be an easy fix, the thermostat on the shower was a little too conservative and I could not get the shower as hot as I would have liked.",
      "rate": 2.0,
      "tripDate": " December 2019"
    },
    {
      "title": "Cool hotel in a cool neighbourhood",
      "text": "We spent four nights at The Annex and really enjoyed our stay, the keyless room card is a big plus in addition to the room size.Location is not too far from downtown and in a really quirky neighbourhood Bloor/Annex.We didn’t use the bar at the hotel but did have breakfast each morning which was a choice of coffee/tea fruit and a cake/croissant or sandwich. My only criticism is that I feel it was all a bit strict and any extra coffee or piece of fruit was charged extra. Thought this was a little unfair considering it is nearly £200 a night and you should have more flexibility over extra drinks.Overall, good stay in a cool hotel.",
      "rate": 4.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Cool, fun, comfort and affordability!",
      "text": "A rare combination of cool, fun, comfort and affordability in Toronto. No reception but always a friendly staff member to answer your questions. No keys, a keypad opens you door with a secret code provided by email/text on check in, don’t forget the check mark after your 4 digits. Spacious rooms, comfortable platform beds, turntable/LPs, minibar and rain showers in a loft like setting. It’s like living in your own pad! The location at Bloor and Brunswick is perfect for a Toronto getaway or staycation.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "For Hipsters and World Travelers",
      "text": "This is not your typical hotel, so look elsewhere if you want a Hilton or Marriott. It is  above a nightclub/bar in a very happening part of town. Any possible place you would ever want to eat or drink at is steps from the front door. Also very easy access from both subway and streetcar lines. I stayed on a weeknight, so it was quiet, but weekends might be a different story. There is no front desk, and check in is all virtual (you have to take a photo of your ID), but there is someone there in case you need something (ice, directions, etc.), and they are friendly. The room is sparse in a really cool, whitewashed kind of way. It reminded me of the original Ace Hotel in Seattle (before Ace expanded and now charges $400+ for rooms). Awesome shower with two showerheads, and a 5 star king bed with soft linen. You get an IPAD instead of a TV; feel free to log into your favorite streaming service. The only chair is a IKEA special- they should really add a comfy armchair. Alas, there was a splash/stain of who knows what on the wall above the bed, and the painting above the bed was not attached and was about to fall over. So, a little attention to detail is needed, but I liked it here and wish the owners and staff well. See you again soon!",
      "rate": 4.0,
      "tripDate": " April 2023"
    },
    {
      "title": "Comfort Zone The Annex",
      "text": "Tucked away in the Annex neighborhood, is a hotel that is truly representative of the essence and embodiment of the Downtown District in Toronto. Proximity to attractions such as the Royal Ontario Museum, the St Lawrence Market and Rogers Centre made exploring the area easy and inviting. The Annex is a boutique hotel has everything you need; privacy, excellent room accoutrements (top shelf comfort for a good night’s sleep), a turntable with selected music, bluetooth speaker, an iPad with Netflix access, secure entry, a wine bar and patio and the concierge service is exceptional. I needed to obtain something very specific and they went the distance, and then some, to find and procure the item. Each morning we started the day with tasty pastries and some of the best coffee anywhere. The whole vibe here is one of comfort and care. The next time I am in Toronto I will definitely stay with the people and scene we found at The Annex.",
      "rate": 5.0,
      "tripDate": " September 2023"
    },
    {
      "title": "Hidden gem in a fun area",
      "text": "Beautiful, minimalist room, the COMFIEST bed + bedding. Host Andrej was super friendly and quick with text response times. The alleyway entrance makes you feel like you're in on a secret. I've lived in the city for many years so was worried this staycation wouldn't feel like much of an indulgence without some of the 'typical' hotel amenities but I was pleasantly surprised and would definitely return. The wine bar downstairs had some killer bottles and the record player in the room provided great ambiance for a chill night in. Loved going back to the old dive the LAB right next door. I was in a 'medium' room and it was enough space to host a couple of friends before going out. seriously did not want to get out of that bed though. get a late check out.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Great hotel and wine bar and cafe",
      "text": "Great hotel in a fantastic area. Very clean and comfortable rooms. There is a wine bar and cafe at the hotel which is awesome. The bartenders and baristas are amazing. The food at the wine bar is surprising amazing too.",
      "rate": 5.0,
      "tripDate": " December 2023"
    },
    {
      "title": "Hubby's birthday",
      "text": "We absolutely loved our stay here. We spent 2 nights. It was quiet and the rooms very neat. The bed was the most comfortable I've ever slept in. I love the shower products, the layout of the room , very quirky and the large window with its dual blinds, one of which was a blackout. We loved that we could play vinyl records on a turntable, that was such a nice, quaint touch. Cheyenne and Jessika were absolutely lovely, very attentive and helpful with all our needs. A cake and some bubbly were waiting as promised (on request), and they tasted very good. A note about parking, we were able to park across the street from the hotel at a cheaper rate than parking in the lot right by the hotel. Will visit again.",
      "rate": 5.0,
      "tripDate": " February 2019"
    },
    {
      "title": "Wonderful boutique hotel in a great location!",
      "text": "I absolutely love the experience - it was an experience! I love that checking in is virtual, you are provided the code to enter the building and a separate code for your room. The communication was done through text - very easy and can be done from anywhere. Our host, Andrej, was an amazing contact for our stay, very helpful and quick to respond, exceptional customer service skills. We stayed for two nights for my birthday. The location is perfect - on Bloor between Bathurst and Spadina, we were walking most of the time. The rooms are good size. My husband and I stayed in the small room and we had more than enough space. The bed was great, neither of us had any issues sleeping through the night.  The only sounds that we heard were when people were walking in the hallway to their rooms, nothing major. Plenty of towels, good water pressure and temperature. There is also a small fridge in the room and a small safe. I would have liked to have a dresser or shelves for my clothes in addition to the little wardrobe for coats/jackets. The cafe/wine bar in the lobby is outstanding! Coffee was wonderful, the croissant breakfast sandwich was superb. There is a parking lot right outside of the hotel, a bit steep $, but there is another parking, right across the road and it's much more reasonable, if you have Green P app on your phone - amazing solution to pay/extend your parking from your room or wherever you are in the city. I am definitely returning to the Annex Hotel for our next stay in the city!",
      "rate": 5.0,
      "tripDate": " September 2021"
    },
    {
      "title": "Comfortable, great aesthetic, good location",
      "text": "Easily overlooked, The Annex is just off Bloor St W and offers a unique boutique hotel option for downtown Toronto. It has a wine bar and cafe, and is described as \"trendy.\" It certainly is that, but whether you like the label or not, the rooms are excellent and with an aesthetic -- minimalist with classy fixtures, white walls and lots of wood -- that I have only seen matched in Scandinavia and Germany. For those interested, there is art on the walls, a turntable and vinyl in room, as well as a loaded iPad instead of the usual TV. This is a digital-savvy choice, with public parking at reasonabable rates steps away from the entrance -- with payment managed conveniently, efficiently through Toronto's green.p mobile parking app. As a boutique offering, the check-in and so on are digitally managed, but they have helpful staff on site who promptly assisted with a passcode glitch when we arrived. Finally, the bed was one of the best I've had recently and, combined with nearly sound-proof brick walls, ensures a peaceful and quiet night's sleep. We will be going back.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Nice Hotel - different",
      "text": "Nice location - was able to get around  walking. Had  initial slight difficulty locating hotel - coming down Bloor street. Close  to subway station , shops, cafes and restaurants.  Quiet - near residential area. Room nice , clean, spacious and different. Liked the  shower. Enjoyed playing  music in the room through the speaker from the vinyl records  and   the iPad  . Stayed a night.",
      "rate": 4.0,
      "tripDate": " September 2019"
    },
    {
      "title": "Probably fine if you're going clubbing",
      "text": "Lots of good things (stylish rooms, nice bar, comfy bed, plenty of space, lovely reception staff) overwhelmed by one bad one:  all of the rooms are suspended directly over a night club, making sleep impossible before 1am on the weekend.If you're planning to be out all night anyway, this place is probably great.",
      "rate": 2.0,
      "tripDate": " November 2022"
    },
    {
      "title": "Great service",
      "text": "Very good service, cleanliness 10/10Friendly staffNice area lots of things to doBeach/shops/restaurants etc. walking distance Beds were comfy, amazing vibes at the pool, would definitely recommend! :)",
      "rate": 5.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Great place!",
      "text": "We arrived at the annex today after a really stressful drive and there was a miscommunication about the parking and i ended up paying way more than i was expecting-that being said andrej was amazing. very helpful even though it was not the hotels fault completely it was a misunderstanding by both us and the hotel. andrej saw that we were upset and came up almost immediately to apologize for the experience and offer us free cocktails and breakfast. I am in hotel management and i was extremely impressed with this level of caring and service. if i could i would steal andrej for my team!! I want to thank the hotel for taking the time to address my concerns and being very very responsive. Top notch service! I will be recommending to all of my friends, guests at my hotel, and family. You want to stay here! plus the rooms are amazing and the vibe is super relaxing!Thanks guys for going above and beyond!Derrick Leach Bachelor or Applied Hotel Operations ManagementGuest Service Supervisor and hospitality expert",
      "rate": 5.0,
      "tripDate": " March 2020"
    },
    {
      "title": "Hip hotel in a happening neighbourhood",
      "text": "Stayed here for a board meeting and though the entrance is a little inauspicious, the wine bar and lounge area are well-appointed and comfortable. The room was impeccably clean and the bed was top notch-only wish that there was a single sheet along with the great comforter as I overheated under it and switched to the blanket at the foot of the bed. Great shower and bathroom is well thought out as are the other amenities like the bar fridge, snacks, lighting, etc.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Delightful modern hotel in an excellent location",
      "text": "Located just off Bloor St near Spadina on a stretch lined with coffee shops, restaurants, bars, and bookshops, this was a wonderful place to spend several days up in Toronto.  The whole approach is self service, though the staff at the bar are happy to answer and direct as needed.  The downstairs has a very decent small cafe in the morning and larger bar area for the evenings, plus there was a creative pizza place attached (we enjoyed all three over the course of our stay - though there's a ton around there to explore).I'd definitely consider them again the next time we head over that way - thoroughly satisfying experience.",
      "rate": 5.0,
      "tripDate": " April 2019"
    },
    {
      "title": "I already have excellent impression though I haven't even arrived yet!",
      "text": "I am supposed to sriive to the hotel in June this year (I put the date for 2022 as the system doesn't accept future revierws). I have questions about my paiment, and the reception answered my e-mails and very kindly explained everything (I am still ashamed when remembering how stupid I was). Then I contacted to the hotel again saying that I am in very giolden period of my life and I dont want high floor. I got the answer immediately - the booked me a room on the 2nd floor. So, I am sure the hotel is excellent. I will write another review after my stay... I am sure it will be perfect. Good luck!",
      "rate": 5.0,
      "tripDate": " June 2021"
    },
    {
      "title": "Unrelaxing and disruptive weekend with no sleep",
      "text": "First night- someone tried to get into our room while we were sleeping, people in halls and stairs being super noisy, people in alley that room faces super noisy.Thought, it can’t get worse…we’ll night 2 is what nightmares in a hotel when you are trying to have a quiet relaxing weekend away are made of… hotel hosted a wedding in the lobby. So noisy my floor was shaking and I could identify and sing along to the songs being played.Horrible weekend with no sleep. If you don’t like sleep and like being up all night this is the place for you.",
      "rate": 1.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Great for Boomers Too",
      "text": "Clearly designed for Millennials, but I would recommend for anyone.  Check in/out is on line. No parking* no TV, no bellhops, no concierge... but who cares? There is Netflix, Wifi and a Bluetooth speaker. The rooms are modern, clean and comfortable.  There are friendly staff around if you need them (only a text away). The beds are super comfortable. Oh, and at the corner of Brunswick and Bloor it is in the one of Toronto’s quintessential neighbourhoods. Next time we go to Toronto I know where we are staying. *Greenp lot on Lippincott very close.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Good coffee and ambience",
      "text": "Hotel stay for a wedding. Entrance in alley at the back. No front desk checkin. Get a outside door code and room door code. Lots of stairs. No elevator or tv.  Very basic furnishing and only a few hangers and one towel. Was able to get more towels from a hall closet.  Had black out curtains. Was clean. Close to spadina subway.  Would never stay there alone due to alley entrance and door code.Coffee and ambience in coffee lounge very good. Nice staff. Best part of experience.",
      "rate": 3.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Trendy",
      "text": "Trendy hotel with amazing amenities. The beds are comfortable and the rooms are well designed. Love the wine bar, especially for happy hour. The area is very convenient and walkable to key attractions and restaurants. Would definitely recommend!!!",
      "rate": 5.0,
      "tripDate": " May 2024"
    },
    {
      "title": "Oh so hip. It hurts.",
      "text": "Nat was fabulous front of house.Everything else is hard work.This isn't hospitality. Toronto tries so hard....and often fails. And this place fails hugely.No TV in the room WHY?No glass ware?Airbnb 100% better than this greedy, average also ran.",
      "rate": 2.0,
      "tripDate": " November 2021"
    },
    {
      "title": "Not your traditional hotel",
      "text": "Convenient, modern, clean, comfy. There are a lot of nice touches at the Annex, like the soaps and lotions, the records, and the art. This is a good spot for young couples and small groups. Not your traditional hotel.",
      "rate": 5.0,
      "tripDate": " February 2023"
    },
    {
      "title": "Spectacular hotel",
      "text": "Spectacular hotel in the heart of the city. The reception area is magnificent. The rooms are really well designed and clean. The coffee shop and wine bar made this hotel even more special. The cocktails at the bar were exceptional. Great place to stay when in Toronto.",
      "rate": 5.0,
      "tripDate": " February 2024"
    },
    {
      "title": "Marvellous",
      "text": "The Annex is located centrally in Toronto. Marvellous design. The rooms are great. Seamless experience here. Nice place to stay. The wine bar is an added bonus. Such great drinks. The cocktails here are great too. Classics and custom options.",
      "rate": 5.0,
      "tripDate": " March 2024"
    },
    {
      "title": "Annex hotel",
      "text": "Thanks to the staff at the Annex for a lovely stay.  Our room was beautiful and comfortable.  We loved the vibe, staff and experience. Special thanks to Andrej, Nat and Nat. This is our second visit to the Annex and won't be the last!",
      "rate": 5.0,
      "tripDate": " July 2021"
    },
    {
      "title": "Mixed at best",
      "text": "This hotel is in an area of west Bloor Street known as the Annex (from which the hotel takes its name). It's trendy/funky, the district and the hotel. The hotel is in a very oldbuilding. The bedrooms have been all turned into modern, but the bed is a mattress on a plywood box, there are essentially no amenities, no TV (but there was a record player!), no coffee, no bedside clock, no usb ports, and everywhere you went, including the hotel bar and breakfast area requires moving from one part of the building to another through doors that require four digit codes.  (Great when it is cold and raining.) Parking is a nightmare.  There is a small city run parking lot right outside the hotel that charges $2.25 a half hour. Figure out the cost for an afternoon arrivaland overnight stay. We stayed at another lot, not far away, again city-run and paid $43 for 17 hours. Most importantly, mid afternoon on a Saturday the lot was completelyfull. We waited nervously and eventually a spot was vacated. I think the owners are new and inexperienced. The place may improve but for the moment, we wouldn't return. We rated 2 stars for staff and service. There was neither. This hotel runs by itself with text messages. On the other hand this part of Bloor Street is reallyinteresting - great bars, restaurants, shops.",
      "rate": 3.0,
      "tripDate": " December 2023"
    },
    {
      "title": "Trendy, Modern and Clean…",
      "text": "Great value in a trendy and hip part of the city.  Loved the virtual check in, but there is always someone around in the cafe area to assist if needed.  Rooms were clean and spacious, and had exceptional bed/bedding.  Included coffee/breakfast is a nice touch!!  Tip for parking if driving…get a city of Toronto 24/48/or 7 day pass.  It allows you to street park within the vicinity of the hotel, and not pay the daily parking lot fees.  I am a former local to the area, and by far, it’s the best deal for overnight parking without worries!",
      "rate": 4.0,
      "tripDate": " September 2021"
    },
    {
      "title": "A very unusual hotel",
      "text": "This hotel tries to be high tech, with mixed results. You do everything by text; there are no phones. There's an iPad, but no TV. You need a key code to get into the building or your room; there are no keys. The rooms look very modern, but the shower and toilet are together behind frosted glass. The 2 person bed is pushed up against the wall, making it very difficult for the 2nd person to get in or out of bed. Our 1st night there our room was very noisy (avoid room 210). Then we had a leak from the ceiling by the toilet. They offered to move us to a new room (302 is much quieter!), but we lost a lot of tourist time doing that. When we asked if we would be compensated for that lost day/night, we were told we could check our later. That wasn't much of a compensation in our opinion. The best part about the hotel is the staff. Although quite young, they were enormously helpful, especially Jason. He helped us with directions to many places, made restaurant recommendations, and got a taxi for us. By the way, breakfast is a small continental breakfast. One pastry and one beverage. No restaurant is attached to the hotel, just a wine bar with minimal food. Parking is also very expensive right by the hotel, so we had to park farther away. The staff helped us with that as well. All in all, we don't plan on returning and can't really recommend it.",
      "rate": 2.0,
      "tripDate": " June 2023"
    },
    {
      "title": "2 night stay at end of Canadian Holiday",
      "text": "If you are looking for a hotel with everything then this is not for you. However if you just want somewhere to lay your head with plenty of places to eat and drink in easy reach, then this is perfect.It's very modern with no room keys just codes for your rooms and everything is done via text message and online. The rooms are sparce but clean and plenty of room. The beds are futon type beds up against the wall so if there are two of you the one nearest the wall has to crawl out the bottom of the bed to get to the toilet. The bathroom is a lovely double shower with a toilet at the other end. The sink is in the room.The staff at the Annex are amazing. They really couldn't do enough for you and were really helpful with directions to places. We walked everywhere including downtown which took about 45 minutes to get there so can't comment on public transport.The one thing taking it from a 5 to a 4 star rating was the breakfast. It was literally 1 piece of food and 1 drink each and on our first morning they only had 1 croissant and 1 muffin left. I would suggest possibly having some cereals on offer as well as the pastries and toast. All in all we loved the Annex and would recommend it as a place to stay in Toronto.",
      "rate": 4.0,
      "tripDate": " August 2023"
    },
    {
      "title": "Being happy at The Annex",
      "text": "My friend and I attended to the Kula Shaker concert in Lee's Palace last september 11th and to stay at The Annex was one of our best decisions during this trip.The hotel is comfortable, quiet, spacious and lovely.The staff is so helpful and friendly. They helped us with our necessities and they always had the best disposition.The hotel is so well located to attend to the concert but it was a perfecto location to get almost everywhere. The surroundings of the hotel are so lovely and lively. There are lots of options to eat too. The bed was so comfy, the showere worked perfectly and the water was warm, just as I needed it to be.They even have vinyl records and a records player to enjoy the music, we were so happy with that touch! I think that the breakfast options could be a little wider, but it was a delicious way to start the day.I'd love to come back to stay there again. Thank you for making our stay in Toronto so lovely.",
      "rate": 5.0,
      "tripDate": " September 2023"
    },
    {
      "title": "Minimal Hip",
      "text": "We found the self-serve check-in was to our liking. The room was beautiful, clean, hip, and modern. Anything we needed was either across the hall in the guest supply closet, or a text/phone call away. One star missing only because we weren’t informed the rooms are above an active nightclub. If you’re uncomfortable with noise, I wouldn’t recommend it.",
      "rate": 4.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Very loud hotel with music venue located below",
      "text": "We stayed in the hotel on a weekend. The hotel staff were great and the location was excellent. The room was clean and nicely furnished. The cost is on the more expensive side. However, the main issue is that the hotel is located directly above a music venue which was incredibly loud (music until 2 AM on both nights). At one point the bass was so intense items in the room were shaking. At our request, we were moved to the 3rd floor from the 2nd floor for our second night.  However, the noise was still disruptive and we could not sleep until 2 AM when the music ended. I would not recommend staying in this hotel unless you plan to be out late every night of your stay.",
      "rate": 3.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Hip, with exemplary hospitality",
      "text": "I loved my stay at the Annex.  So much that I even booked a second stay for later this month on my first night. I loved the low key aspect of the exterior, the industrial look of the room, yet cozy, cool arts on the wall, vinyles in the room, beautiful shower with nice products and a comfy bed.  Was not expecting to see CN tower from it. What a spectacular surprise!The first impression was excellent but it got even better on the second night.  I encountered an important and stressful problem with my iPad. This problem required assistance on the phone with apple and the use of a laptop. The hostess Cecilia was a star, being unexpectedly patient, caring and supportive. She stayed with me for at least one hour and lended her work laptop so I could do the required operations. Her attitude was top notch during the whole process. I must say that Asia, at the bar, is another star. Very professional, welcoming and generous of her time too. Not only a hip design hotel, but an extremely hospitable one.",
      "rate": 5.0,
      "tripDate": " October 2021"
    },
    {
      "title": "Go to spot",
      "text": "Go to spot to stay in downtown Toronto. Located in a perfect location which is walkable or short Uber rides to great restaurants or attractions. Very nice rooms. The cafe here is great too. The restaurant/wine bar is amazing as well. The food and cocktails are great.",
      "rate": 5.0,
      "tripDate": " May 2024"
    },
    {
      "title": "Hugely overpriced. Don't stay here if you are looking for any hotel facilities.",
      "text": "This is not a hotel and should not be advertised as one.  There is no reception. You have to carry your own suitcases up 3 flights of stairs.  You have to climb to the end of the bed to get out of it.  The air conditioning is so loud you can't sleep.  I would not recommend this hotel at all.  The cost is absolutely extortionate for offering zero hotel facilities",
      "rate": 1.0,
      "tripDate": " August 2022"
    }
  ]
}