{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "The Winchester Toronto-Tourist Home",
    "url": "/Hotel_Review-g155019-d2439684-Reviews-The_Winchester_Toronto_Tourist_Home-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.5",
      "reviewCount": 7
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "137 Winchester St",
      "addressLocality": "Toronto",
      "postalCode": "M4X 1B3",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-s/02/67/1c/d5/the-metcalfe-room.jpg?w=500&h=-1&s=1"
  },
  "description": null,
  "featues": [
    "Free High Speed Internet (WiFi)",
    "Wifi",
    "Non-smoking hotel",
    "Non-smoking rooms"
  ],
  "reviews": [
    {
      "title": "Call to the Bar in Cabbagetown!",
      "text": "Our stay at The Winchester was perfect in many ways! We were a group of 8 from Manitoba and B.C. coming to Toronto for a week for our daughter-in-law's 'Call to the Bar'. We wanted to all stay in one place and close to our 'kids' who also lived in Cabbagetown - so we booked the entire home - lots of room for everyone in the shared areas like kitchen and dining room, and yet private in the separate bedrooms and baths. Vicky was helpful when needed - very accommodating. Loved the neighbourhood - just a short walk to Parliament Ave. for groceries, liquor, flowers, restaurants, baking, coffee, .... Rooms were clean and just like in the photos! I do believe we made use of every corner of the house, yard, and upstairs deck! Highly recommend staying here as a group or as a single - so much better than a hotel room!",
      "rate": 4.0,
      "tripDate": " June 2013"
    },
    {
      "title": "Beautiful!",
      "text": "This house is gorgeous. Great value for what you get. It's not a bed and breakfast, but more of a guest house. Breakfast is not included, but there are many restaurants and cafes near by. It is located in historic cabbagetown. The area is quiet and absolutely beautiful! I stayed for two weeks and would stay again in a heartbeat. The owner is trying to be as environmentally friendly as possible, so rather than having your room cleaned everyday, they have a live-in housekeeper that does a thorough clean of the room once a week, or when needed. I really appreciate the effort being made to be \"green\"... And quite frankly having my room cleaned once a week was more than enough. Some people may not like this, but all they would have to do is tell the live-in Innkeeper, Jonathan, that they would like their room to be cleaned and he's on it. All in all, I had a great stay and the house is just beautiful!",
      "rate": 5.0,
      "tripDate": " March 2012"
    },
    {
      "title": "Amazing Experience Staying at the Winchester",
      "text": "I can't speak highly enough of our experience at the Winchester Tourist Home and of Joe. Firstly, the house is beautiful, the rooms are clean, spacious and includes your own private bathroom and TV. The shared areas such as the kitchen have all the essential equipment to cook and are well maintained. The area is amazing...gorgeous tree lined street in the heart of Cabbagetown, a very safe neighbourhood. Easy 5 minute walk to coffee, cafes, groceries, drug store and the street car. The street car will get you downtown within 10 minutes. We stayed in the summer, so we just walked to Yonge street a lot of the time..it's a nice easy 20 minute stroll. Joe (the owner), is absolutely incredible as well. A great guy, with loads of knowledge to share about Toronto and Canadian life in general, both he and Vicky went out of their way to accommodate us as we set ourselves up in Toronto. We also stayed at Joe's properties at Woodbine, and he's brand new property on Pape/Danforth....both were excellent as well. Highly recommended!",
      "rate": 5.0,
      "tripDate": " September 2013"
    },
    {
      "title": "Hovering Between \"Very good\" & \"Average\"",
      "text": "I read other TripAdvisor reviews and decided to book rooms at the Winchester. I had to switch rooms part way through due to availability. (It gave me a chance to experience different rooms.) I agree with the reviews in part, and wonder if I completely missed the plot on other points.-- Here's what I loved:* Location:Cabbagetown is quiet, quaint, and trendy. Winchester Street is very, very quiet, and the neighbouring streets are absolutely beautiful. It's a very short street car ride from downtown and there are lots of amenities. People who live here are much more relaxed than their downtown counterparts.* Responsive owners & operatorsJoseph and Vicky are fantastic and ensure that we had everything we needed from directions to door codes. Joseph gave us a small discount for booking at the last minute. Both always answered our phone calls, emails, and texts.* Price pointBecause you are just outside the downtown core, and it is not a hotel, rooms are bit cheaper.* Communal kitchen, dining room, laundryYou can use everything free of charge. Having access to a communal kitchen really helped with the food budget, and with the days where we didn't really want to eat out.* Communal phone available for free local calls.-- What Visitors Need to Be Aware Of*Not all rooms are alikeThe Berkley Room, despite the shower being quite tight for bigger and taller folk and the tiny bathroom sink being awkward to use, it's a lovely little room. The Metcalfe Room, which I stayed in for a couple of nights, was very tired, the bathroom weathered and old, and the furniture looked like it had seen better days.* No bathroom fans or kitchen hood fanThere were no bathroom fans in the rooms I stayed in. The room was humid and stuff after a hot shower. Be aware that there will be lingering kitchen smells if someone decides to cook a meal.* Inconsistent Wifi and no business centreIf you are here on business, it will be quite challenging to get any work done unless you have a roaming plan to help with backing up the on again-off again wifi, and are also can work completely paperless.* Squeaky floorsIt's an old house, so there is no way around it. Sound, including footsteps and voices, travels quite easily between rooms and floors, but the owners are clear that this is not a party house, and they prefer quiet visitors only.* Be Diligent with Cleaning Up After Yourself: Unsure About Communal Garbage & RecyclingThere were a few times where I cleaned up after other visitors in the kitchen so I could use the equipment. The garbage and recycling also piled up after my week there, so I was unsure about the rules regarding communal garbage and recycling.* There is No Daily Housekeeping in the RoomsTowels and linens are changed out between visitors. If you're the type who needs fresh towels everyday, you may need to do your own laundry.* Not Wheelchair Accessible, and there is No ElevatorIf you like big suitcases, the stairs may be a challenge.For me, it was mainly the details that have me hovering between \"very good\" and \"average\". There were a lot of things the shiny pictures on the internet did not show.",
      "rate": 3.0,
      "tripDate": " September 2014"
    },
    {
      "title": "Great place for a women's get away",
      "text": "Joe was terrific.  Super accomodating.  We were a group of 7 women and stayed in 5 rooms plus a blow up mattress (newly purchased just for us) in the living room.  It was great.  We used the dining room as our gathering place in the morning for coffee and pastry (great bakery two block away) and for evening cocktail hour.  Loved every minute of it!!",
      "rate": 5.0,
      "tripDate": " September 2012"
    },
    {
      "title": "Doll rooms in a fairy land",
      "text": "This place is wonderful. In the heart of the nicer place in Toronto. Amazing neighborhood, great restaurant, calm and beautiful, you fill like home. Clean, safety and well served. Close to the main interests of the city. Good transportation to the centre in 15/20 minutes. I'll be back here if again in Toronto. First choice",
      "rate": 4.0,
      "tripDate": " September 2012"
    }
  ]
}