{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "The Ritz-Carlton, Toronto",
    "url": "/Hotel_Review-g155019-d1959496-Reviews-The_Ritz_Carlton_Toronto-Toronto_Ontario.html",
    "priceRange": "$$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.5",
      "reviewCount": 2090
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "181 Wellington St W",
      "addressLocality": "Toronto",
      "postalCode": "M5V 3G7",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2c/15/af/a0/one-bedroom-suite-living.jpg?w=500&h=-1&s=1"
  },
  "description": "Rest easy at The Ritz-Carlton, Toronto. Our hotel in Toronto, Ontario is located near Scotiabank Arena, Harbourfront, and Graffiti Alley. After a busy day, unwind with a massage or facial in the spa, or enjoy on-site dining at Toca.",
  "featues": [
    "Electric vehicle charging station",
    "Free internet",
    "Fitness Center with Gym / Workout Room",
    "Pool",
    "Bar / lounge",
    "Bicycle rental",
    "Patio",
    "Books, DVDs, music for children",
    "Valet parking",
    "Paid private parking on-site",
    "Wifi",
    "Paid wifi",
    "Fitness / spa locker rooms",
    "Personal trainer",
    "Sauna",
    "Hot tub",
    "Pool / beach towels",
    "Swimming pool toys",
    "Pool with view",
    "Indoor pool",
    "Heated pool",
    "Saltwater pool",
    "Shallow end in pool",
    "Coffee shop",
    "Restaurant",
    "Breakfast available",
    "Breakfast buffet",
    "Breakfast in the room",
    "Complimentary Instant Coffee",
    "Complimentary tea",
    "Kids' meals",
    "Outdoor dining area",
    "Snack bar",
    "Special diet menus",
    "Wine / champagne",
    "Children's television networks",
    "Children Activities (Kid / Family Friendly)",
    "Pets Allowed ( Dog / Pet Friendly )",
    "Business Center with Internet Access",
    "Conference facilities",
    "Banquet room",
    "Meeting rooms",
    "Photo copier / fax In business center",
    "Spa",
    "Body wrap",
    "Couples massage",
    "Facial treatments",
    "Foot bath",
    "Foot massage",
    "Full body massage",
    "Hand massage",
    "Head massage",
    "Manicure",
    "Massage",
    "Neck massage",
    "Pedicure",
    "Salon",
    "Steam room",
    "24-hour security",
    "Baggage storage",
    "Concierge",
    "Currency exchange",
    "Executive lounge access",
    "Gift shop",
    "Newspaper",
    "Non-smoking hotel",
    "Outdoor fireplace",
    "Outdoor furniture",
    "ATM on site",
    "Butler service",
    "Doorperson",
    "First aid kit",
    "Umbrella",
    "24-hour check-in",
    "24-hour front desk",
    "Express check-in / check-out",
    "Private check-in / check-out",
    "Dry cleaning",
    "Laundry service",
    "Ironing service",
    "Shoeshine",
    "Soundproof rooms",
    "Bathrobes",
    "Air conditioning",
    "Desk",
    "Coffee / tea maker",
    "Cable / satellite TV",
    "Sofa bed",
    "Bath / shower",
    "Housekeeping",
    "Interconnected rooms available",
    "Room service",
    "Safe",
    "Seating area",
    "Sofa",
    "Telephone",
    "Wardrobe / closet",
    "Bottled water",
    "Iron",
    "Laptop safe",
    "Private bathrooms",
    "Tile / marble floor",
    "Wake-up service / alarm clock",
    "Minibar",
    "Refrigerator",
    "Flatscreen TV",
    "On-demand movies",
    "Complimentary toiletries",
    "Hair dryer",
    "City view",
    "Landmark view",
    "Bridal suite",
    "Non-smoking rooms",
    "Suites",
    "Family rooms"
  ],
  "reviews": [
    {
      "title": "Afternoon Tea Experience at Ritz-Carlton, Toronto",
      "text": "I have had the chance to stay at the Ritz-Carlton, Toronto four years ago and unfortunately missed the opportunity to do afternoon tea in this location.  When we recently returned, I decided to make it happen to celebrate my partner's 43rd birthday.  Upon arriving at the hotel, we were not sure where to go for our afternoon tea experience.  I decided to ask one of the waiters in a bar area, upon entering the hotel in the left hand side, and found out that it is in this location that they have it.  A few small tables in what it may appear like a sports bar, afternoon tea is done within this hotel.  Our server was more than attentive throughout the entire time, even though he was also busy taking care of other orders from the restaurant's bar.  The sandwiches, scones, and desserts are worth experiencing and come at a reasonable price.  For each person, it came to 36 CAD without champagne.  I would say that it was worth having the experience at this Ritz-Carlton, but would like to make a few suggestion for future guests.  If it is possible, there should be a way to easily identify or promote this experience within this place, so guests can properly idenfity the location.  In the near future, it would be great if a different ambiance could be considered for afternoon/high tea, since it might be too informal having it in a bar area with tvs around it.  Other than such facts, the quality of service, items, and experience exist and it is worth considering it.",
      "rate": 4.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Exceeded expectations!",
      "text": "We stayed the weekend at this iconic hotel and we were not disappointed!  The lobby was beautifully decorated for Christmas and we were thrilled to gain access to our room 3 hours ahead of checkin. The staff at checkin was so friendly and helpful as were all of the staff we encountered! Of note, our housekeeper, Jaya, went above and beyond expectations. She greeted us every time we came to our floor and surprised us with personal touches such as rose petals in a beautiful design on the bed to celebrate our anniversary, small snacks and fresh fruit!  We were also delighted to come back to our room one evening to chocolate dipped strawberries to celebrate our anniversary. The bathroom in our hotel room was hands down the most beautiful and luxurious bathroom I’ve ever encountered with under counter motion sensor lights, dual sinks, a deep soaker tub and a separate area for the toilet and shower. The fitness area was fantastic and contained a ton of exercise equipment including multiple treadmills and two peleton bikes. The pool area was well kept and the only small disappointment of our stay was the very small hot tub which meant (due to Covid restrictions) we often had to wait for quite awhile to gain access.  Otherwise, our stay was phenomenal and we loved every minute.",
      "rate": 5.0,
      "tripDate": " December 2021"
    },
    {
      "title": "GREAT TIME AT THE RITZ!",
      "text": "Spent a week at the Ritz in August.  I had read some very good reviews and some not so good.  When we left I told my husband I couldn't imagine what anyone could possibly complain about.  We were treated like royalty.  There was not a single worker that wasn't professional, kind and very concerned that we were having the best stay of our lives.  We upgraded to a suite corner room on the tenth floor for an extra $100 per night.  It was beautiful, roomy, comfy and had a great view of the CN tower and the water.  Everything worked perfectly and when we requested things like an extra blanket and more pillows they were there within the hour.  Our hair dryer broke and we immediately had a new one with the front desk asking if we were satisfied with the replacement and apologizing for the inconvenience.  People would knock on our door with little extras like bath bombs and sugar scrub for the skin.  We had turn down service at night and a late morning freshen up of the room.  They always seemed to know when we were out so not to obstruct our schedule.  We ate at the Italian restaurant for both breakfast and dinner.  The food was good and the service excellent.  We met friends who stayed on the 20th floor and used the concierge club room.  They were also very pleased and when they asked if they could show us the accommodations we were welcomed in for a glass of wine and a treat.  We took taxi's and Uber to get around and the front staff was always helpful.  We never waited long.  A drink at Epoch one late afternoon also very interesting sitting at the bar watching them make the drinks.  So many pretty colored drinks.  It was artistic and fun to watch.  We had Cokes and nothing was made of it.  You would have thought we ordered Champagne. We were right in the middle of things for touring and we did it all with ease.  A wonderful trip and for seven days we were extremely content!",
      "rate": 5.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Stay was nice, but average; expected more from the Ritz",
      "text": "The one-bedroom suite we stayed in was a nice size and the location was close enough to where we needed to be for our weekend trip. The service was good when asked, but when spending 1K CAD for a two night stay, having the little things taken care before having to ask is something I would have expected. They advertise a candy bar for the kids on the weekend, but we did not see it at all in the morning, afternoon, or evening. I saw it advertised about setting up a little tent in the room for children, but for the 75 CAD cost, it is really not worth it and should be something they offer complimentary or if they must charge, for less. They had a little balloon tied to the tent that was supposed to be for my daughter's birthday but it was clearly a baby shower balloon. Nothing special was done for her birthday beyond what we paid for, which something as simple as a little chocolate or cupcake would have been a small gesture that would show going above and beyond. The average rating is in comparison to the service we've received at other Ritz locations or similar types of hotels.",
      "rate": 3.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Not up to expectations",
      "text": "We had a brief stay and chose this hotel with high expectations for infection control practices. We had a housekeeper in our room while we were present who chose to wear a mask down around their neck - no face or nose covering. There were guests in the lobby not wearing masks and staff walking by without a word of caution. My family expected more from a hotel like this in terms of infection control and were extremely disappointed in how this hotel is respecting public health. Stay clear if you expect more.  We ordered room service to avoid going out with our kids and the food quality was terrible. They didn't have all options available. They forgot items and didn't get the order straight increasing more needless contact with staff. My vehicle was also damaged by the valet service. Needless to say, this was one of our most disappointing stays. I am MOST concerned about their total lack of regard for public health.",
      "rate": 2.0,
      "tripDate": " August 2020"
    },
    {
      "title": "Quite nice",
      "text": "The Ritz is a very nice hotel. It is above par but not what I expect a Ritz Carlton to be. The rooms are extravagant and the staff were very helpful and friendly but it is the little things that lead me to this review. I always stay at Marriott Bonvoy affiliated hotels as I am a member and every time I book a room I always ask for an extra blanket in the room and if it is winter time I also ask for a humidifier. Now I understand when the four points or the Sheraton forget these items but I expect the Ritz to be sharper than that. I received an email from someone at the hotel assuring me that these items would be in the room and guess what? They were not. If we had arrived at 3 or 4 in the afternoon it would be no big deal as they could bring it up to the room before we retire but we were coming in very late in the evening and it was annoying that we had to stay up and wait for the blanket. I did not even bother with the humidifier as at that time of night it would not make the room comfortable to sleep. I also will comment on the lobby. Nothing special for the calibre of the hotel brand. We also had a small incident in their restaurant Toca but I will comment on that in my restaurant review. The hotel is connected to the underground path system so you can reach a lot of the local area without braving the elements. The room was quite large and the amenities were of good quality. Like I said in the beginning, it is a very good hotel but there were a few little things that could have ben done better. Front staff and doormen were exceptional.",
      "rate": 4.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Perfect Stay! Very kind and helpful staff.",
      "text": "I recently stayed at the Ritz-Carlton in Toronto and the visit was wonderful.  I don't often stay at luxury hotels, but this was to celebrate a big milestone, so I decided to go for it and I am SO glad I did. During my stay I felt like the staff went above and beyond to make us feel welcome and comfortable. The hotel was very clean and organized which made me feel safe - especially since we hadn't stayed at a hotel during the pandemic yet. Our room was beautiful and had an amazing view of the city. One day, we had some small bites (charcuterie) sent to the room and everything was delicious. For dinner we decided we would stay in and enjoy our room since we don't do this often and wanted to make the most of the room amenities. We asked the staff for recommendations for nearby takeout and they were really helpful. They even offered to call ahead and place the order for us. They also sent dishes and cutlery to our room which made our dinner feel a little extra special even though we were eating takeout in the room.  While we were there my partner treated me to a spa service and the experience was really lovely. I left the Ritz feeling really relaxed and happy with the experience.  I will definitely keep the Ritz, Toronto in mind for future stays and celebrations.",
      "rate": 5.0,
      "tripDate": " May 2022"
    },
    {
      "title": "Best hotel of my life - Ritz Carlton Toronto!!",
      "text": "I have to say, I have stayed at countless hotels, and in many countries... and The Ritz Carlton in Toronto is probably the best one. This is what I expect of a five star hotel... I was treated like a star from the moment I arrived. The bellhops were very polite and helpful with the bags (not like other hotels, where they do the bare minimum). When I arrived at the lobby, I was greeted with my name, even though I had not even mentioned it. It seems they were paying attention to the reservation system and were expecting me already. The staff are very polite and enthusiastic. After a long trip, it feels good to be greeted with such warmth and care.The lobby is large and luxurious. It feels rich.I then arrive at my room, and it also has this feeling of luxury at every corner. The bed lights up at the bottom, and other the lights are very well placed. The carpet and furniture are new. Also the toilet cover will open upwards automatically when I walk to it. Food (room service) felt like it came from a Michelin restaurant. Everything cooked to perfection and presented beautifully. During breakfast, I was also impressed by the yogurt, it seems they prepared it themselves.The room had a view to the CN tower, and to the lake. It felt like a million dollar view.Overall, I loved staying here. I have visited other Ritz Carlton hotels, but some of them (in the U.S) do not have this standard. This hotel is world class hotel, and the managers at the other Ritz should take notes from the Toronto hotel. These guys know how to offer an exquisite experience. If the Ritz Carlton would like more comments, they can contact me.",
      "rate": 5.0,
      "tripDate": " August 2021"
    },
    {
      "title": "Great Customer Service",
      "text": "Last month I was browsing hotels on the Marriott app, and I accidentally booked a same-day reservation for 3 nights. I pressed cancel reservation within 10 seconds of making the reservation, but as the reservation was for the same-day, it's well past the cancellation deadline and would have cost me almost $700 to cancel. I called Marriott customer service to explain my mistake. They said they will send a message to the hotel and it might take a few days for us to hear back whether the hotel is willing to waive the cancellation fee.I followed up with the hotel directly later on in the day. When I called the hotel to explain my story, the lady already knew my situation, and immediately assured me that I won't be charged for the cancellation, and jokingly add that hopefully I will eventually be back to the hotel to stay with them.The mistake was on my part and the hotel was well within their rights to charge me for the cancellation fee (even though the reservation was only in the system for less than a minute). They extended a nice goodwill gesture, and I will definitely try to return to this hotel in the future to give them my stay!",
      "rate": 5.0,
      "tripDate": " February 2021"
    },
    {
      "title": "Home away from home",
      "text": "I stayed at the Ritz Carlton Toronto in a corner suite room for 6 nights in September 2022. The hotel was busy during the early days of my stay due to TIFF. Despite that, the staffs always managed to recognize me, talked to me, and sincerely were caring towards my purposes during the stay. They were always attentive and strived to make my stay more comfortable. A front desk staff, Kateryna, was always very attentive, polite, and friendly. She took care of me in solving some minor issues with my room, ensuring my safety with an incident in the lobby, and printing an important document late at night that eventually saved me a lot of time in my travel later on. The room was luxurious and comfortable, with everything working properly. Mineral water were given generously twice a day. Bathroom was luxurious with a very important feature, an automatic toilet. Bedroom was homey and serene, inducing good night rest. The bed was a bit too soft for me but I still managed to rest comfortably. Location of the hotel is excellent. Lots of dining options are available nearby. Theaters are also within short walking distance. Quite a number of unique and wonderful locally owned coffee places are within walking distance as well. All in all, I would love to be back at Ritz Carlton Toronto in the future. Thoroughly enjoyed my stay there.",
      "rate": 5.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Great hotel until it wasn’t",
      "text": "I’m a regular traveller to Toronto for business.  I am also a Marriott Bonvoy Ambassador Elite member. I travel a lot and stay in a lot of Marriott hotels.I started staying at the Ritz last year. Most of the staff is wonderful, from housekeeping, to the concierges to the bar and restaurant employees. They always went out of the way to show your patronage was valued. I was offered a corporate rate for 2024 based.I emailed over a week in advance to arrange my next stay in Toronto and was informed that all off the rooms that were covered by my contract (which only has two blackout periods and my stay wasn’t in either of them) were unavailable but the could offer me a “superior” room at a discounted rate. When I pushed back I received a dismissive and pedantic email explaining the realities of my contract. When I pointed out that anyone could go to their website and book one of these “superior” rooms for a lower rate than the discounted one I was as told that was only for 3 night or longer stays. When I pointed out my booking request was for 3 days he never bothered replying.I get the room size covered by my contract may not be available (although he used the words “almost no inventory”). If you are going to force me to pay more for a larger room at least give me a “discount” that is bigger than a random person surfing the net can get.Other members of the Ritz team worked very hard to get me to stay at the Ritz. They made my businesses feel valued and appreciated. One employee wrecked that in a single email exchange.If you want a great place to stay while visiting Toronto I highly recommend the Ritz. If you are a business traveller who regularly travels to Toronto for business and is seeking a corporate rate contract you can rely on for cost certainty, find another hotel as that team at the Ritz does not value loyalty and will gouge you at the first opportunity.If this particular staff member worked for me and treated one of my customers this way, he would be terminated for cause immediately.",
      "rate": 1.0,
      "tripDate": " May 2024"
    },
    {
      "title": "Mediocre hotel at this price point",
      "text": "Rooms are spacious and quiet, which is about all I can say about this hotel that is positive. Highly priced holiday inn for the rest. No amenities in the room at all, no workspace, no service, gym is ok, pool very basic area with no style or atmosphere. Breakfast restaurant really average. Overall, the brand and the price point are not aligned. Feels like a factory designed to maximise revenue buy cutting back on any expense. Other hotels in Toronto at similar price points beat this place hands down for comfort, quality and service.",
      "rate": 2.0,
      "tripDate": " June 2024"
    },
    {
      "title": "Great night in toronto",
      "text": "Truly received the ritz experience. We had to stay overnight in Toronto after missing our connection home and decided to make a trip of it by heading into downtown to check out the city. Decided to stay at the ritz and so happy we did. From check in to check out, every interaction we had with a staff member was a positive one. Hotel was amazing. Great indoor pool area to let the kids burn off some energy. Rooms were very well designed. We had a corner suite with a view of the CN tower which a very beautiful watching it in action at night. Thanks for an amazing stay. We can’t wait to go back and spend some more time there.",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Family staycation celebrations ",
      "text": "Have been meaning to write this review.  Ritz Carlton guest experience has went over and beyond my expectations.  Our family stayed this Aug 2022 to celebrate our 18 wedding anniversary.  They prepared the room with a pleasant surprise.  I ordered some amenities and they arrived in a timely manner.  All my persona requests were met for the kids.  I made a request for cupcake decorating for the kids, elmo toys for my little one and my older one really enjoyed the ice cream cooking class with nitrogen.  Loved the club lounge as we could come and go as we pleased and concierge assisted us with Aquarium tickets before we arrived.  Only drawback is the sofa bed.  Wished there were room offerings for 2 bedroom in the club lounge suites.  Overall fantastic family stay for families looking for a bit of a luxury staycation.  Thanks Kamila for ensuring our stay was well taken care of from start to finish.",
      "rate": 5.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Excellence Service",
      "text": "Amazing hotel w great view of the Lake - especially for New Years firework. However the suites are just one component as the Excellent Service is really what makes this hotel stand out. Would like to highlight Shea Flores who is just a natural hotelier with a sincere passion for what she does. She is attentive and caring - helpful and makes you feel at home.",
      "rate": 5.0,
      "tripDate": " December 2023"
    },
    {
      "title": "Another great stay at this hotel",
      "text": "I stayed at the Ritz-Carlton in Toronto for the first time in December 2022. I liked it here so much that my partner decided stay at this hotel again the next time we were in Toronto.So this summer we spent three nights here and I have to say again that it was a very pleasant experience. This time we had a room with a view of the CN Tower. The room was spacious, clean, I felt very comfortable here. Again, I have to express my enthusiasm for the bathroom: bright, large, with two sinks, large mirror, many towel bars, glass doors to toilet and shower and there were both: a bathtub and a shower. Everything here was absolutely amazing. I really enjoyed my second stay at the Ritz-Carlton.",
      "rate": 5.0,
      "tripDate": " July 2023"
    },
    {
      "title": "Upscale and fabulous venue!",
      "text": "The hotel was fabulous!  Bathroom was just fantastic!  Separate shower with glass door; separate toilet with glass door; large soaking tub; double spacious sinks and large wall mirror. Towel bars everywhere!  Beautifully designed and lighted!Bar/coffee area was nicely appointed!Restaurant was delicious!Only drawback resulted from our visit being on a day when hockey and baseball coincided in TO. Traffic was horrendous!  Took an hour to go one way around hotel. Otherwise, beautiful hotel!",
      "rate": 4.0,
      "tripDate": " May 2023"
    },
    {
      "title": "Room defects",
      "text": "The ceiling lights above the shower and bathtub were both broken. Both USB plugs on the nightstand had no power. One of the two wardrobe door panels did not close properly and always stayed open. It's not about whether I was unlucky to get the one bad room. Nor whether these issues had much practical impact to my stay. The point is, in my opinion, simply to maintain the minimum quality standard for the Ritz-Carlton name, the hotel could and should have taken any room with even one of these defects off the market completely until fully fixed, not bookable by anybody, forgoing their revenue. It's like one of the reasons you're happy for high end products to make a fat profit margin from your purchase is they do the quality control and scrap the obviously defective products before they leave the factory. This was just the most clear and avoidable part. There were also numerous other details and service qualities far below the standard you might expect from Ritz-Carlton. Reception staff was friendly and professional. I will never come back to Ritz-Carlton Toronto, will probably stay at The Hazelton or Four Seasons or St Regis next time in Toronto.",
      "rate": 2.0,
      "tripDate": " October 2022"
    },
    {
      "title": "Absolutely wonderful stay",
      "text": "This is truly an exceptional property. The location is perfect, right in downtown Toronto, walking distance to all of the major downtown attractions. The staff was absolutely delightful, and went out of their way to ensure we had a great stay. Dabby at the front desk was wonderful and so sweet to our daughter. The room was immaculate and spacious. I have high expectations when staying at any Ritz property, and the Ritz Toronto exceeded them. We were sad to leave! Thank you for a wonderful stay!",
      "rate": 5.0,
      "tripDate": " September 2023"
    },
    {
      "title": "Top-notch hotel.",
      "text": "Always top-notch services at the Ritz-Carlton. We usually take a suite at the Ritz, but this time because of time constraints, we booked a standard room for one night stay. How nice of the management to greet us with fruits and a lovely message. Thank you, and we will be back!",
      "rate": 5.0,
      "tripDate": " March 2023"
    },
    {
      "title": "Amazing stay during our month in Toronto!",
      "text": "I wish we'd booked our suite for the length of our stay in TO.  We were returning to introduce our children to a city we know and love (having lived in Toronto some 10 years back).We booked a combination of a few hotels and a lake house stay during our 31 day stay, but I must say that by far, this hotel is the best we stayed in in TO and the best we have visited in a while.Customer Service is outstanding!  OUTSTANDING, all over the hotel.  Concierge are fabulous, Front Desk wonderful, Guest Services just spectacular and all of the staff working hard cleaning rooms, serving and preparing food and everything in-between are just wonderful.  You can really see that the customer experience is at the forefront of what this hotel does.  Guest Services arranged for Birthday cake and balloons for my son and were so kind, bringing milk and cookies in the evening and checking that the kids had everything there needed.Hotel is spotless and seems to be recently refurbed.  High level speed to everything from beds and sheets, to pillows and all electronics etc including washing and drying toilet.On site restaurant was great for family meals and meeting friends. Really good cocktails and high standard of food. Great waiting staff.Location of the hotel is perfect for getting around.  We'll be sure that this is the only place we stay when we return and it has reminded me why I stayed in Ritz hotels in the past - looking for another Ritz location for Easter.  True 5* experience and we've had a lot that promise but fall short...not in this instance.",
      "rate": 5.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Wonderful Time at the Ritz-Carlton in Toronto.",
      "text": "I wanted to write a review to thank the staff who looked after me during my recent stay. I came up for short vacation to see friends in the city with my girlfriend. Apologies if I miss spell names of the staff! Check in was quick and efficient, provided by Guleen. She was prompt with our check in and warm. She provided a number of options for late night dining. She even offered club, but due to the nature of the trip, we refused. The room was very well kept with all the expected amenities for luxury hotel. My girlfriend has actually rarely travelled and was surprised that the neso coffee was complimentary!Our room was always well kept and stocked, thanks to our housekeeping attendant Teressa, which was much appreciated as we were constantly wandering the city and there is a simple pleasure to come back exhausted and everything is how it should be. She noticed we were a couple and placed additional items for us to use. Even left sweet notes for us!I brought a rum cake for the front desk team. Working in the industry and understanding how difficult it can be at times. I wanted to provide them with a positive experience. I provided it to Nikos, front desk agent, who thanked me for the kind gesture. I asked a few questions regarding my billing he was able to assist with them. On the morning of my departure, I was again meet by Nikos, who conducted my checkout, confirming my bonvoy number was attached and email for billing purposes.  He even managed to surprise me. With the help of Marco, another agent, they wanted to return the favor and surprised me with two Ritz Hats and maple candies. They even had the Night Manager meet with me, Alejandro, and we had an exchanged pleasantry. Nikos & Marco also assisted with organizing transportation and showed genuine concern regarding the timings. Everything work out the getting a taxi was no problem.  My only critique would be to check the pillows, as they were a little flat. It wasn't an issue for myself, but I can see how it could be for others. I'm sure if we requested, we would be provided more firm ones. We did not get a chance to enjoy much of the amenities, due to the fact our schedule was packed. However, it does leave an opportunity in future to stay! Thank you once again to all the staff who made this a wonderful experience for myself and my significant other! First class!",
      "rate": 5.0,
      "tripDate": " May 2024"
    },
    {
      "title": "Best Place to Stay in Toronto!",
      "text": "The Ritz Toronto is a great place to stay in the perfect location.  Upon arrival, we valet parked the car and check in was quick and easy.  We had a lakeview room, which was great as we saw both the CN Tower and the water.  Rooms were recently renovated with very nice finishes.  The bathroom was spacious and nicely done as well.  Service at the hotel was fantastic!  We travelled with our two young ones and they brought up milk and warm cookies, stuff animals and drawing books for them.  Didn't even ask for it, but they graciously offered.  Indoor pool was nice and spent a couple hours there one afternoon.  The area isn't that big, but that was ok for us.  Location is great as it is a few minutes walk to the CN Tower and other tourist attractions.  We even walked down to St. Lawrence Market and the distillery district which wasn't that bad of a walk as well.  Overall, great hotel with amazing staff.  I would definitely recommend this hotel!",
      "rate": 5.0,
      "tripDate": " October 2021"
    },
    {
      "title": "Feces in bed sheets",
      "text": "I have never ever experienced anything as disgusting as this. I arrived very late for this booking, had an early morning plan so I went right to bed as I arrived. Upon arriving, everything looked great. I climbed into bed and as I was making myself comfortable, felt something off under the sheets. I lifted up the blanket more, and to my horror, disgust and shock discovered the sheets had feces spread over them. I had just rolled around in another person's poop. I jump out of bed and quickly wash my legs off. I go down to the front desk and show the photos to the lady behind the counter. She didn’t even know what to say. She gets a manager. I spoke with Jason Fang. He asked that I send the photos to him and asked me to wait while he figured out a solution.  A good amount of time passes by, and he comes back. His resolution is this, he changed my room (he said he upgraded me but the room was identical to the poop-infested one) and told me he would pay for my breakfast. So folks, if you want a free breakfast from a $1000+ hotel in Toronto. Just roll around in a random stranger's poop after they failed to clean the room properly (and clearly failed to change the sheets).  All I can say is I have never been so disgusted, not only about rolling around in human crap but also by the hotel's lack of desire to do anything for me after it happened. Photos of the bed are attached.  They tried to get this review removed, clearly because of how embarrassing it is, but I will not allow a hotel to try and force to me to be silent.   (Update: August 2022 - reached out to the hotel manager Guillaume Benezech to express an interest in giving the hotel another chance. He clarified that after an investigation they couldn’t “confirm” that the waste in the bed was human feces. However I can assure you as the person who had to lay in it, it was disgusting. Manager then told me that I was not welcome back because the staff at the hotel was worried and not comfortable because of the last stay and that they were concerned I would find something else in the hotel rooms and post photos of it again. Curious as to why the staff are so worried that something else would be found, maybe their cleaning standards are even lower than I thought.)(Update: April 2023 - I still have faith in the Ritz Carlton Brand. As an ambassador elite member for Marriott Bonvoy, I get to see a lot of establishments, ritz in most cases are phenomenal. I just got off the Ritz Carlton Evrima and it was a good stay. Management of the Toronto location just seems to be extremely poor and has no desire to rectify customer issues, leaving a sour taste in mouths. Hopefully the Toronto location changes their ways to match the quality and service you expect at a Ritz Carlton.)",
      "rate": 1.0,
      "tripDate": " May 2022"
    },
    {
      "title": "A few details need updating, but overall fantastic property",
      "text": "Stayed in a one bedroom corner suite. For families like ours with 1-2 kids sleeping on the pull out sofa bed note there is no door between living area and bedroom which is unfortunate. Room service breakfast always arrived within 30 minutes and was perfect. Top notch service. Stunning outdoor bar for late night drinks with fun drink menu. We used the pool, nice warm salt water though the spa is very outdated (small and plastic) and should be replaced.",
      "rate": 5.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Hard pass",
      "text": "It is not often that I leave a 5 star hotel with the impression that everything was a major let down.I had arranged for an airport pick up that never happened because their driver did not show up on time - they sent me a picture of him in front of a clock 30 minutes later than the arrival time as proof he was there, lol. And to top it off they charged me anyway because, why not rip off the client if you can, right?Then I was allocated a room that had some isolation problems in the window, which would make a whistling sound every time the wind picked up. After some back and forth and even the staff not agreeing on what the problem was, I was moved to a different room, which was better.Then the hotel has no concierge for most part of the day - apparently that is also my fault for not paying up for the fee of the Club lounge access in which they apparently do get a concierge. The restaurants and spa were both unimpressive and more in line with a middle range chain hotel. I thought that maybe in Canada they had different standards for 5 star service, but then I went to the RC Montreal and realized that this hotel is indeed a 3 star property disguised as a premium experience. I had a quick chat with the General Manager of the hotel and he was a very decent and down to Earth guy, which is usually a good indicator of how the staff would behave - but nope, most of them just don’t care at all.Definitely would give this hotel a hard pass next time.",
      "rate": 1.0,
      "tripDate": " November 2022"
    },
    {
      "title": "Disappointed from out of Town",
      "text": "Girls weekend away .When we got our 2 room was told a fee$ 25  for mini fridge turned on and no mini bar  . I  ask staff where the snacks and lounge was , told on the main floor not like what's on the internet (nothing free) went to the business next door for breakfast I drive a older car and as we arrived was asked many times if we were staying at the hotel once okay but not that many times and a fee of $60 to park the car. Cameron could smile once and while wont hurt. The bed was amazing ,rooms clean. Walking distance to the theatre was nice no driving.",
      "rate": 4.0,
      "tripDate": " December 2022"
    },
    {
      "title": "Exceeded all expectations",
      "text": "I was planning a visit to my mom (who is turning 90 this year) locally and decided to treat her to a \"staycation\". I used my Marriott points and chose the Ritz mostly due to the pool and spa and the good reviews. I've stayed in a lot of Ritz Carltons but this was definitely the best and it was due to the amazing service we received from the moment we arrived until when we left.I need to specifically call out all the bell/valet staff. Funny, friendly and helpful. Due to her age, my mom has some trouble getting into high vehicles and they were always there ready to help. They greeted us like family every time we returned to the hotel.At breakfast one day, the GM of the hotel came around and introduced himself (I think to the Bonvoy elite members) - I truly appreciated that and I think that type of management is why you see exemplary service throughout the hotel. If you ask someone at the front desk where something is, they will walk you there and ask you about your day and it seems genuine. When you sit down in one of the restaurants, you will be addressed by name.We had a really lovely afternoon in the spa and I can't say enough about the service providers there - great massage and truly amazing facials. My mom's provider even hugged her when she said goodbye. I think some of the soft furnishings in the lounge are due for a refresh but everything is well maintained and very clean.We had a spotless and very comfortable room with 2 queen beds with a view of the CN Tower. Diptyque amenities, Nespresso machine, complimentary bottled (glass) water, bathroom with a large tub and walk in shower and WC.A huge thank you to everyone who made our stay so memorable - it is a memory of a special time with my mom that we will both cherish.",
      "rate": 5.0,
      "tripDate": " January 2024"
    },
    {
      "title": "Yes, but…",
      "text": "As always, a great hotel, especially for business. The room are still comfortable, everything is clean and my room had a Great Lake view. But COVID has been hard on the Ritz. The check-in process felt almost like airport security, no one says welcome back (I’ve lost counts of my visits), one bath towel ripped while I was using it (just from being an old towel), no more shoe horn in the room and no more house car easily available for a quick drop-off.",
      "rate": 4.0,
      "tripDate": " November 2022"
    },
    {
      "title": "The Ritz was simply fabulous!",
      "text": "We arrived early at noon, and they were able to check us in early, and they upgraded us to a CN Tower lake Ontario view room. Being a platinum elite member does not give you access to the concierge level amenities/lounge. The cost for two people for the whole stay was $300 Canadian, which gave you access to the lounge with food, beverages and car service. We opted to not get it as we couldn’t eat or drink for that amount of money! The room was fabulous. The highlight of the room was the smart toilet. It was simply amazing and I now want to get this $10,000 toilet for my house. The beds were comfy. The water bottles were restocked regularly and the customer service was outstanding. Special shout out to Marco Bosco in guest services who made our stay that much more enjoyable, he was great to chat with in the lobby. The Ritz Carlton signature blend tea is available 24/7 in the lobby and it was delightful. We were able to get a few packages to take home and enjoy after our stay. Truly an amazing experience and plan to return on our next trip to Toronto. Note that this hotel has many professional sports teams staying at the hotel, and sometimes there will be a crowd outside, waiting for players, this does not hinder our experience in anyway, we were just surprised that a crowd was outside a different hours of the day. There’s definitely good people watching opportunities in the Ritz-Carlton lobby.",
      "rate": 5.0,
      "tripDate": " April 2024"
    },
    {
      "title": "Outstanding",
      "text": "This hotel really was fantastic.  Our room, 12th floor overlooking the lake, was so very comfortable and, more importantly, exceedingly quiet.  The location allowed easy walks to St. Lawrence market and the distillery district as well as the theater.  Many restaurants to choose from nearby as well.",
      "rate": 5.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Great short family stay",
      "text": "Did a small staycation trip with wife and kids. Ritz did all the “small things” well like chat up my kids, brought them toys at dinner, maids gave us chocolates when they saw us coming back from dinner and the list goes on. Andrew at front desk in particular was great “checking in” the kids. My only hint of an issue wasn’t even really the ritz fault...but call me old fashion but my advice to another family traveller is don’t bring your football to the ritz pool. It’s not a huge area and there’s lots of couples that are coming from the spa and wanting some relaxation time and really don’t want to worry about your throw accuracy. But yeah...all in all 5/5.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Best in Class Service!   ",
      "text": "For the second year in a row we have celebrated New Years Eve at the Ritz Carlton in Toronto . This is one of my favorite Ritz destinations. The hotel is conveniently located in downtown near restaurants and the Scotiabank arena.  The views of the lake and the CN tower are amazing. What sets this Ritz apart from others is the hospitality on the club lounge. My family and I have severe food allergies and the staff goes well out of their way to accommodate our needs. Olga and Robyn are simply the best and work tirelessly to attend to our and every guests needs.What a great start to 2020! Can’t wait to go back!",
      "rate": 5.0,
      "tripDate": " December 2019"
    },
    {
      "title": "Kudos to Housekeeping",
      "text": "After an amazing visit at the Montreal Ritz we decided to continue with brand in Toronto but found this property did not compare in its room features or service.Our visit started off negatively as we found the reception staff very unfriendly and unwelcoming. Throughout our stay we found the lobby staff to be quite snobby.Our stay did turn around thanks to its exceptional housekeeping team. Our room was always immaculate and the attention was given to the smallest details. Our housekeeping attendant Jaiya was absolutely wonderful and greeted us warmly in the hallway if she saw us.The location is very central and the room itself is spacious and comfortable. However I wouldn’t stay here again as alternative luxury hotels can offer this along with more friendly guest services.",
      "rate": 4.0,
      "tripDate": " October 2021"
    },
    {
      "title": "Excellent stay, comfortable bed, amazing bathroom",
      "text": "My partner and I spent three nights at this amazing hotel. Our room on the 16th floor had a view of David Pecaut Square. The room was spacious, clean, quiet and the bed was incredibly comfortable. But I was most excited about the bathroom. The bathroom was large, bright, had both a bathtub and a shower, the lights automatically turned on when you entered... It was without a doubt one of the most beautiful bathrooms I've ever seen at a hotel.We had breakfasts and dinners at club lounge. The staff there was very nice, they all tried to make us feel good and have everything we wish for. The food was excellent. The hot chocolate with fluffy mousse on top was absolutely delicious. The stay at the Ritz-Carlton was wonderful. It was an excellent experience and I was very satisfied.",
      "rate": 5.0,
      "tripDate": " December 2022"
    },
    {
      "title": "Needed help getting a Novavax booster and the Ritz Carlton came to the rescue!",
      "text": "Having had reactions to the Pfizer shot I wanted to get a booster and Canada had approval! When I called around to ask for help people were clueless.. then I called the concierge team at the Ritz Carlton. Guillermo and the others I interacted with were just absolutely phenomenal. I have been to this hotel years prior so I knew it wasn’t brand new but it surely looked like it was! When I got to Canada the lobby the elevators the restaurants the bars all of it looked like it could be brand new all staffed with smiling faces! Being a little fearful of being in a country not knowing how the health system worked they walked me through it and got me a ride to the clinics that had the Novavax vaccine .. having made the trip alone they made me feel like part of a family. The breakfast and lunch very similar to what you would see in most Ritz-Carlton‘s. The hors d’oeuvres got me in the mood for a dinner! Everything was fresh and everything had a wonderful presentation a couple different times I saw the chef come out to make sure his stamp of approval was on it. Different nationalities were in the club serving and they all would put a smile on your face. I told them I definitely will come back. As you look out the window from the 20th floor you see the aquarium below  and the water in the near background. From a sunset cruise to a dinner cruise to a tour of the aquarium they were ready to get you tickets and could tell you neat areas to walk and observe the city. It truly was a remarkable time I felt relieved they help me get my shot  and I’m now back home where I miss  them.. Sometime in the next couple of months I’m going to go back up the service was just that good!",
      "rate": 5.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Not 5 stars",
      "text": "Although Marriott Bonvoy Gold Elite member I was given an old room with a dirty and foul smelling carpet on the 8th floor. The windows had not been cleaned in a while and the view was of/in the office 10 feet away. I am appalled that such a room even exists in a Ritz Carlton hotel. The staff at the front desk is either helpless or arrogant and unwilling. You are not even greeted by the numerous Belly Boys standing around at the entrance. At least the doors are permanently open so they save opening them for the stray guests. Breakfast is mediocre, service incredibly slow if you come during peak hours. Had to cancel my breakfast several times during my stay because otherwise I would have missed my appointment at 9 am. Still, I paid over $50 each time for tea, orange juice and mediocre porridge. On weekends it is like a children's hotel (kids stay and eat (!) for free) and you can hear the screaming child in the middle of the night from the room next door.",
      "rate": 1.0,
      "tripDate": " April 2023"
    },
    {
      "title": "Incredible Luxury Property with an outstanding staff",
      "text": "My Wife and I have just returned from a four night stay at the Ritz-Carlton in Toronto. Suffice to say we had exceedingly high expectations given the brand, but were still pleasantly surprised. A beautiful property, filled with well appointed rooms and amenities. I don’t think I’ve encountered a more welcoming and professional team, and everyone from the front desk to house-keeping bent over backwards to make our stay a truly remarkable experience. Special thanks to Priscilla on the Front Desk, Zachary in Epoch, John on the door and Marcela, Monica and Eileen for a fantastic house-keeping experience.",
      "rate": 5.0,
      "tripDate": " September 2021"
    },
    {
      "title": "Special birthday treat",
      "text": "As soon as I walked in the lobby I knew I was in for a real treat, it had beautiful lighting and the staff were incredible at the desk at check-in. We had a massage booked for an hour and the spa was spectacular, the masseuse was very knowledgeable and gave me great tips on improving my posture and the product line they use Clarins is amazing... after the spa we went to the bar and had an appetizer and drinks I will say the drinks are rather expensive $22 for a cocktail but you're in Toronto and in a ritzy Hotel. The beds were very comfortable the pillows were awesome and it did have a sofa in the room which was a nice bonus. I would highly recommend you stay here it's fantastic.",
      "rate": 5.0,
      "tripDate": " September 2022"
    },
    {
      "title": "A wonderful family escape ",
      "text": "We stayed at the Ritz-Carlton, Toronto for a family getaway with our 2 young children and we had a fabulous time. True to its Ritz Carlton nature! First of all the location is fantastic to discover the city as it is walking distance to the aquarium, the CN tower and the lake shore. We were welcomed by a wonderful lady at the front desk it was very late at night due to airport delays but they made us feel home straight away brought cookies and milk for the kids. The room was extremely comfortable and spotless. We had our kids in a sofa bed and still had plenty of space and the bathroom is huge so no issue there either. The view from the room was amazing. There is also a great pool with salted water. The spa team was able to give us some balls and swim noodles for the children to play with so they had a great time. We had the chance to dine one time in Toca and the food was so tasty and service impeccable! One day we had some rain in the morning so the lovely lady in the lobby gave us a scavenger hunt to do and the kids loved it. We will definitely choose this hotel again whether on business or for leisure. Thanks for the great stay!!",
      "rate": 5.0,
      "tripDate": " August 2022"
    }
  ]
}