{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "The Drake Hotel",
    "url": "/Hotel_Review-g155019-d496106-Reviews-The_Drake_Hotel-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.5",
      "reviewCount": 843
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "1150 Queen St W",
      "addressLocality": "Toronto",
      "postalCode": "M6J 1J3",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/22/9c/f1/dd/the-drake-hotel-modern.jpg?w=500&h=-1&s=1"
  },
  "description": "Welcome to The Drake Hotel, a Toronto destination rooted in contemporary art, culture, genuine hospitality and proudly celebrating our local surroundings along with the communities we serve. Since opening our doors in 2004, we have sought to create a neighbourhood hub that provides a unique sense of place; to bridge the art of the moment with intentional hospitality, to ignite curiosity within travellers, revellers, neighbours and our local friends. Each of our 51 guestrooms are wired for instant tech and have a little something special for every guest. With an eclectic and constantly changing program of performance and visual art, in addition to an ever-growing permanent art collection, The Drake Hotel is also home to Drake Underground connecting diverse audiences to new music and to Toronto's vibrant culture. We invite you to experience our great seasonal menus, a robust cocktail list, a vibrant local culture, carefully curated curiosities and genuine hospitality.",
  "featues": [
    "Paid private parking on-site",
    "Free High Speed Internet (WiFi)",
    "Yoga classes",
    "Bar / lounge",
    "Evening entertainment",
    "Patio",
    "Highchairs available",
    "Car hire",
    "Parking",
    "Wifi",
    "Fitness classes",
    "Coffee shop",
    "Restaurant",
    "Breakfast available",
    "Breakfast in the room",
    "Complimentary Instant Coffee",
    "Happy hour",
    "Kids' meals",
    "Outdoor dining area",
    "Wine / champagne",
    "Rooftop bar",
    "Nightclub / DJ",
    "Taxi service",
    "Conference facilities",
    "Banquet room",
    "Meeting rooms",
    "Rooftop terrace",
    "24-hour security",
    "Baggage storage",
    "Concierge",
    "Gift shop",
    "Non-smoking hotel",
    "ATM on site",
    "24-hour front desk",
    "Dry cleaning",
    "Laundry service",
    "Bathrobes",
    "Air conditioning",
    "Desk",
    "Housekeeping",
    "Room service",
    "Minibar",
    "Cable / satellite TV",
    "Walk-in shower",
    "Safe",
    "Seating area",
    "Telephone",
    "Bottled water",
    "Iron",
    "Laptop safe",
    "Wake-up service / alarm clock",
    "Flatscreen TV",
    "iPod docking station",
    "Bath / shower",
    "Complimentary toiletries",
    "Hair dryer",
    "City view",
    "Non-smoking rooms",
    "Suites"
  ],
  "reviews": [
    {
      "title": "Funky boutique hotel with the best cocktails ever",
      "text": "My wife and I stayed for two nights at The Drake Hotel in March and loved it. It is a funky boutique hotel with all the amenities we wanted, the front desk staff were friendly and helpful when we checked in and needed and umbrella. The star of this hotel however is Jeremy Day at the cute cocktail bar in the lobby. I love a cocktail and Jeremy made the best cocktails I have had anywhere in the world. As an amateur mixologist myself, I was astounded at how much better Jeremy's cocktails were. If you stay at the Drake, make sure to grab a few cocktails: don't go for an ordinary negroni, whiskey sour, martini - pick one of Jeremy's masterful creations and be blown away. If I'm ever in Toronto again, I will be coming back to the Drake for the cocktails alone, but will stay for the lovely room, decor, and freindly staff.",
      "rate": 5.0,
      "tripDate": " March 2024"
    },
    {
      "title": "Great experience, even during a pandemic...",
      "text": "I stayed at the Drake this summer in the height of the pandemic and just wanted to say that the (very limited) staff's attention to real-world detail, cleanliness and friendliness was exemplary. Naturally, I was nervous about staying in a hotel at all, but throughout my stay I felt safe, well attended to and genuinely empathetic about what the industry is going through. While many places seem to be taking a 'business as usual' approach, the Drake characteristically met the current times with humour, awareness and consideration. I highly recommend this hotel, not only for the general vibe, but for their professionalism under adversity.",
      "rate": 5.0,
      "tripDate": " July 2020"
    },
    {
      "title": "Perfect space for a crash night!",
      "text": "We decided last minute to stay over in Toronto for the night.  After doing some quick research on hotels close by the restaurant we dined at, we settled upon The Drake.  This was our first visit and by far not our last.  We were greeted promptly and check in was a breeze . . . our room was spotless and exactly what we needed.After a perfect nights sleep we woke to have breakfast in the cafe and it was beyond delicious and complimentary coffee and tea.  All in all a 100% perfectly wonderful experience.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Go to party, not to sleep",
      "text": "My partner and I just returned from a little getaway in Toronto, we had decided to treat ourselves with a room at the drake hotel. I had heard about it quite a lot and thought the location would be ideal to explore by foot. We booked a pad in the oldest portion of the hotel since which were the best priced (but still outrageously high imo). The pad was nice, nicely furnished with cute touches. Be advised however that the room are very small and the bathroom glass sliding door don’t offer much privacy into the toilet and shower area. The first two night went allright despite the music being a little loud at night. Some part of the hotel were also booked for private events and could not be accessed. It’s Saturday night that things turned a bit sour for us, we came back to our room after the day and found our room had not been serviced ( bed undone and towels weren’t replace) which was odd. The music was especially loud. We expected things to quiet down a little bit around midnight or at the very least, around 3 AM, but it never did. The loud music and bass continued until 7 in the morning, keeping us awake most of the night. No notice or anything was given, and when we disclosed our disappointment in the situation at the front desk upon check out, we didn’t get any more explanation or anything from the staff. They also informed us the lack or room service was due to some of the cleaning staff not showing up. They only offered us a 25$ off a breakfast at their restaurant which I find is a pretty ridiculous offer considering a night at their hotel runs at around 400$ a night! Quite disappointed with our stay, I think the oldest wing is not much of a hotel, rather a big club/restaurant and event spot with a few beds sitting on top of it. Definitely go for the modern wing or book somewhere else if you intend on sleeping…",
      "rate": 3.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Best Guest Experience in Toronto",
      "text": "We stayed at The Drake for a LONG overdue date night and from the moment we walked in the door, we felt welcomed. The quality of food and drink combined with the uniqueness and beauty of the space makes it pretty easy to love the facility. The surrounding neighbourhood offers a ton of very unique shopping and dining experiences. But the quality of service was by far the notable part of our experience.The staff was incredibly knowledgeable and engaging. They had a ton of great recommendations and their passion for what they do was very apparent. Kudos to The Drake team for cultivating such an awesome culture amongst their staff!If you're in Toronto you need to check this place out!",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Perfect!",
      "text": "Great place, cute and cozy rooms, amazing service, good food and fun vibe! Loved it! The staff is super friendly and always ready to help The room is small and intimate. It’s a old building - so you hear people and noise around but it didn’t bother at allI really recommend this place. And the brunch is really good",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Overpriced motel-level hotel",
      "text": "Staid hotel. Room is closet-sized. Nothing worked. The tablet they provided to order room service didn't work. The number they provided to text for room service also didn't work and nobody responds. I had to call to order late night dessert, which was not very good. In fact, the food at The Drake is overall not mediocre, but I this came as no surprise to me, having lived in Toronto.The next morning at about 10 am while I was out, I finally got a response to my text from the previous night asking for cake saying they would send that immediately. You'd think they'd check the time stamp.The lighting on the magnifying mirror didn't work. No coffee or tea in room. The \"daily fresh baked goods\" are not fresh. I had a croissant and it was so stale, it tasted 3 days old. They never had scones available despite these being a \"Drake Classic\" on their menu.Service is meh. I only ever saw one staff member there at any time of the day. The bedding is cheap and uncomfortable.The hotel is overpriced for what you get The amenities and service are on par with a motel (and I do mean a motel as even a Holiday Inn would offer in room coffee or tea). The only reason this place gets 2 stars is because the location is great if you are in the Parkdale/Queen West area as it is walking distance to a lot of places. But that's all you're paying for.I normally always take photos of the rooms at places I stay but I didn't bother with The Drake as it was just so underwhelming.",
      "rate": 2.0,
      "tripDate": " May 2023"
    },
    {
      "title": "Great one-night stay",
      "text": "ery impressed with our stay at the hotel and dinner at their restaurant (Sky Yard). Everything was super clean, including our room. They’ve reduced the amount of stuff in the room (the description online lists handmade dolls, etc.) and I imagine this is to reduce COVID transmission. Jon and Amy at the front desk were super helpful and accommodating (any requests were quickly taken care of). Dinner was pretty good. The cocktails are great! I watched the staff clean tables, chairs, etc after guests left, and was very impressed. The only negative was the street noise (our room looked out onto Queen St. I know this can’t be helped. Great view though!",
      "rate": 5.0,
      "tripDate": " July 2020"
    },
    {
      "title": "My new home from home in Toronto",
      "text": "This place is great.  Yeah, the rooms are tiny.  That's part of the charm of this place. The furniture was quirky, the bathroom was integrated into the room, but is modern and spotless, and the bed was super-comfy.   There was a safe in the room, and cool snacks and drinks if you were so inclined-- not your typical minibar fare... fun stuff!.  Word of caution... there is no elevator, BUT that brings me to the staff, who are awesome.  They carried my unreasonably heavy suitcase both up and down the stairs for me, and just in general, the staff was very attentive and friendly.  The lounge was a fun place to get dinner, drinks and also breakfast, and the food was really, really good, as were the creative drinks.  The West end of Queen Street is a cool little neighborhood FILLED with restaurants, bars and little shops.  Would definitely recommend the Drake.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Amazing experience",
      "text": "We had an amazing time staying at the Drake hotel. A very hospitable and welcoming staff with an elegant interior design surrounded by beautiful artworks, just makes the vibe magnificent.I'd like to emphasize how great the food quality was, really enjoyed it.We booked an Art Passport package and really enjoyed the complementary services especially the provided personal artwork.Thank you for your services.",
      "rate": 5.0,
      "tripDate": " February 2021"
    },
    {
      "title": "A beautiful spot for a staycation",
      "text": "We needed to get out of our apartment after a long 2020 of not much travel. The Drake was very welcoming and made us feel right at home in Queen West. Though the hotel was fairly quiet due to the pandemic, the staff at the Drake were extremely attentive and caring. The room was cozy and quiet and had large windows with blackout curtains. Oh - and I'm picky about pillows. They were 10/10.",
      "rate": 5.0,
      "tripDate": " January 2021"
    },
    {
      "title": "My favourite place to stay in the city",
      "text": "The Drake is my top choice for staying in the city. I know I can count on stylish comfort, little luxuries like delicious smelling soaps and lotions, and cleanliness at every visit. I personally love how there are always pillows with varying degrees of density so I know I'll have a comfortable sleep. The Drake bar is a lovely place for drinks and great food, and there are lots of menu options for breakfast and coffee. I always look forward to my visit at The Drake.",
      "rate": 5.0,
      "tripDate": " March 2024"
    },
    {
      "title": "An Artsy Perspective on Refined Comforts",
      "text": "The artistic theme is on point throughout the hotel, and no level of comfort was compromised. The staff greeting us at the front desk were warm, inviting and ensured we had what we needed to begin our 3 night stay. We also hosted a private happy hour event at the Sky Yard Rooftop bar. Service from staff was terrific and the food options were well received by our guests. This location is prime for Queen street activities, bike ride shares or shuttle to central downtown.We hope to venture another stay here in Toronto!",
      "rate": 5.0,
      "tripDate": " October 2023"
    },
    {
      "title": "A Fantastic Stay at the Drake",
      "text": "My spouse and I recently embarked on a much-needed \"stay-cation\" to reconnect and indulge in some quality alone time. From the moment we stepped foot in the hotel until our heartfelt farewells, we were treated like royalty. Our intention was to forgo a night out on the town and instead revel in the sheer magnificence of the most imaginatively designed and awe-inspiring room we have ever had the pleasure of staying in. Our experience was heightened further with a delightful dinner at the hotel and the luxury of savoring pastries and coffee in the comfort of our bed the following morning. Having previously enjoyed a remarkable stay at their sister property, the Drake Devonshire, in PEC a few years ago, it brought me immense joy to receive the same exceptional treatment at their captivating new addition in Toronto.",
      "rate": 5.0,
      "tripDate": " May 2023"
    },
    {
      "title": "Wonderful place for a staycation!",
      "text": "We thoroughly enjoyed our stay at The Drake for a special occasion! The staff member at night and in the morning was / were fantastic, helpful, cheerful and polite. Just really great customer service which we really appreciated (including the reminder to get a free coffee to go!) The small touches make a big difference! Looking forward to our next stay when all the small businesses and nightlife are back open so we can also enjoy the prime location (and cocktails in the Sky Yard!). Can't wait. Thank you and good luck with the renovations!",
      "rate": 5.0,
      "tripDate": " May 2021"
    },
    {
      "title": "A place for something different",
      "text": "As a Toronto resident over the holidays I wanted a nice staycation to get away for a night. Wanting something more akin to having personality, rather than another boring hotel room, I chose the Drake and don't regret it in the slightest. When I showed up, check in was quick and the front desk was super nice, informative and personable. Went downstairs to the attached lounge for dinner and drinks - it was damn good with damn good service even on a busy night. Great sleep followed by an even better shower (something about the soap there sells the experience). Check out was fast and easy, decided to stay for breakfast. Get the Drake Benny if you can. Overall the place had an amazing atmosphere and the staff were great throughout. Room was all the comforts of a fancy hotel but with a memorable personality, along with a healthy Snake Plant which I always appreciate. Highly recommended.",
      "rate": 5.0,
      "tripDate": " December 2019"
    },
    {
      "title": "Super trendy hotel with great service!",
      "text": "I stayed at the Drake for a bachelorette (visiting from Seattle), and I must say this is one of the trendiest/sexiest hotels I've stayed at. The decor from the moment you walk in is so fresh and funky, giving Instagram model vibes. Outside of just being \"cool\", the staff was so extremely friendly and helpful, making sure we were well taken care of and giving great recommendations. While other reviews do mention a \"party hotel\", the party hosted was very fun but also when it was time to go to bed we couldn't hear anything from our room. This being my first visit to Toronto, the location was also superb, close to all sorts of shopping/dining/nightlife. I can't wait to come back!",
      "rate": 5.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Covid ending go back to Toronto, amazing people, amazing place. Come from afar, feel like a local.",
      "text": "We went as soon as we could to support local. We love just outside the city and  had a mid week stay just as things began to open up. The feeling we got coming in was professional and feeling like you finally saw a long lost friend with open albeit socially distanced arms. The first person we met along with the locally famous bar manager learning some new tricks were simply amazing. We had a drink on the patio and again, the servers were as excited to see us as we were to see them. The Drake is the Toronto you want to experience. The  drinks are ones you want to be able to make but can't, the feeling is like you are a local in the neighborhood, but are visiting. The proximity to a great night scene, patio, ice cream, late nightcap, all within minutes of this gem. Stay at the Drake, sit on the patio or sit at the bar and talk to the bartender. Have the Drake burger. It's well worth it.",
      "rate": 5.0,
      "tripDate": null
    },
    {
      "title": "Dreamiest pillows, comfiest bed, coolest hotel",
      "text": "This hotel is wonderful! I think it's the most comfortable hotel bed I've ever stayed in; honestly it was hard to leave. The staff are very helpful and personal and you can really feel you are staying in an independently owned local establishment. There were so many cool touches like local art on the wall, a comfy robe and slippers, and my favorite- a complimentary glass jug of filtered water. I'm always so thirsty after travel and I hate having to buy a plastic water bottle! I ended up here when my flight to Halifax was delayed for three days, and the stay seriously made my travel nightmare a dream. It's perfectly located for exploring the city by foot and close to a lot of great bars and restaurants. If I'm ever back in Toronto, I'd stay here again in a heartbeat.",
      "rate": 5.0,
      "tripDate": " February 2024"
    },
    {
      "title": "Classic Comfort",
      "text": "We spent the night at The Drake Hotel for our Anniversary and we loved every minute of it! Delightful and engaging staff in the whole building from the front desk,  hosts, dinner servers/bartenders and our server at breakfast Owen was particularly wonderful. Our room was gorgeous and we can't wait to return to see the exciting new hotel expansion they are building. Whether you are from out of town or having a staycation, The Drake Hotel makes everything feel comfortable and special. Thank you :)",
      "rate": 5.0,
      "tripDate": null
    },
    {
      "title": "1 night in Toronto",
      "text": "Had a wonderful stay! Beautiful space with a great selection of art throughout the hotel.The staff were friendly and accommodating- bringing us cutlery for our takeout dinner. The covid measures (like a social distance table for room service) they have in place made me feel safe during my stay. Room service for brunch was amazing! Would highly recommend the mac n cheese, it has a nice kick!",
      "rate": 5.0,
      "tripDate": null
    },
    {
      "title": "Yes if you want to party, NO if you want to sleep",
      "text": "Loved few things in the hotel:The design, it’s all nicely decorated, great style. The room has a very comfortable bed and great bathroom.Breakfast is delicious, waitress was lovely Location is the coolest in Toronto,  all the favorite restaurants, cafes, delis, stores etc are around.Could have been a perfect experience if the sound level in the rooms was not that insane! There is loud music playing in the hotel patio restaurant until 2:30pm. Impossible to sleep before, it feels like the party is happening in your room. If you are a party person this hotel is for you. But if you want a good night of sleep, run away it’s impossible to close your eyes until the music stop. Ear plugs will not help. So when we left the hotel after 2 nights we were over exhausted with the lack of sleep. And the rooms are not cheap at all.This is a club with some rooms, not a hotel. So if you are looking for a quiet room this is not the place. Just go for the brunch but not to sleep.",
      "rate": 2.0,
      "tripDate": " May 2022"
    },
    {
      "title": "Staycation",
      "text": "Everything exceeded our expectations throughout our stay. We had to stay at the hotel while our pad was undergoing repair, and in the end were reluctant to come back home!:) Before Drake, we tried 3 other places, and we were looking forward to move to Drake, but our expectations were not just met but surpassed big time. We were excited to see the artwork but didn't know that it SO organically belongs on these quirky walls, we heard a lot of good things about the service but we experienced a very warm, genuine and professional culture among all the departments and employees that is on any day better than a formal \"service\" by the book. And the food! Thankfully we can frequent the bar for more lobster rolls, burgers, pastries, drinks and all!I worked in hotel industry for quite a while and have seen too much of the back of the house, so naturally I've grown rather squeamish over the years, but nowhere in the Drake have I seen an overlooked corner (spotless housekeeping!) or a frustrated face.We will be back to stay, eat and one day - dance!With love,Taisiia and Sumant",
      "rate": 5.0,
      "tripDate": " August 2020"
    },
    {
      "title": "Waste of money",
      "text": "I don’t normally write reviews or negative ones, but this hotel was way too expensive for what you get. We got the smallest room because obviously everything is so pricey, but the room was RIDICULOUSLY small with a small bed, the toilet was having problems, and our sink literally shot water at our faces. All of this for almost $500 a night. You can barely walk in the room. Our view from the window was a wooden box on the roof. I wanted to enjoy it, but it was a huge disappointment.",
      "rate": 2.0,
      "tripDate": " November 2021"
    },
    {
      "title": "Great hospitality. Warm, friendly people.",
      "text": "You must reserve parking in advance, as they do not have adequate space. We parked a block away and it was about the same price. Everyone was so accommodating adn friendly, the bar and restaurant are patronized by regulars and locals, in addition to hotel guests and the food was really good. The area is still in development, but there are lots of great spots to dine within walking distance. Most things you'd want to visit as a tourist are not walkable and driving there is a nightmare. Parking gets pricey too, nowhere is it free,",
      "rate": 5.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Look no further in Toronto!",
      "text": "Just finished my stay at the Drake and it is easily in the top hotels I’ve stayed at. The service, decor, and amenities are all 5 star.Upon arrival Natalie at the front desk gave us a warm welcome and was so pleasant and helpful in getting us situated at the hotel.Our room was beautifully decorated (the entire hotel is tasteful and gorgeous) and extremely clean. The bathroom had all of the amenities needed and the provided products are well curated.If you’re a remote worker like I am this is easily the best and most accommodating hotel I’ve experienced.Hot delicious coffee was waiting in the lobby each morning and we ordered breakfast that was directly delivered to the lounge where we were working. The food was also spectacular.For dinner, the restaurant on property is also a must. Delicious food, great cocktails, and good tunes.The hotel is also perfectly situated on the west side and the neighborhood is extremely walkable. Great shopping and restaurants are all right outside the door.Will always be staying at the Drake when visiting Toronto.",
      "rate": 5.0,
      "tripDate": " April 2022"
    },
    {
      "title": "Upscale, warm, and fun environment to dine and spend time with a meaningful group of people",
      "text": "The entire team at The Drake Hotel should be commended on their attentiveness, customer service and hospitality. It was an amazing feeling being at the hotel (my first time) and the dining experience was one to be remembered. We hosted our wedding here in November 2023.Bayley set the tone by helping me as I called in to get further details about the room and following up by reaching out to me via email regarding my inquiries until we had an answer. She was helpful throughout, answering every email or call with kindness and professionalism. I really appreciated our interaction.Nikola was more of the same, incredibly friendly, helpful, calming, and clearly cared and shared the excitement in helping us arrange our plans and curtail some concerns. He was so nice on the phone that I was shocked to have an even more friendly experience in person. Thank you so much for your help.Ali was so helpful during check-in, which was incredibly chaotic, but she got everything sorted and really made life easier.Celia was also incredibly helpful with arranging our dinner details and walking me through the process. Her friendliness and guidance were really needed and appreciated.Chef David Smith completely outdid himself with dinner service and Faye our main serving contact was outstanding. These two made our night dining in the lounge incredibly special, with prompt service, friendliness, some flair from the chef and just a beautiful, fun, delicious experience throughout. I cannot thank them enough and appreciated every moment.Thank you all so much for the help in making our evening so special.",
      "rate": 5.0,
      "tripDate": " November 2023"
    },
    {
      "title": "Good hotel in a great neighborhood",
      "text": "The hotel and surrounding neighborhood is bursting with character, which I absolutely love. The service was extremely attentive and the room was very comfortable- I was lucky enough to be upgraded. That being said, it’s wildly overpriced for the level of comfort/luxury. Don’t get me wrong, it’s a nice hotel but $430/night (USD) for a room that was supposed to be smaller than the one we got upgraded to is absolutely not worth it in my opinion.",
      "rate": 4.0,
      "tripDate": " March 2023"
    },
    {
      "title": "Drake Hotel Visit",
      "text": "Celebrated my birthday at the Drake Hotel in the 'L Studio' suite and it was amazing! The staff is super friendly and accommodating, and even threw in a few birthday surprises which made the stay feel even more welcoming and thoughtful. Rooms are decorated in a really fun and individual way, and as per usual the food was amazing. Would totally recommend the Drake to anyone whether its for a fun dinner night, or for a unique weekend getaway while still staying in the city!",
      "rate": 5.0,
      "tripDate": " July 2020"
    },
    {
      "title": "Funky and friendly hotel",
      "text": "It’s a beautiful hotel in a vibrate neighbourhood. We really enjoyed our visit and appreciated Alia and Natalie’s assistance. The PM attendant (I don’t recall his name) was very helpful with our late arrival. The rooms are comfortable and colourful. We had adjoining rooms in the Modern wing. It was the only hotel which would confirm the adjoining rooms prior to arrival. Other big chain hotels said we would only be assigned rooms upon arrival. Not a complaint, but a warning to visitors from out of town: it’s a busy street and there isn’t a designated area to load and unload. The hotel also doesn’t have trolleys for luggage, or attendants. The parking is limited and by an awkward plaza across the street, but there is public parking nearby. We look forward to our next stay!",
      "rate": 4.0,
      "tripDate": " May 2024"
    }
  ]
}