{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "The Westlake",
    "url": "/Hotel_Review-g155019-d17512498-Reviews-The_Westlake-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.0",
      "reviewCount": 35
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "2847 Lake Shore Blvd W",
      "addressLocality": "Toronto",
      "postalCode": "M8V 1H8",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/1a/09/c7/2e/the-westlake.jpg?w=500&h=400&s=1"
  },
  "description": "Experience urban sophistication and vintage charm at our trendy boutique hotel situated on a bustling street filled with an array of shops and restaurants. Our prime location is just 2 km away from the stunning Colonel Samuel Smith Park, 3 km from the Mimico GO train station, and 9 km from the popular High Park Zoo. Our chic suites and apartments offer a unique blend of eclectic modern and vintage furnishings, complete with exposed brick walls and beams, flat-screen TVs, Netflix, and complimentary Wi-Fi. With most of our quarters featuring fully equipped kitchens or kitchenettes, you can indulge in a home-away-from-home experience. We offer complimentary parking and event spaces for your convenience. Whether you're here for business or leisure, our hotel provides an exceptional stay that's perfect for you. Don't miss out on the opportunity to create memorable moments with us. Reserve your stay today!",
  "featues": [
    "Free parking",
    "Paid public parking on-site",
    "Free High Speed Internet (WiFi)",
    "Complimentary Instant Coffee",
    "Pets Allowed ( Dog / Pet Friendly )",
    "Express check-in / check-out",
    "Clothes dryer",
    "Washing machine",
    "Wifi",
    "Air conditioning",
    "Desk",
    "Dining area",
    "Housekeeping",
    "Coffee / tea maker",
    "Kitchenette",
    "Flatscreen TV",
    "Walk-in shower",
    "Interconnected rooms available",
    "Private balcony",
    "Seating area",
    "Separate dining area",
    "Separate living room",
    "Sofa",
    "Wardrobe / closet",
    "Clothes rack",
    "Private bathrooms",
    "Tile / marble floor",
    "Dishwasher",
    "Microwave",
    "Oven",
    "Refrigerator",
    "Stovetop",
    "Electric kettle",
    "Kitchenware",
    "Bath / shower",
    "Hair dryer",
    "City view",
    "Non-smoking rooms",
    "Suites"
  ],
  "reviews": [
    {
      "title": "Amazing!",
      "text": "I was sincerely impressed by The Westlake.  Amazing facility and superior guest services.  Andy checked in several times and was readily available.  I've stayed on 2 different occasions in the last 2 weeks and will definitely return again!  It's just outside of Toronto where the city is easily accessible by car or subway.  Love this place. :)",
      "rate": 5.0,
      "tripDate": " October 2020"
    },
    {
      "title": "My favourite getaway in Toronto",
      "text": "I read the reviews below and it is likely one person who had a bad experience, then got friends to also write a review. I have stayed at this hotel many times and every single time andy has been professional and polite at all times. He accommodated me when I needed an early check in without hesitation. I always recommend this place to friends and family, if you’re looking for privacy, cleanliness, professionalism, unique style &  affordable then this is your place! I look forward to returning at the end of the month for a long over due vacation",
      "rate": 5.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Loved it!",
      "text": "Far exceeded my expectations. Owner was prompt and courteous with answering my questions. I had no trouble entering the building or the suite with the codes he provided.The Andy Suite is fantastic.  Very clean, spacious, sleek and modern. It certainly felt more like a home than a hotel.  Location is great!  15 min ride from the airport.  15 minute ride to Eaton Center.  Plenty of conveniences right outside the door.  The Lake is a 5 minute walk and was beautiful even in the dead of winter. Would definitely stay again!  And we plan on it.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Nice decor but pick a lane ! Are you a hotel or Air B & B?",
      "text": "The decor was pretty but totally not functional-1) not a single closet and the hanging and The hanging there was was way over my head ( I’m 5’2”)2) There was not a single chair in the place ( not one )3) They refused to do any cleaning AT ALLThe entire 5 days we were there 4) They did not even give us new toilet paper ! We had to buy our own !5) They would come in to take out the garbage but not replace towels or toilet paper ???Pick a lane!!! If it was a hotel we would get cleaning and toilet paper every day .If it was an air b & b there would be a supply of toilet paper and we would not have to buy our own!!So- pick a lane ! Decide !Be a hotel or an air b & bAlso:The lock on the door fell off !thank goodness my boyfriend is handy or we would have been locked out with nobody to call. It took an hour to reach them and They gave us a key.An interesting neighborhood.Nice to be near the lake .Covid is not an excuse for bad service.On the contrary you should be bending over backwards to keep the customers you have.The bathroom was beautifully designed but who cares if you don’t have t p ?!",
      "rate": 1.0,
      "tripDate": " July 2020"
    },
    {
      "title": "Filthy + Andy / Hotel is always unresponsive",
      "text": "We stayed here back in September in the Bye Felicia Suite. There were automated emails for booking and checking in - but no one ever responds to texts, emails, or voicemails. Cool decor - but there were hairs on wet plates / dishes when we arrived. The floors also made our socks super dirty. Andy is always unresponsive... my friend booked the place nearly a month in advance and never once has the hotel responded to questions via any sort of communication. There was also garbage in the garbage bag upon arrival....One of the bedrooms even had stains on the sheets that looked like self tanner stains?If you don't mind cleanliness and hygiene/ lack of customer service / terrible communication then we would recommend this spot for a cool location to stay at.Look at their Airbnb reviews - Google Westlake Hotel Airbnb or Bad and Boujee Airbnb to check further reviews ..... 😬",
      "rate": 1.0,
      "tripDate": " September 2021"
    },
    {
      "title": "Take time to read all the 1 star reviews",
      "text": "Take time to read all the 1 star reviews they all match and is accurate, make you think that all the others are fake? …horrible service, we check-in around 4:00 and we only had 1 towel after multiple request to have more since we were 4 (same as our reservation) I had actually had to be rude to get some as it was 9:00… take a look at the pictures it self explanatory… it was the only time we sleep with our cloths on with socks because it was disgusting. We will NEVER return. This is NOT a boutique hotel.. so many other choices around… and this hotel is on top of a weed shop and a night club… so yes the rooms smells like weed and not quiet at night.",
      "rate": 1.0,
      "tripDate": " February 2023"
    },
    {
      "title": "If you're seeing this review. Please, don't waste your money in this pit.",
      "text": "If you're seeing this review. Please, don't waste your money in this pit. Where to even start... Booked a room for three people on March 26th 2023 for a suite with two queen beds for Sept 19-20 through Hotels.com. Got in today.. September 19th 2023. Received a one bed room. Not a suite, a very small room. I called the contact number provided and the woman who answered was very rude. Seemed extremely annoyed I was calling, told me management would be in touch I asked when and she said \"when they get in touch\"20 minutes later the manager calls and basically says \"that sucks\" but I booked through a 3rd party and it's not there issue but then told me if I couldn't make the room work I was welcome to leave because I was getting money back anyway. Now I'm in a city I'm not familiar with, one bed, three grown adults  The room was filthy. Stains on the blankets and the rug hadn't been cleaned or even vacuumed in ages. There was hair all over the bathroom and it smelled very strongly of smoke. There were cigarette burns all across the curtains. The fridge smelled and was sticky. Got a hold of Hotels.com. They tried to reach out to the manager of the hotel and they were hung up on multiple times. Needless to say we left. Please be careful before considering this hellhole.",
      "rate": 1.0,
      "tripDate": " September 2023"
    },
    {
      "title": "The Noire Suite has bedbugs",
      "text": "I would NOT recommend staying here, until they have their rooms exterminated. We did a pre-Valentines stay at this hotel this past weekend. We had stayed at the Westlake previously, and we were very impressed. This time, however, was a different story. The hotel has started to break down. There were numerous minor issues, the shower leaks into the hallway, the was no coffee maker in the room, the towel rack had broken off in the bathroom... We didn't mind any of these things, as we understand that this happens over time. We slept, and had no complaints. There was no noise, the bed was comfortable, the pillows are fine. Unfortunately, when my girlfriend woke up, she had numerous locations of small bites on her. The bites are on her forearm, legs, chest, butt, side... essentially all over her.I have twice messaged the manager, Andy, and received no response.",
      "rate": 1.0,
      "tripDate": " February 2023"
    },
    {
      "title": "There is a reason they provide complementary earplugs!",
      "text": "Our first impression was good. The room looked nice, with a beautiful bathroom and a few thoughtful touches. But the bed was domed in the middle, spilling both of us off to the sides. And then, shortly after we went to bed, the NOISE began. Our room was directly over an adult entertainment establishment, and very loud music of a certain genre was blasted at us for a few hours.Our stay was in January of 2019 (not 2021, but that was the best choice offered). If the noisy business neighbour went under during the pandemic, this might be a nice place to stay.",
      "rate": 2.0,
      "tripDate": " January 2021"
    },
    {
      "title": "Stay Away from this place!",
      "text": "If there were less than one stars to give, this hotel would receive this from me! We booked a room to stay in the city for a small New Year's eve gathering about a month ago, before the omicron variant. Unfortunately my husband was not feeling well and we decided not to travel. I tried and tried to get a hold of Andy, the hotel manager numerous times in the week leading up to the date, without any response. He took our money and never even called back to discuss the cancellation. STAY AWAY from this awful place!",
      "rate": 1.0,
      "tripDate": " January 2022"
    },
    {
      "title": "WOW!  A real gem!",
      "text": "We stayed at the Westlake August 2019, and it blew our minds.  The rooms are so unique, well appointed and just plain cool.  The bed was super-comfy, and we felt like the staff had thought of everything we might need - all the little details had been considered (thank you for the chilled bottle of bubbly for our anniversary!)We couldn't get enough of the design aesthetic and detail that has gone into this boutique hotel. We stayed in the Cornerstone Suite (stunning), but you can't go wrong with names like \"Bye, Felicia!\" and \"Netflix and Chill\"!The staff (led by hotel manager, Andy) are friendly, extremely helpful, and were clearly on a mission to make our stay memorable - thanks guys!  The few questions we had were answered quickly and efficiently.The location was close enough to downtown that we had great access to our events, but also just far enough out that we got to enjoy walks along the lake and relaxing at the nearby park by the lake.Parking was a little challenging at first, but again, hotel manager Andy helped us out with some local knowledge.Overall, a top experience, and unlike any place we've ever stayed...highly recommended.Chris & Martyna",
      "rate": 5.0,
      "tripDate": " August 2019"
    },
    {
      "title": "Terrible Customer Service",
      "text": "The manager, Andy, is not a man of his word, beware of your dealings with him.Enroute to our stay at the Westlake we received an e-mail that the suite we wanted had been double booked. Andy apologized, told us we’d been moved to the Neverly Hills suite and promised a 15% discount off the rate. We were charged the full amount and Andy never responded to my e-mail asking for the mistake to be corrected. Such a unique property and a great concept, but you’ve got to look after your customers Andy.",
      "rate": 1.0,
      "tripDate": " February 2022"
    },
    {
      "title": "Great for locals wanting a getaway, or for travellers",
      "text": "We live in the city but booked this more as a get-away. In short, this is a great find within Toronto that I wish I had found sooner. I would recommend this for both travellers as well as locals who are looking to get away.   Here are my specific comments - stayed in the \"Noire suite\"1.  The location is right on a streetcar line on Lakeshore. We didn't take it but it looks like it would be around a 30 min commute to get to/from downtown, and TTC line 1.  There is a also a Shopper's Drug Mart, Tim Horton's, LCO  and a few restaurants nearby so that travellers from out of town could easily walk to get groceries, liquor and coffee.2. \"check in\" was easy. I was sent codes for the front door, the door leading to the suites themselves, and the actual suite, the night before.  3. Our suite was extremely clean. It was equipped with glasses, plates, pots, pans, utensils. It had a microwave, sink, toaster fridge (I had trouble finding it as first because from the outside it looks like a dishwasher), and a cooktop that says it is for \"warming up\" only.  We didn't try to cook in there, but I suspect you would be able to cook some basic things like eggs, microwavable meals, breakfast stuff etc.  It had a bench area where 4-5 people could eat.   This fits with the AirBNB concept it advertises itself to be.4. Our suite seemed quiet. We didn't hear anything from outside nor other guest although I don't know how full it was the night we stayed. Of note, there is language written in the facility that no partying is allowed. HOw they enforce that is unclear.5. Unlike a traditional hotel, I didn't see a front desk where someone is physically located. However the manager/owner did supply a phone number to call/text if needed. We never had to do it so can't comment on responsiveness.6.  The suite we stayed in was very nicely decorated, like one would consider decorating their own place.7.  Temperature control seemed to work well.8. My only semi-negative comment is that with the Noire Suite, there really isn't any place to keep clothers. They provide some hangers that hang from piping (that is likely decoration rather than functional), to hold around 10 items of clothing. There is also one of those things to rest a suitcase. This might be an issue with this particularly suite if you are staying a while and have a decent amount of clothes.In short, we would VERY HIGHLY recommend this to people coming from out of town. It is on my list of places to try if looking for a place away from home for a small get together or to go back to after a night out.  It is a very reasonable trip from here to downtown whether it is via public transportation as I described above, or Uber (looks to be around a $20-25 uber ride to downtown).  For people coming into town to see a show or sports game, this is a very comfortable and MUCH more affordable option than staying downtown. The only downside is that if you want to be right in the middle of the action and crowds, this is not for you because it is located west of downtown.",
      "rate": 5.0,
      "tripDate": " June 2020"
    },
    {
      "title": "Enjoyable, ",
      "text": "I can say this hotel is home away from home, Location is perfect walking distance to parks and not far from down town Toronto by car, Quite and safe area, Easy communication and clear instructions from the administration, Very clean and comfortable with equipped kitchen, Thanks for thinking of all the details to make our stay in your hotel so special,",
      "rate": 5.0,
      "tripDate": " May 2024"
    },
    {
      "title": "Great boutique ",
      "text": "Second stay here. Came again with my girlfriend. We stayed in the bad and bougee suite. So big with a king size bed and a mannequin with an apple on its head. Fun and interesting room. We rented the vr system for the evening because it was raining. We spent some time on the patio. It’s was quiet and we had to it ourselves. Took a walk around the place- there’s Buddhas and old surveys on the walls. A few retro Video game in the lobby. Really enjoyed our stay. Andy, the hotel manager, was great with his big dog. We’ve already booked our next stay for December New Years. Plenty of places to eat right around and one nice dinner place around the corner. Love this place and highly recommend.",
      "rate": 5.0,
      "tripDate": " September 2019"
    },
    {
      "title": "Cool concept, great room",
      "text": "We loved our stay at The Westlake.  But it is a unique process.  There is no staff at the hotel.  Everything is done remotely.  Be sure to get you email with entry instructions before you go to check in.  We would have given 5 stars, but the parking is very difficult.  There does not appear to be enough spots for everyone, especially if somebody brings more than one car.  All in all, we had a very positive stay.",
      "rate": 4.0,
      "tripDate": " July 2019"
    },
    {
      "title": "Holiers",
      "text": "Just back from a week stay here, and have to say the place is amazing! Very spacious, clean and close to all the essential amenities. Stayed in the bye felicia suite and it was gorgeous. 3 bedrooms, one large main bedroom, and 2 rooms with nice big beds. The beds were so comfy, which is always welcoming on holidays. Such a great location, with a bakery, drug store, pizza shops to name a few! Street car was right outside the door which was defo an added bonus! A great place if holidaying in Toronto!!!!",
      "rate": 5.0,
      "tripDate": " October 2019"
    },
    {
      "title": "Family stay was perfect",
      "text": "I stayed at the Westlake for 3 nights in connection with a family wedding. The location was perfect and very close to the wedding site. Although it was recommended by the bride's parents. The room was perfect and I particularly liked the friendliness and helpfulness of the staff. I highly recommend it to anyone who is in Toronto and likes the intimacy and peacefulness and quiet of a first class small boutique hotel",
      "rate": 5.0,
      "tripDate": " October 2019"
    },
    {
      "title": "awesome bathroom, very cool",
      "text": "Clean and updated room, helpful staff, awesome bathroom. Plenty of lights, cool, and quiet. Great location. Bed was comfortable with silky sheets. We really enjoyed our stay and would stay here again. Guy that coordinated our stay was super nice. Andy? Would recommend.",
      "rate": 5.0,
      "tripDate": " October 2019"
    },
    {
      "title": "Beautiful stay in this city, interesting hotel, very much boutique.",
      "text": "The room was large with a beautiful bathroom. We were upgraded me to a larger suite which was outstanding. Bathroom is 5 stars, nice clean and beautiful space. Very comfortable bed and good lighting throughout. We tried out the VR rental one night we stayed in. If you have never tried it do it once. They have an outdoor space on the 2nd floor. We found it to be in a very good location. I would definitely recommend this hotel. In town less than a week but wishing we could have stayed longer. Beautiful city Toronto! Its a boutique hotel so thats what you get. Great Value.",
      "rate": 5.0,
      "tripDate": " October 2019"
    },
    {
      "title": "SOHO is my home",
      "text": "I have been a loyal guest at the SOHO for the past year. In my opinion, the level of attention to every detail from the personal interactions to cleaning and maintenance are unsurpassed. Do not hesitate to book a room at the Westlake whenever you are in Toronto - you won't be disappointed.",
      "rate": 5.0,
      "tripDate": " June 2019"
    },
    {
      "title": "Excellent site, polite and well reccomended",
      "text": "I arrived after a long journey to discover that I had been upgraded for free to a luxury Room - what a fantastic surprise! The room was a good size with plenty of features and a luxurious bathroom! I had quite a lot of contact with the staff and found them to be knowledgeable and polite. And they had no problem letting me check out a couple of hours late on my day of departure! The location was excellent - I did not experience any noise problem whatsoever. I would definitely recommend this hotel - it was the best I stayed in during my trip around North America.",
      "rate": 5.0,
      "tripDate": " October 2019"
    },
    {
      "title": "Bussiness as usual, the way i liked it",
      "text": "We use the Westlake for business 6-8 times this year. For business, this location is difficult to beat if you have meetings downtown but want to be close to the airport. Easy access to Gardner. Facilities are great and very clean, never fails to meet expectations. Sorry for the late review guys, finally got some time to thank you for your consistency.",
      "rate": 5.0,
      "tripDate": " October 2019"
    },
    {
      "title": "Loved it",
      "text": "Stayed for two nights recently and really enjoyed it.   Hotel is chic and very clean.  It’s a great location for those looking to be near the airport, but also not far from downtown.   Would definitely recommend this place.",
      "rate": 5.0,
      "tripDate": " August 2019"
    },
    {
      "title": "NO CUSTOMER SERVICE - DON\"T WASTE YOUR TIME AND MONEY",
      "text": "Good luck getting a hold of the manager at this place as i've been trying for MONTHS with no response to get resolve an issue with checking in. Their call centre will take your number, guarantee that the manager will contact you as this \"hotel\" has NO direct line to anyone at the hotel. it's an absolute farce",
      "rate": 1.0,
      "tripDate": " January 2023"
    },
    {
      "title": "Great stay",
      "text": "Love this place - been here 4 times and loved it every time. They are now offering free snack tray for the stay. Very thoughtful and generous to the guests. Staff was very attentive and room was absolutely clean. I will be back over and over again.",
      "rate": 5.0,
      "tripDate": " June 2020"
    },
    {
      "title": "Customer Service is Terrible",
      "text": "My wife and I booked a room but had to cancel. They have purposefully ignore our request and will not return any form of communication, email, phone,etc.Do not book here is your have the slightest chance of needing to make a change of rebook. They will not get back to you in purpose just so you lose your money. Terrible company.",
      "rate": 1.0,
      "tripDate": " November 2022"
    },
    {
      "title": "Great quiet stay",
      "text": "Great feel nice look great service and perfect location. Second time at this hotel. Coming to Toronto would always stay here. Easy access to the city and Niagara falls and the airport. A new concept hotel with easy access.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Great Find in Toronto",
      "text": "Great place - stayed for 3 nights. Came late and just wanted to go to bed, but didn't get any food. The hotel had snacks for us in the room. Nice touch. Clean, neat and perfect place. Andy was great at the manager. Well done Westlake",
      "rate": 5.0,
      "tripDate": " June 2020"
    },
    {
      "title": "Weekend Getaway Hidden Gem",
      "text": "Would recommend this place for a fun weekend getaway. Room was very impressed better then the photos.  Booking and check in was seamless and convenient.  Great location.  Can’t beat this price better than any fancy downtown hotel.  A nice hidden gem.  Even found a bonus roof deck that we didn’t know or wasn’t listed on the site.  Great for dinning and enjoying wine under the stars.  I’ll be back",
      "rate": 5.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Great stay",
      "text": "We really enjoyed it. Everything was great, contactless entry, super cool interior and comfy pillowy bed. It was a great getaway spot. Well located and easy access with free parking. Highly recommend this hotel.",
      "rate": 5.0,
      "tripDate": " October 2020"
    },
    {
      "title": "Best Kept Secret in Toronto",
      "text": "I found the Westlake because I was attending all-week Queen's continuing education at The Old Mill. I didn’t want to stay on the premises. The Westlake (15 min drive to the Old Mill) is what the Drake used to be 15 years ago: beauty in the edgiest part of town. I loved and owned a house in Queen W W back in the day: we moved as gentrification creeped in. The Westlake brought me back. The Westlake: full on boutique hotel minus the reception: all code entry. I’ve stayed here (Noire suite) a few times and enjoy how secluded and cozy it is. This week I discovered a multi-arcade game (free to play) in the lobby: I play Defender and all those old school 80’s game whenever I come in or out. Super cozy room with kitchenette which is awesome for longer stays. LCBO nearby. Not close to downtown but if you choose to stay here there is a streetcar that will take you there. Not much in terms of close restaurants but there are a few sushi spots and…Nimman for the best Thai ever.  The Westlake is the type of spot you want to discover now before the Lakeshore West Village is gentrified. Best place ever.  And close to the lake for nice walks.  What a gem.",
      "rate": 5.0,
      "tripDate": " September 2019"
    },
    {
      "title": "Great spot for staycation or vacation in the city",
      "text": "I stayed at the Westlake for one night on September 5. I had this whole thing planned for a friend's birthday and Andy was more than helpful. I can't thank him enough. I dropped off everything to them the morning of and they set it all up in the room for us before we returned from dinner. We had excellent service. I asked for an iron and an ironing board and it was there so quick I could hardly believe it! I would stay there again in a heartbeat. Granted, it is a bit expensive but worth every last dollar. It's the kind of room in which you can't help but feel romantic and frisky. Well, it didn't work for me ;-) but it can for the rest of you! All in all, an excellent place. I give it two thumbs up...way up. I thought the service would be bad and the employees snotty but they were all very polite. They let me check in early (11am) and were very helpful - Enjoy your stay!",
      "rate": 5.0,
      "tripDate": " September 2019"
    },
    {
      "title": "A lovely stay!",
      "text": "Super Cute! We loved our stay here. It was our first time and will go back. The rooms are clean and comfortable, the bathrooms are spacious. Our shower had two shower heads. The beds are comfy and theres california shutters to keep the light away in the morning. It was a nice touch to have a full kitchen there with a coffee maker, a toaster and we also had a fridge in our room. We were able to have brunch one morning (this place called ‘School’ in Liberty Village. Its not an actual school but their blueberry flapjacks are delic!) And we made breakfast for the other two mornings in our room. The check in took us a minute and there is parking behind the hotel. Excellent hotel for those travelling from out of the country as you have the comfort of your home and it makes for a great long stay. P.S. Theres a drug mart and grocery store right outside, maybe a 10 second walk.",
      "rate": 5.0,
      "tripDate": " September 2019"
    }
  ]
}