{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "The Anndore House",
    "url": "/Hotel_Review-g155019-d12727078-Reviews-The_Anndore_House-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.5",
      "reviewCount": 686
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "15 Charles St E",
      "addressLocality": "Toronto",
      "postalCode": "M4Y 1S1",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/1c/e3/61/5a/exterior.jpg?w=500&h=400&s=1"
  },
  "description": "More than a building. The Anndore House is a whole new way to experience Toronto. It’s eating, sleeping, working and playing in a one of a kind destination with a distinctively creative soul.",
  "featues": [
    "Paid private parking on-site",
    "Free High Speed Internet (WiFi)",
    "Bar / lounge",
    "Pets Allowed ( Dog / Pet Friendly )",
    "Business Center with Internet Access",
    "Baggage storage",
    "Concierge",
    "24-hour check-in",
    "Parking",
    "Wifi",
    "Coffee shop",
    "Restaurant",
    "Complimentary Instant Coffee",
    "Complimentary tea",
    "Non-smoking hotel",
    "24-hour front desk",
    "Ironing service",
    "Air conditioning",
    "Housekeeping",
    "Room service",
    "Safe",
    "Iron",
    "Wake-up service / alarm clock",
    "Refrigerator",
    "Flatscreen TV",
    "Non-smoking rooms",
    "Suites"
  ],
  "reviews": [
    {
      "title": "Spotless clean and Cavalli chic",
      "text": "Great experience, we are in hotels regularly during our Covid summer vacation and we alcohol wipe all surfaces and high touch areas in our rooms upon entry.  This place tops all of the 4 and 5 star places we visited, our white wipes remained white after the job on all surfaces including shelves.  The Cavalli faucets, separate WC shower and sink dressing areas are great, professional lighting and industrial decor, very nice.  Plus they welcome our little fury travel companion with reasonable fee and not assigning a rundown room for it, beautiful.",
      "rate": 5.0,
      "tripDate": " August 2020"
    },
    {
      "title": "Easy living in the heart of Downtown Toronto",
      "text": "We spent over 3 weeks here in December and early January . The location is excellent , less than a 100 metre from the crossing of Yonge and Bloor There is an excellent restaurant ( Constantine ) and bar in the hotel . The Crow’s Nest cafe always has really friendly staff and great coffee .It is excellent for a long term stay even in terms of the layout . You can back and forth to your rooms from the outside without having to cross reception ensuring a greater degree of privacy. The rooms are fun - I was on the 9 th floor and had a pretty decent view of the downtown buildings. They have quirky things like a record player which is also a blue tooth speaker. The key factor behind an enjoyable 3 weeks was the staff. Every interaction whether at reception, the bar , the restaurant or the cafe was very friendly and made us feel comfortable and  welcome.",
      "rate": 5.0,
      "tripDate": " December 2021"
    },
    {
      "title": "Spacious room, spotless bathroom, convenient to museums and theater.",
      "text": "The room was immense compared to other hotels I’ve stayed in. Rooms were cleaned daily with fresh towels, ceramic mugs *as opposed to paper cups for coffee* and fun touches like a little record player with a few LPs, mini fridge.  Bathrooms and closets were huge and there was lots of room to lounge and sleep.  Great beds and comfortable nights.Convenient to many theaters and museums and nightlife.",
      "rate": 5.0,
      "tripDate": " March 2022"
    },
    {
      "title": "Hotel was just fine, but too little was offered COVID notwithstanding",
      "text": "I stayed at Anndore House whilst visiting my family in Toronto. My room was large, but sparse, with a malfunctioning television and toilet. I was advised when I arrived that all hotel amenities were closed due to COVID and nothing was on offer to compensate. Instead of a coffee maker there were instant coffee packets. The nice looking bar was closed and no alcohol was in the room, complimentary/compensatory or otherwise, and the only food on premises was $5 glass jars of gummies. Perhaps at another time this would be a nice place to stay, but compared to other hotels I’ve stayed at in North America and abroad that I have stayed at during the pandemic, this stay was my worst.",
      "rate": 2.0,
      "tripDate": " December 2021"
    },
    {
      "title": "Great Boutique Hotel…. Needs more pillow alternatives",
      "text": "Nice boutique property in Toronto. Overall nice rooms and great location.  Weird that in house restaurant is not part of hotel so therefore no Hyatt Globalist benefit of free breakfast and 500 in lieu of free breakfast never deposited into my account. Had a little excitement when I was there and homeless encampment next door caught on fire. 15 minutes all fires were extinguished and next morning all debris was efficiently removed.Main issue for me is the lack of pillow choice. Should have choice besides high thick foam pillows!!! Was tough to sleep on!",
      "rate": 4.0,
      "tripDate": " May 2022"
    },
    {
      "title": "Better than it was, but not great",
      "text": "The Anndore House is a short couple of blocks from the landmark intersection of Yonge and Bloor Streets, and was previously the shabby Comfort Hotel. Hyatt took over the building, hired a decorator who thinks dark brown with black accents is a cheerful colour scheme for hotel rooms, and installed a restaurant and bar in most of the ground floor space. They also doubled the room rates, which still leaves them lower than other midtown hotels. The Anndore seemed clean, staff were helpful when I needed a couple of small things, and somehow, amazingly, the Comfort Hotel room doors that used to close with a jarring crash have been softened somewhat. However, practically everything in the room seemed badly arranged (awkward bathroom, tiny strange light switches, duvet suitable only for short people) and the bar didn’t seem to be open any time I wanted to make use of it. Your experience may be better, as long as you have the arm strength to open the huge heavy entrance doors. Also, watch out for the little slope in the floor right in front of the elevator.",
      "rate": 3.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Avoid the Hotel at All Costs",
      "text": "Front desk service is challenged by the fact that it doubles as the reception area for what is a very good and popular restaurant. Rooms are small and there is no counter space in the bathroom. The cute but useless record player in the room takes up valuable counter space and has the fidelity of the sound of a drowning cat. There is a very trendy electric kettle in the room with a small baton of instant coffee. The good news is that if you want a real cup of coffee in the morning, there is a Tim's or a Starbuck just around the corner. Overall, I would give the place a five star rating...as a hostel.",
      "rate": 1.0,
      "tripDate": " February 2022"
    },
    {
      "title": "2 Day Holiday in the City at The Anndore House",
      "text": "My husband and I recently stayed 2 nights at The Anndore House in January. We were in the city to celebrate a birthday and see some of the sights. It was a wonderful holiday. The hotel is very special and we noticed how friendly and helpful everyone we encountered was. Upon arrival, Florian checked us in. He was charming and friendly and I made a point to remember him as his service was top notch. We were booked in a beautiful suite called The Residence on the 2nd floor. It was a corner unit and it had everything we could want, including a really cool living room area with record player and a fun selection of albums to play. The bathroom was enormous with the biggest shower I've seen in a hotel. There was a lovely card and some bubbly and cookies awaiting us. It was very, very special. Our only regret is not having the time to dine at Constantine (which we had tried for lunch a year prior). We hope to return and would recommend this hotel for any kind of traveller. It was conveniently located for all our excursions so we were able to walk around the neighbourhood and easily hop on the subway. Thank you again to Florian and especially the General Manager, George Sovatzis. Thank you George for a memorable stay for our special occasion. See you soon, we hope!",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Good in parts",
      "text": "Great location on the edge of Yorkville and Church/Wellesley. Staff were just ok. The front of house were brusque and off-hand and there was no visible management  which explained the flat vibe.We had to move rooms because of loud music coming from the bar every morning at 7.00am (we were on the second floor). Our friends on the 3rd floor had the same problem. We got switched fairly easily to a room on the other side of the hotel.Had two days (out of a 10 night trip) where our room wasn't serviced at all which I think is really poor.The main thing was the staff though. No good mornings from anyone. No attempt to see how our stay was. No attempt to even offer us breakfast. Interestingly the whole time we were there I don't think I counted more than a handful of people having anything in the morning. There is a good coffee shop which you can access via the bar area although we only found this out my being nosey ourselves.As for dinner, they have an upscale restaurant called Constantine. But there is no menu to see anywhere in the hotel or even at the restaurant entrance. Drinks on the lovely patio area out front are somewhat spoiled by the fact that they have a very poor choice. Plus it's only open from 4.00pm every day despite being a great asset to the hotel.This place could be awesome with some care and attention and staff training.",
      "rate": 3.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Globalist Review: A centrally located chic JdV Hyatt property + amazing HotBlack Coffee shop",
      "text": "Rooms at the Anndore house were modern and spacious enough. All amenities provided were working and appreciated: from the record player, pipe exposed faucets, lighting fixtures, fridge, rainfall shower, light controls and so on. Parking in the garage of the hotel is complimentary only for Hyatt Globalist Members. Check in was simple, granted early check in and early check out from the hyatt mobile app. Hotel was sold out for Sunday night but its as if you did not have any issues with crowding. My only comment is regarding the elevator - can be slow at times. A Big thank you and gratitude to Momiji Kishi of the HotBlack Coffee shop in the lobby of this hotel who was simply amazing and professional to make the breakfast experience phenomenal. I had a very early checkout and she was able to accomodate the breakfast situation for all guests as we would be leaving before her coffee shop would open. She was very personable and her breakfast is simply delicious. Don't miss out on her cold brew coffee, green/orange juices, sourdough egg sandwich, strawberry and banana bread sweets 🥰 i would return here on a future stay",
      "rate": 5.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Pride 2022 weekend.",
      "text": "The room was super cute with an old-fashioned with a rustic-industrial feel. The room was clean and well decorated, and the houskeeping and room service was on point. However, the faulty lights in the room kept turning on and off at random (sometimes in the middle of the night). At one point it was so bad I had to call the front desk about them turning on and off every 30 seconds. To which the woman at the front desk replied \" there's no one here to fix it until 3pm.\" Another thing was that the hotel advertised their rooms as being soundproof. Totally untrue...any noise from a neighbouring room or from the hallway would easily wake you up.Aside from that the over-all stay was great and super close to all the action and Pride festivities. They just need to fix the stupid lighting systems in the rooms.",
      "rate": 4.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Travel Guru",
      "text": "No Breakfast or daytime room service lacked services of a 4+ star hotel and price. More like a 3 star. Expected more for a Hyatt hotel. Was thinking and hoping the hotel would have had more of a cool and upbeat vide. I think they tried but missed even the vinyl record player in our room did not work.",
      "rate": 3.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Anndore house",
      "text": "I enjoyed staying here. My room was clean and I particularly enjoyed listening to the portable record player with the Doobie Brothers record provided. The food at Constantine was ok but I wanted more selection.",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Great location - property can use a bit TLC",
      "text": "You cant fault the location, and this is why we chose this hotel.  It is in the heart of Toronto, we easy access to shops, cafes and restaurant.  Vibrant, safe area, walking distance from many attractions.The hotel itself is very nice.  Feels new, definitely modern with a great dining space and bar.  Room had a few issues, maybe it was new that s why?  The room key didnt always work in the lift, or the door.  The light switch frame fell off the wall.  Minor things that take away from the experience though. Service was overall good, reception staff, tentative, most of the times and willing to help.  Customer service style a bit haphazard, or just quite different from what you traditionally anticipate as customer service in a hotel...  For these reasons I think that value for money was not quote there, even though you basically have to pay for being in the center of Toronto",
      "rate": 4.0,
      "tripDate": " November 2021"
    },
    {
      "title": "One of my Top 2 places to stay in Toronto Downtown",
      "text": "This place is amazing! The style of rooms, the helpful professional staff at check in make this a overall great experience.  Great well lit Public Parking right across the Street. Secure entrance makes you feel safe and in a very nice area of Toronto a minute walk to Bloor St. I keep rebooking and will continue to.",
      "rate": 5.0,
      "tripDate": " February 2022"
    },
    {
      "title": "Nice hotel but noisy air-con",
      "text": "This hotel is in a great location for exploring downtown Toronto.  The beds are comfy and the room is nice but the air con is really noisy, and this observation is based on us travelling over the last 3 months and staying in a lot of hotels.The ladies at reception said that “some people were too sensitive” and that if I turned the air con off at night that might help.  When we asked to move rooms their first question was - have you messed up your room?  Not, really customer focussed.  The second rooms AC was a bit quieter but it is still a really noisy system. In the second room - which was supposed to be quieter there was a letter from the manager apologising for the construction noise next door and two sets of ear plugs.",
      "rate": 3.0,
      "tripDate": " August 2023"
    },
    {
      "title": "Upcharges are excessive",
      "text": "Room was unique and clean.  I had a problem with the excessive fees and tax es and on top that  an 85$ a night for pet fee which i wasn't informed until i arrived at this so called pet friendly hotel.  The fees and pet upcharge doubled price of the room and parking is very expensive.   We chose city parking across the street.  I wouldn't return based on the upcharges are way too much.   No pool or any resort type amenities to justify those resort/tax fee and highest pet fee ive ever encountered and I travel alot with my dog.  There response was indifferent.   Just states we are charging your credit card on file.",
      "rate": 2.0,
      "tripDate": " April 2023"
    },
    {
      "title": "Believe that this is a 3 star review & nothing more",
      "text": "I picked this hotel based on the photos and location. Very cute boutique hotel. Upon arrival I was notified that valet parking is NOT complimentary contrary to what is stated on the website. The phone number on the website says it’s out of service so it was hard for me to find a number to contact before I arrived. I was not greeted as a Hyatt member nor was I greeted with any above average hospitality considering how much I payed to stay for one night. Rooms are cute, but you can tell they are built cheaply. Cheap bed and pillows, my bed at quality inn the night before was comfier. I was excited to put on Netflix and chill for the night before the following day of travel I had. I messed around with the tv for over an hour to try and connect my phone which I then realized wasn’t compatible with iPhone. As stated on a list of complimentary things in my room, I called down to the lobby to get a chrome cast set up to my room. They said chrome cast isn’t working due to tvs being updated but offered an HDMI for a laptop ( which I did not have). I asked how the hdmi would be any different than a chrome cast and they didn’t have an answer for me. I asked them to please just bring it up for me to try. I got it, plugged it in. It said not enough power because of a unknown power source. It was an iPhone block instead of the google chromecast original power block. This is why it didn’t work. I was also uninformed until much later that there were even TV channels available. Once I got to the channels it was very limited. Yes this is a rambling review but to think in 2023, paying over $300 to stay in a hotel, I could watch something other than cable. After asking what they were going to do to make this matter right for me they offered me breakfast. Unfortunately the timeframe didn’t work for me to have it so no comment on that. There are no other amenities in this hotel. Truly a 3 star or less stay. Staff were not very nice at all. Not rude per say, but didn’t make sure you felt welcomed or valued. Spend your money elsewhere,  stay at a 3 star like the Alt or Marriott.",
      "rate": 3.0,
      "tripDate": " October 2023"
    },
    {
      "title": "More than a hotel and what I was expecting",
      "text": "Evie at check in was as sweet as pie; off to a good start! The room was excellent, everything you could ever need, quiet even though it’s situated right downtown, great bed, mini fridge, bathroom to die for and the decor just hip enough without going over the top.  Very classy; even had a Smeg kettle for morning tea.We decided to have drinks and nibbles and the host at the restaurant suggested we go upstairs to the upper patio..awesome.!  A few floors up a huge patio surrounded by lush greenery and mature trees muffled the noise and made for a very pleasant cocktail and appetizer experience.  Duck mousse, hummus and the burger all excellent.  I can’t remember what it was called but it’s a cocktail with lavender in the ingredients...I’d go back just to have one.  A really nice surprise, great service in a non pretentious establishment yet stylish and welcoming ...thanks for a wonderful stay!",
      "rate": 5.0,
      "tripDate": " August 2021"
    },
    {
      "title": "Diamond in the rough!",
      "text": "We loved our stay at The Anndore House.  The staff were very friendly and went out of their way to help us check in early and were also able to store luggage on the day of departure. The hotel and rooms were spotless. We loved our room, with 2 queen beds and a seating area. The room also had a fridge which we were able to use. I know it maybe it doesn't go with the look but maybe the room would benefit from curtains, as the white slatted blinds do let a lot of light in when it's daylight outside. The hotel was surprisingly quiet for the location. One thing I will say is the neighbourhood is questionable. The hotel is located right next to a subway station which is great for getting to Downtown Toronto, however I would not walk around the area of the hotel at night,  especially not alone. We noticed a large number of drug users (openly taking drugs in the surrounding streets), and we went to a play park a  5 minute walk from the hotel where a large number of people were openly taking A Class substances. I would not let this put me off staying at the hotel again, but I guess as with every major city across the world it's important to keep your wits about you, keep valuables close etc. Overall a great stay and I would definitely stay at the hotel again.",
      "rate": 5.0,
      "tripDate": " June 2023"
    },
    {
      "title": "Avoid. Overpriced “boutique” hotel with no Hyatt benefits.",
      "text": "We were pretty disappointed with our one night stay at the Anndore House. Based on reviews and the hotels’ marketing it comes across as a boutique luxury property and while although there are some nice touches, it really falls short. Rooms are very small with standard rooms being under 300sqft and upgraded rooms under 400.Only one (small) elevator was working during our stay and the elevator consistently took awhile.Walls were very thin and we could hear people in the next room/ hallways continuously.Staff were basically non existent. No luggage assistance, bare minimum communication at check in, etc. Bath gels/ shampoo were in large bottles but were all almost empty which was disappointing. As a Hyatt Globalist there were essentially no benefits. “Breakfast” is a joke and includes a muffin and a coffee at the attached coffee bar. For a Hyatt jdv property this is really disappointing. Only reason 2 stars is that we found the bed comfortable, the retro decor interesting and the location was convenient for us. Overall, if you like overpriced “boutique” hotels on Younge street then go for it, but if you want to actually enjoy your $300+ experience, go elsewhere.",
      "rate": 2.0,
      "tripDate": " December 2022"
    },
    {
      "title": "Horrible Customer Service",
      "text": "My room was not cleaned until 4/4:30 PM on the first day after I checked in, the room had water concerns with temp and pressure. When you would speak to anyone at the front desk it was like they were doing you a favor. Never felt this disrespected at a Hyatt property. I wish I just stayed at the Regency like I normally do. I wasn't even asked for Identification when I checked in. It was the worst place I could've picked. The gym is not located within the building, at check in I had to wait for about 10/15 min for a valet. Then the same thing when I came to pick up my car. However, after the first day it was fine. There were price discrepancies, only of 15/20 CAD but still it caught me off guard.",
      "rate": 1.0,
      "tripDate": " December 2023"
    },
    {
      "title": "Not lived upto expectation and staff indifferent",
      "text": "We stayed for Pride and our friends 40th Birthday. We booked for one week the an additional 2 days booked separately a couple of weeks ago. We agreed to stay in our original rooms for the additional 2 days (the receptionist said we could have to move) but she said we would be refunded on checkout for using our existing room (which was priced differently to the room for the other 2 days). On checking out the receptionist member of staff (wearing a headscarf) said there was nothing she could do as it was booked by a third party. She was rude and indifferent and we also saw her deliberately belittle another member of staff in front of us. She should NOT be working in hospitality. The hotel was fine for the week but avoid the bar, especially outside as it's extortionately expensive.",
      "rate": 4.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Lovely funky hotel with excellent services",
      "text": "I have stayed in various hotels in Toronto and Anndore has by far the nicest room. The decor is retro + industrial and is exactly like shown on their website (less the flowers).The staff is friendly and helpful. Special shout out to Augusto at the front desk for the nice warm welcome and helpfulness. It really gave a first awesome impression of the hotel. Room cleaning staff is also very helpful and responsive for missing items from the room.Inside the room, spacious walkin closet and sitting area with style. Lots of well-organized cupboards and shelf space throughout the room you can move your own whole bedroom in here.Some people commented on the safety outside of the hotel. It's downtown in a big city and what more needs to be said?As for other people complaining about the thin walls and noise from other rooms. I also did not find any problem. Yes you can hear some noise from the hallway but it's not different than what I have experienced in other hotels.There is no gym or swimming pool but I knew it before I booked.",
      "rate": 5.0,
      "tripDate": " June 2024"
    },
    {
      "title": "Promised discount",
      "text": "I had to extend my stay by two nights due to a flight change. I emailed the hotel to inform them of the two night extension. When checking in, I was told that the two extra nights would be discounted as I had opted to stay in my original room and the two night extra were of a higher rate. When checking out, I was abruptly informed that there would not be a discount as I opted to stay in the original room Very dissatisfied with the way this was dealt with and also being given false information",
      "rate": 4.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Convenient location and attentive staff",
      "text": "I travel to this city quite often and have been in search of a hotel with a convenient location.  On my recent visit I did just that when I happened upon this stylish and trendy looking boutique hotel.  The hotel was within walking distance to everything I needed and everyone I was there to visit.  Very close to subways, restaurants, parking, Yorkville shopping and groceries/cafes.  The rooms are very spacious and offer some unique touches not normally found at other hotels.  It is nestled within a neighborhood off the main streets so you feel like you are in a home away from home.  From the walkup to the entry, the Anndore house is very esthetically pleasing. The staff are very attentive and friendly. This just may be my new \"go to\" for my frequent visits to this city in the future. I am looking forward to experiencing the hotels amenities (restaurants etc.) once the COVID restrictions are lifted.",
      "rate": 5.0,
      "tripDate": " January 2022"
    },
    {
      "title": "My Anndore House Experience!",
      "text": "My recent stay at The Anndore House in Toronto was a perfect blend of contemporary chic and urban comfort. The hotel’s location in the trendy Yorkville neighborhood provided a stylish retreat while being within walking distance of Toronto’s cultural attractions. My room was a haven of modern elegance, with sleek design and all the amenities I needed. The central location allowed me to explore Toronto’s vibrant neighborhoods, from Yorkville to Kensington Market. Dining at the hotel’s restaurant, Constantine, was a culinary adventure, with a menu that celebrated global flavors and creative dishes. The Anndore House exceeded all my expectations, and I eagerly look forward to my next visit to this stylish gem in Toronto.",
      "rate": 5.0,
      "tripDate": " December 2022"
    },
    {
      "title": "Friendly staff made my stay safe and relaxing",
      "text": "The rooms are spacious and well designed, the staff is friendly and informative.  When they saw me traveling with oversized luggage,  they checked me in early and upgraded the room as their appreciation to a returned customer. Overall my stay is comfortable.",
      "rate": 5.0,
      "tripDate": " August 2021"
    },
    {
      "title": "Mother Daughter weekend ",
      "text": "Location is ideal for touring Toronto. Clean, unique, pleasant decor in our room.  We slept very well in the comfy bed and as far as the windows go, if you open the wooden shutters there are blackout roll down blinds.  Very modern conveniences in the room.    Staff are friendly. Get a Citypass. Visit Casa Loma. Take the subway. Only one block away.   This hotel was a great decision for us!   And the dining room is divine. Constantine's is an amazing experience.  Three nights stay on the top floor of an exceptional boutique hotel. You will not be disappointed.  Thank for helping my daughter and I make memories.",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "A hidden gem!",
      "text": "This hotel is truly a hidden gem in the middle of bustling downtown Toronto. The rooms are beautifully decorated with thoughtful details, and it was surprisingly family friendly (travelled with a 2.5 year old and she loved it!) Central location close to all the major transit lines, but the hotel itself felt like a cozy oasis away from the buzz of the city. I'd stay here 100 times over.",
      "rate": 5.0,
      "tripDate": " September 2021"
    },
    {
      "title": "The Computer Says No",
      "text": "On Thursday I booked a room for Friday night using one of the major third party booking sites. Got my confirmation and I was all set for a quick break. I arrived Friday was at the reception, nobody was saying anything lots of scurrying around, the person who was helping me left, keep in mind there was no handover they just left, and then the new person just looked at me “it’s funny we’ve been out of that room for a week, sorry we can’t honour your reservation.” Nothing further added, yes this is a $400 a night hotel experience. I asked a couple questions but was told “sorry, third party booking, nothing I can do.” I felt like I was being guilted for using a large third party booking site the day before - curious I wasn’t aware I decided the hotels business partnerships. It reminded me of the computer says no UK comedy sketch. I continued to ask questions, can I get one night, this they could do. Imagine if I had flown in this hotel has no problems just letting you fend for yourself. So I booked for one night, no discounts or anything, I asked again let me get this straight you’re doing nothing, no credit, nothing? “Sorry, beyond my control, but the manager can contact you.” The manager did quickly reach out and then was able to fully accommodate my two night booking, in a different room. I understand mistakes happen, but when they have, without asking quality establishments take steps, offer you a discount, all I got was my original booking at full price in a downgraded room - and I only got that because I pushed back, this high end hotel was ready just to abandon me. Never again.",
      "rate": 1.0,
      "tripDate": " August 2021"
    },
    {
      "title": "Nice chic boutique in TDot",
      "text": "A chic boutique hotel located in downtown Toronto.  The room got this retro feeling to it. love the little details and how they spend the time to decorate the room with a vinyl player but sadly, the vinyl records are all scratched up so you can't really enjoy it.  Overall a decent stay while parking across the street is abit pricey.",
      "rate": 4.0,
      "tripDate": " June 2019"
    },
    {
      "title": "Deceiving",
      "text": "I booked this hotel - king size bed (on the hotel’s actual website (no 3rd party website)) Got to the hotel and the front desk went on to tell me that there were no king sized rooms available and that they were sold out of this room days ago. I expressed that I specifically booked a king but there was nothing she could do. Put us in a handicapped room to boot! No leather club chairs like shown on the website. Very disappointing for what we paid! Funny thing is a while later, while walking through the front lobby, we overheard  her informing the new arrival the same thing she told us. Hmmm ?!",
      "rate": 3.0,
      "tripDate": " October 2021"
    },
    {
      "title": "Nice Hotel but location lets it down a little",
      "text": "Stayed in a King Loft Room. The style of the hotel is really nice - sort of quirky/industrial with lots of nice touches in the room including the record player. The room is a pretty good size (used the space well), the 2 armchairs and table were a nice bonus and and bed was big and comfortable. The staff were helpful and friendly and the bar area is really nice. The main let down was the location in terms of it being noisy and a little on the rough side. Its near a main road (Yonge Street) and the windows don't offer much sound proofing. We were also next to the lift which made it noisy. Its also a bit of a walk from the main parts of Toronto. So overall it was good but think where your room is located is important and important to consider where you want to be near. Our room was on a high floor which was great but west facing which had a city view but also made it noisy.",
      "rate": 4.0,
      "tripDate": " April 2022"
    },
    {
      "title": "Didn’t know what to expect …",
      "text": "We were going to Toronto from UK for a baby shower and also wanted to experience downtown. I booked The Anndore because I wanted to stay with my daughters in the same room, “bonding, chat time” … it was amazing , beautifully clean , they delivered bath robes daily when we called housekeeping, without even asking there was a knock at the door which I opened to a lovely young man delivering extra towels. The room has lovely touches like a record player and a choice of 4 albums, we played Harry Belafonte whilst having a drink in the lounge area. Lovely Pluck sleep tea bags were on the tray for a bedtime drink and we are now obsessed with them . Location was phenomenal, Yorkville has really upmarket shops  and restaurants and felt very safe to walk around …All round wonderful stay !",
      "rate": 5.0,
      "tripDate": " October 2023"
    },
    {
      "title": "Cool neighborhood, but choose another hotel",
      "text": "The hotel presents itself as a hipster joint, and has a nice vibe with friendly staff (at first) and an outdoor restaurant.  The rooms were fine, if a bit worn out, and the daily breakfast for globalists in the coffee shop worked well.  We liked the location, close to transit, attractions, and lots of interesting restaurants.  Unfortunately the last night we were there a very loud dinner party occupied the restaurant space on the first floor between our two rooms.  We had connecting doors with no sound insulation so when I say loud I mean not just that I could hear it but that I had to turn up the TV all the way in our room not to hear it.  When it started at six I asked the front desk about it and they said it would be over at 9.  Which was fine because we went out for dinner.  When it was still going on our return I was told that \"quiet time\" doesn't start until 11 so I'm out of luck until then.  But were not talking about some intermittent noise, were talking about a large group of people continually yelling to talk over each other.  A few wandered the halls, clearly drunk.  Around 10 I called again they claimed the party was about to end.  I said it really didn't sound like it was ending anytime soon so they offered to move us and discount our last night 50%.  I accepted, and they moved us from our suite to one of their regular rooms.  Here a few days later I find they have refused to discount the last night, saying the offer was to move of or discount the stay.  This I would not have accepted, and I don't like being lied to.  I cannot recommend this hotel, because they clearly value their restaurant business above guest experience and don't stand by their commitments or respect their guests. BTW I went down to check at 11:30 and the yelling and drinking was still going strong.The neighborhood is great, though, I suggest staying somewhere nearby.",
      "rate": 1.0,
      "tripDate": " June 2022"
    },
    {
      "title": "OK - good location",
      "text": "Rooms could be cleaner, in-room amenities could be improved & rooms could use an update. Great location, comfy beds, fair price for proximity to Yorkville. Although rooms not super clean, housekeeping staff were pleasant & helpful.",
      "rate": 3.0,
      "tripDate": " October 2021"
    },
    {
      "title": "Great Location; great hotel",
      "text": "The location of this hotel is prime. It is close to a subway station and lots of places to eat. Also if you forget anything there is a drug store right down the street. The room was well planned out and there were lots of places to put things. The room I was in had the sink outside of the bathroom which was nice for more than one person getting ready. Also the seating area was actually useful. Really great.",
      "rate": 5.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Loved our visit to The Anndore House! Perfect night away!",
      "text": "Visited The Anndore House with my bestie and we had the greatest time!We booked the 2 Queen Bed Room that included tons of cute furnishings and a small seating area that was perfect for snacks and chatting. Room was clean, comfortable and instagrammable ;)Great view of Downtown, close to tons of great restaurants (we ate at Avelo on St.Nicolas street - literally a 3 min walk) and easy to park in the Green P across Charles St.Staff was welcoming and helpful. Loved the look of the cafe and Constantine - will definitely try both next time I'm in the city.Thanks for the great stay, Anndore House!",
      "rate": 5.0,
      "tripDate": " August 2021"
    },
    {
      "title": "The most unique hotel experience in Toronto",
      "text": "An incredible stay, within walking distance of yorkville. The hotel entrance was only accessible my room key after 10:00 which made the hotel feel incredibly safe and the rooms were stunning. Unlike any hotel I’ve been to before. I would stay there again in a heartbeat.",
      "rate": 5.0,
      "tripDate": " June 2024"
    }
  ]
}