{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "The Atmosphere Boutique Suites",
    "url": "/Hotel_Review-g155019-d15638025-Reviews-The_Atmosphere_Boutique_Suites-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.5",
      "reviewCount": 14
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "300 Front St W",
      "addressLocality": "Toronto",
      "postalCode": "M5V 0E9",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/17/56/aa/87/photo0jpg.jpg?w=500&h=400&s=1"
  },
  "description": null,
  "featues": [
    "Kitchenette"
  ],
  "reviews": [
    {
      "title": "Awesome location for downtown sights",
      "text": "Great location literally just across the road from the CN tower and Ripleys Aquarium. Apartment was good size and layout. Looked tired and in need of a deep clean but as we were really only sleeping here we were not too fussed. Good price.",
      "rate": 4.0,
      "tripDate": " December 2019"
    },
    {
      "title": "Location was perfect!",
      "text": "Check in was a bit tricky, only because we were arriving from Quebec and traffic was brutal that day. I called, the employee met me in the lobby across from the building we were staying in. The place was spotless! Lots of room, stunning views, and the POOL!!! The pool was incredible, with a direct view of the CN tower at night, swimming on the roof of a building in downtown Toronto - you simply can't beat it! Every staff member I dealt with was exceptionally friendly. We had a small issue with the washing machine in the unit; I emailed them on Saturday evening and they reached out right away. Everything we needed was right there. It was perfect for a family stay!",
      "rate": 4.0,
      "tripDate": " July 2019"
    },
    {
      "title": "A great location",
      "text": "Stayed in 1 bedroom apt managed by Atmosphere Boutique Suites. While I’d like to give this a 5 star rating, I cant because of a few deficiencies encountered. 5 star rating means excellent in every aspect. The main deficiency was a problem with heat/AC system   It was quite warm, 23.5 Celsius, in our unit when we arrived. It was noted the thermostat was set at 21. We set the system to Cool and set temperature at 17. The system did not kick in immediately but we figured it would after awhile. However, we woke during the night practically gasping for breath as the unit was unbearably hot. At this point, the room temperature on thermostat was registering 25 Celsius. We turned off the system and opened the deck door. Atmosphere suites was emailed regarding the problem. Two days after our arrival, we received an email stating someone would be by the next day to address the problem. We never saw or heard from anyone and we were there for 5 nights! We dealt with the issue ourselves by keeping the deck door open 24/7. Luckily, the outside temperatures were lower than normal, so we were able to keep the unit temperature comfortable in this manner. However, because we had to keep door open, we, unfortunately, had to deal with outside traffic and crowds noise. Truthfully, the bed was so comfortable, it pretty much made up for The temperature issue. The location is fantastic  The building lobby is clean and the building has security system",
      "rate": 4.0,
      "tripDate": " April 2019"
    },
    {
      "title": "Never experienced such bad service EVER!",
      "text": "Don’t bother. If you’re lucky you might get to see a room, this is not a hotel. There are two staff at concierge who do not work for this business and are just there to manage bookings for the building. Not helpful and a waist of time and effort. Mind you there were around 10 people/groups in the same situation as us unable to get keys and frantically trying to call booking agents. We gave up and moved on.",
      "rate": 1.0,
      "tripDate": " July 2023"
    },
    {
      "title": "Superb apartment in a great location. 5 star 🌟",
      "text": "We visited as a family of 5 and had a two bedroom apartment on the second floor. The location was perfect for us as a family wanting to explore the city. We were able to walk everywhere from this location. The apartment was well equipped with laundry, towels, hair dryer etc. all kitchen appliances and free wi-fi. It was beautifully clean and all in a great condition. We had no problems checking in on a Sunday afternoon and I would highly recommend these apartments to anyone visiting Toronto that wants a bit of flexibility and more space than a hotel can offer.",
      "rate": 5.0,
      "tripDate": " October 2019"
    },
    {
      "title": "Excellent",
      "text": "Everything we wished for and more spotless and right in the centre of toronto room 711 would highly recommend parking in underground car park fresh linen sleeps 6 comfortably full kitchen well equipped washer and dryer iron and board perfect",
      "rate": 5.0,
      "tripDate": " July 2019"
    },
    {
      "title": "Dangerous!!!! Management Unethical!!",
      "text": "I reserved an apartment at the Atmosphere Boutique for this week.  I immediately got my family to a nearby hotel after seeing the condition of the room.  Broken windows in bedroom and on the balcony.  There was duct tape covering the cracks! Not to mention, plenty of dust and dirt.  I contacted management immediately letting him know I couldn’t keep my family in that unit...room 711, to which he started repeating to me, “no refund, no refund, no refund.”  It’s evident this building is accustomed to getting away with taking money and falsely advertising beautiful apartments, but the fact is that these apartments are not well-kept.  Even the parking is expensive and scary.  Beware of renting from Stayeffortless and Atmosphere Boutique.  These pictures are from Aug. 7, 2019.",
      "rate": 1.0,
      "tripDate": " August 2019"
    },
    {
      "title": "Pictures highly over-rate the place - Stay somewhere else.",
      "text": "Best thing was the location.  VERY hand to downtown and Skydome.  A+Bed was comfortable,  And there was an awesome 'Rec' floor, with workout, stuff and rooftop deck and pool.But from there it was downhill.  Poor condition, flooring was coming up,  no lamps,  ceiling lights were bare bulb, bathroom was dim. 1 roll of TP, no Paper towel, Coffee maker had wrong Carafe in it, so spilled all over, Dishwasher was totally inoperable, Bath towels had a hole it it. chair was cracked, couch had a big hole in it, elevator was very slow and only 2 of 3 seemed to be functional, Clothes washing machine had a wet mop head in it. missing, based boards..  Advertised as sleeps six, but one of the bed was just 'in the hallway' !?Whats more after paying in full, they greeted us with ONE key and a demand for a $500 damage deposit.I 'complained' or reported all of the issues to get the deficiences on record as we found them and the response was \"This has been noted.  Will advise our staff to take care of the needful .\"  Whatever that means, but nothing was attended to, at any time.",
      "rate": 2.0,
      "tripDate": " August 2019"
    },
    {
      "title": "Quiet yet central Location",
      "text": "I have no problem recommending this hotel. I chose the lowest priced suite and it was exactly as described and as shown in the photos. It was clean and quiet and fully furnished with plenty of extra towels and sheets. One small thing was that I had to check-in in the lobby of a nearby tower. A nice young man there gave me the keys and charged me the $500 security deposit. It was a 20 meter walk across the street to my hotel. The location is right across the street from the CBC, the CN tower and a short walk from Maple Leafs Hockey and from Union Station to take the train to and from the airport. Three weeks later, I haven't gotten my $500 deposit back yet but when I do, this will be a 5 circle recommendation",
      "rate": 4.0,
      "tripDate": " February 2019"
    }
  ]
}