{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "The Broadview Hotel",
    "url": "/Hotel_Review-g155019-d12731277-Reviews-The_Broadview_Hotel-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.0",
      "reviewCount": 168
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "106 Broadview Ave",
      "addressLocality": "Toronto",
      "postalCode": "M4M 2G1",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/28/95/5a/72/record-player.jpg?w=500&h=400&s=1"
  },
  "description": "Housed in a 128 year-old building and historic landmark with a rich and storied past, The Broadview Hotel is an iconic gateway to the city’s most captivating neighbourhood. Each of our boutique guestrooms is refreshingly unique, and fully outfitted with luxury linens, a vinyl record player and a mini-bar offering our favourite locally sourced goods. From the spectacular Rooftop to the energy of The Broadview Bistro + Bar and the elegance of The Civic, our restaurants are a destination in and of themselves. An experience unlike any other awaits you at The Broadview Hotel. We look forward to your arrival.",
  "featues": [
    "Paid private parking on-site",
    "Free High Speed Internet (WiFi)",
    "Bar / lounge",
    "Pets Allowed ( Dog / Pet Friendly )",
    "Business Center with Internet Access",
    "Conference facilities",
    "Rooftop terrace",
    "Baggage storage",
    "Parking",
    "Wifi",
    "Restaurant",
    "Breakfast available",
    "Outdoor dining area",
    "Wine / champagne",
    "Rooftop bar",
    "Banquet room",
    "Meeting rooms",
    "Concierge",
    "Non-smoking hotel",
    "Outdoor furniture",
    "Shared lounge / TV area",
    "24-hour front desk",
    "Dry cleaning",
    "Laundry service",
    "Shoeshine",
    "Blackout curtains",
    "Soundproof rooms",
    "Air conditioning",
    "Desk",
    "Coffee / tea maker",
    "Cable / satellite TV",
    "Sofa bed",
    "Walk-in shower",
    "Bathrobes",
    "Housekeeping",
    "Private balcony",
    "Room service",
    "Safe",
    "Telephone",
    "Iron",
    "Laptop safe",
    "Private bathrooms",
    "Wake-up service / alarm clock",
    "Minibar",
    "Flatscreen TV",
    "Radio",
    "Bath / shower",
    "Complimentary toiletries",
    "Hair dryer",
    "City view",
    "Non-smoking rooms",
    "Suites"
  ],
  "reviews": [
    {
      "title": "Chic boutique hotel, highly recommend!",
      "text": "Absolutely loved this hotel! The room was great; very comfortable bed, beautiful washroom, big windows with lots of light and lots of high-end amenities available (coffee, tea, chocolate, etc..). I also particularly loved the drink stations on the room floors, they are complete with still and sparkling water and tea. The lobby bar and restaurant are also fantastic!",
      "rate": 5.0,
      "tripDate": " March 2020"
    },
    {
      "title": "Amazing boutique hotel",
      "text": "Very chic modern hotel , with great room service with an option to purchase cute little Knick knacks . In an amazing location in the city with transit service and charming neighbourhood. The hotel has five-star restaurants and a lively hip bar. The quality of this hotel reflects the price and would definitely recommend it to family and friends.",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Late Brunch",
      "text": "This was our second week at the new diner. The delightful person who waited our table, Victoria, came with experience to this new diner. It is in the location of what was another local hang out. The decor is new and fun, music 50s/60s but not obtrusive, there is a pleasant diner vibe, but not overly slick like some American chains. The food was good, prices reasonable, AC working on very  hot day( but they need blinds), it was spotlessly clean, and very comfortable.",
      "rate": 5.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Not worth the Money",
      "text": "Hotel is beautiful, record player in the room was nice … however for $250/night it was not worth it. I stayed two nights, the night before our wedding and the night of. My sister also go a room for the night of our wedding. The floors in our room were so dirty, we had to wash our feet and wear shoes in the room while getting ready as our feet were black it was disgusting. It says turn down service is included, it is not. I had left a significant tip for turndown service hoping the room would be cleaned up a bit for when we returned the night of the wedding. Nobody had been to the room. I wish I could say it was just my room but my sisters room also had a dirty floor and dirty tub/shower. The breakfast was good, although again when I booked the rooms we booked a special that included breakfast then when we went to breakfast they said our rooms were not on the list that included it. The rooftop menu is one you should look at before as it’s a bit different but the food was good. They cram all the food on these tiny little tables. They had to take away our water just so food would fit (we ordered a normal amount for 4 people to share). Overall - not worth the price, would not recommend, would not stay again",
      "rate": 2.0,
      "tripDate": " August 2021"
    },
    {
      "title": "So Disappointing ",
      "text": "I’m from Toronto and booked the Broadview Hotel for a staycation for my boyfriend and I, so that we could lay in bed all day and have room service - a service which they advertise on their website as well as in my confirmation email for the booking. After we checked in, I looked around the room and couldn’t find a room service menu anywhere so I called the front desk to ask for one and the receptionist said he didn’t know if they even do room service at all… he said he’d call me back so I waited, but I never received a call. I then went down to the front desk where the manager told me that if I don’t like the situation, I can leave and she’ll just refund me… What a thing to say to a guest who’s already unpacked a bag in their room and been looking forward to their stay… When I told her I obviously wasn’t going to do that, she said I could order food from their restaurant and just get it put in take-out containers then bring it back upstairs with me… What a joke. So of course we just sat at the restaurant to eat. And the breakfast was AWFUL. What’s worse is that the manager was the one who brought it over to us. No quality control whatsoever. She must of simply not cared about how awful the food she was putting out really was. Everything on the plate was completely burnt except the lettuce which was just soggy. The eggs were hard as rocks. The bacon was so dry and burnt that it fell apart into crumbled pieces when picked up. The waitress actually walked by and noticed the food and instantly apologised and offered to bring us a new plate. It’s pretty sad that the waitress noticed and not the manager who brought the food out… On another note, this poor waitress was the only one on the floor other than the manager and during her break we saw her sitting in the alleyway behind the hotel crying because she was so overwhelmed and unsupported. All in all, I’d say steer clear of this place. They don’t treat the guests well and by the looks of it, they don’t treat their staff well either.",
      "rate": 2.0,
      "tripDate": " October 2021"
    },
    {
      "title": "Very disappointed, Policies were vague and unclear !!",
      "text": "I reserved the king terrace room for my recent stay at this hotel. On arrival I was pleased with the service and look of this hotel. But once departing, I received an email stating my visa got charged an extra $280 because of their non smoking policy. I called to discuss the email and was told to review my confirmation email, and the website. The email only stated “100 non smoking”. Any reasonable person would assume that meant no smoking within the room, excluding the terrace. No where on the website was I able to find anything stating that the Broadview Hotel is a smoke fee hotel. I was under the impression I could smoke on the terrace because I was outside. If I knew I wasn’t able to smoke, I wouldn’t have booked with this hotel. Management did get back to me and did offer to refund me but not in full. I reviewed the Ontario smoke free act, 2017, and found obligations that the hotel needed to fulfill which they did not. Section 15 titled proprietor obligation, para B and C states the proprietor must give notice to their guest about their non smoking policies, which was given but was very vague and u clear. Para C, states the hotel must put up designated signs in respect to their non smoking policy, which they did not. No signs were found in the room or on the terrace. I wouldn’t make a big deal out of $280 but, morally I feel like I didn’t do anything wrong. Which is why I strongly feel like I got scammed. So just to be clear because the hotel wasn’t, this hotel is a SMOKE FREE HOTEL. Meaning even if you got a room with a terrace, the terrace can’t be used for smoking. Nor can u smoke 9 meters in front of the hotel.",
      "rate": 1.0,
      "tripDate": " December 2021"
    },
    {
      "title": "Great looking; inhospitable",
      "text": "They've done an amazing job elevating the former Jilly's strip club into a hip looking venue, but since the beginning there seems to be a philosophy of doing as little as possible for the customer.  I'd heard dubious stories like hotel guests being denied a table to eat (as if hotels don't ask at check-in if you'd like to dine, or reserve tables to accommodate hotel guests) but the experience was exemplified during a recent business lunch at the rooftop restaurant.  After lunch we asked for tea and coffee and were told that they don't serve tea and coffee because they don't have the machines... But we were welcome to grab coffee on the main floor café, an elevator ride away.  Absurd. This isn't a 'concept'; it's just sloppy and lazy.  It's not a criticism of the floor staff, who may just work with what they've been given. The experience is one of a hotel not run by hoteliers, who'd rather get in Time Out than give paying customers an experience commensurate with the  price point. Go if you want nice interior design, a killer view from the rooftop, and decent enough food.  But prepare to be treated like you should be grateful to be there.",
      "rate": 2.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Sleepless And Noisy…meant for instagram photos only ",
      "text": "If you like to sleep, I do not recommend. The terrace room I stayed in had a 500 dollar price tag (the cheapest for that entire week), it is nowhere remotely close to that value. I’m not saying this to be bitter I would just hate for someone to spend that kind of money and have the experience that I did. I was only staying one night, and wish I had just stuck out going home on the train from the city that evening instead of spending money to not be able to sleep. 1. Dusty shelving - went to make a coffee, everything was covered in dust. The kettle, the French press, even the sugar packets. 2. The slamming of the doors is insanely loud - understand some folks weren’t aware but the walls shake when a door closes.3. The hotel is located beside the queen Street car artery. And maybe above a subway? I was woken every 30 or so minutes to the rumbling / low frequency noise by outdoor transit. When I say I didn’t sleep, I mean it. I was exhausted in the morning and was not nearly as rested as I could have been if I had just done a commute to and from Toronto even with the loss of sleep hours - at least you could get two hours of sleep. 4. The 6th floor is horribly noisy during the day because the restaurant is in the 7th floor and idk if I just got unlucky bc they were moving tables or what but it was disruptive and made it difficult to take business calls through the day from the room. It was a pretty awful experience especially for the price.  I asked reception if there was anything they could do and there was nothing. Not even a room discount. It was really unfortunate considering how beautiful it is and i really don’t plan on returning, sadly. If you just need somewhere to get ready and hang out it’s beautiful. But it’s not worth the price to sleep or work from there. It’s really just for instagram photos.",
      "rate": 1.0,
      "tripDate": " March 2023"
    },
    {
      "title": "Is the ghost of Jilly's starting to show through at the Broadview?",
      "text": "Very tired and dirty for a relatively new hotel.  When I got to my room, there were dozens of small 'midgey' bugs. I put up with them for the first day, but on the second,  I mentioned it to the front desk, in which I got the reply \"That's Toronto\". It may have helped had Housekeeping visited even once during my 3 night stay. Only television station you will get is CBC if that sort of thing matters.On the plus side,  the room was pretty sound proof for being at a noisy intersection.  And bed was very comfortable.The terrace is a nice touch, (previous guests party favours excluded) if you want a breath of somewhat fresh air.Rooftop terrace was nice, but definitely for those who like to be seen.",
      "rate": 3.0,
      "tripDate": " September 2021"
    },
    {
      "title": "Staycation favourite - best East end hotel.",
      "text": "Cute rooms,  nice staff, good food, great value, awesome neighbourhood. A staycation favourite! Comfortable beds, spacious, loved the record player and kitchenette, we got a room with a balcony which was nice for fresh air. Nice and quiet, surprisingly!  Riverdale is an awesome area with great shops, and a little further and you’re in Leslieville, with eclectic food and shopping. The best place to stay in the East end.",
      "rate": 5.0,
      "tripDate": " April 2022"
    },
    {
      "title": "Impeccable service",
      "text": "Fantastic meal, start to finish!  Katerina our server in The Civic helped make our experience really special.  Ryan the sommelier is excellent, make sure to have him suggest a bottle to accompany your experience.  Thank you for a beautiful night, will definitely be coming back.  Best service in Ontario!",
      "rate": 5.0,
      "tripDate": " July 2019"
    },
    {
      "title": "I wanted to love this hotel but I just can't after all the things that went wrong.",
      "text": "The hotel is beautiful just a lot of issues.  When my co-worker and I arrived we found out that the hotel did not have they didn't have our reservation ( we booked 2 rooms). I showed them the confirmation information for both rooms and the front desk staff asked that we wait in the bar until the manager was done parking cars. The Bartender was very nice but they had run out of a couple of the beers on the menu.  The manager came and spoke to us and told us that they would sort everything out.  About 30- 45 mins later we were told they had our rooms ready and told us they would cover the cost of the drinks.  When I entered my room I noticed it was not the type of room that I had booked (i had booked the Deluxe Room, 1 King Bed with Sofabed). The room I got was a beautiful room but just not the larger room I had booked, it was one of their basic rooms. My co-worker also had a downgrade int he room that we had originally booked.  Because we were only staying one night and we now running behind because of the delay getting the rooms we just excepted what we were given.  If you are looking for a party hotel this might be the place for you, if you are traveling for business and need to be up early maybe stay away.  We were put on the second floor and there is a bar or something on that floor that was pumping music until after midnight and I could hear everyone singing and cheering!  Sounded like a lot of fun but having to be up at 6 am made it for a very frustrating night trying to fall asleep with a party going on outside my door.  After checking out the next morning we realized that we got charged for the price of the larger room ( the room we didn't get) and when I inquired about it I was told someone would call me back and I never heard back.  I really wanted to give this hotel a great review and maybe everything that could go wrong just happens to go wrong this time. Next time I am in Toronto for work I will be looking for a different hotel to stay at.",
      "rate": 2.0,
      "tripDate": " December 2018"
    },
    {
      "title": "Beautiful Hotel, awful customer relations, will not return",
      "text": "I booked directly through the hotel website earlier this summer for a one night stay on a Friday evening in August, paying in advance and in full for a King Sitting Room (the corner King room wasn't available).  I was specifically coming from the west coast to stay in this beautiful room, and was willing to pay for it, as it was my one night solo with my friends in the City. Upon arriving at the hotel and checking in, I was informed that they had over sold the hotel and they were putting me in a terrace suite (major downgrade) and they would refund me the difference between the rooms.  This room couldn't even come close to accommodating my visit with my long time friends in the City given the size of it, never mind having one of them stay if they wanted to.  I was very upset, and I would have certainly stayed elsewhere if I had been notified this was the room I was going to be in or was given the choice.  I spoke with the girl at the desk, who was helpful, and told me to come talk to her in the morning to sort out the mix up and then offered a few drinks on them at the bar (which I never used).  The next morning I went down and again expressed my sincere frustration and disappointment with what had occurred and was told that they would like to buy me and my friend breakfast, and they would discount my terrace room charge by 50% to apologize for the mixup.  I begrudgingly agreed, as I really did not want to pay anything for something that I didn't ask or book for... but felt that it was fair.  I just received my CC bill and not only do I have a whole whack of confusing charges and debits, but there is a full charge for the terrace suite with ZERO discount, and the breakfast they offered to comp is also on my bill.  I called two days ago and spoke to someone at the front desk to explain all of this, and the girl acknowledged the confusion and mistakes they made over these charges she could also see on my folio and assured me they would be corrected / credited and that she would get back to me in 30 minutes.  I have yet to hear from anyone 2 days later and cant get through to anyone on the phone.  At this point, I feel like the only thing left to do is dispute the charges on my CC.  Really, really unfortunate as I was so excited to stay at this hotel, and now will never go back.",
      "rate": 1.0,
      "tripDate": " August 2018"
    },
    {
      "title": "Great ambiance and view of Toronto",
      "text": "What’s more important when trying new restaurants, food or ambiance? The 360 view of Toronto at The Broadview Hotel Rooftop Restaurant was spectacular but the food was mediocre. I was surprised to see how much the area gentrified  in the last ten years and is now a hip and happening area in the city. I had the ceviche which was really just smoked salmon. The shishito peppers werr good and I can’t remember the rest of the meal bc it was nothing special. If you are coming here for food, I’d recommend to eat first and then enjoy the delicious cocktail and view.",
      "rate": 4.0,
      "tripDate": " August 2018"
    },
    {
      "title": "First time Fabulous ",
      "text": "Had dinner Friday night, very impressed. The place was hoping! We are in Civic, the food was excellent!! The best duck ever!! Our server was incredibly professional and very friendly. We went upstairs for drinks and dancing and had a great time. The room and views are amazing. DJ was fantastic!",
      "rate": 5.0,
      "tripDate": " May 2018"
    },
    {
      "title": "Simply Stunning",
      "text": "From the moment we checked in to the new, lush and gorgeous Broadview, we were starstruck by its beauty and warmth.  The staff were friendly, attentive and helpful.  Once we arrived in our room on the 4th floor our jaws dropped . . . marble everywhere in the bathrooms . . . the scent of clean and fresh!  The room was so spacious and funky and believe it or not a turntable accompanied by several vinyl albums for us to relax with.  After swooning over the crisp & bright bedding and revelling over the overstocked bar we decided to hit the already legendary rooftop patio.  It did not disappoint . . . cool, hip and fun people everywhere ordering interesting cocktail concoctions and lots of munchables.   Our server was pleasant and we loved the view of the city and CN tower.  We cannot wait to head back for another nights stay at our fave new hotel destination in Toronto's east end . . . so much to see and do in the area!",
      "rate": 5.0,
      "tripDate": " August 2017"
    },
    {
      "title": "Disappointment in a Nice Package",
      "text": "We booked a room at The Broadview for just one night because it was the closest hotel to the Hennick Bridgepoint Hospital. A relative was there in the palliative care ward and the hotel was just a 10 minute walk away. It was Tuesday January 17th 2023.The hotel sits at the corner of Queen St. and Broadview Ave. in downtown Toronto and it consists of a restored 1891 heritage building and a modern addition. The hotel has no on site parking. We parked down an alley where there were a handful of spaces dedicated for the hotel's use. These were located behind a couple of large garbage dumpsters. Since there was no doorman,  we carried our own bags down the alley and into the hotel and loaded up a trolley  in the small lobby. Check in was quick and our room 602 was assigned. The front desk did not volunteer any information about the dining options. We had previously booked online for dinner in the 7th floor lounge.The room was small and faced north with large windows. It was in the new addition. There were lots of amenities in the room including a turntable with a few LPs!. The bar fridge was well stocked.Things were looking good.Our dinner on the 7th floor was good and the space attractive with great views and a glass ceiling. The service was quick and friendly. No complaints.That was the high point. Then things went rapidly downhill.Our particular room was, we found out, located right below the 7th floor public washrooms which, it being a  bar, were kept busy until very late. We were serenaded with the appropriate sounds until well after midnight. After a lousy night we looked forward to a good breakfast before leaving for the airport and home.Upon coming downstairs at around 9 am for breakfast we were greeted by a chaotic scene. A large  crew were setting up to film a commercial in the hotel. There were wires; boxes; lights; props; etc. everywhere. We proceeded to enter one of the two restaurants located off the lobby but the front desk clerk announced that both were closed that day. Closed. No further comment,  apology, or other information as to where we could have breakfast was offered. At  check in  this closure was never mentioned, nor was the fact that we could go to the 7th floor lounge where breakfast was available. We paid our bill and managed to navigate all the film equipment with our luggage and left looking for another place to have some coffee at least.We texted the hotel manager who apologized  but insisted we had been told about all this. Not true. The impression I have is that the film crew took precedence over the hotel's guests. We are home now and still have no further word from the Broadview. I presume it's case closed. We have stayed in hotels all over the world and I have to say the Broadview Hotel in Toronto ranks very poorly in our experience.The package is nice and the atmosphere inviting, but if the people running the place don't care much then what's the point of staying there?",
      "rate": 2.0,
      "tripDate": " January 2023"
    },
    {
      "title": "Not 4-star, better hotel options",
      "text": "The room we were in was incredibly loud. It's obvious that the hotel was renovated using cheap design and labor - acoustics between rooms and mechanical equipment/hallways were terrible....as if other people were walking inside our room and the mechanical (my guess an air handler) equipment was running constantly, along with peppered high pitched sounds like the elevator equipment room would have....can you imagine a loud hum thay runs 24 hrs a day?? Paying $350/night, I would expect way better construction/acoustics. We founds lots of random hair (we have black hair and there was blonde hair in the shower and on the floor) but otherwise clean. Doors and hallways seemed old, hallways lights are falling apart. This place is clearly a 3-star hotel but advertises as a 4-star in order to charge a high fee.The hotel staff were polite and friendly. But we were told that paid hotel parking is first come first served....that the hotel charges unlimited folks for parking even though there are a very limited (like maybe 8-10 spaces) amount of parking spaces for the hotel....pretty shady don't you think?? So you could end up paying for parking and NOT get a parking space. Figured out it's cheaper to park in the public lot across the street.  Upon checking out, apparently someone charged a bunch of drinks to our room....probably need to up your game on checking validity of when someone gives you a room #. Hotel is in good location but likely would recommend another hotel to friends at this price. A fair price would be $150/night.",
      "rate": 2.0,
      "tripDate": " October 2022"
    },
    {
      "title": "Great location if you are needing to be on the east side of Toronto",
      "text": "This hotel is in a lovely east side location. We've stayed here multiple times. The rooms are OK in size (def not big), they are clean and well equipped. The staff is friendly and there is lots of parking around. The room is loud though. So loud. You can hear the doors close on neighbouring rooms which is super disturbing when you are trying to sleep. The hallway is loud and it can feel like people are in your doorway. All the rooms are in parallel with streetcar tracks - so that is loud, and there always seems to be police whooping their sirens around 2AM. We've stayed on the 6th floor (I believe...the one under the restaurant) and it is really noisy. We also couldn't turn off the A/C fan noise...which I think is intentional so you hear the restaurant less. The bathrooms are small, but robes are supplied and they are clean. Honestly, because the location is perfect for what we need we stay here - but it is pricey for what you get.",
      "rate": 4.0,
      "tripDate": " April 2022"
    },
    {
      "title": "A Great Toronto accommodation option - comfortable, close to downtown & TTC transport",
      "text": "The Broadview is a great accommodation option for Toronto. Its close to downtown, fantastic for public transport (the TTC), and is in a great neighborhood - a very interesting part of Queen St East. Staff are very helpful, went out of their way helping us find a local Doctor when we needed one. The rooms are spacious, comfortable, and get minimal ambient noise from street level. Our room had a turntable in it, which was a welcome addition, and allowed me to listen to some of my vinyl purchases. The view from the 7th floor at night is well worth a look, and breakfast on L 1 can be simple or quite elaborate, depending on your disposition. Recommended.",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "A disappointment!",
      "text": "I'd think twice about this hotel. Rooms are tiny and maintenance was terrible. Our shower leaked, and flooded the room. Despite our repeated complaints, nothing was done!  I find it baffling that in this day and age, when internet reviews can make or break a hotel, management would be so tone deaf to customers.      Once and never again!",
      "rate": 2.0,
      "tripDate": " October 2021"
    },
    {
      "title": "Disappointing",
      "text": "Hôtel was nice but very disappointing for the price. No television channels due to COVID costs for the hotel, although room prices stayed the same. Hotel staff were only somewhat helpful . Location is very far from downtown. Not very convenient.  Very nice roof top deck open from 12:00 noon.",
      "rate": 2.0,
      "tripDate": " September 2021"
    },
    {
      "title": "A nice night out",
      "text": "We enjoyed our stay, and the turn-table and record collections was an interesting touch.  We didn’t care for the scent of the products in the bathroom. Everyone was very friendly..we went to the bistro & the rooftop patio. The history of the building is particularly interesting.",
      "rate": 4.0,
      "tripDate": " April 2023"
    },
    {
      "title": "Pretty Place Terrible Food",
      "text": "Go for a drink and the view. Service was great. The food was particularly poor. It was better when I was there before but seriously disappointing today. There wasn’t much choice and I am a huge fan of dim sum for lunch but not dinner. Ordered the kimchi fries and they were of the frozen kind. If this is all because of Covid there should be a warning to set expectations.",
      "rate": 2.0,
      "tripDate": " August 2020"
    },
    {
      "title": "Lovely building Good location",
      "text": "Good location not far from Downtown with restaurants within walking distance. Friendly and helpful staff. Good food at the rooftop restaurant. The streetcars were clean, affordable and easy to navigate.",
      "rate": 5.0,
      "tripDate": " February 2023"
    },
    {
      "title": "Highly recommended ",
      "text": "Lovely hotel. Comfortable and clean, friendly and helpful staff. A little way from the centre of the city but easily accessible on bus or tram.Lots of great places to eat in the area and a good atmosphere. Got a voucher for free drinks in the rooftop bar/restaurant which was a nice touch.",
      "rate": 5.0,
      "tripDate": " June 2024"
    },
    {
      "title": "The Noisiest Hotel I have EVER Stayed At",
      "text": "Let's be serious - the Broadview is a hotel/restaurant/nightclub that happens to have hotel rooms.  And it shouldn't.  I was put in room 601 on a Tuesday night that was clearly NOT busy.  The 6th floor is the highest floor of hotel rooms but located under the \"rooftop bar and patio\".  I could hear the toilets flushing all night as well as the music and partiers.  Once they cleared out at 2 the cleaning staff came in and moved the furnature and vacuumed until 6 in the a.m.  Then there is the noise outside - Queen and Broadview is a LOUD intersection due to streetcars, nightlife and construction.  There is also a dog park right behind the hotel with many barking dogs.  The room was tiny (think Manhattan) but beautifully decorated and the bed and linens were lovely.  The bathroom was so small you couldn't get in the shower door without some manouvering.  In short, this place should decide what it wants to be - which is likely not a hotel.",
      "rate": 1.0,
      "tripDate": " January 2018"
    },
    {
      "title": "Not for light sleeper!!",
      "text": "The hotel itself is very nice. Room is small but comfortable. They even have record players and a few records in the room, which was fun!BUT, there is a streetcar right outside the door that seems to operate all hours. My wife and I slept terribly all three nights, even when we used our white noise app to try to drown out the sound. As much as I want to give this hotel a good rating (because it’s otherwise great), I can’t. If you are a light sleeper, don’t do it! Otherwise, enjoy (and try the white truffle frites in the hotel bar!!)",
      "rate": 2.0,
      "tripDate": " November 2019"
    },
    {
      "title": "Great Sunday Brunch at Civic!!",
      "text": "This is their street level restaurant - just off the main lobby (not to be confused with the roof top restaurant). The vibe is fun and trendy, the menu definitely has something for everyone. I had Eggs Benny $16 (served with a lovely mixed green salad with a fab, light, just the right amount, citrus-y dressing, and perfectly cooked potato hashbrowns (chunks of real potato). I'd definitely order that again! There were quite a few items of particular interest so we'll just have to go back. And such a delight on their cocktail menu - among many fun items, they have the Bottomless Mimosa!  For only $16!! OMG!  And the TTC 504 street car drops you at their door!  :)Their bathrooms are a bit out of the way - downstairs in the basement but are quite nice and each is its own single stall with sink and all. And, they DO take reservations!!   (So many brunch places don't). The service too, Alex, was great. Friendly, professional and had some good recommendations from the menu. My friend and I were busy catching up and he was \"there\" without being in our faces. This was a great brunch!",
      "rate": 4.0,
      "tripDate": " October 2019"
    },
    {
      "title": "Rooftop bar",
      "text": "Having dined elsewhere, we called in at the rooftop bar and were delighted to be there on an evening when the moon was almost full in a clear sky. The city view is also worth the trip. Outdoor heaters certainly kept us warm! We would recommend the beers, too!",
      "rate": 4.0,
      "tripDate": " September 2019"
    },
    {
      "title": "Great stay!",
      "text": "A very nice boutique hotel, the sparkling & still water in the hallway is such a nice touch. The record player is so cool. The room was clean and cute. The bathroom was beautiful & all of the soaps and lotion on the wall was very convenient. I will definitely visit again and recommend to friends & family.",
      "rate": 5.0,
      "tripDate": " March 2022"
    },
    {
      "title": "Bachelorette weekend in the city",
      "text": "Staff and rooms were lovely.  In a historic building with lots of character and design details.  Roof top patio has an amazing view with a great vibe.  Only glitch was one of the two elevators was being serviced so it took forever to get up and down,  one of the two rooms was not available until 4:30 and some of the bathroom toiletries were not refilled.  No shampoo in one room and no body wash in the other.  I understand that they were fully booked the night before therefore probably had to rush to get all the rooms ready but the staff’s friendly demeanour made up for it for the most part.  Love  the sparkling water dispenser on the third floor, great touch!",
      "rate": 4.0,
      "tripDate": " August 2021"
    },
    {
      "title": "Bad experience, don’t stay here",
      "text": "Would not recommend this hotel if you’re coming for work. It is incredibly noisy. The first night they put my in a room directly below the rooftop patio and I was kept up till 1am by the footsteps and toilets flushing. I asked to be moved and then second night I was woken up at 2am to a fire alarm. Everyone went outside and waited for 20 minutes while no staff told us what was going on or even when we could go back in. Luckily a firefighter told me it was just a false alarm so I went back in but the staff was not helpful at all. I also arrived at 5:30 pm and had to wait for 15 minutes as they said my room wasn’t ready, even though check in is much earlier. Our room was out of shampoo and body wash and there was no spoon to stir my coffee. All around not a good experience for the premium price paid to stay here. Won’t stay again.",
      "rate": 1.0,
      "tripDate": " July 2023"
    },
    {
      "title": "Very nice place to stay that’s conveniently located near our family.",
      "text": "Lovely stay at a very nice hotel. Our room was comfortable, clean and relaxing. The staff was attentive and helpful when we had questions or needed something. This was our second stay at The Broadview and definitely won’t be our last.Highly recommend if you want to stay in this section of Toronto.",
      "rate": 5.0,
      "tripDate": " June 2024"
    },
    {
      "title": "A nice trendy hotel with a beautiful rooftop",
      "text": "I booked the hotel room for a friend's birthday for a staycation. I found the location to be convenient with some good food around us. The hotel room itself was good. The bathroom felt luxurious, the bed is SO comfortable. The record player is more of a decor than something usable. They have a floor dedicated to records you can pick but when you actually plug it in-- you can barely hear the music. We were laughing about it because you literally have to be next to it to hear it. They cap the volume which makes sense for a hotel but it seemed a bit extreme. They were able to get us reservations for the rooftop which was lovely. i appreciated how prompt they were to satisfy our asks.",
      "rate": 4.0,
      "tripDate": " July 2021"
    },
    {
      "title": "Oh Toronto!",
      "text": "Lovely hotelNice staffWell pricedToronto is such a lovely city and the broad view really captures its spirit.  The neighborhood is nice and eclectic. The hotel is a beautiful historic place that has been nicely modernized.  The roof bar is a special treat",
      "rate": 5.0,
      "tripDate": " October 2021"
    },
    {
      "title": "Not what I’d hoped",
      "text": "For $500/night, I expected a lot more than I got. The room and amenities are ok but not deluxe. There is no parking available, no place to drive up and unload. There seemed to be more than one wedding that prevented us from being able to access all dining areas and rooftop. Breakfast was ok. The staff were pleasant and helpful.",
      "rate": 3.0,
      "tripDate": " May 2022"
    },
    {
      "title": "Peaceful and beautiful hotel",
      "text": "This is a lovely small boutique hotel on the Eastern side of Toronto. It's in a quieter neighborhood, with lots of small boutiques, restaurants, etc. It is not in the heart of things, which I really liked, but it is very well served by the tram and bus system which is right outside. Our room, 406, was very spacious and well-appointed. The staff was very nice and brought up toothpaste which I have forgotten.Downstairs there's a very charming little cafe for breakfast and lunch, and the rooftop upstairs is beautiful.",
      "rate": 5.0,
      "tripDate": " June 2024"
    },
    {
      "title": "Beautiful boutique hotel!",
      "text": "This hotel is absolutely stunning. It was super easy to find and The curb appeal had us right away. Although the parking was kind of crummy it was to be expected for Toronto. The rooms are super clean and cozy. The decor is beautiful. We had a king room with a pull out couch and even the pull out couch was comfortable. The location is great! So many fun places to go eat and go for drinks. We will absolutely be back!",
      "rate": 5.0,
      "tripDate": " January 2023"
    },
    {
      "title": "Beautiful, boutique hotel with the attentive staff and comfortable rooms.",
      "text": "We loved our stay at the Broadview Hotel and highly recommend it. We were there for about 3 weeks while our home was under renovation, and the hotel staff was incredible!! Aarti, Morgan and their entire front desk team were kind, considerate and helpful at every opportunity. This is a well run boutique hotel, with beautiful decor, very comfortable beds, well laid out rooms and a great rooftop patio. Excellent with kids and dogs. Nice dog park behind the hotel, lots of parking, great restaurants and shops nearby. A gem of a hotel!",
      "rate": 5.0,
      "tripDate": " September 2020"
    }
  ]
}