{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Toronto's Favourite Urban B&B",
    "url": "/Hotel_Review-g155019-d3533528-Reviews-Toronto_s_Favourite_Urban_B_B-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "5.0",
      "reviewCount": 5
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "51 Bowie Ave",
      "addressLocality": "Toronto",
      "postalCode": "M6E 2P4",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png"
  },
  "description": null,
  "featues": [
    "Free parking",
    "Wifi",
    "Children Activities (Kid / Family Friendly)",
    "Airport transportation",
    "Laundry service",
    "Self-serve laundry",
    "Air conditioning"
  ],
  "reviews": [
    {
      "title": "immaculate and well priced",
      "text": "Needed to find a place in a hurry for relatives from NYthe owner Yohan was very helpful and my relatives found the place immaculate which is a plus for them . approx 70.00 per night.Queen size bed with a single room option also available for less. Fresh baked bread provided with your continental breakfast and little extras like water etc provided .Free Wifi  4 pcs bathroom.Nice size kitchen for a longer stay",
      "rate": 5.0,
      "tripDate": " March 2015"
    },
    {
      "title": "Great neighborhoods to explore and wonderful guide ",
      "text": "My husband and I took a waking tour of Chinatown and Kensington Market.  Both areas had such great history and diversity. Our guide, Mike, made the tour really enjoyable because of his knowledge of Toronto, ability to engage everyone in the group into the conversation, and tips for local favorite spots. The tour ran a bit long but we were happy to keep going.",
      "rate": 5.0,
      "tripDate": " September 2018"
    },
    {
      "title": "Wonderful stay",
      "text": "We stayed here for 2 nights. It was a wonderful staying here. Rooms were spacious than expected. Bathroom were quite clean. Kitchen was reasonably good for those who have plan to cook some food items. All in all, it was comfortable staying here.",
      "rate": 5.0,
      "tripDate": " March 2018"
    },
    {
      "title": "J'aime les B and B",
      "text": "J'adore les beds and breakfast. La propriétaire parle très bien français et nous renseigne sur tout ce dont nous avons besoin. Le couple est très accueillant. Numéro de téléphone disponible pour le rejoindre ou un email pour une réponse rapide. Le lit est mou, donc un peu difficile pour le dos. Les chambres sont au sous-sol et nous devons faire attention à notre tête par moment pour ne pas accrocher le plafond. Le sous-sol est propre, l'air climatisée est en marche et malgré la présence d'un enfant à l'étage, tout est tranquille. Déjeuner: pain, céréale et fruit. C'est comme être dans un appartement chez soi! Pour parler du quartier, il semble que ce quartier soit davantage défavorisé!",
      "rate": 4.0,
      "tripDate": " August 2013"
    },
    {
      "title": "We stayed at the Aeirie Inn",
      "text": "We stayed at the Aerie inn. What a lovely place! Very clean! Very Quiet! Daphne was wonderful! Our only issue was with the parking...but my daughter who lives in Toronto came to our rescue. Very well priced! Will definitely look at Urban North Inns when I come back to Toronto. thank you!",
      "rate": 5.0,
      "tripDate": " March 2018"
    }
  ]
}