{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Toronto Rooms and Suites",
    "url": "/Hotel_Review-g155019-d16963083-Reviews-Toronto_Rooms_and_Suites-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.0",
      "reviewCount": 8
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "357 Spadina Ave",
      "addressLocality": "Toronto",
      "postalCode": "M5T 2G3",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/1a/4c/e0/6d/photo0jpg.jpg?w=500&h=400&s=1"
  },
  "description": null,
  "featues": [],
  "reviews": [
    {
      "title": "Excellent! ",
      "text": "I did a lot of research and this is definitely the best value in the area. The rooms were very clean and even though it’s more of a guest house check-in and checkout was very very easy and everyone was so polite. The room was spotless. So clean. There was even an iron and ironing board in the bedding is comfortable. Call ahead if you need parking. They are so polite. Again, great value I will be back.",
      "rate": 5.0,
      "tripDate": " December 2019"
    },
    {
      "title": "Good experience",
      "text": "I was very happy with this property. My flight was delayed and the check in was easy. The room was clean, everything was brand new and conveniently located next to Kensington market and Chinatown. I would recommend to anyone.",
      "rate": 5.0,
      "tripDate": " November 2019"
    },
    {
      "title": "Clean and convenient",
      "text": "A clean and convenient place to stay if you're visiting Toronto and want to keep the hotel costs low. Friendly and accommodating staff, extremely comfortable beds, option for kitchenette was a huge plus.",
      "rate": 4.0,
      "tripDate": " February 2019"
    },
    {
      "title": "A diamond in the rough...",
      "text": "The good, the bad and the ugly..The good, the room is modern, clean (mattress is completely encased as are the pillows)and fairly well appointed (hairblower, cutlery, etc).The bad, no fan, bedside light or clock. No dish soap, no extra blanket. There is a “balcony” which would be nice to be able to access but is quite a mess.The ugly, the rooms are not serviced by an elevator, the address can be a little easy to miss and the narrow window for check ins may be an issue for some.For me the price, cleanliness and location won out and I was not disappointed. The older gentleman who checked me in and helped me with my (very heavy bag) was sweet and helpful.",
      "rate": 4.0,
      "tripDate": " May 2019"
    },
    {
      "title": "Hidden Gem in Kensington Market",
      "text": "Stayed here for one night. Room was exceptionally clean. check in was simple. I texted contact upon arrival and I was greeted promptly and allowed to check in early. the room was appointed with all the basics. Bed was comfortable. Large screen TV with Netflix. Chair, small dresser. small Fridge. Bathroom corner shower with vanity and toilet. Soap and towels provided. As other reviews suggest, the walls are thin and you can hear the other guests as well as front door opening and closing. Perfect location for great restaurants and shops as well as Chinatown and Kensington Market. I will definitely return.A real hidden Gem at a fraction of the cost of some of the large chain hotels.",
      "rate": 4.0,
      "tripDate": " May 2019"
    },
    {
      "title": "The worst Hotel in Toronto !!",
      "text": "Very bad customer service. The room was dirty and they didn’t give me back my damage deposit, even if they confirmed that nothing has been damaged. Now they are ignoring my calls . Be very careful and don’t trust the pictures on Internet",
      "rate": 1.0,
      "tripDate": " August 2021"
    },
    {
      "title": "Great stay in Lavish Living",
      "text": "My two nights in the heart of Toronto were made that much better with this awesome flat.Very modern, great bathrooms and layout, fully equipped with washer and drier even (great ones at that); at very sensible price.Best part was the breathtaking view from the balcony. Simply awesome.Overall great value stay. Home away from home.",
      "rate": 5.0,
      "tripDate": " May 2019"
    },
    {
      "title": "Good Price and Good Value",
      "text": "Excellent price for the Toronto area.  Everything was exceptionally clean. The mattress was excellent.  Best sleep I have had in a long time. The only disadvantage was two sets of stairs. I have some knee issues but the person checking us in was quick to grab my luggage and take it to our rooms.",
      "rate": 5.0,
      "tripDate": " March 2019"
    }
  ]
}