{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Toronto Plaza Airport Hotel",
    "url": "/Hotel_Review-g155019-d188296-Reviews-Toronto_Plaza_Airport_Hotel-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "2.0",
      "reviewCount": 370
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "1677 Wilson Ave",
      "addressLocality": "Toronto",
      "postalCode": "M3L 1A5",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0f/28/b9/06/toronto-plaza-airport.jpg?w=500&h=-1&s=1"
  },
  "description": null,
  "featues": [
    "Free parking",
    "Free High Speed Internet (WiFi)",
    "Bar / lounge",
    "Free airport transportation",
    "Business Center with Internet Access",
    "Conference facilities",
    "Non-smoking hotel",
    "ATM on site",
    "Internet",
    "Restaurant",
    "Airport transportation",
    "Banquet room",
    "Meeting rooms",
    "24-hour front desk",
    "Air conditioning",
    "Refrigerator",
    "Non-smoking rooms"
  ],
  "reviews": [
    {
      "title": "No longer a Hotel",
      "text": "This is no longer a hotel. This is now a shelter.  I stayed here over a year ago which was the worse experience ever. I could see this making a great shelter thou but a shame that people won’t have something nice to stay in. Very dirty and out dated. Leaks in rooms, exposed wires, blood on walls and nasty staff.",
      "rate": 1.0,
      "tripDate": " September 2018"
    },
    {
      "title": "Not good",
      "text": "This hotel is being used to house Syria refugees. The lobby is full of people hanging out. Kids running up and down the hall. The elevator was shut off and we had to have it turned back on so me girlfriend could get up to our room on the fourth floor. Counter person James was great but I would not book here as long as they are housing over 400 refugees.",
      "rate": 1.0,
      "tripDate": " January 2016"
    },
    {
      "title": "Holidays in Canada",
      "text": "Very bad experience, hotel has bad smell all over, its a big building but very poorly managed.Hotel service, very poor quality, broken furniture,  Hotel shuttle driver has dual role, the driver and the receptionist.  Just standard to poor quality food. corridors has bed smell, faulty lifts.  Hotel was full of asylums.  Far from city.  Not advise to stay.",
      "rate": 2.0,
      "tripDate": " October 2017"
    },
    {
      "title": "Excellent service and stay",
      "text": "Stayed here with my three kids all under 7 during quarantine. Great food and clean rooms. Everyone at the hotel was super friendly and eager to help make our stay comfortable. It was an overall great stay taking into account quarantine requirements. Shout out to Tony working the front desk, very helpful and kind.",
      "rate": 5.0,
      "tripDate": " July 2021"
    },
    {
      "title": "Don't stay here!",
      "text": "Dirty place and very dated. Safety issues :exposed electrical wires in the mini fridge and the hair dryer! After our third complaint that evening, hotel manager offered the room complimentary. Just got our credit card bill the other day, and, to our surprise, found that we got charged for the room anyway. Still waiting for a response from hotel management.",
      "rate": 1.0,
      "tripDate": " May 2018"
    },
    {
      "title": "Don’t book it!",
      "text": "This was the worst hotel I have ever stayed in. They tried to redo the lobby and hallways, and I say tried.   The rooms are so outdated and the bathroom was so disgusting! My eight-year-old son begged me not to make him take a shower in there. There were spots of mold everywhere.   The other half of the hotel doubles as a refugee camp for immigrants.  People hanging out in the halls and the lobby everywhere.  This hotel is also located in a very bad part of  Toronto. We were worried our car was going to be stolen.",
      "rate": 1.0,
      "tripDate": " October 2017"
    },
    {
      "title": "Run down, crowded, smelly",
      "text": "Our room wasn't ready, we arrived much later than check in time, the place was crowded with 400-500 refugees many lingering in the lobby and halls, Staff were not equipped to deal with such crowds  floors were sticky, room was cleaned quickly for our arrival and not done well, smelled of super strong air freshener, many people in room next to our were awake and LOUD till 3 am. Smelled of cigarettes, bathroom was in need or repair, gaping hole in tub surround, stained tub, hair dryer not functioning, no coffee available, no continental breakfast available, beds were old and saggy, free wifi was weak at best, my family member had to all 3 times and was on hold over 45 minutes in total trying to have a call put through to our room,  the best thing about this place was the shuttle to and from the airport. overall a horrible experience. Made a complaint to the front desk person who just shrugged his shoulders, they were too overwhelmed dealing with the overcapacity crowds of people in the halls and lobby to care. Was nasty.",
      "rate": 1.0,
      "tripDate": " February 2016"
    },
    {
      "title": "Stay away - dirty",
      "text": "We stayed here as a stopover after our vacation.  It was filthy.  They put us on the 4th floor, and the elevator wasn't working.  They expected us to lug our luggage up 4 stories.  The stairwell was full of bloody Kleenex, orange peels and various other garbage.  It is being used a place to put up Syrian refugees.  Lobby still full at 1 am.  They charge you $100 deposit, after paying for the room, hopefully it will be refunded.We would not recommend this hotel to our worst enemy.",
      "rate": 1.0,
      "tripDate": " January 2016"
    },
    {
      "title": "We Left! I’d rather sleep in my car!",
      "text": "We booked this hotel in February 2018 for a king bed. When we arrived in May, they had given away our room and only had two double rooms left. I asked for another room and they moved us to a ground floor that was listed as a king. Again it was two double beds. The second ground floor room had a broken lock on the window and the exterior window was smashed from someone throwing something against it. We didn’t even sit down. We immediately turned around at 10 o’clock at night and ask for my money back. Only the manager could do that! Six days later, still no refund! I had to call AGAIN while I was in my vacation away to chase my money. NOT HAPPY! The area is very sketchy and we just didn’t feel safe there.",
      "rate": 1.0,
      "tripDate": " May 2018"
    },
    {
      "title": "Beyond Horrible!",
      "text": "Dirty, very rundown, saggy mattress on bed, stained tub with large hole in wall, strong smell of deodorizer that does not cover the bad smells. Got no sleep as it is a base for the refugees - a lot of noise until early morning. Can't believe we paid to stay here. Manager and front staff did not care at all about our concerns. Shuttle to the airport was the only positive thing.",
      "rate": 1.0,
      "tripDate": " January 2016"
    },
    {
      "title": "HORRIBLE- Worst hotel ever",
      "text": "Please people stay far away from this place. It's cheap for a reason. Dirty, dirty,dirty. Everything reeked of pot and booze. Sketchy, drunk and intoxicated people stay at this hotel. During the night we could hear people yelling across the hall.. Water leaked in our room on a rainy day all over carpet. Smelled of mold. We told this to a staff member at the desk and he simply said not to worry about it , it's nothing serious. Absolutely horrible, the worst hotel I've ever had the misfortune to stay at. Not to mention how old and outdated it is, not maintained at all. This place will shut down soon hopefully. It looks like it's about to fall apart.",
      "rate": 1.0,
      "tripDate": " June 2015"
    },
    {
      "title": "This is not a hotel its a Apartment.\r",
      "text": "Don't go here its not a hotel anymore.There owner rents the rooms on a month to month basis.The staff at the hotel told me they rent on a month to month basis to anyone at $1000 a month.So you and I pay $100 for a night those that rent month to month pay $30 and What's wrong with this place .Staff told me that girls sell there body's there on site called backpage And many drug dealers live there too.This is a nasty place and having the police knock on all the doors at 4am looking for someone.People go else where this place is really bad .I will never ever go back Also bed bugs all over WoW Looks like the owner does not CARE",
      "rate": 1.0,
      "tripDate": " May 2015"
    },
    {
      "title": "Decent and cheap",
      "text": "Well it isn't the Hilton, but the price already suggested thatGrab a pizza is great, rooms are clean and tidy, staff wereFriendly and helpful,near malls beer store Walmart etc,Well situated and if you drive, you are not far from the cn towerAnd casa loma, as well as Clifton Hikk(Niagara Falls) allIn all I thourily enjoyed my stay, I would not hesitate on going back there",
      "rate": 3.0,
      "tripDate": " April 2013"
    },
    {
      "title": "Definitely not worth anything",
      "text": "Yes we had sleep park and fly. Our plans changed and had to book late so no other reasonable hotel was available. Definitely a bad area. The hotel reeks of Marijuana especially the third and fourth floors. Loud got moved and the next room was just as bad. Decor is awful. Dirty and completely rundown. Not worth the money. Secure parking is questionable when we found people sleeping in their car.",
      "rate": 2.0,
      "tripDate": " April 2018"
    },
    {
      "title": "Not worth the price you pay",
      "text": "We stayed here on February 9th as our flight was early the next morning and we did not want to have to get up any earlier than we already were.  We shopped around the internet as many others do, and thought this hotel was a good option, based on the pictures on their website.  Shame on us - we always check out tripadvisor before we book; why we did not this time is behind us, but we definitely regretted it after the fact.  The guy at the front desk was doing double duty - booking rooms and running people to and from the airport with their shuttle.  We were told to find a spot anywhere on the property to park the car, front or back; did not matter.  We were lucky enough to find one spot on an end row while others drove around aimlessly trying to find anything.  Very dark parking lot, not lit up at all and reminds you of parking out behind an alley somewhere.  The hotel is worn and is in desperate need of a renovation / overhaul.  The government has clearly elected to use Toronto Plaza hotel as one of its locations to house Syrian Refugees.  They hang out in the halls, sitting against the wall texting, walking their babies up and down in a stroller and having takeout dinner.  The place smells filthy, looks filthy, dust in the room was SO thick!  Bathroom faucets and shower tiles were disgusting.  Very clear this place was a great hotel at one time and is now beyond run down.  We went to their restaurant for dinner the night we stayed; greasy, dirty, two young girls running the business.  A girl was passed out in a chair at a table, her cell phone had fallen on to the floor and she did not even realize it.  The people serving tables never once woke her up to ask her to leave, so every person that entered the room had the pleasure of watching her.  When we arrived back at the airport, we called the number for the hotel - he told us it would take 40 mins due to the driver having to pick someone up in Downsview.  When he finally arrived, he crammed 12 of us into the shuttle, luggage and all and asked if anyone was staying at the hotel that night, to which everyone said 'Noooo'.  Some conversations about the state of the hotel went on while we drove to it and it was very clear that everyone felt the same way.  Spend a bit extra and stay somewhere where you won't wonder if you leaving the hotel with more than what you came with.",
      "rate": 1.0,
      "tripDate": " February 2017"
    },
    {
      "title": "Don't Go There!!!!!!!!",
      "text": "This hotel is horrible!!!!!!!!!!  It is filthy, smelly, just all over gross, and in a bad area. If I could rate it 0 for everything I would. My husband and I checked in and checked out as soon as we went to the room , and they gave me a credit receipt, but still charged our Visa, and now they are lying saying we stayed there!!!! Very horrible management staff, the hotel should be shut down!!",
      "rate": 1.0,
      "tripDate": " September 2016"
    },
    {
      "title": "Absolute Slum !!",
      "text": "The place is filthy and reeks of cigarette smoke (even though it is supposedly smoke free).  The swimming pool had no water in it.  The internet does not work.  Free breakfast consists of toast and coffee.  Furniture is ancient.  Wallpaper has stains and tears on every interior wall.  They do have free parking, but it is about half a kilometre from the back entrance.",
      "rate": 1.0,
      "tripDate": " May 2016"
    },
    {
      "title": "All we could do was laugh",
      "text": "After finally arriving in Toronto all we wanted was to get a little sleep before we had to head to the airport for an international flight. The room had holes in the wall. The faucet handles just spun and spun without a drop of water. there were holes in the shower curtain, wallpaper peeling, the TV was half broken. It had been a long drive from the States so after we were able to digest where we were staying our whole party cried with laughter because this place is a joke! I wish I would have taken pictures.The only reason they get 2 stars is because our car was still there when we returned a week later, the the front desk manager/shuttle driver/bell hop was incredibly attentive and got us to the airport in a flash!",
      "rate": 2.0,
      "tripDate": " April 2016"
    },
    {
      "title": "Back to being a dump",
      "text": "This hotel is returning to regular service after serving as syian refugee holding till they found housing. The place is in desperate need of renovation and one half WAS populated by hookers. It will be interesting to see what the populaes the hotel after reopening to the general public May 1 2016",
      "rate": 2.0,
      "tripDate": " April 2016"
    },
    {
      "title": "Very dated ! ",
      "text": "This was one of the worse places I've stayed in problems are as follows very cold hotel,very out of date , swimming pool with no water hot tub no water !! What good is a pool with no water Wifi was crap ! The only thing I liked was the cleaning of my room ! The lady was excellent ! But I believe this place should be up dated or torn down I've stayed in better highway motels",
      "rate": 1.0,
      "tripDate": " January 2016"
    },
    {
      "title": "0 out of 5",
      "text": "The pictures they advertise must be stock photos because it does NOT look like the pictures. Also there is no pool, despite the website and trip sites saying it has one.The restaurant staff member looked annoyed that we were in there. And the shower smelled like smoke when we turned it on, and made the whole room smell like smoke.",
      "rate": 1.0,
      "tripDate": " April 2018"
    },
    {
      "title": "Filthy",
      "text": "You have been warned, worst Hotel I have ever stayed at. Breakfast consisted of toast, cereal,l coffee and juices. Seating is filthy, I would not sit there. No water in the swimming pool. It took over 10mins to get someone to answer the phone, I was at Toronto airport and needed a shuttle pick us up, after 12hrs of flying the last thing I needed was to wait for over 10mins to get to talk to someone, then another 25mins to get picked up.Could not wait to get out of there.",
      "rate": 1.0,
      "tripDate": " May 2016"
    },
    {
      "title": "Should have read the reviews!",
      "text": "Stayed here through the park and fly website. Seemed a good price for two weeks parking, however. I could not believe the condition of the hotel but then we just wanted a nights sleep for an early flight in the morning ......no one told us about the hundreds of refugees in the place ......children were playing, screaming in the halls well past 11pm. We maybe got a couple of hours rest at best. The service to airport was excellent both going and pick up, no problems there.Next time, I'll do more research and read trip advisor.",
      "rate": 2.0,
      "tripDate": " February 2016"
    },
    {
      "title": "ROOMS of MARIJUANA, CIGARAETTE SMOKE, UNSAFE! DARK PARKING LOT- AVOID!!",
      "text": "THIS WAS BY FAR THE WORST EXPERIENCE AT any hotel we've been to! I'm all for staying somewhere cheap.. but not at the expense of our security and safety The halls were very dark and the elevators were broken again.  There were NO lights at ALL in the stairwell- Imagine carrying your suitcase up and down flights of stairs in PITCH black! There were obstacles in the stairwell too! There was a 2x4 of wood leaning in the stairwell anyone could have gotten very hurt on. I'm surprized they aren't worried about Liability.  This place breaks many Safety Standards rules and lacks basic safety standards as well as DOES NOT KEEP their non smoking floors smoke free, whole wings of \" non smoking\" rooms wrecked of cigarettes.We checked into our room it was a Monday.The room to our right, the people were smoking Marijuana and the smoke was drifting under the door into our room, filling our room with cigarette and Marijuana smoke.  We had a 4 and 8 yr old children in our room being exposed to Marijuana and cigarette smoke coming into our room.The room on the other side of us, the people were partying till 2am, smoking, being loud.  We put in Several calls down to the front desk, saying this has got to stop. They came up a couple times to \"warn\" them, it was a NON SMOKING floor, but no one was kicked out, and the loudness and smoking continued so no one got ANY sleep.We booked through Hotwire, the pictures they had of this hotel did not match the hotel.Hotwire confirmed by calling before we arrived the Pool would be open for our stay.  I confirmed again when we checked in.  The Manager on duty 'Yosh\" had us sit on the couch and wait 10 mins before checking in any guest, as he was doing \" shift change\" with the other girl. He said the pool was available when we checked in I said the kids were excited to swim. Once in our room, there were 3 small towels available and 4 of us who wanted to swim.  NO towels in pool area so I called down and asked for more towels.  At this time, \" Yosh\" the \" Manager\" Informs me that the pool is closed and will not be available for our stay.  What?? I told him he'd already confirmed before and when we arrived that it would be open.  He said it was a \"Health regulation issue\" I pursued the issue, he said they would be cleaning it for the next 24 hrs or so closed? During our stay NO one ever cleaned the pool.! We asked another Assistant manager, James, he said he had no idea about any of this. He said the pool would be ready in an hour.  So we went down to the pool with our kids.  The water was so cold even my kids who normally don't care, wouldn't swim in it, IT was frigid.!  The small hot tub was so hot it turned our skin bright red in seconds, scalding and WAY too hot! It had to have been 110F or higher.  The pool and hot tub were definitely not usable, no one was in them during our stay.  Even though it was March Break, this hotel seemed pretty empty, ghost town.We returned to our room, every corridor in the hotel wrecked of smoke even though it was supposed to be non smoking.  Every thing was \"out of Order with signs that looked like they'd been there awhile- Ice machine out of order, no ice or pop in hotel, pop machine broken, no Laundry as advertised.  NO games room as advertised, no nothing.  Elevators broken, no lights in halls and stair wells.  PARKING LOT BLACK so dark! Another guest said there was some cars broken into.  It looked like a very rough neighbourhood.  I would not repeat the experience even if I only needed a place to crash for a couple hours as no one got any sleep anyways!The kicker is, at Check out 'James\" Assistant Manager ( who seemed much nicer than the \" Manager \" Yosh who gave us the run around several times, and kept changing his story) said \"Just call Hotwire (who we booked through) and tell them and they'll gladly refund your money- you can use that to stay somewhere else\"  So I called Hotwire who called the hotel and \"James\"( front desk Manager) confirmed, yes, everything we said is indeed true about this hotel, yet \" YOSH\" the General Manager would not honour the Hotwire contract and release the money for a refund. Can you believe it? Later in the day, Hotwire called back again to process the refund,\" Yosh \"changed his whole story and said we were just not happy with the room but DENIED the other things hotel had ALREADY ADMITTED TO AND WERE recorded BY HOTWIRE! The Manager was caught in a lie as another Manager had already admitted all the complaints were true. An investigation was launched by Hotwire pursuing the refund. This hotel Is NOTHING like the pictures on their website or how its advertised! BEWARE! I hope no one else has to go through this.*Also the Free Wii fii advertised was very slow or didn't work at allIt seems like it's due to be shut down soon. I'm all for staying somewhere modest and very reasonable, but not with illegal activity and unsafe environment where no one gets any rest and doesn't feel safe.",
      "rate": 1.0,
      "tripDate": " March 2015"
    },
    {
      "title": "Horrible Experience Overall",
      "text": "We booked this hotel on points from a TD credit card reward program, and from the beginning we were disappointed. The 1st phone call to the hotel to set up the free shuttle (as included in the expedia booking for $12 more than the cheaper room rate without a shuttle) we were told it is a short ride and to just call upon arrival. When we arrived on March 16th at 530pm, we placed the call at 538pm and the person on the other line said the shuttle would be there within 30 min and to wait by door C22. We waited there for 37 mins before calling to check on the shuttle at 615pm. James answered and said they never had a request for a shuttle and that he would send one right away. I asked when it would arrive and he said 15 min. At 630pm i called back and got a gentleman with an accent who said the shuttle was on the way, and it would be no longer than 10 min. He did apologize but we were not happy because we were nearing the 1 hr mark for waiting. At 645pm i had to call again, and spoke to James again who remembered me from a half hour ago. He said thr driver had just left and would be there soon. I asked why the driver had \"just left\" and he said there was a miscommunication. I could not understand how there was a miscommuni ation when we had called 4 times. When the driver arrived at 650pm (72 mins after original call) i asked when he was dispatched. He said he was the one who answered my call and he left right away. He was the gentleman with the accent that i spoke to at 630pm, so i timed the drive which was 10 min, so obviously he was lying about leaving right away. Once we got to the front desk, we got an apology from James but no attempt for compensation of any type until we asked. Their idea of fair compensation was to offer the shuttle ride for free (but it was already included in the room). When we pointed out it was alreadt included, they argued that expedia does not sell rooms that way. After showing them the email confirmation, they gave us a voucher for the continental breakfast (not the hot breakfast). Our room over all was ok, aside from the loud refrigerator, the smell of cigarette smoke (non smoking room) and the paper thin walls. I heard the next door neighbors having sex all night, and it would not have been as disturbing if i could not hear her say she wished she had a gun and a nurse's uniform. Before going to sleep, the power went out in the block, and it came back for 30 seconds a few times throughout the night. In the morning, the elevator was out, so we took the stairs which isn't a big deal. It was concerning though that the power had been restored to the rooms and the hallways, but there was zero lighting in the stairwell. It was pitch black and a safety hazard, especially in the case of a fire where everyone would be exiting through the stairwell. We mentioned it to the manager/owner, and he shrugged it off as the city's fault for not restoring power to the neighborhood. Overall very disappointed with the experience, and in this case, we didn't even get what we paid for.",
      "rate": 1.0,
      "tripDate": " March 2015"
    },
    {
      "title": "DON'T BOOK HERE! JUST AWFUL!",
      "text": "I'm not fussy but this hotel is not even deserving of 1!We booked 1 night here recently due to visit to nearby hospital. We thought it was close and convenient. After 1st night, we found several hotels on Norfinch for just a few dollars more per night,only a little farther from hospital.The hotel was dirty and in disrepair.The room was as clean as could be with it's sorry state. I'm ok with dated but this was well beyond. The rugs were stained and burnt. The light at door didn't work and there was a large water stain around it. The bathroom was moldy. Towels were thin. Only shampoo in bathroom and one of those was half full. TV didn't work. We had to call twice to get staff to come. Lamp broken; socket teetering on the base. Sticker on fridge advising it's only meant to keep beverages cold and not for perishables.Then there are the people who hand out around the hotel that live there.I could go on but I'm sure this paints an accurate picture.",
      "rate": 1.0,
      "tripDate": " April 2018"
    },
    {
      "title": "Terrible",
      "text": "I booked this hotel as a park and stay for our vacation travel. I will say it was the first hotel that I pulled the blankets back to check the bed and I stay in a lot of hotels for my work. I would not ever book here again even if I had t cancel my trip somewhere else because of it. The reservation for my return trip was lost and they did not have an available room, which surprised the crap out of me. I was never happier to get in my car ad 1:30 am and drive to find another hotel. DO NOT STAY IN THIS HOTEL!!!!!!!!",
      "rate": 1.0,
      "tripDate": " April 2018"
    },
    {
      "title": "Overnight stay",
      "text": "Booked this a park and stay hotel . I checked and was told that this hotel had been used as Syrian Refugee housing , but that as of May , the hotel was back to normal hotel function . So not the case !!! Arrived in lobby to refugees just hanging out in lobby and at the doorways . Young kids riding bikes through the hall . I asked desk clerk what the story was , he said 6 families remained, no way unless their families are over 10 persons each . I paid over a hundred dollars for my one night stay and then was asked to leave a $150 room deposit . Are you serious , I need to leave a room deposit . Wallpaper hanging off walls , halls stinking of smoke , carpets dirty and not vacuumed.  Disgusting to charge anyone to stay here , should be paying me   .  Stay anywhere but here , pay the extra bit of money and stay Ina REAL hotel",
      "rate": 1.0,
      "tripDate": " May 2016"
    },
    {
      "title": "Stay away!!!",
      "text": "Stayed at this hotel last week....checked in at 5am after a long flight.To begin with....the place is a dump!!!.....the front lobby looks ok upon arrival but beyond that...it's a different story....filthy carpets...graffiti on the walls....garbage all over the place and overflowing garbage barrels in the hallway.....wallpaper peeling off walls...room was dingy ....not enough lighting....and they had the nerve to ask for a $100 damage deposit upon check in!!!.....which was refundable.If that's not bad enough...starting 6:30 am.....yelling and screaming in the hallways...kids running up and down....parents yelling at them.......doors slamming....good luck trying to get any sleep!!!......finally gave up at 9am and checked out.Complained at the desk on the way out....but the manager didn't seem to care.Do yourself a favour and do NOT book this hotel!!!!.....I wouldn't board my dog here!!!!",
      "rate": 1.0,
      "tripDate": " April 2016"
    },
    {
      "title": "Do not stay here!",
      "text": "Wow.... Is about all I can say.  Stayed here before our family trip because they offered extended parking.  Place is run down, dirty and in desperate need of being torn down.  Garbage in hallways, stains on carpet, foul smell throughout.  Not to mention if you are not aware, this hotel is the base for refugees.  20-30 people in hallways, and lobby, with several children at 11pm.  Wanted to walk out but our flight was early in the AM.  Front lobby staff were extremely nice.  Shuttle to airport in the morning was great.  They took us when we got downstairs.  But, pick up from airport took over an hour with 3 phone calls to find out when the shuttle would arrive.  We were always told 10 minutes.  We honestly weren't sure if our car would still be there when we got back.  Terrible place!  Pay the extra money for parking and avoid at all costs!",
      "rate": 1.0,
      "tripDate": " January 2016"
    }
  ]
}