{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Toronto Downtown - East Furnished Apartments",
    "url": "/Hotel_Review-g155019-d1547474-Reviews-Toronto_Downtown_East_Furnished_Apartments-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "1.5",
      "reviewCount": 7
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "4 Newbold Ave Beach Community",
      "addressLocality": "Toronto",
      "postalCode": "M4L 2G7",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png"
  },
  "description": "Toronto Downtown-East Furnished Apartments give you the choice from budget studios to 2 bedrooms apartments for relocation, temporary housing, business travel, or vacations as well as suites for weekly and monthly rentals. Free yourself from the confines of your average hotel room. Every suite has a kitchen so you can cook and eat on your own schedule. Spend more time relaxing and less money on your next trip for business or leisure.",
  "featues": [
    "Free High Speed Internet (WiFi)",
    "Wifi"
  ],
  "reviews": [
    {
      "title": "Not cracked up to be what it claims to be",
      "text": "This property is substandard. We stayed a month in questionable setting. No contract, no complimentary walk through or shopping tour as advertised. Kitchen is not fully equipped - we tried to bake a pie and subsequently were informed baking function in ovens in building were disabled as not to get fire department involved as apparently had happened in the past. Cutting knife couldn't even cut anything. We had to buy not only cutting knife but also wok as there was no frying pan. The outlet in stove to plug microwave in didn't work so there were not enough outlets for all electrical appliances provided (hot water, toaster, microwave).Caveat: no air conditioning so we're practically sweating. And believe it or not, we were placed on top floor of 4 floor building with no elevator. Imagine carting suitcases and stuff up the many flight of stairs...The beds have the cheapest mattresses I have ever slept on - and do not fit a regular 6' person. Squeaks, both our backs aren't the greatest as a result.Mail service unreliable - we got notice from post office two days after notice was dropped off/left.There was no contract. No information sheet. At time of check in, superintendent showing apartment didn't know how phone system - incoming calls and voice mail - worked or our code for it. Key to back of building didn't work so had to walk from parking lot around to front to enter building. All sorts of inconveniences. Frankly its not worth the money spent.Do not construe this as bitter gripes but rather, 'from the horse's mouth' on our observations. Undoubtedly we were disappointed beyond belief.I wouldn't call this a hotel so disregard hotel-related questions that Tripadvisor requires.",
      "rate": 1.0,
      "tripDate": " July 2011"
    },
    {
      "title": "Nightmare !!!",
      "text": "Jessica Yao, the property manager of the place made us live a nightmare in the first day we arrived Toronto. The house was colder than than the outside, even snow was dropping from one of the windows and they advised us to put a pot under the window to collect the water. Like a very bad joke! There were nearly no kitchen utilities other than 2 old pots and 3-4 very old plates. They better throw them to the garbage. We immediately left the place and found a hotel that night at the cost of missing our deposit. I still can not believe how they can ask for such high rents for a terrible place.NEVER STAY THERE unless you wanna live a nightmare.",
      "rate": 1.0,
      "tripDate": " February 2011"
    },
    {
      "title": "Don't stay there",
      "text": "This is a terrible place. Though the apartment was supposed to be fully-furnished, a lot of kitchen utensils were missing. It had not been cleaned properly. There were problems one after the other. Then there was problem with the roaches. The roaches would run over the kitchen counter, stove and in & out of the microwave. If that was not enough, house centipedes started appearing too. The TV remote would not work. The washing machine/dryer are in the basement, but the basement itself looks horrible and smells moldy. I would recommend you skip this place and stay somewhere else. We left the apartment earlier than the planned check out date.",
      "rate": 2.0,
      "tripDate": " August 2010"
    },
    {
      "title": "DO NOT EVEN DREM OF STAYING THERE",
      "text": "I stayed in this accommodation for 5 days and these 5 days are my worst days in my life.I landed there and no body was there to show me the room. The manager Jessie just took the money for the 5 days and asked me to go to the room which is almost 200-300 meters away from the office. I went all the way to the room holding my luggage of arond 40KGs suitcases and other stuff. Nobody was there to help me or guide me to the room. The room is kept unlocked and the moment I entered in to room, it is stinking and I felt that some 10-20 rats are dead in that room and could not bear the smell and came out for some some fresh air.The bed was not cleaned, the linen and the bed sheets were not washed. Horrible room I have ever seen in my life. I stayed there just because its just walkable to my business place ans was suffered a lot. The hospitality of the staff is pathetic and nobody cares to fix any issues in the room, even after repeated complaints.I request every body in this world to to just avaoid this services under any circumstances. Even if you need to stay on footpath, that will be better tahn this accommodation.",
      "rate": 1.0,
      "tripDate": " May 2012"
    },
    {
      "title": "Unsafe and unscrupulous",
      "text": "The hotel or accommodation venue is a dump. The picture is extremely misleading. Many of the doors to the rooms look like they've been broken into because of the dents on the doors. My room has a flimsy lock with no inside security chain. The towels were well over used and should not have been offered. I know people who provide their pets with better towels. The cable system was not working though the manager pretended that it did. I called him back, he tried for 20 minutes and couldn't do it. The refrigerator was placed in front of the stove and of course that is a problem. The manager asked, \"are you going to cook?\" Obviously, the picture presented cooking would have been a challenge. Only one sheet on the bed which I assumed it was expected i would have covered my body with the disgusting comforter.DO NOT BOOK THIS SPACE!!!!!!!!!!!!!!!!!!!!!!!How bad would it have been? After paying 543.00 to Toronto Furnished Living, I went and paid $749 at a Quality Inn. An expense I could not afford, but did.",
      "rate": 1.0,
      "tripDate": " July 2016"
    },
    {
      "title": "Dead city overall",
      "text": "I guess I maybe ask for too much, but first thing I realized arriving to Toronto is that the streets are empty. It is a big, empty city. Where are the festivals, the walking streets, musicians? It is a concrete jungle. Pro: -Tall and impressive buildings-Lot of activity to do, the aquarium was simply amazing.-feel safe in the day-very multicultural, a lot of world restaurants.-tramways!!-Peoples are very helpful for information as a traveler.Con:-Empty. Does not feel alive at all. No street musicians, no festivals, no pedestrians roads.-Lot of homeless peoples and drugs. They don't even hide their illegal drugs.-I am all for weed dispendaries, but do they need to have one at each corner street?-Does not feel secure at night at all. Drivers are crazy and a lot of aggressive homeless peoples.-Everything is overpriced.-No much trees.Overall it was nice to visit, but we won't come back. Vancouver and Montreal feel way betters overall.",
      "rate": 3.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Rename Roach Hotel",
      "text": "We did not even stay one night! We were traveling with  a baby, one that had been premature at birth, and when we saw the roaches and they did nothing other than give us spray and act all surprised that there was roaches to begin with. Gave us three different sprays, two of them almost empty. We expressed our worry regarding the roaches and our infant daughter and that we did not want to stay. We called to complain and get our money back within an hour of arriving. We left after 3 hours when we were able to find another place to go, and were refused our money back. Thiefs. Tried cancelling the payment on the credit card and couldn't do that either. Found through Booking.com May 2015.",
      "rate": 1.0,
      "tripDate": " May 2016"
    }
  ]
}