{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Toronto Garden Inn",
    "url": "/Hotel_Review-g155019-d1062807-Reviews-Toronto_Garden_Inn-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.5",
      "reviewCount": 275
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "142 Seaton St",
      "addressLocality": "Toronto",
      "postalCode": "M5A 2T3",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/07/0a/d0/a6/toronto-garden-inn.jpg?w=500&h=-1&s=1"
  },
  "description": "Property is permanently shut down",
  "featues": [
    "Paid public parking nearby",
    "Parking",
    "Free High Speed Internet (WiFi)",
    "Wifi",
    "Free breakfast",
    "BBQ facilities",
    "Baggage storage",
    "Newspaper",
    "Sun terrace",
    "Air conditioning",
    "Housekeeping",
    "Telephone",
    "Wake-up service / alarm clock",
    "Flatscreen TV",
    "Non-smoking rooms",
    "Family rooms"
  ],
  "reviews": [
    {
      "title": "Brilliant",
      "text": "the perfect introduction to the B&B experience. Great food and lots of it and wonderfully presented. The rooms are clean and well appointed. Check out the common room, particularly the music stand beside the piano; an intriguing surprise awaits.For those of you who are more experienced with B&B accomodations, this one will, I believe, will become one of your favourites. Ergin is an excellent host.",
      "rate": 5.0,
      "tripDate": " July 2011"
    },
    {
      "title": "Nice place, interesting neighborhood",
      "text": "Having had decent luck with a similar b and b in another city, I figured I'd try again, especially with the insane hotel rates for this time due to the Toronto International Film Festival. The place is in an old victorian house on Seaton Street, which is a 13-block walk from Dundas Square, which is a Subway stop on the Yonge Street Line. It's about an hour via public transportation from Pearson International. As for the room, though they are somewhat small, at least the Magnolia room, it is comfortable.In terms of breakfast food, it's standard breakfast cereals including Chocolate Cherios and some other basic items like fruit and so on. The drawback is the first floor bathroom that is used while people eat.If there's a downside, it's the neighborhood, but I think that's more of a product of the size of the city with the seedy elements trickling into downtown and midtown areas. The area is part of Cabbagetown, which from what I've read is trying to gentrify. A block away is a homeless soup kitchen I believe and further down the block is a strip club. So you might hear noise outside your window from that element as well the occasional police siren. That's probably the only thing discouraging me from staying there again, but beyond that it's a good enough place if all you care about is sleeping.Though the owner is not physically there often, he is very easy to reach via email. The price is right around 79-99 Canadian depending on a single/double rate. And a tip, if you don't to walk down that part of Dundas Street from Church to Seaton, you can either take the 505 street car, which stops a block east of Seaton or you can walk up Seaton to Gerrard, which is the next major street and a nicer block as it passes through Ryerson University.",
      "rate": 4.0,
      "tripDate": " September 2011"
    },
    {
      "title": "Hidden Gem in downtown Toronto",
      "text": "Everything about Toronto Garden Inn was pleasant and comfortable, I only wish I had found it sooner. Great price, very homey feel, clean, friendly. Ergin, the Inn Keeper, is professional and kind. Each morning you wake to coffee on, a fully set table and lovely breakfast assortment, including a huge bowl of fresh fruit. I've been visiting my daughter here for over 5 years and will surely stay again for future stays. As far as the neighborhood, it isn't the best but I never felt unsafe.",
      "rate": 5.0,
      "tripDate": " September 2011"
    },
    {
      "title": "Let down",
      "text": "If the web site had not built it up, or if it was $20 cheaper, I may not have been so disappointed.  This is just a glorified dorm.  The breakfast that was raved about is just a huge assortment of cheap cereal, bread and some fruit with jams and cream cheese.  PLEASE check the bread, cereal and milk before eating, so much was moldy or had gone bad. Better yet, stay somewhere else and go to the St. Lawrence Market and have a really great breakfast!Room smelled a bit a was always too hot.  The only control was to block the heater and opened the window. The mattress was ancient and was more like a tub than a bed.  As for romantic, not likely.  But safe, I could hear everyone walking on the \"nightingale floors\" and would know if someone was sneaking up on me.  Bathroom was clean each day, but like a dorm, it all depends on the last person.  With eleven people and only 2 bathrooms, you can imagine it wasn't always easy. No smoking inside was great, but because the back door does not latch, the kitchen always smelled of smoke.I have stayed at all levels, this rates Nice Youth Hostel. Leave it for the kids, they will think it is a step up and enjoy it. Stay somewhere else if you want privacy, a better deal, and just not to be let down.",
      "rate": 2.0,
      "tripDate": " November 2010"
    },
    {
      "title": "Nice house-dangerous location",
      "text": "House and rooms are fair enough but although it is very central I would say it verges on dangerous to walk back to here from downtown at night",
      "rate": 3.0,
      "tripDate": " July 2011"
    },
    {
      "title": "The good the bad and the ugly...",
      "text": "This is a tough place to review because it's both really good, and really not so great in some ways.  The people are very nice, especially the German artist who lives in the basement and the manager/caretaker Monica.  Unal the owner is a nice guy, a bit scatterbrained, who is genuinely responsive to the needs of his guests.  The food for breakfast is fine- don't listen to the negative reviews about it.  If you want fancier food you should be paying a higher rate.  Which brings me to price- VERY reasonable.  And the rooms are pleasant, the atmosphere is friendly.  So what's not to like?  That depends on how much you value your sleep.  This is an old creaky house and you hear EVERYTHING.  And I'm a sound sleeper.  Did I mention the police and ambulance sirens wailing all through the night?  You should do a little research on the neighborhood- you're surrounded by needle-exchanges, soup-kitchens, homeless shelters, the works... (that said, it's not a dangerous area, from all accounts, it's just overrun with vagrants.)  Minor note- don't expect the internet to work- but every now and then it flashes on.So... lots of noise, not the best part of the city.  Would I recommend this b&b anyway... yes!  Because it's friendly and very good value... if you're a stingy, light-seeping middle-aged complainiac stay away... if you're young, or young at heart and on a budget, this is the place for you.",
      "rate": 3.0,
      "tripDate": " January 2011"
    },
    {
      "title": "OK but a bit disappointed",
      "text": "Quirky Victorian character house in a charming tree lined road, very convenient for central Toronto's Eaton Centre only a 15 mins walk.  Not the best of areas however, a bit downtrodden and a few dodgy characters but probably OK as long as you are accompanied.  House is furnished with old furniture (not quite antiques) a bit of a mixture.  Nice front parlour with telephone, TV and free internet.  Mid sized kitchen with everything you need, good self service breakfasts with plenty of variety of rolls, bagels, fruits, cereals, yogurts, hot drinks etc. - only spoiled by the second bathroom opening up in the middle of it.  Not very sanitary and somewhat embarrassing as breakfasts were punctuated by guys in their Y fronts walking in and out.  Met some lovely people fromall over the world around the breakfast table, a real plus.  Our bedroom (Magnolia) was on the first floor, not ensuite, again furnished with old furniture, bare floorboards,  an old elaborate carved bed was beautiful but was dressed in unironed crumpled grotty bed sheets under an old bed cover. Pillows were thin and lumpy so am guessing they too had some age to them.  Bathroom was spacious and clean at the end of the landing.  Didnt get any sleep first night as a full on student party was happening at the house opposite, police called a couple of times but eventually went quiet at around 05.00 am.  Met our host mid stay and at the end to pay, seemed like a very nice chap.  Price was CAN$113 including tax per night, OK I guess, Toronto is on the whole expensive accommodation wise.  In summary, not as nice as we expected - could be vastly improved by moving downstairs bathroom entrance out of the kitchen and just a few touches here and there, decent bed linen is an absolutely must.  Would probably not stay again.",
      "rate": 3.0,
      "tripDate": " October 2010"
    },
    {
      "title": "Good experience for short term stay",
      "text": "This is a good place for a short term stay, as it is very close to stopping points that take you to the main avenues in the centre of toronto.The food is healthy with good quality options, such as fresh fruit, eggs, juice, cereals, milk, vegetables, etc. The amenities are clean and spacious.This is a good option for those looking for some privacy and willing to spend a bit more than in a hostel and less than the cheapest hotels in the area.",
      "rate": 3.0,
      "tripDate": " December 2010"
    },
    {
      "title": "Good budget accommodation in central Toronto.",
      "text": "Friendly, helpful hosts,convenient location,  clean, well priced.",
      "rate": 3.0,
      "tripDate": " March 2010"
    },
    {
      "title": "A quiet and well located spot",
      "text": "We appreciated the proximity to the center of Toronto.Old house with charm. We enjoyed the room at the main floor. Very quiet. Unfortunately,with share toilet.The autonomous breakfast -- with varied choice -- is a good idea.",
      "rate": 3.0,
      "tripDate": " October 2009"
    },
    {
      "title": "Perfect Place",
      "text": "Toronto garden Inn is an absolutely great place. I stayed in this B&B one week in 2010. I visited a lot of countries for business and vacation, and I saw a lot of B&B too. I was referred to the Toronto Garden Inn, and I suggest to all my friends. Breakfast was very good with a huge selection of everything and there was enough variety for individual's taste. The room is so clean and nicely decorated. Bathroom and kitchen is so clean, and also have unique decoration. Complimentary snacks and drinks available all day. Free local calling, wifi internet and computer plus a printer. The host was really nice, had good advice for us on what to do in the city. The host have all the time beautiful smile and kind, and embracing personality. I would like to stay again.",
      "rate": 5.0,
      "tripDate": " November 2010"
    },
    {
      "title": "An excellent stay",
      "text": "Toronto Garden Inn was the perfect place for us since it was a short walk to Downtown; therefore we could explore a lot of Toronto on foot. The B&B was really wonderful: clean, quiet, comfortable, with a generous (self made) breakfast. The host was really nice, had good advice for us on what to do in the city, provided umbrellas when it rained :-) and even spontaneously invited us to a bbq one evening. We enjoyed our stay there very much and would absolutely recommend the Toronto Garden Inn.",
      "rate": 5.0,
      "tripDate": " July 2010"
    },
    {
      "title": "Troveling with right person will make much more fun~",
      "text": "Gardrn Inn is very nice! Because it locates in a quite street, I can enjoy nice sleep. What's more, it is only 15minits by walk from Eaton. Nice sleep and convenient transportation! Bus roots is just in the next street. My boyfriend and I lived in this B&B for nine days, we really enjoyed the time we spent in Toronto. The price for this B&B is reasonable. I like the decoration in side which is the old victoria age style. I think we will back to this B&B again. By the way, I love the Magnolia room most. I lived in Trillum room, which is private and bigger,is the second best.",
      "rate": 5.0,
      "tripDate": " December 2010"
    },
    {
      "title": "Lovely set-up!",
      "text": "We stayed at this Bed and Breakfast while we were traveling to Toronto.  When you first arrive, you wonder if you're in the right place as the area itself seems a bit run-down.  However, that thought quickly disappears once you go inside.The B&B is well-maintained, the rooms are clean and comfortable, and the landlord keeps the kitchen stocked and free for you to use.  This was a very nice feature!  You felt like you could roam a bit, read in the living room, make yourself tea in the kitchen and play cards, so on and so forth.The owner makes you feel very welcome, and it was well worth the stay!",
      "rate": 4.0,
      "tripDate": " July 2010"
    },
    {
      "title": "Good value, friendly B&B in Toronto's Cabbage Town",
      "text": "We really enjoyed our 4-day stay in Garden Inn B&B  located on a shady street steps from the street car and Metro. Although it's an over a hundred years old house, the owners have modernized it and kept it in a very good shape. They provide all day access to the separate dining room and a roomy kichen. It's very clean and very well supplied. Self-service breakfast allows for  a lot of flexibility in scheduling your daily activities. There's also a TV and a compute for guests' use in the living room.",
      "rate": 4.0,
      "tripDate": " July 2010"
    },
    {
      "title": "I will stay again at this hotel",
      "text": "Very convenient location, friendly host family atmosphere at this price it is a steal, we cannot imagine downtown so near at so cheap prices.",
      "rate": 4.0,
      "tripDate": " May 2010"
    },
    {
      "title": "My week in Toronto",
      "text": "What a wonderful week I spent in Toronto and I can only say I was so lucky in finding such suitable accommodation i.e. Toronto Garden Inn.  I never imagined one could find a B & B in Toronto and to find such a clean, friendly and homely atmosphere I felt like it was home.  Ergin was a super host and ensured his guests were provided with every possible convenience and he certainly didn't spare the heating.  Very comfortable room, ideal location within walking distance of downtown Toronto.  Hope to return in the next few months and will certainly book well in advance THE TORONTO GARDEN INN.",
      "rate": 5.0,
      "tripDate": " October 2011"
    },
    {
      "title": "Fantastic stay!",
      "text": "My partner and I had a wonderful stay here. The Garden Inn, is in a great location for walking in to Toronto down town area. Near local transport. We never had a problem. Great facilities available to you, I especially enjoyed the breakfast choice in the morning. :)I would recommend for value and location. Ergin the owner was lovely, very welcoming and offering advice on things to do and see. Would stay here again!Thank-you again Ergin.",
      "rate": 5.0,
      "tripDate": " August 2010"
    },
    {
      "title": "Great!",
      "text": "The place and  Ergin the owner were fantastic:-DThank you!Alain",
      "rate": 5.0,
      "tripDate": " August 2010"
    },
    {
      "title": "A place to stay!",
      "text": "We visited the Toronto Garden Inn for the second time and again we had a great time. The B&B has a great warm and friendly interiour and it's very clean. Unal, the owner, is a friendly, easy going person who makes you feel at home. We definitely had a great time and recommend this B&B to everybody!",
      "rate": 5.0,
      "tripDate": " May 2010"
    },
    {
      "title": "Nice place!",
      "text": "Before I came to Toronto, I spent a long time looking for the right B&B place for me to go.I finally found this one, and the moment I saw the picture of it, I loved it!This was my first experience with B&B and I must say: it was definitely a good one!I had a pleasant time there. The place was nice, clean and met exactly my requirements - and the host was very nice and helpful with hints and tips, too!!As this place is only 1 km away from Dundas/Yonge Square, I could reach it within a nice 20 minutes walk. I could have taken the streetcar as well - but as I love to walk, this was perfect for me!I love this place, and if I come back to Toronto (which I hope I can do soon) then I will definitely try to get a room there, again!Thank you for a lovely time!!",
      "rate": 4.0,
      "tripDate": " September 2011"
    },
    {
      "title": "Wonderful :)",
      "text": "I stayed here for 9 nights and had the most amazing time. It feels as if it is a home from home. The owner is lovely and goes out of his way to be helpful. Its a 10 min walk from Dundas Square and therefore all major attractions including the AGO are within walking distance. I would highly recommend this to my friends and family and if I return to Toronto I would definitely want to stay here again. The only one negative aspect I must confess is that the surrounding area is a little run down however this home is a sanctuary of sorts and as with anywhere in Toronto one never feels unsafe. The b&b is spotless and my bed was comfortable and the breakfast is superb and as a vegetarian it catered very well. So all in all a thumbs up! I am certain that if you choose to stay here you will have a most relaxed and enjoyable stay in Toronto.",
      "rate": 5.0,
      "tripDate": " February 2011"
    },
    {
      "title": "I will stay there on my next visit.",
      "text": "Clean place. Great value for money. Convenient location. The staff is very accommodating.",
      "rate": 4.0,
      "tripDate": " November 2010"
    },
    {
      "title": "My stay at the Toronto Garden Inn",
      "text": "Just stayed at the Toronto Garden Inn for two days and had a great experience! Ergin, the inn manager, was super, helping me out with directions, places to eat ,parking etc.,and just overall assisting me in any way he could to make my stay easy and fun. The inn itself is great, clean and appointed with everything you\"ll need for your stay,and it\"s only a quick walk(or trolly ride) to Yonge St. and the heart of downtown. I hope I'll get a chance to get back to Toronto soon and I know where I'll be staying!",
      "rate": 5.0,
      "tripDate": " October 2011"
    },
    {
      "title": "A safe, comfortable, affordable place to stay in Toronto",
      "text": "We stayed at the Toronto Garden Inn for five nights in September and enjoyed our stay. The hosts were very helpful and friendly, the self-serve breakfast met our needs admirably, the B & B was within walking distance of everything we wanted to do and see in Toronto. The other guests were an interesting group and breakfast discussions were entertaining. The house is acoustically very live - you will hear the front door close, you will hear hallway conversations, you will hear domestic arguments in other rooms. The noise level depends upon who else is staying at the house while you are there; some nights we resorted to earplugs, while other nights the house was quiet. If you would classify yourself as a \"clean freak\" this may not be the place for you: the floors, sinks, toilets and tub are spotless and the bed linens and towels are freshly laundered and in good condition. The window sills, wainscotting, and baseboards need washing, and you'll meet dust bunnys when you go seeking a plug for your laptop.  Your satisfaction with Toronto Garden Inn will depend on how clean you like your surroundings.",
      "rate": 4.0,
      "tripDate": " September 2010"
    },
    {
      "title": "great !!!!!",
      "text": "Toronto Garden Inn is probably one of the most pleasant,  friendly and affordable place I'have ever been in.Our host was just as charming and efficient as possible... just a feeling of peace and trust...A great place where you'll feel at home !!!! thanks a lot.I'll be back soon.Yannick",
      "rate": 5.0,
      "tripDate": " December 2010"
    },
    {
      "title": "It feels like being at home",
      "text": "The house is located in a central place of Toronto. Most the things are walking distance. The rooms and even the common bathrooms are very clean. I liked the lovely arranged living room with its piano, the old sofa and the chimney. The house with its people is a very cozy place.",
      "rate": 5.0,
      "tripDate": " January 2011"
    },
    {
      "title": "torontos best kept secret",
      "text": "when i first pulled up to the Toronto Garden Inn i was asking myself.....did i choose the right place ? ....the exterior is very ordinary to say the least.......but when you enter you start realize just how nice this place is.....Unal and Ergin are the most gracious of host......the front room offers you a comfortable setting with free local phone service , computer , television , dvd`s , and a supply bof reading material.....you begin to sense a nice home away from home feeling right away......the entire place is very neat and clean.....breakfast is included here and what a treat !........they offer a nice selection of fresh fruit , cereals , juices , breads , bagels , teas and fresh brewed coffee.....you want eggs ?......they got you covered.......sorry folks......you do have to make your own breakfast....ha ha.....all the rooms have tv , radio , and comfortable beds with fine linen.....in the summer you have a/c and the winter warm moist heat......no dry nose and throat here.....the showers have endless hot water......a 15 minute walk takes you to the Eaton shopping center and Dundas Square where all the action is......this place has the best rates around for all you get and it is Toronto`s best kept secret.....i`ve been coming here for months and you need not look any farther then The Toronto Inn.......                                                                                                             martin j. folga                                                                                                             Cheektowaga, new york",
      "rate": 5.0,
      "tripDate": " December 2010"
    },
    {
      "title": "Good Value",
      "text": "I am very satisfied with this B&B.  The two hosts were friendly and helpful. Breadkfast was plentiful and filling.  There's a laundromat around the corner of the street which is a great advantage.  There were two lap tops and a printer for guest to use, although the one connecting to the printer wasn't working while we were there.  Phone is free to use if you have a prepaid calling card.  The house is old  and Victorian style; we have the biggest room, the Orchid room and it was very comfortable.  The location has many eateries, mostly ethnic.  The only drawback is the small bathroom  on the first floor, in the kitchen.  Kind of awkward in the morning when you come out of the bathroom with other guests  eating breakfast , at other times it's fine. The bathroom on the second floor is much bigger.  Both bathrooms have good showers.  The outside of the house looks drab and untidy...but that's the same with all the houses around; it's a old neighborhood.  Parking could be a problem, although we were able to find a parking a parking place everyday.  The host provided us with a parking permit.  Be sure you don't park in front of the fire hydrant at all times.   My husband parked the car there, even it didn’t have a red line; parking enforcement came by 2:00am and gave us a ticket!  Walking distance to Chinatown, Eaton Center and some other attractions",
      "rate": 4.0,
      "tripDate": " April 2009"
    },
    {
      "title": "A great B&B very welcoming and very confortable",
      "text": "I recommend this B&B for those wants to have a place to live in downtown of Toronto.Host is very polite and very nice. The location is convenient and close with buses and street cars.Rooms are very clean and spacious, and allow to have peaceful moments.Moreover, the food is varied and healthy (fruits, beverages, eggs, cereals...)Finally, a very great place at cheap prices",
      "rate": 5.0,
      "tripDate": " January 2011"
    },
    {
      "title": "Good priced accomodation in a seedy location",
      "text": "This is a well priced bed and breakfast - good kitchen facilitties with a self help provided breakfast and the option to use the kitchen at other times. There is a good guest lounge with free internet service. However the  area is  a bit scarey with a lot of \"low lifes\" hanging around the street around the corner and there are no decent eating places nearby. The  neighbouring stores are dirty. We were on the second floor where there is only one shared bathroom  and our room the \" Mimosa\" is fairly small. On the plus side it is within easy walking distance to the main down town area and there is a laundry near by.",
      "rate": 3.0,
      "tripDate": " July 2009"
    },
    {
      "title": "Good value, somewhat scary location near Eaton Centre",
      "text": "Staying at this B&B was similar to staying at an absent friend's house; we barely saw the owner who seemed to be living off-site. It was very reasonably priced and just a few blocks from Eaton Centre. However, the location was a bit sketchy, with groups of men loitering and arguing on the street, as well as a nearby strip club. WiFi was very easy to use and had a strong signal. Breakfast was strictly do-it-yourself, although 24-hour access to the kitchen was nice for a cup of tea.  American visitors should be aware that they will be sharing a bathroom, although this was not a problem. The Orchid Room on the main floor was surprisingly quiet.",
      "rate": 3.0,
      "tripDate": " June 2009"
    },
    {
      "title": "Excellent service and attention",
      "text": "In March my husband, me and the kids all visited Toronto for a week. We stayed at the Toronto Garden Inn and got excellent service and attention, not to mention the affordable price. We were settled in a spacious room with comfortable beds. Our room was cleaned every day and we received fresh towels regularly. The breakfast was pleasant and with a lot of fruits.  The owner Ergin made sure the fridge is full and so I could prepare some meals myself at the kitchen which was fully equipped. We all felt as if staying with an old friend. We took our time to explore the city and were happy with the location of the Toronto Garden Inn as well, since it is close to the shopping zone of the city and the Dundas Square with all its attractions. When we were onsite the kids used the computer in the lounge room. My only complaint is that the area was rather noisy, but still the place is nice and cozy, and the owner is friendly, so we definitely recommend it.",
      "rate": 5.0,
      "tripDate": " March 2011"
    },
    {
      "title": "Relaxed Atmosphere and Lots of Character",
      "text": "My partner and I stayed here overnight for a quick getaway to Toronto this past weekend. This is an older home with plenty of character and artful decor! But most importantly, the rooms were exceptionally clean. It's a casual, relaxed sort of place - you let yourself in and serve yourself breakfast.  The owner was kind, welcoming and unassuming. My favourite part of our stay? Sitting out in the garden, waking up with a strong cup of coffee and listening to the sparrows. In my opinion, this is the best deal in Toronto. We would absolutely stay here again.",
      "rate": 5.0,
      "tripDate": " August 2011"
    },
    {
      "title": "Good for young travellers, near to the public transport!",
      "text": "The B&B is a good place to stay if you don't have a large budget. Ergin, the host recieved us with a warm welcome a did a lot of efforts to keep the house very clean. For breakfast you have a big choise of cereals, jams, fresh fruits, teas, coffees,....The public transport (Streetcars and buses) are around the corner and in less than 10 minutes you're in the center of Toronto. We were sleeping in the orchid Room, which I can not recommand. It's on the mainfloor, next to the livingroom and the kitchen. The bed was noisy and the bathroom was seperate (entrance in the kitchen). The other rooms are much better, the bathroom on the second floor aswell! If you're a backpacker and like to cook something yourself, the kitchen has lots of opportunities for you. For people who are happy with a bit less luxury than a hotel, I recommand to stay at Toronto Garden inn!",
      "rate": 4.0,
      "tripDate": " August 2011"
    },
    {
      "title": "Clean, affordable, great kitchen and really good coffee!!!",
      "text": "The house has a nice worn-in feel, with clean and comfortable bedrooms. The central air-conditioning was a welcome relief from the July heat. The kitchen is large and well-equipped, and also very clean. The other guests were great, helpful and respectful. Ergin (the proprietor), was around when needed, and was willing to help with all the questions I had. The coffee machine in the kitchen makes an amazing brew. Free WiFi worked well, and there was a public computer downstairs. Also a piano, movie, and book library.",
      "rate": 4.0,
      "tripDate": " July 2011"
    },
    {
      "title": "Homelike house",
      "text": "Nice place where you really feel at home, taking your breakfast in a big kitchen with everyone living in the B&B. Comfortable room with space and nice bed.The location is also good if you don't like the crowded center of the city.",
      "rate": 5.0,
      "tripDate": " September 2011"
    },
    {
      "title": "I recommend Toronto Garden Inn...",
      "text": "I found the inn to be very comfortable, clean, convenient and safe. The room size was fine - not spacious, but plenty of room for a couple (tho I was solo so I had lots of room). Bed was very comfortable. Room very clean; sheets and towels very nice. Sizeable closet and dresser. Small color TV, clock/radio. I was in the Begonia room, and it is on the second floor at the head of the stairs next to the upstairs shared bath - but down a little alcove so private. People were very considerate of others so the bath noise didn't wake me, and if I was up it was not intrusive. The only startling noise was when someone tripped on the stairs - they are not carpeted and that was loud. I looked into two other rooms down the hall - they were a bit larger and also looked very nice and very clean. Bathroom was spotless, and I always had hot water and availability. Breakfast was plentiful; people cooked their own eggs if they wanted and it was self-serve, but everything fresh and easy. I was the first one down one morning and turned on the coffee pot. Other guests included couples, a family, some single women. Ergin, the host was friendly, helpful, and flexible. If you don't bring your own laptop or netbook, there is a computer and it's generally available; also a phone to use for free local calls. No printer so you can't print a boarding pass. Umbrellas available to use in foyer. The area is \"in transition\" and there's a soup kitchen a block away at a church so you will see homeless people. I felt perfectly save in the daytime, and others told me evenings were fine too but given my schedule I was typically back by 8:30 or 9:00. House is always locked with a keypad lock. Keys for your room. Lots of other victorian houses on the street being renovated. Garden was very small, and needed some cleaning out, but it was too hot to use. Strict non-smoking. 10 - 12 min walk to Eaton Center in downtown.Only minor complaint - the AC was on full blast in my room and so it got a bit cold for me to sleep, but happy to have it since the weather was hot!Definitely a great value for the price! I would recommend, and go back.Note - main floor bath is right off the kitchen, but it really was not a problem.",
      "rate": 4.0,
      "tripDate": " June 2011"
    },
    {
      "title": "Cozy",
      "text": "It is a quiet hotel  with great attention by his manager, a few steps from the 505 Dundas streetcar route (Sherbourne stop) and excellent self service breakfast.",
      "rate": 4.0,
      "tripDate": " November 2010"
    },
    {
      "title": "You can not go wrong if you choose to stay here!",
      "text": "I just returned from my third stay at the Toronto Garden Inn.  I spent 6 nights and was just as happy as on my previous stays.  The man running the bed and breakfast (Ergin) is very attentive to detail and is very dedicated to the job.  Most impressive is that I reserved over the phone and when the email confirmation arrived, there was a price difference based on a miss-communication based on language or phone quality, whatever.  The innkeeper just honoured the deal that I had expected and stuck with the lower nightly rate, even adding 10% savings for staying several nights.   Even though it is not a hotel, the innkeeper tidies up your room every day and makes the bed, also bringing fresh towels daily.  There are various teas and coffee to relax after a day on the go and the breakfast is the nicest I have ever seen in all the bed and breakfasts I use:  fresh kiwi, mango, bananas, oranges, apples,.....the fridge is full of soy beverage, low-fat and standard milks, orange and fruit juices, low-fat and standard creamer, fresh eggs, yogourts, etc .  The kitchen is fully equipped and there are two nice supermarkets nearby.  I shopped and made chicken cacciatore on Sunday night and found every item I needed to make the meal.  Ergin made sure I knew there were umbrellas for the rainy week and is open and friendly, often downstairs chatting and helping guests.  It is a short 15 min walk to nightlife of Church Street and Yonge Street and right on the Dundas Street tram line.  Eaton Centre shopping is 10 min by foot and Yonge Street subway line right there too. There is a free computer in the sitting/community room for guests and wifi connection throughout the house.  Also very impressive is that Ergin is always there when I check out and offers to drag my heavy luggage down the stairs and out to my truck!   Thanks Ergin!!!   :) :)",
      "rate": 5.0,
      "tripDate": " April 2011"
    }
  ]
}