{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Toronto Furnished Apartments - University Plaza",
    "url": "/Hotel_Review-g155019-d3381091-Reviews-Toronto_Furnished_Apartments_University_Plaza-Toronto_Ontario.html",
    "priceRange": "$$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.5",
      "reviewCount": 16
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "140 Simcoe St",
      "addressLocality": "Toronto",
      "postalCode": "M5H 4E9",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/06/77/13/d5/toronto-furnished-apartments.jpg?w=500&h=-1&s=1"
  },
  "description": null,
  "featues": [
    "Free High Speed Internet (WiFi)",
    "Air conditioning",
    "Kitchenette"
  ],
  "reviews": [
    {
      "title": "A very good company !",
      "text": "Toronto Furnished Apartments is a very good company with good services. The maintenance men are reactive when you have a problem with the tv or the phone! The apartements are very large, spatious and with a good view.If you have a trip to Toronto, don't hesitate to go to Toronto Furnished Apartments; you will be well accomodated there.",
      "rate": 5.0,
      "tripDate": " May 2014"
    },
    {
      "title": "Pleasure experience",
      "text": "During my stay at the TFA Company, the staff responsible for the logistics of the apartment was very kind and considerate, where I felt like I was at home with all comfort. The apartment had all the structure of a complete residence.",
      "rate": 5.0,
      "tripDate": " January 2017"
    },
    {
      "title": "A different way to enjoy Toronto",
      "text": "My husband and I recently had occasion to visit Toronto for a little while longer than our typical 2-3 night stay and thought we would try 'living' there -- in the downtown -- and see what we thought of it.  So, Toronto Furnished Apartments and a snug 1 bedroom condo seemed to be the perfect solution. It was very convenient, in a well-managed and secure building, close to everything we wanted to be close to for our 'experiment'.  There were a few minor issues with the apartment, but these were all addressed in a very timely fashion by the properties manager whose office is very close by.  All-in-all a very positive experience for our first time experiment in short term property rental.",
      "rate": 4.0,
      "tripDate": " May 2015"
    },
    {
      "title": "Terrible",
      "text": "Arrived at apartment to meet the manager who had arrived with our bedding in garbage bags.. the apartment was disgusting, looked like someone else’s possessions still in apartment. Blind hanging off window and toilet flushed once before blocking up.  Go outside of our door to see the apartment directly opposite to have a police crime sticker on the door",
      "rate": 1.0,
      "tripDate": " July 2018"
    },
    {
      "title": "Stunning apartment, amazing location",
      "text": "We booked Toronto luxury apartments through booking.com at 168 Simcoe Street.  The day before we arrived I had an email from them advising that the person in the apartment we'd booked wanted to stay another few nights, but they could put us in 140 Simcoe Street instead.  I was slightly worried but I need not have been, Tara in the office arranged everything perfectly with booking.com and 140 Simcoe, the concierge were expecting us and our keys were waiting.  It was seamless and the apartment was STUNNING!!!! I would definitely book with them again.  Beautiful hotel, wonderful stay.",
      "rate": 5.0,
      "tripDate": " October 2019"
    },
    {
      "title": "Home away from home",
      "text": "Great location, in the entertainment area, close to the MRT, convenience stores, eateries and shops. Everything is within walking distance. I stayed over a month and was generally comfortable in the one-bedroom with den apartment. The con is the living area is a bit dark. The window is not very big. The bathroom is quite small and has no window. There was only one light in the bathroom. I had to request a change in the shower curtain because low lighting. The bathroom needs to be upgraded. The kitchen is modern and has all the appliances including a double door fridge with an ice and water dispenser. There is a separate laundry with a washer/dryer combo.  The property manager was generally responsive (within 24 hours) to my queries. The building has 24 hours security.",
      "rate": 4.0,
      "tripDate": " September 2018"
    },
    {
      "title": "Wonderful!! Highly recommended!!",
      "text": "I stayed here on a business trip for three weeks. The rooms are extremely spacious, and all the amenities you needed to take care of yourself were available. The apartment is serviced on a weekly basis, and the staff are extremely helpful and friendly. The location too is extremely helpful, it's just a 2 minute walk to the financial district of Toronto. There's a lot of good restaurants and pubs around as well. Everything's within walking distanceI'd reccommend TFA to anyone.. Value for money",
      "rate": 5.0,
      "tripDate": " February 2015"
    },
    {
      "title": "Great company and people",
      "text": "Toronto Furnished Apartments is a great company to work with and it employees are very good as well.   Their furnished apartments are great compared to hotel living with various amenities.I would definitely encourage anyone who is looking for a furnished apartment vs a hotel room to use the services of Toronto Furnished Apartments.Shailesh Godse",
      "rate": 5.0,
      "tripDate": " December 2013"
    },
    {
      "title": "Small but perfectly formed",
      "text": "my mother was taken into Toronto General Hospital so I was looking for a place to stay that was within easy walking distance and booked it because it fitted the bill.  Access to transport could not be better.  Osgoode subway station is less than an minute away and I found walking to trendy Queen Street W and Eaton Centre was a mere short stroll.  The location was perfect, but you want to know about the flat, don't you!Cleanliness: 10/10 ( and I'm really fussy)Amenities:  washer/dryer, iron, hairdryer, all excellent tried and tested.Wifi:  totally reliable The office for this flat is just downstairs next door.  Haim in the office could not have been more friendly and helpful.  This man could give a masterclass in customer service.My only criticism is that the couple next door could use some marital counselling or volume control, lol.  They won't be there when you arrive, so don't let that put you off.",
      "rate": 5.0,
      "tripDate": " April 2017"
    },
    {
      "title": "A Comfortable Place to Rest",
      "text": "This location is very comfortable and everything inside is perfect. Even though the outside is under going some construction, the luxury inside makes that fact, something quickly forgotten. Well thought out appointments, plenty of space to unwind and feel refreshed, most everything that says 'we want you here'. The view of both the city and the bay give a beautiful Vista to relax and take in.No location is without any faults and this one is high on the list of being the first. This is a location that over delivers on value.  Well worth the stay.",
      "rate": 4.0,
      "tripDate": " April 2015"
    },
    {
      "title": "Perfect Location",
      "text": "Second time I stay in their spacious 2 bedroom condo, and another great experience. It has an awesome gym that has all the equipment I need, a perfect location (I walked to all my downtown meetings), and the staff was pleasant and friendly.  The booking process is also very easy. Both times the rooms were immaculately clean, stylish and I had great concierge service. The whole experience was seamless. I definitely would recommend, and I will be staying here again next time I'm in Toronto.",
      "rate": 5.0,
      "tripDate": " January 2015"
    },
    {
      "title": "Great short term properties",
      "text": "Apartments are walking distance to all amenities. Very clean and professionally furnished. The price was great compared to hotel rooms. Having full kitchens and ensuite washer and dryer is a definite added benefit.The service provided by Toronto Furnished Apartment staff was excellent! I would rent here again in a minute and recommend using these apartments as alternatives to high priced downtown hotels.",
      "rate": 5.0,
      "tripDate": " August 2014"
    },
    {
      "title": "Great location, as well as a great price and value",
      "text": "Needed accommodations for a couple of nights in downtown Toronto, and a friend referred me to Toronto Furnished Apartments as an alternative to a hotel. I am glad she did. The room was nicely furnished, the rate was reasonable, and the view was great. In addition, it was a great having the convenience of the en-suite washer and dryer as well as a kitchen.",
      "rate": 4.0,
      "tripDate": " April 2014"
    }
  ]
}