{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Toronto Don Valley Hotel & Suites",
    "url": "/Hotel_Review-g155019-d186892-Reviews-Toronto_Don_Valley_Hotel_Suites-Toronto_Ontario.html",
    "priceRange": "$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.0",
      "reviewCount": 1187
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "175 Wynford Dr",
      "addressLocality": "Toronto",
      "postalCode": "M3C 1J3",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2c/21/57/a7/yyzdvexterior-dpi.jpg?w=500&h=-1&s=1"
  },
  "description": "Toronto Don Valley Hotel is a spa like resort located near downtown Toronto where guests can relax in comfort. This Toronto resort offers a variety of vacation packages to suit any budget, meeting facilities, wedding venues, and multiple dining options.",
  "featues": [
    "Paid private parking on-site",
    "Free High Speed Internet (WiFi)",
    "Pool",
    "Fitness Center with Gym / Workout Room",
    "Bar / lounge",
    "Pets Allowed ( Dog / Pet Friendly )",
    "Business Center with Internet Access",
    "Conference facilities",
    "Parking garage",
    "Wifi",
    "Pool / beach towels",
    "Indoor pool",
    "Outdoor pool",
    "Heated pool",
    "Restaurant",
    "Breakfast available",
    "Breakfast buffet",
    "Vending machine",
    "Banquet room",
    "Meeting rooms",
    "Baggage storage",
    "Concierge",
    "Gift shop",
    "Non-smoking hotel",
    "Outdoor furniture",
    "ATM on site",
    "24-hour front desk",
    "Dry cleaning",
    "Laundry service",
    "Air conditioning",
    "Housekeeping",
    "Private balcony",
    "Room service",
    "Safe",
    "Flatscreen TV",
    "Non-smoking rooms",
    "Suites"
  ],
  "reviews": [
    {
      "title": "Going downhill",
      "text": "We have been staying at this hotel for quite a number of years. While we appreciate that there are certain amenities that are not offered due to Covid, the overall experience at this hotel is going downhill.We appreciated that we could request additional towels, toiletries and coffee/tea supplies in lieu of having staff enter our room.The paper cups, no corkscrew, no wine glasses/any type of glass seemed new to us as did the lack of refrigerator. We booked the same room category as last year (we even think that we were in the exact same room) and there was no fridge. When I called to ask about that, I was told that a fridge only came with certain types of rooms (of which I was certain ours was one). When I asked about a corkscrew, I was told that there were no spare corkscrews in the hotel, but that I could come down to the bar and have the wine bottle opened (which the bartender did for free, but I tipped her as she was very nice!). So, a solution, but a bit inconvenient.On Saturday morning, there did not appear to be any staff working at the restaurant, despite one other couple dining. A member of the cleaning staff offered to to into the restaurant to see what was going on and came back to said that someone would be out soon. We waited about 15 minutes to get seated (we thought about leaving, but that would have required sourcing another location to grab breakfast). Once seated, the service was decent though.While the room and bed were comfortable, there was a very strong smell of cannabis coming down the hallway to our room upon our return from dinner on Friday night. The smell was then also in our room when we opened the door. We aired out the room by opening the patio door, but truly, the stale smell never left the room the entire weekend. In a non-smoking room, I expect not to smoke, but I also expect not to be infiltrated by smoke either.",
      "rate": 3.0,
      "tripDate": " September 2021"
    },
    {
      "title": "Some good, some mediocre",
      "text": "We stayed on a Sunday night after a wedding close by. The overall impression of the hotel when we first arrived was good. The downstairs lobby/restaurant area is quite large, but a bit disjointed. It was clean and nicely decorated.We arrived early so had a late lunch first with a large group. The wait staff in the restaurant were fabulous. Very accommodating very competent and friendly. This was the case both at lunch on Sunday and breakfast Monday morning. I can't say this is the norm because we were virtually the only people so they had plenty of time to give us lots of attention. The food was quite good. When we decided to check in, it was fast. However, the front desk staff were not in the least bit friendly. During our stay the desk was often unmanned. The rooms we were given (2 of them) were quite outdated, and not very well stocked. Beds and pillows were very uncomfortable. They need a serious update. And while they had flat screen TVs, they were small, much smaller than any other hotel I've stayed at in a very long time. For the price we paid for a hotel in Toronto, it was good value for the money, however if you are expecting the rooms to match the lobby, you will be disappointed.",
      "rate": 3.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Great Food, Great Stay, Convenient Location",
      "text": "I had the pleasure of returning to the Toronto Don Valley Hotel & Suites (TDV) after many years of travel to this property from a very young age. It was really nice to see that the TDV has been refreshed and renewed. The updates make it feel more modern but still very welcoming.I checked in a little earlier than expected but was greeted with open arms by the front desk clerk Raquel who not only had a breadth of knowledge on the property but made me feel right at home. She addressed all of my concerns in a timely manner and got me into my room early – that is always a bonus!I was travelling solo and opted for the King Deluxe Room which offered a beautifully updated interior overlooking the ravine. There was a loveseat in the room too which was nice as I was staying for 4 nights, meaning I would spend some time in my room – not just for sleeping.I’d like to express my gratitude to Champagne, Head of Housekeeping, who went the extra mile to ensure my accommodations were perfect, each and every day! Besides the room, the hotel offers an indoor and outdoor pools, fitness facility and dining at the DV Bar | Bistro.I had the pleasure of meeting Food & Beverage Manager, Executive Chef Ben West who brings along many years of culinary experience to the TDV from many well-established restaurants around the World. From the breakfast buffet to lunch, dinner and late-night menus, options are plentiful and delicious!The TDV’s proximity to the Don Valley Parkway make it a quick 12-15 minute drive to the downtown core.It was a pleasure staying here once again, and I look forward to my next stay!",
      "rate": 4.0,
      "tripDate": " March 2020"
    },
    {
      "title": "Miserable management",
      "text": "We needed to find a Toronto hotel for a family member who was going through cancer treatments at Sunnybrook Hospital. Even though the hotel is tired and needs some updating, the location was attractive and it advertised a 30-day stay starting at $1500. We called to arrange this stay and the representative on the phone indicated the price for this length of stay had changed and rooms start at $1600. They said they recently increased their price and just hadn’t changed the website yet. When we arrived at the hotel a week later, the advertised price had not changed and the front reception staff gave us the same story…. They said would not honour the price on the website. (This is called a bait and switch.) With all the stress of supporting our family member, we elected to not cause a fuss as we were checking-in since the staff had a “take it or leave it attitude”. We decided to speak to the general manager later….  He was dismissive and rude saying it was not worth his time to change the website and since we checked-in with the higher price there was nothing he was willing to do and then he hung up on us! This likely explains why the staff weren’t always courteous to their guests. The GM sets the tone. A month later… the website is still advertising the old price. This place could be a welcome refuge for people receiving lifesaving treatments just down the street.  If this hotel wasn’t so close to the hospital, we would not have given them our business. I would not recommend this hotel for a vacation stay.",
      "rate": 1.0,
      "tripDate": " March 2022"
    },
    {
      "title": "Absolutely Trash & Garbage!",
      "text": "I was there with my family and friends from Montreal. We booked 7 rooms. Price was expensive and the service we've got was 100% garbage. I know, it's a difficult time to stay outside home and arrange stuff but come on when you charge higher money to the clients, please provide them ATLEAST a microwave oven and a refrigerator! AC in the room was noisy and bad smells all around the balcony! I Will never ever think about this garbage hole again.",
      "rate": 1.0,
      "tripDate": " August 2020"
    },
    {
      "title": "Terrible customer service, grungy hotel",
      "text": "I recently stayed at this Hotel with my sister, solely because we needed to be near Sunnybrook Hospital.  Upon check in, we had to leave a $450 authorization on a visa for \"incidentals\".  The hotel is dated and grungy, sticker on our door said \"Sanitized for your protection\", but when we went in it did not feel sanitized.  There were fruit flies congregating in the bathroom sink, dirty handprints on the fridge, and everywhere else.  We cleaned everything with sanitizing wipes and decided to tough it out as it was late and she had surgery in the morning.  We didn't sleep all night because there were dogs barking, who knew we were on the dog floor.  In the morning I asked to be moved to a better room so she could sleep after her surgery.  They said check back at 1 or 2 when last nights guests have left.  I called and they said they had no available rooms, and that the dogs had checked out.  How about the fruit flies?  They didn't check out.  They said if there were more problems that night they would move us...how, thought you had no rooms?  Then I went online and found I could book a room for that very night.  I will never stay there again, I'd sooner travel from downtown to the hospital.  Terrible stay, and terrible service.The restaurant in the hotel was also full of fruit flies, we did not want to eat in that disgusting room, so we went to the restaurant..just as bad.",
      "rate": 1.0,
      "tripDate": " July 2021"
    },
    {
      "title": "Last resort",
      "text": "We stayed at this family and party motel for 5 nights as it was conveniently close  to a medical facility we attended. The common areas need a major cleaning and overall refresh. Glass entry doors to the motel and room balcony doors were filthy. The overworked room cleaning lady worked very hard to keep our room clean and was so helpful. That's the only positive comment we can make. The motel charges for parking. Cigarette butts, candy wrappers everywhere.",
      "rate": 2.0,
      "tripDate": " August 2021"
    },
    {
      "title": "Only stay here if you don’t mind filth and lies",
      "text": "Had a look at two rooms which were in very poor shape - holes in bedding, washroom counter cracked, hair on pillow, crumbs on floor, etc. The corridors smelled like smoke and marijuana. This is or was a decent hotel at one point and is the worst now. Homeless people are guests which is kind of the government to assist with but now the staff do not clean the rooms good enough nor do they care to keep the hotel in as good a shape as their website purports. Since when is holes in bedding, washroom counter cracked, hair on pillow, crumbs on floor, and smoking of various substances acceptable in a 'decent' hotel in Toronto?? And with the hotel is this shape, do you really think I'd stay and get bed bugs? There was no way I was going to chance this! Not only did management deny the poor conditions of their hotel but they refused a pre-paid stay. Do NOT stay at this hotel or pre-pay with them or a third party.",
      "rate": 1.0,
      "tripDate": " March 2022"
    },
    {
      "title": "Terrible Customer Service",
      "text": "We booked our two night stay using points. We were travelling down from Ottawa for a surgery and found out as we were driving down the night before that it was cancelled and rescheduled for a later date. We contacted the hotel to advise them we wouldn’t be checking in and were hoping to move the dates to when the surgery was rescheduled to or receive a refund for at least the one night (booked for two nights). They released our room and denied us of a credit, a refund or a change in date and were extremely rude on the phone. They told us that it’s the company we used our points that decides, meanwhile they’re telling us the hotel makes the decision. Having a cancelled surgery that was booked for months be canceled last minute is already frustrating enough, but then to have the hotel deny any of our requests and lose out on more than 55k worth of points is also very frustrating. Will never book with this hotel again.",
      "rate": 1.0,
      "tripDate": " May 2022"
    },
    {
      "title": "Terrible guest services.",
      "text": "I rented a room as we had been staying with family and I need a good night sleep. The place is so old that the options were to have The heat off or on - but the lowest setting made the room incredibly hot. So I was up all night turning it on and off (no window to open, only a sliding door on main floor which I didn’t feel safe leaving open). Front desk said “we will ask someone to go look at it”. They also heated up our dinner for us in their microwave. Which they don’t usually do but they were doing us a favour. They didn’t know not to put foil wrap in a microwave and then started a fire in their microwave. Our dinner was ruined, it was late, and they refused to even offer me a muffin to feed my toddler before bed because it was my fault for not telling them and I almost burned down their hotel 😅Will never be going back. Don’t recommend it if you are wanting to relax or feel well cared for. Oh and the pool area is beautiful but the pool is so old that you get out with flakes of paint covering your suit.",
      "rate": 1.0,
      "tripDate": " March 2022"
    },
    {
      "title": "Not worth the discounted pricing",
      "text": "My stay at the DVH was the most disappointing hotel experience I’ve ever had.The front desk and housekeeping staff were exceptional, but the hotel itself is quite old, though the rooms are passable.During my fourth visit to the front desk to replace my room card, the general manager, Kevin Porter, refused to provide his name and title. Each day, our room key stopped working, which was frustrating during our four-night stay.When I spoke to Kevin about this recurring issue, instead of apologizing and seeking solutions, he immediately blamed us for having the card near our credit cards or phone. I explained that we had taken precautions after the second incident, but he dismissed my concerns. When I suggested that a fourth incident warranted maintenance attention, he simply shrugged and said, “That’s your opinion.” At this point, I expressed my frustration and informed him that this would be our last stay at the hotel.Additionally, they include the incidental deposit in your total bill, a complaint I’ve seen in other reviews as well. I plan to contact the Better Business Bureau on Tuesday to file an official complaint.We only booked our stay at the DVH because of their Sunnybrook Hospital rate. When you live 8 hours north and undergoing treatment for brain cancer, enduring this type of deplorable treatment is the last thing my husband and I should have to worry about.Lastly, the reviews don’t lie. Stay far away from this hotel if you can afford it.",
      "rate": 1.0,
      "tripDate": " October 2023"
    },
    {
      "title": "Beware of the second floor",
      "text": "I used hotel.com to book a room. We stayed in this hotel two years ago and it was fine.This room was on the second floor and it was awful. There were holes in the wall, the balcony door didn’t lock , the phone didn’t work and we were facing the woods.The furniture was very worn and there were two double beds that looked like they had seen better days.My daughter and I did not feel safe.I phoned the front desk on my cell phone and requested another room.I said when we stayed at this hotel last time the  room didn’t look like this.Apparently according to the man who came with another key we had a deluxe room and the rooms on the second floor were all the same.It would be $20 a night extra.I agreed to the upgrade.The room we stayed in was on the third floor and it was better.I don’t understand why a hotel would rent out rooms in such horrible condition. I gave me a bad feeling and was actually scary.For to night it cost $400 paid to booking.com,$12 a night for parking and $20 night for the upgrade  for a total of  $470.They must be under new management . We I’ll never stay there again",
      "rate": 2.0,
      "tripDate": " February 2024"
    },
    {
      "title": "Website terrible because ..........",
      "text": "I have stayed at the Don Valley Hotel before and all was good, especially being able to reserve online.  Now, after trying their newer reservation website, it does not allow you to choose CAA, CARP, or Senior rates.I plan to go elsewhere.",
      "rate": 2.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Not an Urban Resort",
      "text": "I  am not sure what we expected having read quite a few reviews but it is safe to say we won't be staying here when in Toronto again.  There were good and bad points , but the bad outweigh the good.Arriving was tricky as the hotel sign is very faded and felt like you were using a service driveway entrance.  The front of the hotel had a strong smell of marijuana the 2 days we were there.Checkin was ok, but had friends who arrived 15 minutes early and had to wait or get a ridiculous early checkin fee.The room was ok and clearly partially renovated with new furniture, but the patio door was very drafty and the carpet looked dated.  There was no fridge either bit a saying you could rent one.  The pool say wasn't open as the heater broke the day before our arrival which was one of the reasons we picked this hotel.Upon check out the free parking on our reservation confirmation  became 11.95 +tax for each night, but it wasn't worth arguing.Overall, the location was great, but the hotel was not in the best shape and wasn't worth the cost to stay there.  It is definitely not an 'urban resort' as advertised.  There are plenty of other options close by...",
      "rate": 3.0,
      "tripDate": " February 2023"
    },
    {
      "title": "Don’t Stay Here",
      "text": "This hotel needs so many improvements!!! Our room was disgusting. The tub had chipped paint and the drain didn’t work. Only one of the two sinks worked. The floor was gross and very dirty along baseboards. The room smelt very damp and not fresh at all. The hallways and lobby smelt like weed…big time!! Went to get breakfast in morning…..was told it would be over 30 minutes to get an order of toast. Thank goodness Tim Hortons is around the corner. So lucky we only had to stay one night. Never again.",
      "rate": 1.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Look elsewhere ",
      "text": "Very dated, doesn't look anything like the pictures on the website. Parking $11.95/day, took over an hour to receive extra blanket with multiple calls to front desk. Beds horrible, only double size. Heard other guests all night long. Would never stay here again for $300 for one night.",
      "rate": 2.0,
      "tripDate": " June 2023"
    },
    {
      "title": "medical",
      "text": "Absolutely horrible customer service. Called to make reservation. Hung up on four times. They heard my request and immediately slammed phone down in my ear. Made the reservation online. Two weeks later the same thing. Phone slammed in my ear. Called back immediately, different person answered the phone. Apparently a manager. The first words out of my mouth were please don't slam the phone down in my ear i'm trying ot make a reservation. Immediately this \"manager\" got quite defensive and rude saying she never slammed the phone down. No you didn't because it wasn't you on the phone. After explaining the situation to her I got zero information out of her. Instead of explaining why the phone was slammed down in my ear a total of six times she lied and said it didn't happen. Then when I got defensice she lied about the whole situation and said to go somewhere else. This is the kind of staff that is on call at the desk. The fact that they are affiliated with Holland Bloorview right now because of Covid makes this situation unacceptable. This second situation happened on 01/29/21. Disgust doesn't begin to describe my feelings right now. I want to give zero stars but it won't let me. Anyone booking for Holland Bloorview please go elsewhere. Also they are not handicapped friendly either.",
      "rate": 1.0,
      "tripDate": " November 2020"
    },
    {
      "title": "Trip to Toronto",
      "text": "Enjoyed our one night stay here. Check in went well. Used the pool early in the morning   My only complaint is the outside noise level was very loud. Bed was very comfortable   The information for this hotel says that it has a sauna and a steam room, steam room is in the men’s change room and sauna is in the woman’s change room",
      "rate": 4.0,
      "tripDate": " October 2022"
    },
    {
      "title": "Decent hotel, booking system overcharged me",
      "text": "Decent hotel for our purposes: getting 25 people from across the country into one hotel for 3 nights, on a tight budget. Food was better than expected. One reason why I will think twice before coming here again: the booking service they use  charged me more than 50% more on ambiguous \"fees.\" Also, there is no \"hotelvalues.com\" web site so what can I do but comment here? Insane cash grab.",
      "rate": 4.0,
      "tripDate": " May 2024"
    },
    {
      "title": "toronto don valley",
      "text": "THis is NOT a 'HOTEL\" but a Motel.  Please do not stay here.  It's a great location, but very unfortunately, you will be extremely dissappointed.  When does a 'hotel' take your entire stays cost and charge you when you check in?? hint hint.  If you like the smell of smoke and marijuana,  nails in the carpet sticking out, loud portable AC, drawers not working, 2 hangers, galore bed bugs, spiders  in the bathroom and paint/wood chips, constantly people being upset at the reservation desk, and not being BBB accredited, this is your dream place!",
      "rate": 1.0,
      "tripDate": " July 2022"
    },
    {
      "title": "THE WORST customer service",
      "text": "If you have an issue, all they do is to direct you to an email address that will never get answered. Eventually I heard “if you are not getting an answer is because they will not help you”. I am a single mother that wanted to take her child to the pool but the hotel is only concerned about keeping my money and not letting me change my reservation to a day when the pool would be open. Shame on you.",
      "rate": 1.0,
      "tripDate": " July 2020"
    },
    {
      "title": "Just Horrible - do not stay here!",
      "text": "I’ve booked a room on Booking.com as we were coming into town for a concert and this hotel was in a good proximity to the Danforth. I called the hotel and booked an extra night. We arrived around 1:30 in the afternoon and asked if we could check into our room and was told I had to pay $40 to do so. Everything went downhill from there. When we ride in the lobby we were greeted by homeless people. There was  a crack addict woman and husband who was harassing the front desk because she didn’t receive a wake up call. She had cut her pyjama pants mid-calf and you could see track marks all along her ankles. She was spun out. When I expressed my concern as to the type of people loitering in the hotel lobby, the woman at the desk Actually told me that this woman and her husband had just sold their house and they were staying in the hotel overnight so that they can move into the new place. What are the most laughable excuses I think I’ve ever heard. My daughter google the hotel and was surprised to learn that the government has been housing homeless people at the hotel. Not a place I want to stay myself with my daughter!One of the reasons we practice hotel was for the indoor pool which was being renovated and was not accessible. Some thing that the hotel did not advertise on their sitenor did booking.com. We were told we could use the outdoor pool but it was raining so really not an option.Hotel looks nothing like the photos on Booking.com or any of the other websites. Our “deluxe” room was supposed to have a fridge and a microwave and it did not. So I requested to move to another room which dead and they wanted to charge me $30 more!! They moved us to another room which smelled bad, the beds were not made properly, and the headboards had scratches all over them. I’ve includes some photos.We immediately returned to the front desk and demanded to check out. I’m still trying to get my money back from Booking.com but will escalate this as far as I have to in order for them to return my money as this hotel is disgusting. To have homeless people and crack addicts roaming around is inexcusable. This is not a family hotel. I recommend you stay far away!!  Ironically the hotel has been removed from Booking.com. So I’m not sure if that says some thing or not.The front desk staff seemed nice — But honestly I feel bad that they have to deal with this kind of crap at work.",
      "rate": 1.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Absolute Trash",
      "text": "I had the worst stay with my boyfriend ever, during covid-19 they did not have proper safety processions, the Tv was not working and the manager we talked to that day did not let us know that the tv would not be working that night. There was a door that lead to another room that had no proper locks. The website it absolute garbage, because I paid $30 to pay for early check in and when I got there was charged $50 instead like f****g no thank you. was the absolute worst stay I have ever had and I hope that manager gets fired for her negligence.",
      "rate": 1.0,
      "tripDate": " May 2020"
    },
    {
      "title": "Perfect Vaccation Spot",
      "text": "Initially I had booked the best deal online while staying in the city shoping for a few days, only to find a mini oasis. I have returned 3x in the last 3 months. The prices are unbeatable ♡ and so much more! The rooms are variable to prices, but all are well kept and cozy. Most have beautiful balconies,  some overlooking a small jungle of trees. There is a mini convent store that offers everything from cereal to drinks and swimsuits ntm rolling papers ♡The restraunt serves a great variety of very well made food and drinks.  They even offer room service ♡ off of the patio There is a pool, well kept with towels , lounge chairs,  and friendly staff.The staff is quick, professional, and very friendly. I have had nothing but good experiences with all of the employees,  the cleaners are always cheerful and polite offering above and beyond service. The restaurant staff definitely aims to please and do not disappoint.  And the front staff is always welcoming and ensure that you would want to return, if not stay longer. They also offer epic monthly deals. 😎",
      "rate": 5.0,
      "tripDate": " July 2021"
    },
    {
      "title": "False advertising/poorly kept rooms",
      "text": "At first arrival, this hotel seems very promising but once we entered the room the lack of upkeep was apparent. I paid for a deluxe room on the ravine side with a balcony. the Netflix did not work and the iron was missing, there were flying bugs in the bathroom. the shower caulk was disgusting. When I went to the front desk I was met by the manager, I think, he stated there should be a card with tv instructions-there was not, there should naive been a safe- there was not, nor was there an iron or the SLEEP number beds they advertise. He came to my room and saw there was no instructions and someone had actually taken wires out from the television. We changed rooms to discover once again, no safe, no special mattresses, and no door handle to get out onto the balcony. there is also a claim that the rooms are silent or sound proof- they are not. I wouldn’t have cared but there is ALOT of FALSE advertising going on here. I am still in this noisy, unkept hotel for the next few nights because of a medical appointment and recovery. The ravine side is also full of garbage. The front staff is super nice but that can’t make up for a crappy room I paid $130 a night for.",
      "rate": 1.0,
      "tripDate": " August 2021"
    },
    {
      "title": "Worst customer service ever.",
      "text": "I’ll start by saying I’ve travelled around the world and this is the only time I’ve ever felt compelled to leave a review.The hotel in itself isn’t bad. Nothing special, but fills a need. My only complaint about the room would be the A/C or lack there of. That was pretty brutal. Now, the reason I’m writing this is solely do to check in and check out. At check I was only given the option to enter a pin for my visa and as I hadn’t used that prior too, I ran into a problem. My fault, admittedly. After moving to the side and contacting my banking provider I was instructed that I would have to go to the closest back and use a machine to reset my password, unless the hotel could manually input my information which my bank said could be easily done.The hotel said no, this wasn’t possible. I then asked if there was anything I could do or any other way to pay instead of me having to take a cab to the closest bank? They said no. Off I went. Went to the bank, got the pin installed, went back to the hotel (40 mins approx). At this point we started all over and for whatever reason my card still wasn’t working. I called my bank again, getting extremely frustrated at this point.  I will say although there was some inconvenience on the hotels part, up until this point I would still consider this my fault.  After waiting on the phone for telephone banking 27 mins, the front desk lady randomly  says. “Sir, you can pay with your debit card if you like.” At this point, in my head I’m like really? You couldn’t have told me this an hour ago, before I made the trip to the bank, before I spent the past half hour on the phone with my bank, again?. However I knew bringing this up would get me nowhere at this point so I just handed over my bank card and off I went to the room. Upon checkout I was told I had to have my room inspected to which I had no problem with as it was absolutely spotless. I did nothing but eat dinner and have two beers. After waiting a few minutes I was told I would be charged 34 dollars due to wine stains which Was absolutely ridiculous considering I don’t drink wine. At this point I was flabbergasted and my Uber was there and I had already made him wait a few mins so I took it on the chin and left. I’m writing this in the Uber as I felt it was the only way to get some sort of justice. I will never stay there again and the guy that got super obnoxious telling me I had to may this fee name was Troy. Thank you for trying to ruin my day. If other options are available, do not stay here.",
      "rate": 1.0,
      "tripDate": " June 2021"
    },
    {
      "title": "Disgusting DO NOT STAY HERE!!!",
      "text": "Just arrived home from a conference that was held at a near by Center from the hotel. The first 5 minutes into the hotel we were treated with rude, attitude. No welcome, nothing. We were told our room was not ready but then we’re asked if we wanted to pay $50 to go into our room early. Make that - make sense. The pictures of this hotel are very misleading. This hotel is absolutely disgraceful and disgusting and should be less than $50 a night. The carpets are ripped and stained, the rooms are dated and the beds are absolutely filthy with no bed bug covers or clean sheets. The mattresses were dirty and the room furniture looks to be from the 90s. The only thing that worked was the fridge. A friend of ours found a bug in her bed and the a/c didn’t work in the hallways. Our bathroom had water on the roof, mold and dirt in the corners. Towels were not replenished and the toilet wouldn’t work properly.The staff were rude and very unprofessional any time a need or question was brought up . Walking up to the counter we were greeted with a “what” instead of a nice greeting.Since our conference members pretty well stayed at the hotel as it was the closest and one that was chosen by our company we were not treated well.The only “decent” part of this hotel was about a 6-7 minute walk you will arrive at a Tim hortons and grocery store. Don’t bother with the hotel food or store. Overpriced and lack of service.Our team asked to have a pizza party on a table in an open area by the hotels restaurant. We were told no, so we sat outside with our crew to enjoy our pizza. Meanwhile, a boys team of some sort were yelling, running and eating Pringles and pizza and had food all over the floor yet we weren’t allowed as adults to sit and enjoy our pizza in this space in the hotel lobby / seating area.Save your money, this hotel is very overpriced for a motel style, dirty, horrendous stay. If I could give zero stars I would. Please don’t stay here! YUK and disgusting for a hotel in Canada.",
      "rate": 1.0,
      "tripDate": " July 2023"
    },
    {
      "title": "Clean with a nice manager but...",
      "text": "I wanted to stay close to a small clinic where I was picking someone up after surgery.  This looked good.  Clean room, accommodating meal options during Covid-19 but the noise level was incredible.  Evidently a large group of people (more like hooligans) arrived late and spent all of their pent-up energy racing around, slamming doors and who knows what until the wee hours.  Most disappointing.  Probably a one-off but I will spend more and be more choosie next time.",
      "rate": 3.0,
      "tripDate": " November 2020"
    },
    {
      "title": "June 28/22",
      "text": "A $40 charge for checking in early be aware at 2;45pm though can check in early for no feeParking costs $27 for two nightsDisappointed they didn’t mention indoor pool closed for construction on website Very disappointed in outdoor pool. They take your bag from you and store it in a deck box. You can’t have access to your personal stuff unless you take it all out-  or walk to the deck box to get it-  it is so stupid. Not very secure either as anyone could grab your bag and you wouldn’t knowAnd the deck box they have falls apart every time the pool monitor opens it!  Spend some quality money on a system They won’t let you come in with drinks or a water bottle. It is very tacky. Room was clean",
      "rate": 3.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Great stay and service",
      "text": "We were travelling from Windsor to Ottawa with a new puppy. We were given a pet friendly room. Super clean with balcony.  Bed was very comfortable too.  We decided to order in suite dining. The meal was brought to the front desk and we picked it up. Food was hot and attention to detail was very much appreciated.  A big shout out to staff for their hospitality.  We travel a lot and for the price, a great value.  We will be back!",
      "rate": 5.0,
      "tripDate": " March 2021"
    }
  ]
}