{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Travelodge Toronto East",
    "url": "/Hotel_Review-g155019-d188389-Reviews-Travelodge_Toronto_East-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "2.5",
      "reviewCount": 367
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "20 Milner Business Court Toronto East",
      "addressLocality": "Toronto",
      "postalCode": "M1B 3M6",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/23/e4/8b/c6/exterior.jpg?w=500&h=-1&s=1"
  },
  "description": null,
  "featues": [
    "Free parking",
    "Free High Speed Internet (WiFi)",
    "Pool",
    "Free breakfast",
    "Children Activities (Kid / Family Friendly)",
    "Car hire",
    "Meeting rooms",
    "Newspaper",
    "Parking",
    "Wifi",
    "Indoor pool",
    "Bar / lounge",
    "Restaurant",
    "Breakfast buffet",
    "Vending machine",
    "Non-smoking hotel",
    "ATM on site",
    "24-hour front desk",
    "Express check-in / check-out",
    "Dry cleaning",
    "Air conditioning",
    "Safe",
    "Refrigerator",
    "Flatscreen TV",
    "Non-smoking rooms",
    "Family rooms"
  ],
  "reviews": [
    {
      "title": "Worst sleep ever in a large hotel chain.",
      "text": "There were noisy people in the room across from me slamming their doors all night.  Two reports to the night staff never resolved the problem.  Next morning on check out the manager wasn’t even there for me to address my concerns with.  I asked for a call back from him and never received one. This was the worst sleep, and the most lack of concern and follow up from a large chain hotel that I have ever experienced.",
      "rate": 2.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Okay place to stay !",
      "text": "Nice hotel. Lots of parking. Staff is friendly. Breakfast is adequate. Good sports bar attached to the hotel. Pool and jacuzzi is okay. Hopefully it's available for you when you're there. Exercise room is there but used as a storage room.",
      "rate": 3.0,
      "tripDate": " January 2020"
    },
    {
      "title": "2-Star Hotel, 1-Star Clientele, 0-Star Value!",
      "text": "I was \"bumped\" to this hotel because the facility in which our group was originally booked was full.  The staff at check in was very friendly and professional, and the lobby presents a decent first impression, but that's about all this place has going for it.The Travelodge is a depressing remnant of late '70's early '80's architecture with furnishings and decor to match. Expect worn carpets, threadbare upholstery and linens, dingy bathrooms that are unable to be properly cleaned any longer, and lumpy, uncomfortable beds.The night we were there the hotel was home to two peewee hockey groups.  These children were left unsupervised until at least 11PM, during which time they ran wild through the hallways while their parents partied downstairs at the 'dungeon' known as \"Shoeless Joe's\".  Two calls to the front desk did little to stop these poorly raised hellions from preventing everyone else on our floor from getting any sleep.  The continental 'breakfast' the next morning is bleak.  You are better off to skip it entirely and head to the Golden Griddle next door or Starbucks down the street.  The rate we were charged was $89 per night, which seems like a total ripoff when you can get 4-star hotels in dowtown Toronto on Priceline for $50.   If you are looking for a decent hotel in this area consider the Holiday Inn Express instead- newer, with nicer rooms and ammenities.",
      "rate": 2.0,
      "tripDate": " May 2009"
    },
    {
      "title": "A nice, convenient place to stay in Toronto",
      "text": "Hotel is in an excellent location, 401 & Markham Rd. Access to the highway in less than 2 minutes. Plenty of good eating in the area and only 5 minutes from the Scarborough Town Centre where there is the LRT to connect you with the subway.",
      "rate": 5.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Old but clean hotel with lovely accommodating staff",
      "text": "It is definitely an older property however it is well up kept. The staff is wonderful and very accommodating (Thank you again for a late check out!).  Rooms are small but cozy. And the restaurant downstairs has absolutely delicious and fresh food at very affordable prices.",
      "rate": 4.0,
      "tripDate": " August 2020"
    },
    {
      "title": "RUDE RUDE RUDE",
      "text": "I moved a chair in the lobby across the floor in order to sit with my business associates who were occupying 2 chairs, 1 each. This was a large lobby with only 4 chairs in total. The General Manager himself namely Jit Tanna approached me and said these words \"do I come into your house and move the furniture around\". WOW! how rude. He then tried to explain that the last time  someone moved a chair they broke the chair. I was upset and told him that I no longer with to talk to him and he would not leave me until I insisted to be left alone. Because of my work I am very familiar with the use of hotels and have never experienced this odious behaviour before. I suggested that he could have politely asked me not to move it again. I also frequent many Travelodges and have always enjoyed it. This experience has cause me to NEVER USE TRAVELODGE AGAIN. I was there for a business meeting only and did not stay overnight.",
      "rate": 1.0,
      "tripDate": " January 2017"
    },
    {
      "title": "Absolutely disgusting, insulting, rude management. This place will swindle you.shame on the management",
      "text": "Terrible stay horrific service absolutely un acceptable..At Check in the girl at front desk had no knowledge of what she was doing she refused to take my Government I.D. I asked if I could speak to the manager on duty she refused and said no manager is on duty and I cannot speak to one. I than asked if she could call him in regards to this matter she refused again. After arguing for 15 minutes she finally calls the manager (Sugan) who Refuses my government ID as well. He would not speak to me, at that Point another agent walked in and educated the girl at the desk about the government ID.and told me they do accept this GOVERMENT I.d. Great I finally checked in. I enter the elevator it smells like Pee,entered the room the room had a mold smell to it looked very old the AC was taped to the wall the bed had no sheet only had a bed skirt,the brown blanket had holes in it,the shower was missing a shower head, the towels were old and had holes In it,the walls were empty and thin. At checkout the manger on duty (sugan) went to go check my room for cash deposit. And he accuses me of smoking in the room. As a non smoker I got so upset and had asked him to take me to the room and prove me I smoked. I went back in the room it didn't smell like smoke, it had no butts and it had no ashes..he refused to listen instead he was very rude, asked to speak to the general manager they gave me his card and said call him later he's not available. Being accused and than being charged for the accusation is unacceptable... Never stay at this hotel. The environment of this hotel is absolutely disgusting. Please don't waist your money at this place",
      "rate": 1.0,
      "tripDate": " May 2015"
    },
    {
      "title": "Bad Hotel Experience Overall - Did Not Stay the Night",
      "text": "I was looking around for a hotel I could use for attending a company Christmas party. This particular hotel was the closest and cheapest. I was soon to find out why it was so cheap.In reading the online reviews I simply thought that this hotel had gotten a bit of a bad rep for whatever reasons and booked away. At $80 per night, how could one go wrong? Well, I did, and it went very wrong. It had such potential to be a great place for a gettaway though. They have a Shoeless Joes built into the hotel and plenty of nearby ammeneties. There is no longer a Golden Griddle nearby however.Problems started at check in when my access card for my room refused to work. I had to go up and down at least 3 times before my room door opened and by this time I had to have a manager accompany me to check that out.When I opened the door to my room, despite having a \"non-smoking room\", the whole room smelled of heavy cigarette smoke and was damp and a bit cold. I noticed a heat-pump unit on the wall but no thermostat/controls for it and there was a bag completely covering it.Additionally, the ironing board was nowhere to be found, and I had to call the front desk to get one. They did bring that however so I really can't complain about that. However, of all the things to not have in a hotel room, an ironing board seems pretty odd to not have.I utilized their pool, which, for all extensive purposes was nice minus the fact there was no changing room so I had to change on the deck. After utilizing the pool I went back to my hotel room to find my cards not working again. After 3 trips the woman at the desk I had spoken to about the keys asked me if I was checking out (even though I had been to the hotel for less than 2 hours).After returning to the hotel, my cards, once again, did not work and I had to ask the duty manager to get my room open because I was leaving. I was not going to chance this room more than I had and I was not willing to give their breakfast a shot. Nothing personal about him, just frusterated by the fact that I wasted my money on a bad room. I was tempted to ask for my money back but by this time, I just wanted to get out of there and find a better place to crash at.Take my advice: spend a few extra bucks on a room at the Holiday Inn Express on 50 Estate Drive (it's a stone's throw away and a hell of a lot cleaner/nicer).",
      "rate": 1.0,
      "tripDate": " November 2014"
    },
    {
      "title": "Needs an extreme make over!!",
      "text": "Our flight was cancelled at the airport so Westjet put my family in this 'Motel' for the night. First of all, I have stayed in many hotels all over North America and this was the first time I was ever asked to take my drivers liscense out and give them! I asked the gentleman at the front desk why he needed my license, he said to fill out the information on it. That was fine when he passed it back, the lady at the front desk passed me a piece of paper to fill out all my information!?! I thought it different but I got over that. I then asked for a king size bed but there was none left, so I asked for something bigger than two double beds, I'm fairly tall so a double just won't cut it, and it was only my wife and our 9 year old son, so a king bed would do fine. tThey finally put us in a room with two queen size beds, perfect, I thought. Opened the door to the room, oh my god, I did really want to take off my boots! The carpet was old, very stained and ragged, the wall paper, or whatever was on the walls, was stained all over and falling off, there was three BIG dents in the wall, just at a glance! The boxsprings on the bed were showing and STAINED!! Then there's the bath room, all I could think was 'That Seventies Show', in serious need of an upgrade! We convinced ourselves that it was only one night and settled in only to be awakined at 2am by the sound of the neighbours headboard hitting off the wall repeatedly. (what could they be doing?) I almost forgot to mention the lampshades, filthy, stained and ragged. Needless to say, I will not be staying at this hotel anymore and I would not recommend this hotel to anyone!!",
      "rate": 1.0,
      "tripDate": " March 2013"
    },
    {
      "title": "Beware of the Bed bugs!!!! Gross!!!",
      "text": "We stayed for 2 nights and never again! what a horrible experience we had!...The room had a awful smell, the bathroom looked like it wasn't cleaned and or maintained in years! The bathtub has mold and meldew. The walls in the bathroom were so filthy, looked like dried up blood stains on the wall. The bath towel were small and not enough for 2 people. There was people argueing at night out side our rooms across the hall, no consideration. The matress was so old the structure of it was falling apart. We stayed there for the weekend and not once did roomservice come to clean the room or replace bath towels...we had to call to ask for it!!!! We noticed after one night we had little bite marks on our skin....low and behold we checked out and went to the Dr. to find out it was bed bugs bite!!!! BEWARE!!!! What a terrible experience, would never recommend this hotel to anyone!!! Highly annoyed and disappointed!!!",
      "rate": 1.0,
      "tripDate": " December 2011"
    },
    {
      "title": "No service for things broken and breakfast not as promised.",
      "text": "The first thing I ran into was that the tv would not work.  After waiting an hour they called and said that they had looked into it and it would not be fixed until tomorrow.  I pointed out to them that they had contracted to me for a room with a tv but that went right over their heads.  I asked how they could know that the tv could not be easily fixed when they had not even taken he time to come to my room to see it and when I asked for a refund they said they would come down.  He did, and finally after an hour and a half waiting they got it fixed.  I pointed out that the internet was not working and he said \"Oh wait til later as we don't have enough band width\" never conceding that they had contracted to provide band width.  And it was a poor signal and not bandwidth anyhow.    Breakfast was supposed to end that day at 10 and I got there and the bacon or sausage or what ever it was, was all gone and I got only a tiny bit of the eggs even though I was there at 15 minutes to.  Many people came in after me still well before 10 and they got none at all of those items.  Room was also too hot as heat was stuck on. Room in drastic need of decorating.  I would NEVER recommend this place to anyone. If you say you provide breakfast until 10 then  do it.  If you say you provide tv and internet then do it and don't make stupid excuses.  The night before I stayed in an old fashioned '50's hotel for $70 and had a fantastic night.  The night in this place was terrible!",
      "rate": 1.0,
      "tripDate": " October 2014"
    },
    {
      "title": "Disappointed visit",
      "text": "Starting at the checking me in process with such a rude receptionist turned me down ! Try to avoid her (Ra...) if you want a better first impression ! The hotel itself isn't bad at all , it has all facilities , free parking, nice pool, free simple breakfast (don't expect much) room size is ok although it needs much of renovation to meet the 3 stars standards, I'm sure I would of giving better rating if I've been treated better but for sure with the first impression being continuous frustration couldn't give me the chance of feeling pleasant.. I don't think I'm going to go again !",
      "rate": 1.0,
      "tripDate": " August 2014"
    },
    {
      "title": "A convenient stay",
      "text": "We stayed at the Travelodge Toronto East two nights for convenience, as we were spending a full day at the Toronto Zoo. The location was perfect for this purpose (less than 10 minutes away), but I would not recommend it for someone who is planning to visit Toronto-proper.The Travelodge itself was as expected: a budget hotel, dated but clean. The staff was very friendly and always helpful. The complimentary breakfast was convenient, but very plain.Some of the highlights were the attached restaurant/sports bar Shoeless Joe's, which was close and offered good grub. We also enjoyed the pool, which was clean and had a comfortable temperature.A few improvements I could suggest would be the addition of a small changing area at the pool. Also, we could not use the coffee maker in our room without unplugging the TV or moving it.It is an okay stay if travelling on a budget and if you have activities planned in the Scarborough area.",
      "rate": 3.0,
      "tripDate": " June 2014"
    },
    {
      "title": "No light switches?",
      "text": "We arrived in town late & were supposed to stay with family, but didn't want to disturb them so we went to the closest hotel. We got a room for $120.00 (which we thought was quite expensive after booking online last time we were in the area). It was late & we simply needed a place to crash for the night. We got to the room & went in. The main overhead light worked with the switch by the door, but the lights next to the bed & over the desk had no wall switches & the twist knobs were missing at the bulb??? There was plastic wrap over the AC that we had to remove & plug in the unit. We called the front desk & were told to simply open the window (maximum opening about 6x9 inches). The ceiling had large water stains above the window & the glass in the window was a bit foggy inside. This hotel is VERY dated & in need of a major upgrade!! Rooms were quite small also, maybe 15 x 25 feet including the bathroom. Please take it from this weary traveler...only stay here if all you want to do is pass out.",
      "rate": 1.0,
      "tripDate": " May 2014"
    },
    {
      "title": "Good for the price",
      "text": "I got a great deal through Expedia for a 2.5 star unnamed hotel (they give us the details after booking). The star rating seemed about right for what we got. Average looking hotel with outdated rooms. For the good price, free parking, free breakfast, free Wifi, and on site restaurant, we felt it was a good choice. But otherwise might have been disappointed due to the poor condition of the room. However we slept very well, bed was comfortable and room was quiet. Hotel lobby nice and clean, staff was pleasant. The hotel appeared to be in a safe and quiet area close to the 401 (highway), gas station across the street, and amenities nearby. Breakfast included bagels, muffins, sliced bread, jam, cream cheese, scrambled eggs, sausage, waffles, cereal, fruit, juices, coffee, tea and hot chocolate. On site restaurant is called Shoeless Joe's. It is a sports bar and restaurant with very good food. Hotel gave us a 15% discount coupon good for one meal. We ate there every night for the convenience and good food. We did not use the pool or gym, so I cannot comment on that.",
      "rate": 3.0,
      "tripDate": " May 2014"
    },
    {
      "title": "Hotel? You Mean Motel ...Horrible",
      "text": "My boyfriend and I book through expedia on the secret hotels.  You get a great rate and price but you don't see the name of the hotel until after you book.  We never had a bad experience up until this past weekend Feb. 23, 2013.  After revealing our hotel right away I came on this sight to read reviews and to my knowledge, it was all negative!  I was so disappointed but I couldn't get a refund so we decided to roll with it and maybe it wouldn't be so bad.  So 1st of all i can't believe this is a hotel, this should not be on any website as a hotel but a motel.  The front check in looks upgraded which is misleading because when you get to the rooms, the carpets are indeed stained, the bed is busted, the air circulation in the room makes your nose and throat dry all night.  This wasn't even the smoking room! The shower head in the washroom was busted, there was limited towels and the free breakfast was nasty!  For a couple of dollars more, you can get a better hotel.  There's a saying you pay for what you get and in this case you don't even get that.  If this hotel wants to make it they need some serious upgrades and should listen to what people are writing on this website.  Instead of having the front with a flat screen tv and looking nice, use some of that money and upgrade your rooms and maybe you'll see better results and ratings!",
      "rate": 1.0,
      "tripDate": " February 2013"
    },
    {
      "title": "Great value for the price paid.",
      "text": "Convenient location on Hway 401, Markham Rd. & Milner Ave -  it was easy to drive anywhere in the city from Hwy 401.  The room is standard, plain-looking as other Travelodge with bed, dresser, desk, bathroom, phone, internet access, iron, hair dryer, TV.  It was clean & quiet. We had a new bedspread & all the linens & towels were changed daily. The coffeemaker had supplies of coffee, tea, sugar, coffeemate, cups & napkins.  Free breakfast that was better than most hotels of this category - eggs, toast, bagels, muffins, cereals, fruits, butter, cream cheese, jam, coffee & tea.  Staff were friendly & attentive.  This is excellent value for the price.  We will go back for sure.",
      "rate": 3.0,
      "tripDate": " April 2011"
    },
    {
      "title": "Close to freeway",
      "text": "Just Okay, room is dated, wirings all over the room, free Continental breakfast.  Weird room set up but i only stayed for one night. Did not try the adjacent restaurant. Service was good and prompt, complained about the light having no switch and was promptly repaired.",
      "rate": 3.0,
      "tripDate": " November 2019"
    },
    {
      "title": "We stayed there last month and I would say the room was nice and clean. The staff is very friendly and helping. great lo",
      "text": "We stayed there last month and I would say the room was nice and clean. The staff is very friendly and helping and would make you feel like family.  Great location for the price you pay for. I would def recommend travelodge toronto",
      "rate": 5.0,
      "tripDate": " October 2019"
    },
    {
      "title": "Very convenient",
      "text": "Easy access from the 401 getting there, a little more complicated getting back onto the 401 W and Markham Road.The reception:    • was quick and efficient. Apart from the cost of your stay they will put a financial amount hold on your credit card, mine was $150.00, which came off my credit card within the following week    • there are elevators, in the morning they are also used by the cleaning staff.      The room:    • was smallish but had everything one would need for a few days stay    • the fridge was working, the microwave was large enough to take a dinner plate    • there is a coffee maker with supplies as well as mugs and plastic cups    • there is no safe in the room    • there was no iron or ironing board.    • there were plenty of coat hangers and clothes’ hanging space.    • the bed had a medium firmness and 3 pillows on the queen size bed.    • the room heat control can be changed using the thermostat on the wall.      The bathroom:    • had a walk in shower with a wand which can be hand held.     • there were 2 soap pucks and a shampoo/conditioner small bottle, plus a hair dryer    • there is a large mirror but no long mirror in the room.      Other:    • The free Wifi was good.    • The parking for paid guests is free    • The free breakfast is sufficient to last until lunch. The breakfast room is smallish, there seemed to be no objection to bringing one’s food and drink to one’s room. The breakfast during my visit contained: sausages, scrambled eggs, bread plus toaster, bagels, cream cheese, spread and jam, cereal, muffins, fruit salad, plus tea, coffee, milk and juice.I felt safe as a single female traveller.",
      "rate": 4.0,
      "tripDate": " October 2019"
    },
    {
      "title": "Please listen to all bad reviews-ALL TRUE",
      "text": "I'm not the type to complain especially after getting a great deal from Priceline but I really wished I took the bad reviews seriously and stayed else where. Only stayed overnight for a total of 8 hours and from the second I checked in there was nothing but problems. RUDE RECEPTION. Mold in room. I've had better rooms in some side of the highway dumps. Very loud -paper thin walls-doors slamming all night- bathrooms with no water pressure- old sink/tub-NO tub stopper- terrible stains-more mold. The free hot breakfast which was one of the reasons this hotel got my attention the WORST breakfast I have ever had. Frozen paper thin bad tasting waffles and powdered type scrambled eggs was the hot breakfast. Bagels, bread and a few pieces of bruised fruit round out the rest of it. . I will usually eat anything and not complain but please please read reviews. Watered down juice. Coffee was the only positive thing I can think of. I really have never seen a more pathetic looking and tasting breakfast. Also had to stand to eat since this large hotel only has a few seats in breakfast area. Many elbows and people stepping on feet to get to the little food they have. When I told reception I was running to my computer to write a review they did not care or try to make anything right. I would not stay here for free. On the positive side of this hotel I did get my wake up call and the coffee was good.",
      "rate": 1.0,
      "tripDate": " July 2014"
    },
    {
      "title": "Horrible dirty place!",
      "text": "I stayed here for 2 nights with my son and quite honestly thisplace is a flea bag motel at best. My first room had not been cleanedproper - beside the dresser there was a nasty mess that was nevercleaned up properly and the room smelled horrible - If i was to guesssomeone threw up on the carpet and it was never appropriately cleaned.We went down to the lobby to change rooms and the staff were notslightly taken back by the picture I'd taken just... oh well take the roomnext door. So we do and we move our stuff in and it was slightly cleanerthan the previous room it was still a mess - see pics- thenastiest stains all over the bed, on the walls, plastic bags over theair conditioning units, mold all around the tub and floor, wall paperhanging off the wall  - We open up the frdige toput in our water and it is full of old food from someone else! We callthe front desk and they send a girl up - no apology just ok well sendsomeone up! The cleaning lady was nice and apologized and cleaned outthe fridge. Night time comes and we go to turn on the lights bsdie thebeds - NO LIGHTS - bulbs burnt out - we call again and they send someone up - no apology, again just OK. If we were not there with a hockeyteam I'd have left immediately but we were stuck.  We checked out on the sunday and I talked to the manager aboutthe horrific experience we had and his only comment was and I quote him- Oh well send in a complaint ...never made eye contact with me, neverapologized could have cared less whether I was happy or notnever mind satisfied. I emailed Travel lodge directly and after several emails they refunded me one night stay. This hotle is not worth it for any price...buyer be ware",
      "rate": 1.0,
      "tripDate": " January 2011"
    },
    {
      "title": "Cold pool, filthy hot tub.",
      "text": "We have just returned from a two-night stay in East Toronto.  We chose this hotel because of its proximity to the Toronto Zoo.  We had our 13-year-old son with us and wanted a relaxing weekend away.  The zoo was magnificient but the hotel's pool and hot tub were disappointments and detracted from our weekend.  The pool is in an air-conditioned room and was only room temperature because of a broken heater.  When we spoke to management about this, they said that the pool maintenance company had been called but had not responded (it was the beginning of a long holiday weekend).  They told us that nothing could be done about the temperature of the pool.  We thought that the hot tub would be okay but the water was a murky shade of green, dead bugs were floating on the top, and when we turned on the jets, large amounts of dirty, shampoo-like bubbles rapidly formed on the surface.  We spoke to management about this late Friday afternoon and were told that the tub would be drained, cleaned, re-filled and ready to use by the time we returned from the zoo on Saturday evening.  We took one glance at it on Saturday evening and noticed that the hot tub was dirtier and foamier than ever.  Clearly, the management had not followed through on their promise.  If we had only been travelling for business and wanted a quiet, clean room at a cheap price, this hotel would have been okay.  We didn't use the free continental breakfast but instead ate breakfast at The Golden Griddle, using the hotel's 15% discount coupon.  Next time, we would re-visit the restaurant but look for a different hotel.",
      "rate": 2.0,
      "tripDate": null
    },
    {
      "title": "The best of Scarborough",
      "text": "I have stayed at all CAA Approved Hotel/Motels in Scarborough and this place by far is the best. It offers the cheapest rates, free parking, free high speed internet, local calls, breakfest. We deiceded to stay in the Sleepy Bears Den (A room made for kids). It includes a VCR, Kids Designs, and a table and chair for the Kids.We are only paying $89.00. Which is a bargin compared to other hotels in the area. The breakfest is quite good which muffins, bagles, fruit, juice. The room is very clean and in good working order (Since is a Kid Room). The room is extremly Clean, and all the extra benefits are great (Pool, Fitness Cnter, Shoeless Joes.) It is also close to the 401, ZOO, Downtown. If your looking for a great place to stay at a great price and want to be near everything this place is for you.",
      "rate": 5.0,
      "tripDate": " January 2006"
    },
    {
      "title": "Never Again",
      "text": "WE chose this motel because of it's proximity to the zoo.WE reserved three rooms well in advance of our travel dates, and confirmed by phone the week before. Although we were told check in was at three o'clock,we were not in our rooms until 4:10.Having a 5 month old baby and a \"special needs\" child in our group this made for a real inconvience. We arrived at the motel at around 1:30, so the front desk knew of our arrival. We were repeatedly told that the rooms weren\"t cleaned yet. I'm not sure they were cleaned at all since we found pretzels under the bed. The pool was overcrowded all weekend, mostly with unsupervised children. Although our day at the zoo was great, the Travelodge was not.",
      "rate": 1.0,
      "tripDate": null
    },
    {
      "title": "NO RESERVATION but CHARGED FOR NO SHOW!!!!",
      "text": "Phoned hotel directly to cancel a reservation 1 week in advance to be told I did not have a reservation. Spent 1/2 hr on the phone with Front Desk person trying to find the reservation .. to be told there wasn't a reservation for me. One month later I get my Cc'd bill and they charge me as a NO SHOW!! Called hotel to dispute but was told they could do nothing .. all of their staff are long term and know how the system works. Taking it up with my cc'd company. How to hell are you suppose to cancel a reservation when they are telling you you don't have one. Total lack of customer service ... watch your charges if your staying at this hotel and if they tell you that you don't have a reservation with them email them over and over!!!!!",
      "rate": 1.0,
      "tripDate": " September 2019"
    },
    {
      "title": "Very poor",
      "text": "We checked in and the room we were given was dirty, the sheets weren't do e and obviously not ready. We then got another room and the room smelled of smoke and the bed was visibly deformed and the room was noisy and unpleasant.Avoid at all costs.",
      "rate": 1.0,
      "tripDate": " December 2018"
    },
    {
      "title": "Weekend Stay",
      "text": "First off let me say that when I booked this hotel direct there was nothing said about a $100,00 security deposit above the cost of the nightly rate. We were told this was a pre-authorization to my credit card that would be reversed in three or four days.  We have stayed at many Travelodge's and not one has done this. When we checked out the front desk staff still wanted to put this on my bill. Only when I refused did they put my credit card through for the room only.There were two of us and there was only one wash cloth and hand towel in the room.When I asked for another set of towels and was cloths they brought POOL TOWELS for us. As for the indoor pool no one used it the whole weekend it smelled so strong of pool chemicals.We would not recommend this hotel to anyone.",
      "rate": 1.0,
      "tripDate": " July 2017"
    },
    {
      "title": "Traumatic and Horrible Experience!",
      "text": "we booked a room at this hotel for a weekend because it is near a friend's place... We got charged for 70$ for our 2 dogs although their site doesnt say they charge. The fee is significantly higher than the charges from 4-star hotel... My older furbaby whined through out the night, refused to eat his food or sausage, did not pee or poop... Very unusual of him... My husband and i woke up at 630am the next day... Very unusual also for both of us on a weekend and when we are on a mini-holiday... We cancelled our plans that and decided to return home as soon as we were up as we couldnt bear to stay at the hotel anymore.. We didnt even shower as we wanted to just hurry and leave the hotel!!!  Thats how uncomfortable we were....The bat tub was not clean; the air con did not cool down the room although it was set on \"high\"... The aircon was noisy also... I would never ever stay at any travelodge anymore... It is worth spending more money on more decent hotels than stay at travelodge...",
      "rate": 1.0,
      "tripDate": " May 2015"
    },
    {
      "title": "Will never return",
      "text": "Very dissatisfying experience..I booked this hotel through Tripadvisor/getaroom. When I reached the hotel, they didnot have my reservation, and gave me hard time.. The General Manager asked me to pay again if I wanted to check in, inspite of showing him my confirmation. He said that he doesnt deal with \"these websites\" so it is my problem and I needed to get my money back from Trip Advisor.After a lot of argument and back and forth for more than 30 minutes, I finally got a room.. Went upto the room and the room was a dirty room (Housekeeping didnot clean it after the last guest checked out). I had to come down again and ask for another room.. and the gentleman at the reception treated me as if it is my fault.. Instead of apologizing, he questioned me 4 times, if I was sure... so I decided to bring their Housekeeping Manager with me to show him..The new room was terrible, dirty, smells like fungus.",
      "rate": 2.0,
      "tripDate": " November 2014"
    }
  ]
}