{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Trillium Suites toronto",
    "url": "/Hotel_Review-g155019-d4436326-Reviews-Trillium_Suites_toronto-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "2.0",
      "reviewCount": 33
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "5 Mariner Terr",
      "addressLocality": "Toronto",
      "postalCode": "M5V 3V6",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/05/e4/fa/5d/trillium-suites-toronto.jpg?w=500&h=-1&s=1"
  },
  "description": null,
  "featues": [
    "Free internet",
    "Internet",
    "Air conditioning",
    "Kitchenette",
    "Refrigerator"
  ],
  "reviews": [
    {
      "title": "Unauthorised paymeny taken  - even though room was cancelled in plenty of time",
      "text": "I haven't actually stayed at this hotel, however I feel I should write this review as Trillium suites took an unauthorized payment from my card, despite cancelling the booking in plenty of time. I did preliminary book a room on the 23rd September through booking.com. I had until the 5th October to cancel the room. I cancelled it on the 24th September as I had found more suitable accommodation for my parents and for our trip to Toronto on the 6th October. To my dismay I found that Trillium had taken the money from my account on the 25th September. I sent an email to both Trillium and booking.com on Friday 2nd October. I received a response from booking.com but not Trillium.  I am advise other travelers to be aware of this, when booking this accommodation as I am now going through the hassle of trying to get money back that should never have been taken in the first place, not only this but Trillium have not even bothered to respond to my email in the first instance, had they responded, I wouldn’t be writing this review.  This is totally unacceptable and I have notified my bank of this unauthorized transaction. My bank advised me to wait and see if I get a response from either booking.com or Trillium. As previously mentioned, I have had a response from booking.com who are in the process of looking into it, so am just waiting to see the outcome of this.",
      "rate": 1.0,
      "tripDate": " October 2015"
    },
    {
      "title": "Look for another place",
      "text": "Although it is located almost in the center, far from the subway and other transport. When the temperature is -25C it is very important. Sleeps was only 2, other people need to sleep on mattresses on the floor. Equipment is very old, it is necessary to turn off the kettle to pull it out of the socket. The castle the entrance door reeling so that it can fall by itself. Teaspoons are absent altogether. In the bathroom there was only 2 bars of soap and toilet paper. Tea, coffee, sugar were absent. WiFi worked only 2 days, and then disappeared. It is impossible to phone to owners. Maps or pointers around the city was not. Although we liked the trip, but apartments made ​​a very bad impression and did not want to go back there in the evenings. If you want to get pleasure from visiting Toronto, choose another place to live.",
      "rate": 2.0,
      "tripDate": " January 2014"
    },
    {
      "title": "Unwelcoming ",
      "text": "Unwelcoming staff members the only saving grace was the location of the apartments right outside the baseball stadium and the CN Tower. Poor customer service not a place I would be visiting in a hurry as when we arrived he was asking us when we were leaving! He was unwilling to help us find our keys as we arrived late and we weren’t allowed in certain parts of the apartment block which is not clearly stated. The fun part of the apartment is that there is a roof top swimming pool you can use which has BBQ facilities which is nice.",
      "rate": 2.0,
      "tripDate": " May 2018"
    },
    {
      "title": "300 Front Street Location!!  Not Mariner!  Never Again!!!",
      "text": "Good; Dog friendly; we met many nice dogs!           Parking garage well lit, modern and spacious for all vehicle sizes.           HVAC worked fine, but it wasn't over 23 deg. C outside when we were there.           Large balcony afforded excellent views.           Location couldn't be beat for our plans. i.e., Rodgers Center, etc.           Lots of room for two in the unit & just enough room for 4.           Has washer and dryer if staying for a long period of time and packed lightBad;    Room door Lock did not work properly, ever.           Very difficult to reach Supervisor.           No TV for two of our 7 nights; service had lapsed.           Very slippery (dangerous) shower floor.           Leak at shower sprayer head connection; ~ 45 % less spray than normal.           Stove very difficult to use; had to google for help. Micro-wave we never got to work.           Floor looked clean at first but caused us black feet and proved to be filthy.           Whirlpool full of garbage and did not work.           Hot tub only worked occasionally.           Bathroom fan would not turn off but not an issue for us.           Kitchen poorly equipped, 1 coffee cup, 2 bowls, 3 glasses, 1 pot no pans to cook with for 4 people (but lots of plates) Did know I would be doing dishes, not even attempting to try and figure out dishwasher.            Parking transponder; 3rd day before we got it & then it didn't work properly 2           days later.           2 false fire alarms within a week, 1 at 2 am           Not enough bed linen or pillows to make up the sofa bed. Took 2 days to get more, by then our guest were leaving.           Warning!!! Do Not believe the booking.com reviews as these have been clearly manipulated!!!!!",
      "rate": 2.0,
      "tripDate": " June 2017"
    },
    {
      "title": "Excellent self-catered apartment",
      "text": "Having read some of the previous reviews, it appears that some people were expecting the hotel treatment.You won't find this here. You're hiring an apartment, so you cater for yourself.With that in mind, this place has everything covered.Very comfortable one-bed apartment, with a separate lounge/kitchen area. TV with hundreds of cable channels.The bed was memory foam, extremely comfortable.Less than 5 mins walk from the CN Tower and Rogers arena.The location is within walking distance of hundreds of great restaurants and all of the usual attractions.The only down-sides would be the gym facilities, that could do would a refurb, but that's more down to the building operators than Trillium Suites themselves.Communication is also a little bit dis-jointed, as the building concierge is far from helpful. If you're happy to fend for yourself in terms of meals and housekeeping, this place is perfect.",
      "rate": 4.0,
      "tripDate": " March 2017"
    },
    {
      "title": "very dirty flat you can not enjoy the viewing of the windows too as they never been cleans!",
      "text": "we had a nice stay in Toronto, but this flat was very dirty! The services were very down and they are just after making money! Also no organization with the keys, thee was no note for the internet or the other facilities in the flat, always you have to call the owner to ask about any information! We have never been to the more dirty place and I don't know how this people are renting the apartment in this awful conditions!!!!???? are they not a shame?! The reception security were not helpful and they do not know much about the flat! The rent they require is too high for the services provided! There was no cafe, no fresh towels, no cleaning everyday .. nothing from their side!",
      "rate": 2.0,
      "tripDate": " August 2016"
    },
    {
      "title": "Money grab",
      "text": "Like others have reported, I got a big surprise when the full amount (including taxes) was charged to my credit card immediately.  I cancelled a couple of days later and am now awaiting a refund. I wish I head checked these reviews before I hit confirm!  Booking.com sent a message to them and promised to follow up. I called the property directly this morning and got a very indifferent person who said the refund has been processed. We'll see how long it takes, and how many times I have to contact them. DO NOT DO BUSINESS WITH THIS COMPANY.",
      "rate": 1.0,
      "tripDate": " April 2016"
    },
    {
      "title": "Awful service...they just want your money.",
      "text": "I am happy that I did not stay at Trillium...but I have had the worst experience booking with them. This November without notice, Trillium charged me for my May 2016 reservation. I did not know about the charges until I checked my Visa statement. There was no email receipt or notification. I ended up cancelling the booking as my travel plans changed.  It is more than 2 weeks later I have still not received a requested refund receipt nor a refund for my cancelled booking, even after calling Trillium 4 times and leaving an email message. I managed to speak to representatives on three of the four times who each told me that the refunds had been processed - though two told me different dates when it was done. I was also told that they would send me via email a receipt of refund and I am yet still waiting. I sent an email (seems like you can only email Trillium via their website form, and you don't even get a confirmation of your message to them) and an additional voicemail and have yet to hear back from both communications. I have followed up with my bank and they have confirmed that there is still no refund being processed.  Trillium has been nothing but a frustrating experience and nothing seems to be getting rectified.",
      "rate": 1.0,
      "tripDate": " November 2015"
    },
    {
      "title": "Worst sleep of my life",
      "text": "We decided to get a Trillium apartment instead of a hotel for the purpose of having a kitchen and a separate room. If we were to do it again, we would NEVER stay here - worth going out for food and sharing a small hotel room instead. I have travelled Asia and slept in 1$/night accommodations and the Trillium bed is the worst I have ever experienced. Not to mention, the second set of bedding looked like it came from someone's basement. The \"pull-out\" is harder than the hardwood floor and the next night when I slept in the actual bed, it was no better. If you are working in Toronto you will regret this apartment due to exhaustion from lack of sleep. I am young and usually am happy to stay anywhere, I swear I'm not a snob!The owners of Trillium took every short-cut and cheaped out in putting these apartments together, making the kitchen useless due to lack of supplies/utensils. There were not garbage bags/toilet paper/enough towels/t-towels/dish soap/laundry detergent/shamppo&conditioner. There are far better options. We should have stayed at an AirBnB, at least people actually live there so you know it's functional. I write this as I get ready to leave, with a kink in my neck, a soar back, and a need for a massage. I do not recommend staying in this Walmart Special, under-supplied apartment. Great location though...",
      "rate": 1.0,
      "tripDate": " October 2015"
    },
    {
      "title": "Looked good, left a bad taste...",
      "text": "My wife, daughter, and I arrived for our five day stay at Trillium to be greeted by security who had no idea who I was or how to help. I had to physically show him my confirmation email before he would give me the keys to the apartment. When I asked about parking he had no clue and told us to leave the car parked in the fire zone for the time being. When we got into the apartment the Internet password didn't work so we had to go to Starbucks down the street in order to do anything online, which was inconvenient at best. The phone didn't work either, which meant we couldn't even call the totally unhelpful help line that we were provided - when we did call the number given for \"help\" we got a \"subscriber not receiving messages right now\" message. The email requested no shoes in the bedroom to keep the place clean so we had our daughter, and ourselves barefoot, and came away with dirtier feet than the sole s of our shoes would have been. There were dead bugs on the window sills, great for our 14-month old to play with. Overall a very disappointing rental experience, and had we known a way to ask for our money back we would have left and gone elsewhere. The only positive is the full kitchen, so that we were able to cook for ourselves during our trip, which is the only \"affordable\" part of our stay.",
      "rate": 1.0,
      "tripDate": " May 2015"
    },
    {
      "title": "Location Location Location",
      "text": "Perfect location if anyone wants feel the buzz of city of Toronto as well as enjoy the view of skyscrappers. Apartment was fully equiped and spacious. Friendly staff. Couldnt fault anything. Absolutely loved it.",
      "rate": 5.0,
      "tripDate": " August 2015"
    },
    {
      "title": "Be patient- this isn't a hotel",
      "text": "The trillium suites are lovely and their location in downtown Toronto is perfect. But this is not a hotel - it is a group of condos rented out by owners. The guard desk in the building will have your keys waiting, but they are not a \"front desk\" and they provide NO services. And if there is a problem, you are probably stuck with it for the duration of your stay... Their phone is not attended much., and they don't have much authority to fix things. However, I was very impressed with the flat I rented-- very spacious and well- equipped! Beautiful view! Unbeatable location. The price was great, too. So if you have the patience of a saint, this is a great choice.  Just do NOT expect any guest  services or help at all.",
      "rate": 3.0,
      "tripDate": " March 2015"
    },
    {
      "title": "It is what it is.",
      "text": "I'm a bit confused by some of the reviews about this place, it's basically private apartments that owners sub-let. The security people in the lobby just take care of the building, not the guests.It's not a hotel, it's just an apartment you rent. The one we had was really nice, clean and just what we needed. Great view from the 38th floor! If you want service, a maid, a concierge and all the trappings, go to a hotel. This ones not for you.",
      "rate": 3.0,
      "tripDate": " August 2015"
    },
    {
      "title": "Awful Service",
      "text": "We were unable to ever get hold of anybody that worked for Trillium. We had no way to wash clothes due to a broken washing machine and the flat was not exactly clean. It was a shame but we did have a great holiday in Toronto.",
      "rate": 1.0,
      "tripDate": " June 2015"
    },
    {
      "title": "Never ever stay there!",
      "text": "We stayed with trillium back in 1995. These people are rude, enter your apartment when you are away, don't know the words service or hospitality. Stay somewhere else! They have an office in Missisauga and several locations around Toronto.",
      "rate": 1.0,
      "tripDate": " March 2014"
    },
    {
      "title": "Dirty and Dangerous; Poorly Maintained",
      "text": "Stayed for a whole week. Here goes...Gripe 1. Apartment was barely clean. Bath was filthy, windows were grubby, skirting boards & door frames were caked in dust and walls were splattered  with stains. Agent was contacted upon arrival but did nothing. Gripe 2.  Apartment is poorly maintained. Blinds were broken, light bulbs didn’t work, ironing board was broken, window was cracked, door handle was missing. Agent admittedly fixed some (but not all) things, but only after we had arrived and after I insisted. Gripe 3. It’s dangerous. Our kids got stuck in the bedroom with no handle. The electrics failed. The balcony door (30 storeys up) did not lock... not clever with young. kids. Agent was contacted and did hee-haw. Disappointingly (but not unsurprisingly) I tried to contact the Owner via the Agent but they refused to take my calls or reply to my messages. Summary: I consider Trillium to be evasive, unprincipled and greedy. Money appears to be more important than the upkeep of their properties or the safety and well-being of the guests. It’s a real shame as it’s otherwise a good apartment block in a very central area close to amenities (CN Tower and Aquarium) and had a nice outdoor pool. My advice is to avoid Trillium and find another property owner in the same block who has scruples, and a conscience. Be warned!Now here’s some pictures of some lovely dirty and broken things...",
      "rate": 1.0,
      "tripDate": " July 2018"
    },
    {
      "title": "Bad customer service.",
      "text": "I have not even stayed in this place and the service has been shocking!I booked a room through booking.com on a free cancellation only to have to change plans and cancel.On cancellation of room I was charged full price,I wrote to the hotel explaining the error hoping for it to be resolved. I have sent the email over a week ago and still no reply.In the meantime boiming.com has called them explaining and they said they would refund straight away...still no money a week later.I have been in touch with booking.com again who have asked for for details to refund me and then charge this dreadful place.As well as bad service I have been left £471 out if pocket for over a week with no explanation whatsoever.",
      "rate": 1.0,
      "tripDate": " November 2017"
    },
    {
      "title": "Not a hotel!",
      "text": "As long as you remember that this is an apartmemt you rent and not a hotel, then you'll be fine. The apartment was well furnished and had all the kitchen utensils you'll need during your stay. The bed was memory foam so no complaints about comfort there! The wifi was very good, you should receive an email telling you how to log on. Secure parking can be purchased additionally, which we did.The location is the best part of these suites. Literally opposite the cn tower, rogers stadium and aquarium-with hundreds of restaurants within walking distance. The top floor (labelled 'rec' on the elevator) has a full gym, spin studio and steam room which you have access to. There was also a rooftop terrace with a pool but that was closed for winter. As long as you dont mind going without all the little hotel perks then this is a fantadtic place to stay. Really felt like a home from home.",
      "rate": 4.0,
      "tripDate": " March 2017"
    },
    {
      "title": "Very disappointed",
      "text": "Booked this as I was at the conference centre across the road. It looks great inside, but the wireless & cable never worked, couldn't get the coffee maker to actually make coffee, although I could set the time no problem. It had a flat surface stove with controls on the flat top, I never could manage to get I working. The microwave turned on fine but wouldn't cook. When my wife joined me she couldn't get them to work either. Fortunately a Starbucks next door & a Timmie's down the Stret for coffee &  wireless. To be fair they did offer to move me, but only sometime in the morning which I couldn't due to conference schedule.",
      "rate": 3.0,
      "tripDate": " January 2016"
    },
    {
      "title": "Trillium Suites at 300 Front St West, Toronto. - Very disapointed. Beware.",
      "text": "Gave my apartment to somebodyelse. Took approx 1/2 hr to rectify. Apartment very dirty. Found bucket of dirty water ( from previous floor swabs) in the utility closet. Informed the management, but they never removed it. No telephone. No power in living room sockets. No bath shampoo, conditioner. Only a bar of soap. Dirt towel was re-folded and placed in the bathroom as clean. Shower control didn't work properly. No coffee. Open cans of beverages found in the refrigerator. No parking available although the listing said there was parking.",
      "rate": 2.0,
      "tripDate": " October 2015"
    },
    {
      "title": "Poor quality and no customer service",
      "text": "Y stayed at one of their suites are 35 Mariner Terrace, suite 3201. The apartment is a ruin, very old and worn out. Rust all over the place in the bathroom, lot of useless stuff in the balcony, washing machine, drier and telephone out of order...nothing was fixed during my 9 days stay. They do not respond to any emails sent to them. I checked out a week ago and still fighting to get the deposit (300$) back, with no luck so far",
      "rate": 1.0,
      "tripDate": " September 2015"
    },
    {
      "title": "Awful - avoid at all costs",
      "text": "Arrived and were unable to get into our apartment as it was still being cleaned, building staff told us to come back later (they could not tell us how long it would take). Once we got into the apartment it didn't even look like it had been cleaned, everything was dusty. The washing machine had an out of order sign on it so I called the number I had for the company and they told me they would look into it. After not hearing anything I called back and emailed several times and received no response from Trilium. The apartment was run down, floorboards were broken and chairs falling apart. Did not enjoy my stay here and had the added hassle of having to get clothes dry cleaned after booking an apartment with laundry facilities! Bad experience over all! Avoid at all costs!!",
      "rate": 1.0,
      "tripDate": " June 2015"
    },
    {
      "title": "August 2014 : non-existent customer service, lack of communication, rude, unhelpful reception staff",
      "text": "I would not recommend this agency (?) to fellow tourists. Trillium suites rent out apartments in a building called 300Front and then rent to tourists. I met no representative from them at any stage & reception staff in the building didn't have my details when I arrived & no parking was available although my booking information claimed it was readily available. Reception staff at 300Front were rude and unhelpful both when I arrived and when I returned the apartment key. Given the vague nature of Trillium Suite's business and lack of communication from them to date to my email asking for a detailed breakdown of the  cost charged to my credit card (more than the charge indicated on Booking.com - I'm aware that various canadian taxes  are  added on but I have asked for a receipt confirming this - I've received no reply to date), I would urge fellow visitors to Toronto to use one of the many reputable and well known hotels in the area. The only positive of the apartment were the location (beside the CN tower).The kitchen was well equipped although there was no cleaning equipment and there is no housekeeping provided). There was no fire blanket, no fire extinguisher and no evacuation procedures which are standard in most hotels and accommodations. I don't know if this is against Health and Safety law in Canada. The sofa bed is not comfortable and there is another mattress which was filthy in the wardrobe in the main bedroom. The extractor fan in the bathroom does not turn off with the lightswitch so bathroom door has to be kept closed to avoid the constant hum. Again, I would not advise anyone to book accommodation through this agency.",
      "rate": 1.0,
      "tripDate": " August 2014"
    },
    {
      "title": "Wonderful experience while on a business trip",
      "text": "I'm surprised by all the negative reviews. I won't discount them, but I have to say my own personal experience was excellent!I stayed there for 3 days, while I was on a business trip downtown. The rooms were so clean I could eat off the floor, the fridge, cooker and bathrooms were impeccable and the bedroom was the best. Silence, despite being downtown and overlooking a busy part of town.",
      "rate": 5.0,
      "tripDate": " September 2017"
    },
    {
      "title": "Not how it was described! ",
      "text": "The location of this apartment was brilliant but that was the only thing. The apartment was dirty on arrival- don't know when the fridge or sink were last cleaned, dust everywhere! Only 3 mugs and 3 glasses yet 4 of us staying there. Most of the blinds on the windows were missing. The flooring was dangerous- big chunks missing out the laminate flooring. I emailed the company through booking.com and didn't even get the courtesy of a reply. It was a lot of money for what it was.",
      "rate": 1.0,
      "tripDate": " July 2017"
    }
  ]
}