{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Trinity Suites Condo On York Street",
    "url": "/Hotel_Review-g155019-d23033082-Reviews-Trinity_Suites_Condo_On_York_Street-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "1.0",
      "reviewCount": 7
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "14 York St",
      "addressLocality": "Toronto",
      "postalCode": "M5J 0B1",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2a/9b/ed/ea/caption.jpg?w=500&h=400&s=1"
  },
  "description": null,
  "featues": [],
  "reviews": [
    {
      "title": "Stay away - Scam",
      "text": "I did not do my research thoroughly enough and also booked a similar condo on the same site as the other reviewer to stay in for October 2023. When communicating with the \"host\" the prices changed from CAD to USD. When the payment was sent via Paypal (it was the only option they would take that would have a safety net to some sort of dispute mechanism for a refund if things went south) it took more than a week for confirmation, even though my messages indicated to advise upon receipt of payment. Correspondence was the same copy and paste messages which try to dissuade you from asking more definitive questions. Good thing that I did  go with Paypal as I had a very uneasy feeling. The email address is definitely different from the booking site and chasing the information was more than difficult. Paypal ended up favouring on my side of the dispute. After putting my dispute in through Paypal, they contacted me right away stating that doing so puts a \"bad reputation\" on the business and tried to assure they had my booking confirmed.They tried to take the entirety of my payment, even though I cancelled the booking two months in advance. They tried to say that the bigger deposit was non-refundable due to operational costs. Stay far away. This is a scam.",
      "rate": 1.0,
      "tripDate": " August 2023"
    },
    {
      "title": "Cowboys and scammers",
      "text": "If I could rate in a negative number I really would. Keep away from these cowboys. When there is a problem, you will never get hold of these guys. They’ll keep your deposit and stop replying to you. I got given a condo I didn’t book. Stank of smoke on arrival. When I called, nobody wanted to pick up. Ended up booking a hotel for a night elsewhere. Emailed these guys and they said they’d send someone in to do a deep clean the following day which never happened. Still smelt awful in the condo. At this point I ended up staying at family’s and booked a hotel for the rest of my visit. When I asked for a refund for my stay they stopped replying. They still have a deposit which they never gave back even though I barely spent an hour in this condo. I have called, whatsapped and emailed multiple times but no response from anyone. I have a feeling I won’t be seeing that money again (best part of £1000 for 3 nights). Seriously stay away from them. Don’t let the price fool you. You’ll get no response once you are there and everything has been paid for.",
      "rate": 1.0,
      "tripDate": " October 2023"
    },
    {
      "title": "TRUST ME. DO NOT STAY HERE. Read the reviews.",
      "text": "Gave a 1 because there are no zeros. It's a scam. I wish I read these eviews first. If you made the mistake of staying here, VISA will dispute the charges if you have to leave for 1. No parking as promised or the rate as promised, No air conditioning. No TV. The place is a dump. These are low life owners, who probably know they can con trusting Canadians. If you made the mistake of staying here, you are free to protest on the sidewalk as peeople come in. Be very loud and let people know not to stay in this building.",
      "rate": 1.0,
      "tripDate": " April 2024"
    },
    {
      "title": "SCAM. STAY AWAY.",
      "text": "My mother in law who is not technically savvy booked a place with Trinity Suites, and upon arrival the suite was trashed. Being accountable, she had already paid the amount in full. We took videos and emailed them over to whatever customer service was in contact with her for check in / check out, and were met with unapologetic (copy + pasted) message, with an offer to get another unit. Obviously we asked for a full refund, and they obviously refused. We are taking legal action to attempt to get the money back.",
      "rate": 1.0,
      "tripDate": " September 2023"
    },
    {
      "title": "Avoid the scam",
      "text": "Big scam operating to collect money from people. Once they grabbed my card payment details, i couldn't have any communication with them. They sent me an email that i need to fill pre arrival form sent in my email to confirm the booking. However, They never sent any form. I tried to contact them by texts, phone calls but no replies. I thought my booking is not confirmed as i did not fill any form.I received a check in info not 24 or 48 hrs earlier but on the day of check in at 5pm when i was already staying at other place. They straight away took money out too from account after sending check in info. This sophisticated scam costed me 400 dollars.",
      "rate": 1.0,
      "tripDate": " March 2024"
    },
    {
      "title": "Suspicious Place !  Stay away !",
      "text": "I rented the place on the Beds24 platform. When I came to pay via paypal I was redirected to a non-existent page. Then I received an email asking me to make a direct deposit in dollars or bitcoin to an address like @gmail. Non-refundable deposit of course. Then I had to run after the information. I was asked to complete the transfer to have the details and telephone numbers when I will arrive on site.Finally after multiple obstinacy, he does not want to give me back part of my deposit. Really suspicious. They have two email addresses but it is not on the email of the corporation that we make the deposit but on the Gmail email. Really it does not say how he proceeds for the checkin / checkout. We can't pay the difference when we arrive despite all the negative comments I've found. Stay away.",
      "rate": 1.0,
      "tripDate": " October 2022"
    },
    {
      "title": "Don't even - horrible!",
      "text": "trinity suites is a scam. Horrible choice on my part to book with this awful place. The fact that there is a government body out there approving establishments like trinity suites is doing a disservice to Citizens and guests. Close down your shady business!",
      "rate": 1.0,
      "tripDate": " January 2024"
    }
  ]
}