{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Two Peas Pod Hostel",
    "url": "/Hotel_Review-g155019-d15194270-Reviews-Two_Peas_Pod_Hostel-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.0",
      "reviewCount": 22
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "403 Spadina Ave",
      "addressLocality": "Toronto",
      "postalCode": "M5T 2G6",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/16/02/63/ca/two-peas-pod-hostel.jpg?w=500&h=400&s=1"
  },
  "description": "Two Peas Pod Hostel is an innovative new travel concept straddling the line between a hostel and a hotel. Born out of the recognition that current travel formats are not keeping up with the needs of the modern traveler, we have completely redesigned the hostel experience – combining the community and social experiences of a hostel with the sleek design and modern amenities of a hotel. Our hostel was re-imagined from the ground up. Our common areas feature a state-of-the-art media room, two lounges, modern washroom facilities, and a rooftop patio space with breathtaking scenic views overlooking the city. We have several types of rooms, both shared accommodation and private accommodation options. Each of our pods were custom built and meticulously designed for comfort and functionality. Each pod features: • Premium memory foam mattresses • Smart TV • Bamboo Pillows • Charging station • Personal Fan • Bed light • Individual privacy screen",
  "featues": [
    "Free High Speed Internet (WiFi)",
    "Wifi",
    "Free breakfast",
    "Bar / lounge",
    "Restaurant",
    "Concierge",
    "Non-smoking hotel",
    "Self-serve laundry",
    "Air conditioning",
    "Non-smoking rooms",
    "Suites"
  ],
  "reviews": [
    {
      "title": "great location and price",
      "text": "first time staying in Toronto and at a hostel, great first experience staff was super informative and helpful, restrooms were co-ed , and the women only dorms were great you need the keys too get in about every door so safety was a top priority, everything is in walking distance.",
      "rate": 4.0,
      "tripDate": " October 2019"
    },
    {
      "title": "Decent place for the price. Loved the privacy curtains.",
      "text": "beds are comfy and liked the secure access to the female dorm.  But don't see the point in the curtains instead of doors - a sliding door would be just as handy and less noise from people accessing the toilets and reception doors.  Also no room for the bags in the room so had to sort bags on corridor.  Breakfast wasn't a great selection so wouldn't hold out for it.  Reception were very helpful. Loads of nice restaurants around.  Also lockers to store bags after check out, most of the locks are broke so these could be fixed.  It is a decent walk from downtown so would prob pick somewhere closer if i visit again.  Would perfer female and maie separate washrooms.",
      "rate": 4.0,
      "tripDate": " September 2019"
    },
    {
      "title": "Amazing Stay!",
      "text": "This is the best hostel I have ever stayed at! Other hostels should seriously take notice of their business model because it works! Even though the accommodations were shared, everything felt so private! Their beds or pods are so uniquely built and have privacy screens all around and it makes you feel like it's just you in the space. The showers were amazing and water was steaming! The showers and toilets are also built with a private feeling. Rooms are a little cramped but the styling makes up for it. The best part about the pods were the TVS inside each one!  Everything about Two Peas is modern, clean and comfortable. I seriously did not want to leave!Staff was also super helpful and kind enough to give a tour of the space upon arrival. It's located in Chinatown on a really neat street as well.The only con I will say is that breakfast starts late at 8am. Due to my schedule I was not able to eat the free breakfast provided.",
      "rate": 5.0,
      "tripDate": " August 2019"
    },
    {
      "title": "Nice bed but cramp room",
      "text": "Nice pod with curtain, but no place for opening up your luggage. Everybody's luggage lining up along corridor. Streams some large range of movies within your pod,  which were quite alient to me.Place was easy to find, follow the instructions the hostel gives. Towels are not changed. they only clean when someone checks out. Common Toilets and shower are places which gives you nightmares. Don't want to go unless necessary.it's in the basement. Staff are nice and helpful. It's a usable accommodation when else where is fully booked, and you haven't got any choice.",
      "rate": 3.0,
      "tripDate": " June 2019"
    },
    {
      "title": "New, clean, small",
      "text": "(+)Friendly and helpful staffClean and modernBed pod has a light, fan, socket, TV with headset Good breakfast with a waffle cooker Good locationNice sitting loungeNice terrace Towels provided for free (-)Unpractical: toilets located in the basement so the guest needs to go up and down No sink in the kitchen, fridge located in the sitting roomRooms have no doorsRooms are way too small",
      "rate": 3.0,
      "tripDate": " October 2018"
    },
    {
      "title": "Not good value for money ",
      "text": "Staff was friendly and location is fine, but it is not good value for money. I stayed in the “deluxe” private room, deluxe clearly being an overstatement, the only difference with the other rooms was that you had a door instead of curtains. I found a few hairs in my bed and the blanket didn’t smell clean. Toilets and showers were in the basement (2 flights of stairs down) and cleanliness was inconsistent.Breakfast wasn’t good at all, burnt coffee and very limited food choices.Had I paid a regular hostel price, I would be a lot less picky but for the price of the “deluxe” room, you’re better off with a hotel.",
      "rate": 2.0,
      "tripDate": " October 2019"
    },
    {
      "title": "Amazing experience!",
      "text": "We stayed in the deluxe private room but they have other options such as shared rooms. Each of their pods were custom built and meticulously designed for comfort and functionality. Each pod features: premium memory foam mattresses; smart TV; headphones, bamboo pillows; charging station; personal fan; bed light, individual privacy screen & the door’s electronic keypad protected.Staff were very friendly and helpful. All facilities were super clean!When you find an amazing hostel, well located for an affordable price reflects a considerable value for money. Despite of being kinda used to staying in hostel, I never expected to have so much privacy and peace.",
      "rate": 5.0,
      "tripDate": " May 2019"
    },
    {
      "title": "Overall rating",
      "text": "This pod hostel is located in Spadina, China Town, Toronto.In heart of China Town.The pods are ok , and best it has small TV on which you can watch Netflix as well as YouTube.The staff is great.The wash rooms are extremely clean, very well connected by public transport from both domestic as well as international airport.Dowside toilets are too small for average broad size person, location of washrooms is below so one has to keep on going below for mundane things.Breakfast is average.",
      "rate": 3.0,
      "tripDate": " August 2019"
    },
    {
      "title": "Simply great",
      "text": "I had some nice nights in this hostel. It was clean, comfortable, cozy and private. We can have our own space, since each bed has its own TV and curtain. Also, the staff is really nice and helpful. The location is good, the price is excellent and includes breakfast.",
      "rate": 5.0,
      "tripDate": " November 2019"
    },
    {
      "title": "Great Location and Accessibility",
      "text": "Good size pod bunks with plenty of space in the pod. The access to netflix per individual bunk was pretty nice when hanging out in my pod. The walkability was amazing being right next to Kensington Market, tons of food and easy access to the tram for farther distances. The bathroom being downstairs wasn't a big concern except the door can be loud when I had to leave really early in the morning. Breakfast was simple and typical hotel far with a self serve waffle maker, toast, yogurt and mixed beverage options. I left before breakfast hours most days so I didn't usually partake in it anyways. The bathroom never had any backups in all the time I was there even as a shared bathroom. The only time the sinks had any issue was waiting for a couple older ladies to finish washing their cabbages which they moved out of the way very quickly and kindly. There is a washing machine and dryer available in the same area of as the bathroom also.",
      "rate": 4.0,
      "tripDate": " October 2019"
    },
    {
      "title": "invasive male cleaner and cat pee smells",
      "text": "i wish i could leave a better review. the desk staff and the sleeping pods are great. however, their rude, male cleaner barged into our women’s only dorm room just as i was about to change clothes, unannounced. i was startled & said, “can you knock next time? i was about to change.” he barked, “see this (pointing to the curtain/door he just opened)? it’s open. you know what time it is? i have to clean the room. you know how much you paid for for this room? if you want better, you can pay $850 down the street.” my friend was so freaked out she left, and since i didn’t want to change in front of him, i had to wait for him to leave our room. when he finally did, i closed the curtain & said, “don’t come in here, i’m changing.” he pointed at me, responding, “you can’t tell me what to do. you can make a request and i’ll see.” i don’t think i need to say more about how wrong his behavior was. the hostel doesn’t mention cleaning times anywhere and we received no notification that rude-dude was in the women’s area, let alone that he was going to walk into our room.also, there’s a very strong cat pee smell in the entire bathroom, especially in the toilet area. it’s nasty. management said they’re trying to fix it. again, the sleep pods are great, the general cleaning woman is great, and the front of house staff is great. if you can handle strong cat pee smell and very rude room cleaners, this is your place.",
      "rate": 2.0,
      "tripDate": " July 2019"
    },
    {
      "title": "Room was great - bathroom disgusting",
      "text": "Loved the concept. The room was great for the one night I stayed. The piped in music was a little loud, but livable. The bathroom smelled like something died - damp and musty. That stench wafted upstairs quite a bit too. If they could fix that, I'd consider it again.",
      "rate": 3.0,
      "tripDate": " June 2019"
    },
    {
      "title": "Great for pleasure, NOT business travel",
      "text": "Pros:-excellent staff-clean-super cute & modern-well organized & designed-great location - near college, in Chinatown, not far from downtown, light rail outside the door-lots of great places to eat/drink-pods are cute, comfy, well-designedCons:-toilets are 2 flights DOWN...-breakfast starts SO late - 8am!-NO coffee/tea service except at breakfastI would stay again! But NOT for business, because breakfast & coffee in the am are too important",
      "rate": 4.0,
      "tripDate": " April 2019"
    },
    {
      "title": "Excellent!!",
      "text": "Fast smooth check in. Clean comfortable bed. Walking distance from tram stop which can take you nearly everywhere. Nice rooftop. Very secure place. Only breakfast was very poor. Would recommend it to anyone looking for a hostel in Toronto!!",
      "rate": 4.0,
      "tripDate": " August 2019"
    },
    {
      "title": "great, but the staff need to pay attention for keeping it great",
      "text": "the rooms are cool because each bed is separated by a curtain and has its own TV (!) connected with Netflix, amazon prime, etc. also, my room did not have a door, but only a curtains what I find great so you did not wake up every time someone entered the room. Sheets clean, not that noisy, they give you towels, sleeping earplugs, blankets, etc. The bathroom is great too, the showers are super good quality and you have a changing space that is good. Location is great if you love Asian food! In the centre of Chinatown and 5h min from the hipster neighbour, Kingston Market, walking distance of 20m from the downtown, and in front of a tram station.Well, the staff only arrived at 8 something and left at 21h. Therefore, I never saw them, which is annoying. I (and many people on the hostel that week) were in town for a congress and we needed to be out at 8h and the breakfast started only at 9h. I book the hostel because there was breakfast, but by the time I have to leave there was no coffee, no food, nothing. I don't think 9h is an acceptable time to start breakfast. Also, there is not even a sink on the kitchen, so the kitchen was useless for me. I tried to get hot water for tee in the night and could not have access, I think that is just dumb. Also, because they leave so early in the night and arrive so late, I basically all the time had the bathroom a bit dirty, messy, and full of water everywhere. The hostel is clearly new and using good quality stuff, but they need to pay attention to the maintenance or soon will be bad. The showers were frequently sticky and smelly early morning. Finally, if you have problem with using stairs, dont go to this hostel. To go to the bathroom or the lounge you need always to take steps, there is no elevator.",
      "rate": 4.0,
      "tripDate": " March 2019"
    },
    {
      "title": "Exactly as advertised",
      "text": "Exactly as advertised. I stayed in the female dorm, which is split into “rooms” of four pods. The rooms are closed off from the hallway by a curtain. The room was quite a small space with four “pods”, which are essentially enclosed bunk bed spaces, with a light, and a television. There is storage underneath, which is not large (it fit my duffel bag fine, but wouldn’t accommodate larger luggage, there are larger lockers elsewhere in the building). The bed was comfortable. There is not a lot of room to move around in the room. It also gets incredibly warm at night. There are small fans in the bunk to hel deal with this, but I imagine in the height of humid Toronto summer, they wouldn’t do the job. Overall, the place was relatively clean. Coffee and waffles for breakfast was welcome. It was fine for one night, but I wouldn’t have wanted to stay much longer.",
      "rate": 4.0,
      "tripDate": " March 2019"
    },
    {
      "title": "Clean food and hostel",
      "text": "We decided to stop in this original combo of healthy food and hostel.  Excellent, healthy food, impeccably clean washrooms, and friendly service!  Most definitely worth a visit to this unique establishment.",
      "rate": 4.0,
      "tripDate": " October 2018"
    }
  ]
}