{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "University of Toronto - New College Residence - Wilson Hall Residence",
    "url": "/Hotel_Review-g155019-d637782-Reviews-University_of_Toronto_New_College_Residence_Wilson_Hall_Residence-Toronto_Ontario.html",
    "priceRange": "$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.5",
      "reviewCount": 82
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "40 Willcocks St",
      "addressLocality": "Toronto",
      "postalCode": "M5S 1C6",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/08/94/17/e9/audrey-taylor-dining-hall--v74383.jpg?w=500&h=-1&s=1"
  },
  "description": null,
  "featues": [
    "Paid public parking nearby",
    "Free High Speed Internet (WiFi)",
    "Vending machine",
    "Bicycle rental",
    "Baggage storage",
    "Newspaper",
    "24-hour front desk",
    "Laundry service",
    "Wifi",
    "Non-smoking hotel",
    "Shared kitchen",
    "Shared lounge / TV area",
    "Self-serve laundry",
    "Air conditioning",
    "Desk",
    "Iron",
    "Non-smoking rooms"
  ],
  "reviews": [
    {
      "title": "I stayed at the 45 Willcocks (New College III) Building",
      "text": "Check-in/check-out at 40 Willcocks, but  I stayed at 45 Willcocks/New College III building. PROS:1) GREAT STAFF! 2) central location (510 streetcar stops right outside the door, a few minutes to Spadina TTC station, near main streets: Spadina, Bloor, Yonge, Bay, Queens Park), 3) cheap accommodations (cheaper than Massey College where I usually stay who went up on their rates), 4) quiet in summer months so you don't have to share bathroom/showers with a lot of people (at least not in New College III). I was here end of June/first week of July; 5) FREE internet access via wifi or ethernet (free if you have your own cord, but $5 to rent one from them); 6) access to kitchen/fridge (if you want to cook or store leftovers)- tv is also in that room; 7) laundry room on each floor; 8) study rooms are available if you need them; 9) cafeteria in the 40 willcocks building (for breakfast only, though)Cons: 1) extremely small rooms (I guess I was spoiled by the room plus sitting area offered at Massey College just up the street)2) ethernet streaming buffers frequently (annoying when watching news or movies)3) The towel that's provided is only a little bigger than a hand towel so BRING YOUR OWN! You only get the one - no face towel. 4) Beds are firm so you may need to use 1 or both blankets as a kind of mattress cover/cushion so BRING YOUR OWN blanket. If you like firm beds, you'll be fine.5) breakfast only in summer (no lunch or dinner on site except for summer camps), but it ends at 9:30am not 10am as I was told - buffet style $9, but I don't think there's a lot of hot options",
      "rate": 3.0,
      "tripDate": " July 2017"
    },
    {
      "title": "Lovely, quiet budget accommodation in Toronto",
      "text": "Booked to stay here after reading reviews on other websites, as we wanted somewhere cheap to get a good night's sleep ready for exploring the next day. This is two student residences, open to the public during the summer holidays. As such, the rooms were large, with shared bathrooms - great for us as we didn't have to share a bathroom! Also security was better than with hostel accomodation. It was a bonus having access to a common room with a fridge and TV. There is a choice of single or twin rooms, and our rooms were very clean. You can book via hostelling websites, but we found that you can book directly with the college and then get student discount. The buffet breakfast included in the price was extensive and pretty good quality. The location was good, close to Spadina station and the tram line. It was great as a quiet base for exploring, but not a lot going on if you want accommodation with action.",
      "rate": 4.0,
      "tripDate": " June 2005"
    },
    {
      "title": "$265 CAD for Seven Days Lodging (includes 13% Tax)",
      "text": "I stayed in the long-term Wetmore Hall Residence for one week in August 2011.  Basic room with pillow, sheets, blanket and bedspread; desk with chair; and telephone included but mine didn't work.  Very economical accommodations in a very expensive city.  Laundry machines were $1 per load and $0.50 to dry.  Breakfast buffet was available while I was there but can be sporadic depending if there are large groups staying on campus.  Right across from Spadina trolley line and a 5 minute walk to subway ($3 CAD with transfers).",
      "rate": 3.0,
      "tripDate": " August 2011"
    },
    {
      "title": "Friendly staff, residence is a cess pool",
      "text": "Staff super nice. This place is filthy.  No food service open. The only alternative is a kitchen- that residents are supposed to keep clean- without any paper towels, cloths, or soap. The fridges are closed. There are no dishes or pots and pans. Counters and stove are filthy. Showers filthy. Carpet in hallway filthy. Laundry room smelly like mildew. Can’t beleive parents pay for the kids to stay here…. Also someone should call Toronto public health",
      "rate": 1.0,
      "tripDate": " June 2022"
    },
    {
      "title": "witmore hall - a filthy hostel",
      "text": "Witmore Hall at the New College, U of T, is a cheap summer residence. But It is full of students from India who stay here for three months and leave the kitchen filthy every evening after long hours of Indian cooking. The toilet seats in the toilets are splashed with urine most of the time. Complaining to the staff on duty is useless since they do little to correct the various problems. Getting more responsible staff would be a first step in improving the conditions at a residence that belongs to a large Canadian university.",
      "rate": 2.0,
      "tripDate": " June 2023"
    },
    {
      "title": "This place gave me claustrophobia.",
      "text": "I stayed here during the best times in the summer (May).This place is extremely depressing.The halls are very barren, with poor lighting.The common room had almost nothing working. There is no fridge. There is one sink shared between dozens of student. The sofa were extremely deteriorated.The room is very very small. Fits exactly one person. Don't expect friends to visit or stay. The AC is turned on 24/7 and makes noise. You cannot shut off the AC.The bathroom can be extremely gross most of the weeks.Because of the cheap housing, the place has attracted some weird characters. I saw one old gentleman doing some hard drug in the 4th floor common room.Ask anything for the staff, you will get an email that begins with \"Unfortunately...\". This is their default response. Is there anything fortunate around here?I would give this place a 0 star rating if weren't for its convenient location.The best part about staying at new college is the part of getting out of there first thing in the morning and taking a nearby TTC to a place far away.",
      "rate": 1.0,
      "tripDate": " May 2024"
    },
    {
      "title": "Basically disappointing",
      "text": "We thought it would be fun to go back to where we went, but it was very disappointing. The front desk staff were NOT helpful. Parking is a nightmare. The hallways are depressing. Towels are small and course. The bottom sheet was too small for the bed. Cafeteria and common room were under renovation.",
      "rate": 1.0,
      "tripDate": " July 2022"
    },
    {
      "title": "On campus!",
      "text": "If your destination is UOT area or nearby, then this residence is a nice choice. The price is so attractive in the summer since most students are away. The only inconvenience is that the washroom is not private, and a little uncomfortable to take a shower according to my experience.",
      "rate": 4.0,
      "tripDate": " August 2016"
    },
    {
      "title": "Perfect for budget travellers",
      "text": "This is the perfect place to stay for budget travelers! For $45, I got a private room with clean sheets and a clean towel. It was a 10 minute walk from the subway station and there is a street car on Spadina which takes you right to Union Station. It is located in a quiet neighborhood and a 20 minute walk to Dundas Square. Perfect place to stay if you need to save money and don't need any amenities! Save some money and stay here.",
      "rate": 5.0,
      "tripDate": " May 2015"
    },
    {
      "title": "worth of money",
      "text": "It is simple but has a very good location and the environment is good enough. The room is not big but public area is very big. There is not a lot of people, and you could enjoy stay here like a student.",
      "rate": 4.0,
      "tripDate": " June 2014"
    },
    {
      "title": "Adequate stay on a tight budget",
      "text": "Location is reasonable if you're happy to walk, with around a 20-30 minute walk to downtown Toronto and access to local public transport. I chose this budget accomodation for the privacy of a single bedroom compared to a hostel. The bedroom was adequate with a desk and enough space to get dressed, although the bed was very hard and the curtains were translucent so I woke when the sun rose at 5.15am. The bedroom itself was relatively clean although the walls/roof were marked from previous student's stickers/decorations. The bathrooms are shared and very smelly and dirty. The towel I was given was also the size of a bath mat and stained. Overall, the staff were very friendly and it was easy to get around but I probably would not stay here again.",
      "rate": 3.0,
      "tripDate": " May 2017"
    },
    {
      "title": "Good to Keep in Mind Just in Case...Just remember that this isa College Residence...",
      "text": "This is a college dorm, so do not expect a hotel experience. That said, there are definitely occasions when this place can come in handy. The front desk staff were friendly and helpful; the front desk is open 23 hours a day (closed for one hour in the small hours of the morning). There is a place to store luggage if you get there early, or after you check out. Within the building, there are shared cooking facilities/fridge, coin-operated laundry facilities, and large-screen TVs located in the common rooms. The rooms are not in a suite set-up, so many rooms are sharing the washroom facilities which are set up like those at a gym, The washroom facilities were very clean, but it looked like they could become very busy depending on occupancy. The other shared features were in pretty good shape except for the kitchen sink, which had backed up and really needed attention. The room itself was larger than many hotel rooms, since it was meant for a student to live in for a whole term. It was quite clean, except that it smelled a bit musty and that got to me. If it were not as warm, I might have opened the windows and that might have helped with the smell, but the air-conditioning was keeping the room cool...I stayed there one night, arriving late evening, and by morning, while I was enjoying the air-conditioned comfort, the musty element kept me from wanting to hang out there much longer. Except for smelling musty, the room was very clean and the bed reasonably comfortable - if you are very tired you can probably sleep just fine. While there is no TV in the room, the free wifi worked, and there was a phone with free local calls (features not found in some rather more expensive establishments). There are many pluses to staying in a college residence of which safety is one...The building is located right across the street from a streetcar stop on Spadina. You can take the streetcar to/from the Spadina subway station or walk the few blocks to get there. Spadina  subway station is on the line that connects with Toronto Pearson Airport (subway to Kipling, the end of the line then the 192 Airport Rocket express bus).The front desk sells TTC transit tokens which will save money over paying cash fares. It is just a little bit out of the very center of town - a little bit further than some people might want to walk, but definitely doable for others.If you need a place to crash for a night  this place works just fine. Maybe your flight arrives late: you can stay here until morning and then go someplace else... Maybe you are coming to Toronto for an event that ends late: you can stay here overnight and then go home in the morning...Maybe you live nearby and your a/c broke down on a hot day...If you don't mind all of the shared features, you might be fine with staying here longer or even for an extended time - the price compared with most hotels and even many AirBnB type things is very attractive and for some could make a stay in Toronto affordable. For the price, this might be a best bet in Downtown Toronto for a number of reasons; definitely better than all of the risks that could go with staying in a down-scale hotel in the same price range... Just remember that this is college residence and plan accordingly...",
      "rate": 3.0,
      "tripDate": " May 2016"
    },
    {
      "title": "Affordable & central, but..",
      "text": "Rooms are like prison cells; tiny, single bed, and not very good isolated in terms of outside noise, both in- and outdoor.However, you get super central location for low cost. Excellent for solo travellers who only spend time in room for sleeping.Bring sandals for the share shower and bathroom, and the blanket may give you a rash, so I would advise that you bring your own.",
      "rate": 3.0,
      "tripDate": " July 2015"
    },
    {
      "title": "Cheap accommodation for the summer in Toronto",
      "text": "This is a good spot when you are not able to book another hotel in Toronto.  During the summer the residence is turned into a hotel offering cheaper rates.   The room were very basic and clean.  The only issue I had with the place  was with the shower stalls where unclean and the paint was peeling off the wall.",
      "rate": 2.0,
      "tripDate": " July 2014"
    },
    {
      "title": "Very unintelligent service",
      "text": "The staff do not care to help you. Employees will not use their judgment to accommodate you within reasonable limits. This place is really meant for students. But the rooms are big and it is not too noisy. I would not recommend.",
      "rate": 1.0,
      "tripDate": " June 2015"
    },
    {
      "title": "Excellent value for money!",
      "text": "Toronto is an expensive city for accomodation, and this university residence is a total bargain. Of course, you'll get a basic comfort, with shared bathrooms, but the room is really OK. On the other hand, you will benefit from the common area equipments, which include a shared fridge, microwave oven, etc. What's more, the location is top-notch, right smack in the city centre. Oh, and: there's Wifi! :)",
      "rate": 4.0,
      "tripDate": " May 2011"
    },
    {
      "title": "You get what you pay for.",
      "text": "The room was tiny and spartan, as I expected.  The toilets and shower down the hall were almost disgusting, but not quite.  Let's just say it was clear many people used them both frequently.  All of this was as I expected, given the incredible price of $40 per night.  And the location is incredibly convenient for downtown.  The Spadina street car is very closeby.I needed to leave a day earlier than expected, not an emergency but a change of plans. They would not even consider refunding all or part of my final night's fee.",
      "rate": 2.0,
      "tripDate": " July 2008"
    },
    {
      "title": "Great Inexpensive Option - Conveniently Located",
      "text": "Just had my 2nd stay at the University Residence Hall - it was perfect and really easy on my budget!  This time I brought my own pillow - and also some food as they do have a shared kitchen area with a fridge that you can use.  There's also a TV with netflix - and I wound up watching a movie early one morning before I headed out for touring.  I drove there and both times used their parking facility two buildings over - but learned this time that you can keep pushing the \"max time\" button on the machine to book multiple days for your car to be parked so that you don't have to get up at 5:30 a.m. to get a new sticker in your car window by the 6:00 a.m. departure time.  Between parking for my car and the room fee, I wound up staying there for 2 nights/3 days for only $140 - which is awesome.  If you really don't spend a lot of time in your room and don't need much - these room options are fantastic.  The location is so close to everything and I felt very safe there the entire time.  Kings Noodles - about 3-4 blocks down on Spadina has great food at also very reasonable prices - I can't wait to go back again - Toronto is a wonderful City!",
      "rate": 4.0,
      "tripDate": " July 2019"
    },
    {
      "title": "This hostel is not safe",
      "text": "This hostel sells rooms to groups of aggressive teenagers. I was restricted to access the common room with a kitchen as well as the toilets by these groups. The front desk could manage only an extra shift of cleaners to the toilets. No security guard nor the campus police was available during these stay. Really not safe environment.The room was not properly vacuum cleaned at the check-in. The bed was not comfortable, the mattress was too hard.Strict check-in times, the check-in time starts at 15:00 / 3:00 pm.The luggage room can be accessed by anybody. The staff could issue luggage tags and only the staff should access the luggage room. They give you a lengthy explanation that they don't bear any responsibility for lost or damaged luggage.Basically, low price = low cost service.",
      "rate": 1.0,
      "tripDate": " May 2018"
    },
    {
      "title": "Clean and Cheap",
      "text": "Had two nights to stay in Toronto. I never spend much time in a room so cannot justify paying $250/night for a hotel. Room was very basic, plastic covered mattress with sheets, cement walls, but it was air conditioned with towel for shower provided.. Walking distance to Kensington -market and great shopping and restaurants on Blood st. Also walking distance to Bata Shoe Museum and the ROM. Separate bathroom/shower area for men and women. The old buildings on campus are beautiful. Great value for $50.00 a night, can't beat it.",
      "rate": 4.0,
      "tripDate": " August 2017"
    },
    {
      "title": "Cheap Toronto accommodation",
      "text": "It's cheap, clean and has good air conditioning- for those looking for budget accommodation in Toronto this fits the bill. Be prepared for a bit of a walk to main attractions- 30-40 mins for CN Tower etc. neighbourhood is nice. All staff were very helpful and you can buy TTC tokens at reception.",
      "rate": 3.0,
      "tripDate": " August 2014"
    },
    {
      "title": "False Fire Alarm - Not Sure Everyone Heard It",
      "text": "This is the second time I've stayed at New College Residence - this time with my nine year old granddaughter.  Price for a private room with two beds was around $450 USD for a week, which is a good deal for Toronto - it's a college dorm room.  Common area and bathrooms were clean and access is controlled by electronic chips to enter doors and elevators, as well as a standard key to enter your room.One of the nights there was a false fire alarm early in the morning.  My granddaughter did not hear the alarm and if I hadn't been awake preparing for our daily activities, I too might have slept through it.  The alarms seem to be at the ends of the building on each floor when, in my opinion, they should have alarms within the rooms or more located on each of the floors.  This is not safe: University of Toronto should fix this issue ASAP just in case there is a real fire in the future.",
      "rate": 1.0,
      "tripDate": " July 2014"
    },
    {
      "title": "Downtown, High speed internet, safe, affordable!",
      "text": "I stayed here for 4 nights in June 2014 and i am more than impressed. $10 buffet breakfast on the cafeteria which was very good. I thought it would be noisy as id expected young travellers but it was calm n peaceful. Within walking distance from Chinatown and places like Rogers stadium, Cn tower, harbour front etc. Room was more than okay for one person, more so for me as i was out during daytime. Bathrooms were clean, atleast over the floor i was staying. Internet was superfast, tho i wish theyd Wifi. Would i come back here again, DEFINITELY! ps:check in and out was in a breeze. My only complaint would be, absence of wifi and having to buy internet cable at $5.",
      "rate": 5.0,
      "tripDate": " June 2014"
    },
    {
      "title": "Good stay!",
      "text": "Huge spotless room with two twin beds, quiet, super safe building requires a magnetic card to enter, 5 blocks to the subway but the street car passes right at the corner.  One-per-floor so-called kitchen has no pots, plates, cups, silverware or microwave, but you can bring your own to use on the stove.  Chinatown is just a 2 minute walk away.  There's only a large, one gender bathroom at opposite ends of each floor so you might have a long walk.  We drove, so had to navigate the U of T website ahead of time to decipher which parking lots were how much, and which ones you can remain in past 6am (there can be a big span in parking fees, so plan ahead). Free internet but $5 for a usb cable if you forget your own.  Cheaper than all the other poorly rated places, I highly recommend this facility!",
      "rate": 5.0,
      "tripDate": " June 2013"
    },
    {
      "title": "Nice test",
      "text": "This place has excellent.easy local walking and some sightseeing locales in hand with  wonderful onsite personnel that offer a personal touch.ike a disguised parking garage. If you have a car, note that there is no overnight parking on Willcocks street in front of the residence. I parked on Spadina just below Willcocks, where you can park overnight but the meter starts charging at 8 a.m. So you have to get up and move your car or put money in the meter.",
      "rate": 4.0,
      "tripDate": " July 2013"
    },
    {
      "title": "Only for the cheap price. Bring earplugs!",
      "text": "To save money, because we were staying in town for six nights, we stayed here but regretted it. As previous posters have mentioned, the front desk staff seem poorly trained, and they are more used to big school groups than individual guests. An unfriendly young man who was working the overnight shift told me he couldnt tell me if there was any possibility of moving to a different room to a quiter section of the hall and that I would have to ask in the office the next day. The front desk person doesn't know how full the residence is?On the plus side, the room was air conditioned, which is necessary in Toronto in summer, and the curtains at least had linings to block out light in the morning. Our biggest complaint was the noise from what seemed to be the undergrad students who are residents there in wetmore hall, where we stayed..They showed no consideration for other guests, walking through the halls and yelling at each other from one end of the hall to another, well past midnight, and slamming room doors and hallway entrance doors. There is a kitchen common area where they gathered each night watching TV that blared away. Security is good, with locks on the main building entrance, the entrance to each floor and you can;t use the elevator unless you have a room key. Be warned that you could end up with a large group of high-school students staying on your floor as well, since it's a popular accommodation for student groups. The communal bathroom can also be a very long trek down the hall from where your room is.Location is good and fairly central, in a leafy and green area of the campus. Building is ugly late 1960s architecture with lots of concrete, like a disguised parking  garage.If you have a car, note that there is no overnight parking on Willcocks street in front of the residence. I parked on Spadina just below Willcocks, where you can park overnight but the meter starts charging at 8 a.m.  So you have to get up and move your car or put money in the meter. A better bet would be to find a city-run parking lot and just leave your car there if you don't need to drive anywhere while in town.",
      "rate": 2.0,
      "tripDate": " July 2012"
    },
    {
      "title": "Poor service",
      "text": "The place was reasonably clean, but it is in a 1960s or 70s concrete building so it is not beautiful. This wouldn't matter because it is cheap and well-placed for downtown Toronto. This hall is set up for school groups and sports teams - not for visitors from the general public. The worst thing was the attitude of the staff, who are apparently only geared to deal with students. The girl on reception was very friendly but had little clue how to deal with most of my questions - I concluded that she was not trained. Her supervisor treated me like a badly behaved first-year student. The information on line says, for example, 'A pillow is provided' - what it does not say is that if you need another pillow, you can't have one. The worst thing was not that there are no pillows but that the supervisor spoke contemptuously to me as if I should have read the instructions and it was my own fault that I didn't bring one. The kitchen had nothing except work surfaces, settees, a cooker, microwave and fridge/freezer. I.e. no pans, crockery, cutlery, kettle or utensils. I was given a paper cup so I could heat water in the microwave. This kitchen might work if you were Canadian and coming by car so you could bring all you needed. For an Englishwoman coming on the train, it was of almost no use at all.I have stayed in many university halls of residence before and this was definitely one of the worst organised. For example, in my last couple of days a party of young teenage boys arrived and were staying all around me. My bathroom was moved by the simple expedient of putting a notice on the door. Sharing a floor with a group of boys was not my idea of fun. There is a good and cheap laundry room. The bathrooms were cleaned fairly regularly. The place is cheap. Those are the only good points.I would advise anyone not to go there. It should not be being advertised to the general public.",
      "rate": 1.0,
      "tripDate": " May 2012"
    },
    {
      "title": "What you pay for is what you get",
      "text": "Saved much on accomodation during this trip. Bare necessities were provided. Security was sufficient for a lone traveller.Could rest well. If you're looking for a luxurious place to satisfy creature comforts. this is not the place to be..",
      "rate": 5.0,
      "tripDate": " June 2011"
    },
    {
      "title": "Functional",
      "text": "I stayed here for three nights over a weekend. I booked the residences because I was last-minute and it was one of the few places with availability. I was apprehensive of partying with it being a weekend, but the place quieted right down at midnight, so no problems there. My room was fine, clean and given I had a double to myself I had plenty of space. The free wi-fi was completely reliable. The shared bathrooms, however, weren't cleaned once in the three days I was there, even though they needed it (particularly the sinks). I didn't use the common areas so I can't comment on them. The staff are really helpful. The location and price are the main things going for this place. I'd stay again.",
      "rate": 3.0,
      "tripDate": " June 2011"
    },
    {
      "title": "Great stay for a budget traveler",
      "text": "If you just need a bed to crash on after a long day touristing, this is the place to stay! Nice, simple room, with a clean bathroom located in the corridor. Super friendly front desk staff and good breakfast for only CAN $10. If you're a light sleeper, be sure to bring a sleeping mask, because the curtain is very thin. Location is excellent and there's a tram station exactly in front of the building.",
      "rate": 5.0,
      "tripDate": " July 2018"
    }
  ]
}