{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "University of Toronto-New College Residence - 45 Willcocks Residence",
    "url": "/Hotel_Review-g155019-d6527738-Reviews-University_of_Toronto_New_College_Residence_45_Willcocks_Residence-Toronto_Ontario.html",
    "priceRange": "$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.5",
      "reviewCount": 23
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "45 Willcocks St",
      "addressLocality": "Toronto",
      "postalCode": "M5S 1C7",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/13/f9/91/31/university-of-toronto.jpg?w=500&h=-1&s=1"
  },
  "description": "During the summer months, New College Residence at the University of Toronto in downtown Toronto offers daily, weekly or monthly accommodation in our dorm-style residences. We also offer meals, catering and meeting spaces for groups and conferences.",
  "featues": [
    "Paid public parking nearby",
    "Free High Speed Internet (WiFi)",
    "Fitness Center with Gym / Workout Room",
    "Vending machine",
    "Bicycle rental",
    "Conference facilities",
    "Meeting rooms",
    "Baggage storage",
    "Parking",
    "Wifi",
    "Newspaper",
    "Non-smoking hotel",
    "Shared kitchen",
    "Shared lounge / TV area",
    "24-hour front desk",
    "Laundry service",
    "Self-serve laundry",
    "Air conditioning",
    "Non-smoking rooms"
  ],
  "reviews": [
    {
      "title": "An excellent place to stay for the solo budget-minded traveler",
      "text": "This is a hotel with very basic amenities - just enough for one person to sleep in at night. The beds are hard (which worked out perfect for me), and there is just a table and some standing space. Not much more. The bathrooms are shared, and there are no hotel services to change your sheets/towels as this is basically a students' dorm facility. The elevator stops working sometimes (and when it does, it is very slow when crowded since it only works when the access card is swiped), and so be prepared to use the stairs. The reception, across the street is open 23 hours a day which works perfect for late check-ins. The facility is very conveniently located near a streetcar station, about 7 minutes from the subway station (Spadina), and about 5 minutes walking from Chinatown. The breakfast buffet in the morning is $8 plus tax and, in my opinion, is not worth it at all. No lunches and dinners, but there are lots of good ethnic eateries about 10 minutes away that are open well into the night.I STRONGLY recommend this place for a budget-minded traveler that is just looking for a place to lay horizontal at night, and can rely on public transportation to get around the city. Great job by the university of Toronto.",
      "rate": 4.0,
      "tripDate": " July 2015"
    },
    {
      "title": "Extremely basic, dirty bathrooms",
      "text": "I was quite disappointed with this place. On the positive side, the room had a modern style, with a decent single bed, table and closet, has AC and good WiFi. There is a kitchen available to use. The staff are great, helped me out when I needed an extra hour in the room after check-out. However, I wouldn’t stay again unless I was on a serious budget. The bathrooms were extremely dirty all the time, if they every got cleaned it did not show. I stayed for 6 nights and there was absolutely no cleaning service to my room either, not even to empty the trash can, there was also no cleaning equipment available so I could not clean up the room (sweep the floor for example) myself either. My room was very far from the bathroom (there is one female bathroom per floor).The place is noisy, you can hear everything, talking and doors banging all night. No breakfast included in the price, and the add on breakfast is pricey.",
      "rate": 3.0,
      "tripDate": " July 2018"
    },
    {
      "title": "BASIC, BUT CENTRALLY LOCATED. GREAT STAFF!",
      "text": "Pro - I stayed at 45 Willcocks/New College III building for about 8 days. GREAT STAFF! central location (510 streetcar stops right outside the door, a few minutes to Spadina TTC station, near main streets: Spadina, Bloor, Yonge, Bay, Queens Park), cheap accommodations (cheaper than Massey College where I usually stay who went up on their rates), quiet in summer months so you don't have to share bathroom/showers with a lot of people (at least not in New College III); FREE internet access via wifi or ethernet (free if you have your own cord, but $5 to rent one from them); access to kitchen/fridge (if you want to cook or store leftovers)- tv is also in that room; laundry room on each floor; study rooms are available if you need them; cafeteria in the 40 willcocks buildingCons: 1) extremely small rooms (I guess I was spoiled by the room plus sitting area offered at Massey College just up the street)2) ethernet streaming buffers frequently (annoying when watching news or movies)3) The towel that's provided is only a little bigger than a hand towel so BRING YOUR OWN! You only get the one - no face towel. 4) Beds are firm so you may need to use 1 or both blankets as a kind of mattress cover/cushion so BRING YOUR OWN blanket. If you like firm beds, you'll be fine.5) breakfast only in summer (no lunch or dinner on site except for summer camps), but it ends at 9:30am not 10am as I was told - buffet style $9, but I don't think there's a lot of hot options",
      "rate": 3.0,
      "tripDate": " July 2017"
    },
    {
      "title": "Google reviews lied. This place is extremely disappointing.",
      "text": "Buyers beware.This is a 0.5-star hotel.The bed is extremely small and a person can barely stretch their legs. There is AC in the room. It is neither warm or cold (just pure air). You cannot turn off the AC (I have asked the staff about this). The AC is loud and this is throughout the entire building. There is not just minimal amount of accommodation for anything. You are treated with suspicion if you ask anything here. Don't expect to bring a partner here or even having friends for visit. The room fits exactly 1 person. There is no housekeeping.",
      "rate": 1.0,
      "tripDate": " May 2024"
    },
    {
      "title": "Your worst nightmare",
      "text": "The images posted and description of the place fooled us! Soon as we saw the toilet & bath, our worst nightmares came true! There were toilet tissue trashed on the floor! It was smelly and the bathroom fixtures were defective! There were even people knocking on my door at 10pm!!! It was noisy and messy!!! The phone lines are not even working and there is absolutely no privacy!!! They may look good in pictures but, they are the total extremes of what they posted. And even though their policy says that you have to pay on the day you check in, they charged me in advance and they did not return the payment when I asked for it, even if I reiterated their own policy!!!! Worst dorm type accommodation ever!!!! Chexk in at your worst experience!!!!",
      "rate": 1.0,
      "tripDate": " August 2015"
    },
    {
      "title": "It is what it is",
      "text": "You can definitely tell you're staying in a university residence. The smells, the sounds, the fire alarms going off constantly.I was situated next to a room where the occupant held random weekend parties and smoked weed most nights (which due to the ventilation system, meant all my stuff stank too). It's also the kind of place where people will take your clothing and throw it on the floor in the laundry rooms because they don't want to wait to use the drier.It's in a good-ish location though, close to the action. Just not a pleasant stay.",
      "rate": 2.0,
      "tripDate": " May 2015"
    },
    {
      "title": "Decent accommodations...watch out for the elevator.",
      "text": "I stayed here for a conference. The price and location were great as it is very close to all of the attractions of Toronto. I was pleased that the floor I stayed on didn't feel overcrowded or loud despite having a shared dorm-style bathroom. The room decor was a little lacking with an unpainted cement wall, but the furniture was new, the room was clean, and the bed was comfortable. The view from my room was great! However, the elevator was a piece of work. Basically, it is set up with a keytag reader so you have to swipe your keytag to select your floor. This resets each time the doors close which is kind of a major issue when there are multiple people riding the elevator. Basically, make sure that you memorize which floors have been selected and be ready to quickly press buttons whenever someone leaves the elevator. This was an affordable option for travelling in Toronto, but be aware there are a few trade-offs for staying here.",
      "rate": 3.0,
      "tripDate": " June 2014"
    },
    {
      "title": "Best Deal in Toronto",
      "text": "I have been visiting Toronto for 30 years and just found out about the Dorms at the University of Toronto 45 Willcocks, at the corner of Spadina and Willcocks.  This location is a couple of blocks south of Bloor.  The rooms are neat and clean (shared Bath) with free local calls and WIFI. Availability in June, July, August is very limited. You do not make your reservations far in advance.  Bookings are sometimes made in January.  With advanced planning, you can't go wrong with the location and price.  You can book directly with the University by filling out a form provided or Bookings.com usually has their availability.",
      "rate": 5.0,
      "tripDate": " May 2014"
    },
    {
      "title": "amazing value",
      "text": "If you want a super inexpensive and functional place in a great location, this is it.  It's a dorm, but for a dorm it's pretty nice.  It's a modern building and everything was extremely clean.  The room had a bed (which was comfortable) and a desk and GREAT air conditioning (when I was there Toronto was in the midst of a heat wave and temperatures outside were hitting 95 every day... but the room was nice and cool!) Every floor has a shared bathroom, a large kitchen/common room with a TV, and laundry room.  It's a short walk to Chinatown, and a reasonable walk to almost anywhere downtown.  It's also near the Spadina streetcar.  The price of this nice private room was similar to what I've paid for a bed in a noisy, crowded shared hostel room in many US hostels.  So it is an amazing value.",
      "rate": 5.0,
      "tripDate": " July 2018"
    },
    {
      "title": "Clean, basic, very well located and cheap",
      "text": "I stayed at the student residence for several nights and it did deliver on being basic and cheap and clean! The rooms were tidy and spotless. The shared bathrooms were pretty clean, which really surprised me. My room was on the 8th floor above the streetcar/tram stop. The view was great but I didn't like the fac tthat I couldn't relly open the window. The residence was pretty quiet except for one night where tourists got pretty loud.The residence is ideally located: in Chinatown close to the underground/metro and the tram. It is about 15-minutes away from the bus station bby foot and approximately 25-minutes away from the train station by foot too.The staff was very welcoming and service-minded.And if it's of any help, Uber eats does deliver there! So all in all I would definitely recommend staying there if you're looking for a basic accommodation in Toronto.I would not however recommend having breakfast there. For 11$, you could get something better.",
      "rate": 4.0,
      "tripDate": " June 2018"
    },
    {
      "title": "Excellent accommodation in excellent location",
      "text": "I did a one night stay. Since it’s summer the residence was very quiet. It was a very clean room. If you’re looking for a basic and very affordable place to stay, I recommend here. The residence is next to Spadina and the street car runs past there. It is shared washrooms.",
      "rate": 5.0,
      "tripDate": " June 2018"
    },
    {
      "title": "Best inexpensive place i've ever stayed.",
      "text": "if you are looking for shangrila..this ain't it..its a college dorm room, go from there. having said that i found the room clean, quiet and comfortable. the bathroom, kitchen and shower was very well kept. i stayed summer of 2017 am staying again summer 2018..for the money i think i got more than expected, front desk was awesome as well.Really nothing to complain about at all..and location was perfect, right on Spadina streetcar line. i'd recommend it for anyone who wants bang for their buck.",
      "rate": 5.0,
      "tripDate": " August 2017"
    },
    {
      "title": "The perfect cheap, clean and central place to crash",
      "text": "I've stayed here twice over the summer--once for my trip to TCAF, and once for a trip to visit friends--and it's been ideal both times. It's not a luxury hotel, but it IS nice and quiet over the summer, there's a kitchen you can use if you want, the bathrooms are clean and everything was well-managed. The bed isn't super luxurious but it's comfy enough to get a good night's rest on (which is a big deal for me as I have fibromyalgia). I also rented a mobility scooter on my first trip, and while the halls were too narrow for me to fit it through the doors into the room, I was able to store it in the common area on my floor with no issues overnight. The staff were also very helpful about arranging for the rental to be picked up on Monday morning after I left.The bathrooms are dorm-style, so there's a men's and women's one on each floor, including a row of toilet stalls, a bunch of sinks and three shower stalls. They all have proper doors, so it's not like showering in a public pool locker room! The towels they provide you are pretty small, and you only get one, so if you have space to pack your own I'd recommend it. I made do with the tiny one, but if you've got long hair you might wanna ask for an extra one at the desk.The location couldn't be better--I was able to walk from the Greyhound station, as well as to lots of cool stuff in Chinatown, and I had no trouble getting UberEats delivery there late at night either. All in all, if you're looking for a place that's cheap, clean and convenient for your summer trip to Toronto, this is the place.",
      "rate": 4.0,
      "tripDate": " May 2017"
    },
    {
      "title": "Anyone cleans your bedroom",
      "text": "We spent 5 nights there so you get dirty the bedroom although you are careful, and anyone cleans your bedroom, there's no service for that.The litter was full and anyone removes the rubbish.It's truth that although is far from the center, the tram stop is near the residence.",
      "rate": 1.0,
      "tripDate": " June 2015"
    },
    {
      "title": "Nice cheap place",
      "text": "Comfortable, , clean, budget place to stay in Toronto. Pleasant. Surroundings , walking distance to Chinatown, city and of course the University. Only down fall, no kettle in rooms for one to make a hot drink!",
      "rate": 3.0,
      "tripDate": " June 2014"
    },
    {
      "title": "VERY GOOD LOCATION, ALSO PRICE-QUALITY RELATIONSHIP, AUSTRE AND CLEAN ROOM WITH SHARED BATHROOM.",
      "text": "First of all I must say that the price of this accommodation was less than half of what I had been paying in accommodation, of course they were hotels and cannot be compared. Therefore, at my age, it was my mistake to book a private room but with a shared bathroom, since it was about 30 meters from my room, which had no refrigerator, no TV, no microwave, and no coffee maker. It was an austere, clean student dormitory, with a single bed and a good closet. The black out curtain was not so \"black out\" and at 6:30 AM a lot of light was already coming in, making it difficult to sleep.  I clarify that I knew all this before booking, it did not surprise me, but at this stage of my life, I admit that I made a mistake. Before, I was in the residences of the University of Quebec and the experience was totally different, although I repeat, the price was too. If I put aside my age and habits, the price is good for what it offers, since the shower was with good pressure and it was clean. The location is very good, on the edge of Kensington and all the attractions of downtown, with good public transport. Reception and key collection (for all buildings) is opposite, at 40 Wilcock Street.",
      "rate": 3.0,
      "tripDate": " May 2024"
    },
    {
      "title": "Very basic ",
      "text": "It's the school's boarding school......so very basic: austere rooms, colony bedding, general heating/air conditioning impossible to adjust and very noisy, shared shower cubicles (same as WC and sink)Plus it's very noisy (very excited teenagers) Contrary to what the advertisement says, there is no parking: an underground public car park is 5 minutes walk on the other side of the Block30 minutes walk from downtown Honestly, for the price, look elsewhere!",
      "rate": 3.0,
      "tripDate": " June 2024"
    }
  ]
}