{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Veeds Private Suites",
    "url": "/Hotel_Review-g155019-d10898487-Reviews-Veeds_Private_Suites-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.0",
      "reviewCount": 29
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "300 Front St W",
      "addressLocality": "Toronto",
      "postalCode": "M5V 0E9",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0d/27/21/b0/apto-de-2-dorm-2-wc-cozinha.jpg?w=500&h=-1&s=1"
  },
  "description": null,
  "featues": [
    "Free High Speed Internet (WiFi)",
    "Internet",
    "Air conditioning",
    "Kitchenette",
    "Non-smoking rooms"
  ],
  "reviews": [
    {
      "title": "Poor organisation.",
      "text": "The apartment itself was clean and well located but the organisation by Veeds was appalling. We arrived at 11pm after a 24 hour journey with two children (one of whom was vomiting because he was so tired) to find we couldn't get into the place as our access codes and key fobs had not been activated. It took us a long time that night to get into our apartment and then the same thing happened the following morning until security stepped in and spent quite some time sorting it all out for us. Not a great start to the trip and no one has even contacted us to apologise. Not impressed.",
      "rate": 3.0,
      "tripDate": " March 2017"
    },
    {
      "title": "Good location and great view but service just so so",
      "text": "We stayed for 3 nights at an  one-bedroom.  Only one set of FOB and apartment key can be provided as it's a one bedroom.  So if you are a party of 3 like us and sometimes want to go out separately, you have to coordinate very carefully.Upon arrival, we had trouble getting into the building entrance as the FOB key is inside the apartment.  The code provided didnt work so we had to enter the building following other tenants. I did ask the concierge about the code but the guy refused to tell me saying I had to ask the airbnb host?!  They hadnt heard about Veeds.When we arrived at the apartment the dryer is still working?!  There is notice on the dryer saying that these are extra bath towels.  When we took it out, it's appalling to find also cleaning towels.  Apparently the cleaner wash bath towels and cleaning towels together. I had to wash the bath towels again before using them. The apartment should have been freshly cleaned before our arrival - judging from the towels mentioned above. However the kitchen counter top, the toaster and the kettle were all dusty. The balcony has raw cement floor and very very dusty.There were no extra pillow provided for the sofa bed.  When I asked, the host replied \" there are 4 pillows inside the apartment\" Ok 4 very soft pillows in the master bed and I believe 2 for one person is a standard provision.The aircon inside the apartment cannot be adjusted.  It says 24C but certainly feels like 26-28C for the few days that we stayed.  So I told the host by email and he seemed to be amused \" you couldnt turn it to a lower temp?\" Then he said he would send someone to re-set it on our last day.  I told him no need to send someone as it's the last day.  When we came back to the apartment that day, someone has re-set the aircon as it said 23C.Communications were not particularly satisfactory I have to say - slow in response, cold and almost always say no (to extra key, extra pillow - both very reasonable requests in my opinion)The building concierge was not helpful as all.  They wont even keep a parcel for us for a few hours.  Generally all the people I encountered for this stay havent make me feel welcome.  First time for me to have such feeling in Canada.Good things about the apartment: Good location - walkable to almost everywhere in downtown; Good view from the apartment - if you dont mind the dusty cement-floor balcony. Good free wifi connection and laundry facilities inside the apartment.  Dinning table and coffee table are all glass and can be a bit dangerous if you have toddlers.",
      "rate": 3.0,
      "tripDate": " July 2017"
    },
    {
      "title": "read the full experience",
      "text": "There was none to attend the traveler, neither we were told that there will absolutely be no one. The suites were in a condominium & we were standing on the road for 45 minutes with all our luggage, looking for the place. The person sitting at the reception of the building had no idea at all if that building has something like this. Even google gets confused when we look for a place standing over it only. Finally we tried calling them, after 4-5 attempts someone picked up & told us hoe to proceed. However the apartment was good & comfy. But this idea may seem shady to some. No housekeeping is there if you want to get your apartment cleaned. And we were told through a pamphlet that at the time of checkout just leave the keys on the island & leave. I mean isn't it weird.",
      "rate": 2.0,
      "tripDate": " June 2018"
    },
    {
      "title": "BEWARE",
      "text": "Please be very cautious of using Veeds. They owe me around $1,000 and have 'disappeared' Not answering emails or texts. This can be why the rooms are so messy. I  had to clean my own suite as well. I have been reaching out to them for over 2 months. Even if they are in lock down the service is very bad",
      "rate": 1.0,
      "tripDate": " May 2020"
    },
    {
      "title": "Amazing! ",
      "text": "I couldn't of asked for a better place to stay whilst visiting Toronto! Amazing view, perfect location, very clean, everything you need in a compact apartment! Waking up to that view from your bed is just perfect! I will definitely be returning and recommending to everyone! Amazing!",
      "rate": 5.0,
      "tripDate": " November 2016"
    },
    {
      "title": "Great apartment in a good location",
      "text": "This apartment was fantastic - had everything you could possibly need. It was in a really good location - easy walking distance to the CN tower and the centre of the city. It was very clean and had loads of amenities. Views from the 36th floor over the city (but not the CN tower). Overall a great place to stay",
      "rate": 5.0,
      "tripDate": " October 2016"
    },
    {
      "title": "Nice apartments in Toronto",
      "text": "Very central location, clean and convenient. I shared the apartment with another colligue and we each had our own bathroom which was great. Also had a dining area and a lounge where we had a few meetings. Very good for business traveleres",
      "rate": 4.0,
      "tripDate": " May 2018"
    },
    {
      "title": "Absolutely perfect!",
      "text": "My husband and son were in Toronto for business. Because of the location they could walk to the convention centre. I had couple of days for myself. Next door is a Starbucks so morning coffee was delicious. Although the suites has coffee for you! The internet was not working, I call Veeds and they were helpful. The parking garage is made for small cars thanks goodness we travelled with my car knowing that big cities are difficult for big cars. Don t forget to reserve a spot. You won t need a car during your stay. 300 Front street west is very close to Chinatown and fashion district so great shopping all day for me. Next to CN tower, Blue jays and Leaf stadium so Wonderful location!",
      "rate": 5.0,
      "tripDate": " September 2017"
    },
    {
      "title": "Very good, Greta location, big problem",
      "text": "I am very much against the tradition of bad mouthing a place just because something went wrong for me. So I have to say that this place is in a brilliant location with stunning views of the CN tower and has everything you need to have a great stay in Toronto. Unfortunately for us we had an air conditioning problem which coincided with the hottest weekend in Toronto this year and this spoilt our stay as the apartment was constantly at temperatures of 25 or more. Coming from the UK that's hot. However, credit where credit is due the manager compensated us and apologised for the inconvenience and that's all that he can do. He was let down by the aircon people and did the right thing without argument. These things happen unfortunately but it would not stop me going to stay here again as it has everything you need within easy walking distance.Please do give VEEDS the opportunity to service your needs, you won't be dissapointed that you did.",
      "rate": 4.0,
      "tripDate": " September 2017"
    },
    {
      "title": "Veeds Private Suites",
      "text": "Actually stayed at Peter Street. Was a bit unnerved on arrival as the suite was in a nondescript apartment building, so I thought we were in the wrong place. But followed he instructions and all was fine. Suite was ideal with one child - a fridge and a washing machine more useful to us than the facilities a hotel offers and cost less too. Great location too, close to good restaurants and other stuff in central Toronto",
      "rate": 4.0,
      "tripDate": " July 2017"
    },
    {
      "title": "disappointing although great location ",
      "text": "Completely different than the email received and the outline of the accommodations. Very costly so expectations were high. Requested early arrival and they said they would call when the cleaner was finished ...they never did call and i emailed and they didn’t respond. When we entered I went by instructions of the email sent originally and security stopped me, I was required to show my email, sign in etc..this was not explained. No where to park the car to drop off the bags. Upon entering the apartment it was unclean. Pic attached. Started to do laundry and the washer was leaking..called and they said they knew and would send someone out the following day. There is a patio but no chairs. One of the kitchen chairs was broken. Only 5 towels (none for the pool). The pool is cold. No access to the games room and billiards room. Would not recommend. Great location.",
      "rate": 3.0,
      "tripDate": " August 2018"
    },
    {
      "title": "Still room for improvement...",
      "text": "Great location - nice view and spacy suits and own parking space. However @ this price level we expect no filthy dish washer - no left over blanjets in the dryer AND a properly working air condition. This time even rainy weather was welcome!",
      "rate": 4.0,
      "tripDate": " May 2018"
    },
    {
      "title": "Nice Apartment and Central Location",
      "text": "Overall this was a welcome alternative to traditional hotel stays, but there were a few missteps that made my stay only slightly above average. Pros: this Entertainment District location is very easy to walk to from Union Station (about 12 minutes) or 35 minute Uber/cab from Pearson Airport. I took the train and felt safe rolling my bag from to the Veeds through pedestrian friendly streets even at 9 p.m. Front desk security and key code access makes the building appear secure (more on that in Cons below). The 2 bedroom apartment I rented was great for 1 person and would easily accommodate 3-4 as long as they didn't mind standing in line for the bathroom, and could make due with limited kitchen outlets (1). Excellent view of Chinatown/Kensington neighborhoods and beyond from my apartment from a spacious balcony. Full kitchen with amenities was also great --though no wine corkscrew was to be found :-( I slept in the Master bedroom because it had large picture windows and direct access into the bathroom (2nd bedroom had no window or door). It was bright and there were plenty of sheets (20?) and towels (8-10?) to choose from. Good pressure in the shower, which is terrific for a 40th floor high rise apartment. Large flat panel TV and comfortable, modern furniture in living room to rest on. Very close to mass transit of all kinds, Chinatown, Downtown, restaurants, a grocery store and huge drug store, etc. the location is great for people like me who love to walk the city, grab a craft beer or cocktail, eat a good meal, and walk to the theatre for a play. all super easy to do from this location.  Cons: the floors left my feet filthy. The bath tub was coated in a greasy film I scrubbed off my 1st morning there. Bedroom window didn't open (mechanism was broken) and the screen door for the sliding patio door in the living room was laying on the patio. Dryer was packed solid with damp sheets and towels I had to re-dry and fold to use for my own clothes. Very limited selection on the TV and confusing to use. Front desk security guards didn't look up often to see who was coming into the building throughout the day, and bro-ish young guys and gals swigging beer and preening  crowded the lobby and front door vestibules on Friday and Saturday nights from about 7-9. They weren't menacing or rude, but the guards clearly had no control of who came or went during those hours. All-in-all, I enjoyed my stay, but I'm on the fence about recommending it to anyone who demands spotless housekeeping even without daily maid service. Or simply bring your own sponge and Bon Ami and you'll be fine :-)",
      "rate": 4.0,
      "tripDate": " November 2017"
    },
    {
      "title": "No Complaints",
      "text": "This is a great home away from home condo in a great location for sky dome, sightseeing, downtown etc. Good small grocery 7-11 type store just 5 minutes walk away. Car parking underground at cost well worth the 25.00 per day. Beds comfy, everything worked well in the kitchen and all in all no complaints from us. If being nit-picky the only thing we found wrong was the extractor fan hood had not been cleaned for ages!",
      "rate": 5.0,
      "tripDate": " October 2016"
    },
    {
      "title": "Good not great",
      "text": "On the plus side - The location is amazing. It is directly across the road from the CN Tower and Ripleys Aquarium. Was a bit concerned after reading some previous reviews but we thought the apartment itself was comfortable and had everything we needed.Slightly strange start though - initially we were told to go to a different building for the keys into the apartment. There we were asked for an apartment number that we wasn't given but eventually got in after a couple of phone calls.Towells were left in the drier in the apartment and there were no evidence of cleaning. We were there 3 nights so thought it would be attended to once at least. We spent most time out so it didn't bother us too much but worth noting I think.Staff were friendly enough and the view from the balcony at night was quite nice (subject to which room you get). It has potential to be great but lets itself down a bit for us.",
      "rate": 3.0,
      "tripDate": " December 2019"
    },
    {
      "title": "One star because that is the least amount I can give",
      "text": "Vile, avoid at all costs.  Place was dirty and no-one to clean it.  We had to change and wash the bed clothes ourselves because the cleaner had not done it from the previous guests.  Emailed Veed and the issue was not addressed.",
      "rate": 1.0,
      "tripDate": " October 2019"
    },
    {
      "title": "Great location, Great view, filthy apartment",
      "text": "We stayed at the 300 Front Street location. The views were amazing and the location is what you hope for. However, for the crazy price you pay you would expect the apartment to be clean and taken care of. It was not. The walls were filthy. The floors were dirty. The showers were dirty. Over all, not a well kept rental.We had organized early arival. And I do not mean for the apartment, just so we could park our car in the underground space. This was done 6 weeks in advance and on a number of times after. When we arrived we had to fight tooth and nail with the useless agent upon arrival who played stupid and refused to let us in even though I showed him all of the emails. So that was a terrible start to our trip into the city. After 1 hour of them not answering the phone we finaly got an agent who made him let us in. So terrible customer service through out.",
      "rate": 2.0,
      "tripDate": " September 2019"
    },
    {
      "title": "Clean, Quiet and Comfortable",
      "text": "Exactly as advertised which was very good. Loads of space. Comfortably furnished with everything you would need to be self sufficient for a long stay. Great view from the balcony on a high floor. Good wifi. Easily controlled heating / ACOnly negative is nowhere to leave luggage when you leave and have a wait before going to airport.Lots of restaurants and bars within a short walk even when it is snowing and cold outside",
      "rate": 4.0,
      "tripDate": " January 2018"
    },
    {
      "title": "Good base for Toronto holiday",
      "text": "Our apartment was on the 37th floor and the views were amazing. Instructions on how to access the property were emailed a few days before we arrived and we had no problems. The flat was quite spaceous and has a full kitchen, washing machine and drier. The free Wi-Fi worked well and there was a gym and a roof-top pool.The location was good. Very close to the CN Tower and an entrance to the PATH (very convenient in torrential rain! ). It was only about a 5 minute walk from Union Station.All in all a good place to stay.",
      "rate": 4.0,
      "tripDate": " September 2017"
    },
    {
      "title": "Great views and central location ",
      "text": "This is an excellent apartment with exceptional views and it's well equipped . A few minor things for me , thermostat seems central controlled and  not a lover of polyester sheets. Other that those minor personal preferences all was good",
      "rate": 4.0,
      "tripDate": " April 2017"
    },
    {
      "title": "Acceptable but not great",
      "text": "We stayed at the 300 Front Street location and it was a somewhatweird experience. First and foremost, this isn't a hotel. I'm not sure why it even pops up as an option on sites like Hotels.com. This is really an AirBnB-type situation. There is no front desk or concierge to assist you (in fact, the check-in paperwork specifically requests that you NOT speak to the building concierges, as they are for the building residents only, not for Veeds guests). There is no housekeeping. If you have an issue you have to wait for someone from Veeds to show up, which can take quite a while. In short, if you prefer hotels then this isn't the place for you.We're fine with AirBnB rentals but even on that scale this place had some issues. First, we were unclear on how check-in was going to work and had to call the day before to request that someone e-mail us the details. Check-in is a minor inconvenience because depending on what time you arrive you have to pick up your key at one address and your room is at another. They're close by and it isn't a huge deal, but if the details hadn't been e-mailed to us it would have been hard to figure out what to do. It's not intuitive at all. We were unable to reserve a space for our car (the garage was already full for our dates, I guess?). It wasn't a big deal because we found another garage nearby for a reasonable price, but it would have been preferable to park at the building where we were staying.The biggest issue was that when we arrived the room wasn't clean. And I don't just mean there were missed spots, I mean the room hadn't been turned over from the previous guests at all. All of the beds were unmade with dirty sheets on them, the trash hadn't been taken out; it was obvious the room hadn't been touched between when the previous guests checked out and we arrived. Fortunately we were able to get in touch with someone from Veeds on the phone and they said they would send someone to clean \"right away\" but it took nearly an hour for somebody to arrive. Because we were there while the cleaning took place we were able to make sure the apartment was cleaned to an appropriate standard, but it sure would have been nice to have that done BEFORE we arrived! The lady who came to clean said it was an oversight and they were short staffed, but looking at previous reviews it seems that this is a pattern at this place, so beware.Once it was cleaned up the apartment was fine. Our room (1310) did have a view of the CN Tower but only from the balcony, not from inside the apartment. There are two bedrooms and two bathrooms plus a fold-out couch in the living area so we all had plenty of space. Those were the upsides. The furniture and basically everything in the apartment seems to have come from IKEA, by which I mean it looks nice enough but feels cheap. The bed was okay, but sheets were worn, as were the towels. The apartment could use some touch up paint in a lot of areas. We didn't use the kitchen other than the fridge so I can't speak to the appliances or kitchen tools. There is a smart TV that we were able to use to access our Netflix account but the live TV aspect didn't work (when we tried to follow the instructions to view TV it told us the package had expired). Luckily we didn't come to Toronto to watch TV so it didn't matter much, but it was just another little thing that wasn't as it should have been. (We didn't bother reporting this minor issue during our stay so it's possible it would have been fixed had we cared enough to waste time dealing with it.)The location was great, right across the street from the CN Tower and Ripley's Aquarium, easily walkable to much of what Toronto has to offer in terms of tourist attractions and an easy walk to the streetcars and subway if you want to do more exploring. But it feels like the owners cut a lot of corners and our stay could have been better.",
      "rate": 3.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Veeds Private Suites on Peter Street",
      "text": "I rented an apartment with Veeds Private Suite on Peter Street, apartment # 3612 (they obviously have several locations around Toronto). The location is great but the place was FILTHY; we walked bare foot and our feet were black with dirt, the sink in the bathroom was dirty and the couch was all stained. Also, when we arrived, there was a soaked dirty towel stinking of Clorox in the kitchen sink. The dryer was full of damp bed sheets - there is a note in the laundry closet saying that the housekeeper does not have enough time to finish the laundry, but it is NOT my job to empty the washing machine or dryer if I want to wash my own clothes. This apartment is supposed to be fully equipped but there was only 1 water glass in the cupboard and 3 wine glasses and NO teaspoons. There were many slats missing on the vertical blind in the living room, which defeated the purpose when wanting some privacy or darkness in the apartment. Overall, the experience was quite disappointing for the high price tag I paid for this apartment. I would not recommend.",
      "rate": 2.0,
      "tripDate": " August 2019"
    },
    {
      "title": "Great Location disappointing appartment",
      "text": "Great location although difficult to find and even more difficult to check in as the representative is in a different building to where we stayed. When we finally accessed the 2 bedroom appartment we found that the wardrobe door in bedroom 1 was broken and couldnt be used. Bedroom 2 was located within the kitchen/living room and had glass panels for privacy. We found one glass panel was cracked and held together with sticky tape, very dangerous, and the other glass panel was off the tracking rail so couldn't be closed. This afforded no privacy for one couple. We immediately contacted the customer service to request a new appartment and we were told there were none available. The last straw in this disasterous stay was when the internet was lost on the second day of our stay which meant we had no television either. We again contacted customer service on numerous occasions and were reassured that it would be fixed. We had no internet access for 4 of our 5 day stay. When we arrived home we again contacted the company and were offered a refund of the parking charges. To date we have not yet received this refund. This is indicative of the customer service at Veeds Private suites!!!",
      "rate": 2.0,
      "tripDate": " October 2018"
    }
  ]
}