{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Village at York U",
    "url": "/Hotel_Review-g155019-d17636686-Reviews-Village_at_York_U-Toronto_Ontario.html",
    "priceRange": "$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "1.5",
      "reviewCount": 3
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "313 Murray Ross Pky",
      "addressLocality": "Toronto",
      "postalCode": "M3J 3N8",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/18/a6/0c/45/village-at-york-u.jpg?w=500&h=-1&s=1"
  },
  "description": null,
  "featues": [],
  "reviews": [
    {
      "title": "Clean rooms, dirty kitchen and very dishonest owners",
      "text": "We stayed at this property via Booking.com. After our trip was over, I wrote a review on Booking.com and included some photos that clearly showed this place had rats, at least at the time of our stay. Booking.com didn't publish those photos and the owners made a reply to my review, lying about almost everything.They claimed we didn't have breakfast included, which we definitely did. They lied that we didn't clean the dishes, which we did. We never met the owners during breakfast, so they lied about the dishes to make my review look bad. They claimed that the bite marks in the apples was caused by \"stems of the apples pierce the other apples\". I'm including photos here as well, these are definitely bite marks! Finally, they wrote that I was still upset after being asked to clean up, yet as I've said, we never met the owners and we were never asked such thing - we cleaned the dishes thoroughly every time.The owners are very dishonest by lying about my review and trying to make me look bad. I therefore strongly advise against staying at this location.Here is the original review that I've left on Booking.com:----------The bedroom was really nice and clean. Shared bathroom was also nice and it was rare to find it occupied by other guests. The included breatkfast was ok, bagles with jam and instant coffee, can't complain for the price, but the kitchen itself was unkept.The location was quite good, about 10 minutes walk from the subway and then another 30 minutes ride to downton.The kitchen was really dirty. One day, we saw bites on the fruit that we assume were from rats. The fruit was on the dining table, so rats must have walked over it. There was also rat poison under the table (see photos), so they definitely have some sort of rodent problem. We didn't want to eat there any more after this. You also have to clean the dishes yourself, which I guess is ok, but it can be an issue if the guests before you didn't do a good job.We stayed in room #5, which doesn't have an outside window. The window that is there looks on to the kitchen, so you have to keep the curtains closed all the time (and you can't get any fresh air in). This also means that you hear everything in the kitchen, so people eating early or staying late will keep you from sleeping. It was rare for the kitchen to be quiet before 11pm.",
      "rate": 2.0,
      "tripDate": " June 2019"
    },
    {
      "title": "Budget, clean but unwelcoming and bad area",
      "text": "If you are looking for a clean budget place to stay in Toronto this might be for you. But beware. The place is not in a very nice area. This dirty enviroment didnt give us a very safe feeling. The house and rooms are very clean. So clean that the whole house is litterly a cloud of cleaning chemicals. So much that it irritated our lungs.We found the keepers and the whole atmosphere in the place very very unwelcoming. When we asked for advise the men just kept on repeating to read his welcoming mail for tje answeres. Furthermore a lot of rules what not to do and who are not welcome. Children for example are not welcome here as the fear false eligations because of the shared washrooms. The list of what not to do goes on and on. Papers strapped to the wall with them written on it.Bathrooms are shared. Clean. Good shower. Dont forget to bring your own towels though as they are not suplied.Subway to the centre at 800 metres. Walking distance.  Then 45 mins to union. About 8 dollar return pp.We found the surroundings of the place filthy. Litterd with rubish. Gave us an unsafe feeling of the area. Google for the streetname and you will find out our feeling was correct.Rooms noisy. We had number 5 with a window to the kitchen. When kitchen lights go on this rooms lights up. You can look straight in the kitchen and vice versa. Bizar.Rooms small but clean. Airco. We did take the breakfast. Not the best we had but all seemed clean.All in all: clean rooms, low budget. But not a welcoming athmosphere and many rules, rules, rules....",
      "rate": 2.0,
      "tripDate": " August 2019"
    },
    {
      "title": "Méchanceté gratuite, fuyez",
      "text": "Le client est roi, ici ils connaissent pas, FUYEZ !!!  Pour infos: chambre petite; +1h du centre en transport; agence qui gère cette maison...Nous avions rendez vous entre 8-9h pour laisser nos bagages à un responsable (check in à 14h pour le temps de ménage), personne nous a reçu. Nous avons donc suivi les instructions: tapez le code pour rentrer dans la maison, notre chambre était dispo avec les clés et grande ouverte, donc nous avons pensé avec un étranger qui nous a accueillis et fait visiter à son réveil, que c’était un geste de leur part d’avoir préparé la chambre pour nous accueillir avant le Check in. PAS DU TOUT A 12:00 nous rencontrons Mélanie (responsable) qui nous dit qu’il n’y a aucun problème qu’on se soit installés.RÉSULTAT: A 16h nous recevons un message de demande de paiement de 53$ car nous sommes arrivés plus tôt! Ils nous ont menacés d’appeler les flics pour qu’ils nous virent!!?? nous n’étions pas d’accord de payer le prix d’une nuit supplémentaire pour 2h passées dans la chambre puisqu'ils ont oublié de venir nous recevoir et de nous prévenir, nous n'allions pas laisser nos bagages dans l’entree : pas de caméra, en cas de vol aucune preuve...  On a reçu un message insolent et a 21:30 nous voilà à la rue.  En 6 mois de roadtrip, et après des pays plus difficile que le Canada, nous n’avons JAMAIS été traités de la sorte, ni de toute notre vie! C’est une honte.C’est un hôte qui y séjourne depuis plusieurs mois qui a fait le médiateur entre nous et les responsables et qui nous a remboursé le prix du logement ! Vous trouvez ça étrange ? Nous aussi...",
      "rate": 1.0,
      "tripDate": " June 2019"
    }
  ]
}