{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "W Toronto",
    "url": "/Hotel_Review-g155019-d185237-Reviews-W_Toronto-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.0",
      "reviewCount": 50
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "90 Bloor Street East",
      "addressLocality": "Toronto",
      "postalCode": "M4W 1A7",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2b/ff/da/e1/w-toronto-arrival.jpg?w=500&h=-1&s=1"
  },
  "description": "Book your stay at this vibrant W Toronto hotel. Feel the pulse of downtown Toronto in the Yorkville neighborhood, where our hotel is close to iconic galleries, sophisticated shopping, and world-class dining. The W Toronto offers uniquely designed rooms and luxury suites, a FIT® gym, live music, and bars including a stunning rooftop bar. Dazzling venues elevate every event.",
  "featues": [
    "Electric vehicle charging station",
    "Free High Speed Internet (WiFi)",
    "Fitness Center with Gym / Workout Room",
    "Bar / lounge",
    "Patio",
    "Pets Allowed ( Dog / Pet Friendly )",
    "Conference facilities",
    "Banquet room",
    "Valet parking",
    "Paid private parking on-site",
    "Wifi",
    "Paid wifi",
    "Coffee shop",
    "Restaurant",
    "Breakfast available",
    "Breakfast in the room",
    "Complimentary Instant Coffee",
    "Outdoor dining area",
    "Wine / champagne",
    "Rooftop bar",
    "Meeting rooms",
    "Rooftop terrace",
    "Baggage storage",
    "Concierge",
    "Newspaper",
    "Non-smoking hotel",
    "Outdoor furniture",
    "24-hour check-in",
    "24-hour front desk",
    "Express check-in / check-out",
    "Dry cleaning",
    "Laundry service",
    "Bathrobes",
    "Air conditioning",
    "Desk",
    "Housekeeping",
    "Interconnected rooms available",
    "Coffee / tea maker",
    "Cable / satellite TV",
    "Walk-in shower",
    "Room service",
    "Safe",
    "Seating area",
    "Sofa",
    "Telephone",
    "Bottled water",
    "Iron",
    "Private bathrooms",
    "Wake-up service / alarm clock",
    "Minibar",
    "Flatscreen TV",
    "On-demand movies",
    "Radio",
    "iPod docking station",
    "Bath / shower",
    "Complimentary toiletries",
    "Hair dryer",
    "City view",
    "Non-smoking rooms",
    "Suites"
  ],
  "reviews": [
    {
      "title": "Funky New Hotel",
      "text": "Stayed here for one night at the end of September,  2022. I used to stay at this hotel very frequently when it was a Marriott which was a decent hotel with comfy beds. The new W Hotel is nice. I would stay here again but I do find it a tad pricey.  Nice touches in the rooms. I liked the automated drapes but I couldn't figure out how to make them stop in order to keep them half open.  I liked the Nespresso machine in the room.  I was also happy to see they use Davines toiletries which I have only seen once at a boutique hotel in Montreal years ago. I also discovered the room has a doorbell which was somewhat unique but I believe the Soho Hotel has this feature also. I stayed alone so the bathroom setup was fine. I would actually say this hotel has one of the best hotel showers I've seen.  I thought the bed was fairly comfortable,  perhaps a tad softer than I prefer but pretty comfortable because I slept very well.  I would say that my biggest issue was the extremely loud restaurant music that they also play in the courtyard.  When your room faces the courtyard,  like mine did, this became super annoying super fast! They keep it on until 10 pm. I will be sure to ask for a non courtyard room next time. I cannot stress enough how loud it was. I really think they need to scrap that loud courtyard music.  Otherwise,  I enjoyed my stay.  The location,  for myself,  is excellent,  being right above the Bloor subway station and walking distance to Yorkville.",
      "rate": 4.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Great hotel but….",
      "text": "This is an upscale hotel in a great location. The staff are fantastic. The rooms an open concept with all that you need and Davines amenities in the bathroom. Nespresso coffee maker. Bed is comfortable and pillows were fantastic. My only complaint is that I was there for three days and not once was my room serviced. The privacy light was off and I was in meetings all day. I don’t really need much but to have the water and the coffee replenished would have been nice. I had to seek out a cleaning lady to get a bit of coffee. Once in the middle of the night I woke up thirsty but was out of luck. Some of my collegues said the hotel went above and beyond however this was not my experience. I would recommend the hotel however if you are the type of person that likes things replenished be aware that you may have to chase it down a bit. I didn’t want to chase them down. By the time I was back in my room I was tired and wanted to recharge before we went to dinner. I wanted to get ready and didn’t want them to be there freshening up linens and replacing items",
      "rate": 4.0,
      "tripDate": " January 2024"
    },
    {
      "title": "Very trendy but needs some improvements",
      "text": "The hotel is very modern, a lovely reception area and friendly staff.There is underground parking right at the hotel which was very convenient. The rooms are very attractive, loved the decor and the layout, really liked the couch area and the sink in the room. The toilet and shower are behind frosted doors in the bedroom which wouldn't be for everyone, my kids didn't appreciate that.The main issue I had was that the doors to the rooms are not softclose, which means from the outside there is no way to close the door softly without making a loud banging noise. We kept being woken up by the neighbours who went to their rooms very late and the banging of the door would cause my bedroom door to vibrate.I haven't had such issues in hotels before. The staff was being very understanding and sent the mechanic up who added some door stoppers to stop the vibrating. IAnother issue if you are a light sleeper and have a room on the lower grounds you can hear the subway underneath.I would say this hotel has great potential...",
      "rate": 3.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Great for families in the heart of Toronto",
      "text": "W Hotels does it again! I love the look, vibe and experience at W properties so was naturally inclined to stay at the first W in Ontario. I highly recommend this hotel for people traveling with families. The front desk staff (Priscilla) along with the whenever/wherever team (Curtis & Angelica), went above and beyond to make the stay memorable for my family. We celebrated a birthday here and they were so kind to give our children treats and make them feel special by giving them a card and decorating our room. Everyone from the valet to security team went out of their way to say hello and seemed genuinely happy to be there. The room was spacious, with comfortable beds and located right in the heart of Yorkville. We can’t wait to come back. In the sea of sameness that are hotels, W Toronto is a clear standout.",
      "rate": 5.0,
      "tripDate": " October 2022"
    },
    {
      "title": "Probably The 1st Guests In Our Room, (Opened 2 days before).",
      "text": "Wow, hi tech, well thought out and just a neat place. From the retro Frigidaire to the curtains that close after a tug, everything is brand new, high end and functional. Outdoors in the 9th floor restaurant is great but you will need reservations. Connected to the Bloor subway station with zero street noise, The staff fit the place and are eager to help",
      "rate": 5.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Modern and comfy stay but",
      "text": "Mini business trip in Toronto as a bonvoy member (one night stay sunday to monday, titanium elite).I had booked a room with two queen beds (family of 3 here).Requested JR suite and even tried using suite night upg. awards (denied unfortunately).First time at this new Hotel.Staff greeted is with a smile.Room was cleanhotel felt New and ultra modern.My five year old was hoping for a swim but there's no pool here unfortunately.We had a comfy sleep and our room 635 had it's own outdoor 'balcony' space which was cool although it was wet/rainy during our stay.Mini bar fridge is 'weighted' and a bit warm.  Ultra modern fridge and closet storage howver. Nice Standing shower (behind frosted glass)Had some business work to do in the morning but there's no real desk area in our room; just a small round table although the swivel chair was nice.This tiny table btw was not suitable for dining in the room either for a family of 3.As a vegan family we enjoyed some menu choices from the morning breakfast credit at Public School restaurant / cafe. The oat latte 's were delicious.All in all this hotel reminded me of Element Seattle but perhaps a notch up from that.No EV charger in the provided parking for our car that I could see.Wifi worked fineBest wishes but we'll likely stay elsewhere next time.",
      "rate": 3.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Ok Stay...They Still Need To Work Out Kinks",
      "text": "This is a new, nice hotel, but with some minor setbacks in development. A great value add is that it's right on top of the Bloor-Yonge subway station which connects to both lines. Very clutch. The check-in staff was helpful. Understand that once you go into the building, you go to the sixth floor to check in. Guestrooms start there. The hotel is nice, with new decor. We had a deluxe room, which felt like a studio suite. Once in the room, the shower/bath area was nice. There's a panel at the door that controls drapes and the lights. That wasnt working in sync well, so we had to play around to get the right combo of lights out. Unfortunately, the bed was super firm, so we had trouble sleeping. Also, no desk to work or sit at. Continuing on drawbacks, there is no pool here. Also, the \"rooftop\" as advertised is actually on the 9th floor of the building, but there are the residences above, which go up at least an additional 20 floors. So in actuality, there is no view. The lift at the front door was not working. So heavy luggage has to be carried up two shorter flights of stairs. They should make sure it's always running. Theres nowhere to sit in the lobby with a drink or outside food. The coffee lounge portion of Public School closes at like 3pm. Ok, now a few positives. The Skylight lounge was nice though, with a nice bar serving. Also the restaurant on property, Public School, served good breakfast & tasty coffee. Besides valet, I dont think there is any parking close by. Also, a liquor store(LCBO) is right next door. It's in the high-end shopping district of downtown, so plenty of restaurants, museums & shops are within a few blocks of walking. They are a new W property, and were okay, but are missing some big perks.",
      "rate": 3.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Great spot in Toronto",
      "text": "The hotel is just WOW from the moment you step foot on the property.  The valets were all so helpful and cheerful.  Check in was smooth and the rooms are great.  They are very modern and have a great vibe.  I want to shout out to Mike from Skylight as he was an amazing server.  He recommended dishes, was very knowledgeable and check in on us just the right amount.  Thanks Mike.  Speaking of Mikes, we were lucky to  have met the executive chef who is also a Mike in the elevator.  The food he prepared for us was nothing less than spectacular. I know that he kitchen was busy, yet he came out to check on us and it made us feel like we were dining in his actual home.  Everything we ate was delicious and had a great twist on traditional middle eastern foods.  The truffle labneh...no words!  Also, the venue has a very sophisticated design yet comfy and relaxing all at the same time.  Sorry we did not have time for the lobster hotdog, but  maybe next time.  You must try the Skylight Rooftop, it is a 10 out of 10!!!",
      "rate": 5.0,
      "tripDate": " December 2023"
    },
    {
      "title": "Great stay! ",
      "text": "We loved our stay at the W. The room was huge with a convenient sitting area. The luxury bath products were luxurious. The location is excellent with lots of great spots in the area and also the subway underneath.Overall the staff were wonderful. We breezed in around 10:15 pm after sitting in 5 hours of eclipse traffic and kitchens had mostly closed. Tired and stressed, we plunked down at the living room bar and Roche's kindness and chill vibes really made an impression on us. He gave us great recommendations for our stay.We came to toronto with only a lose plan of what to do and between Roche and the concierge walked away with enough recommendations to sustain us through our stay.The skylight lounge was also gorgeous. Definitely more of an upscale vibe but the bartender there was fun too and made up cocktails on the spot for us.Be aware that their self park garage has extremely low ceilings. The valet option was $75 a day so we took the valets suggestion and parked in the surface lot at church and Dundas for much less.The only downside is the paper thin walls. You'll hear your neighbor taking a wiz... and their alarm, and so forth. But def would stay here again.",
      "rate": 4.0,
      "tripDate": " April 2024"
    },
    {
      "title": "Sexy New Hotel - would highly recommend",
      "text": "Enjoyed a night in the Wonderful courtyard King room and felt like royalty. The hotel has a very sexy vibe, a few awesome bars, cafe and restaurants, which made for a great date night in the city or bachelorette spot. All of the staff were friendly and very attentive and available to help. The rooms was all high tech, full minibar, automatic lighting settings and drapes, brand new appliances and decor. A few kinks to work out - somewhat difficult to find where to check in, etc, but to be expected as a new hotel.",
      "rate": 5.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Nice stay",
      "text": "We have a great time. The room and the hotel are brand new with a good vibe. Very confortable bed and delicious breakfast at the restaurant. Special shout out to Georgina at the reception, she made our stay and our celebration very enjoyable. Thank you and we'll be back when the hotel will be totally opened.",
      "rate": 4.0,
      "tripDate": " July 2022"
    },
    {
      "title": "AMAZING STAFF",
      "text": "The friendliest and most helpful staff I’ve experienced in a while. Shout out to Jemilla at reception along with Andre and Jessie at their restaurant. Great location next to Yorkville. Gym is nicely equipped",
      "rate": 5.0,
      "tripDate": " April 2023"
    },
    {
      "title": "Good stay overall",
      "text": "Nice property, but the W brand is a bit odd. Trying to be young and funky, I suppose. No pool or hot tub, nor a proper business centre. Elite recognition was decent - easy upgrade to a suite (thank goodness, because I was NOT a fan of the open concept layout with the sink and mirror in the main part of the room), but no lounge. Overall, it was okay with the work discount I received, but I probably wouldn’t rush to rebook. Great location on the edge of the main shopping area of Yorkville.",
      "rate": 4.0,
      "tripDate": " October 2022"
    },
    {
      "title": "Modern coolness",
      "text": "Design and architecture are amazing. Beautiful rooms. Lots of warmth and details. Very modern but cozy. Plus, the doorman / front door service is amazing! Very genuine and helpful. Had breakfast and dinner. Both were very good and loved the ambiance and music.",
      "rate": 5.0,
      "tripDate": " March 2023"
    },
    {
      "title": "It’s a party hotel",
      "text": "We’ve stayed at the W two separate times, once during the soft open back in August and this weekend. As others have stated, the location is fantastic, no doubt about it. I do find it somewhat odd they’ve put the W logo on the residential tower behind the hotel itself (not a nice looking tower). The hotel is only a few floors really (6-11), with the “rooftop” bar on the 9th floor. We had consistently excellent service from the Insider and entire front desk team. The common spaces are the typical W funky spaces - all very trendy if a bit strange. The overall hotel (as with all Ws) is geared towards being a party hotel, which unfortunately is not a positive in my book. Both stays we had serious noise issues with our neighbors. There is very little sound proofing between rooms, so anything beyond normal conversation can be heard. The first stay had a rather exuberant couple next door, the second had a party happening until 6am. We changed rooms on the first occasion, second one we called security - who to their credit did come up, but did little to actually end the party. I think for anyone staying here, you just need to be forewarned that it’s a location for partying - I would not consider it appropriate at all for families or business travelers.The rooms themselves are nice - though I echo others that the bathroom set up is less than ideal. There is no desk (party only please) and the entire in room bar is geared to drinking, there is limited storage for your own affairs. For some travelers this hotel might be great (bach parties, etc.), personally I won’t stay again. A note to management - there are a few changes that have been suggested elsewhere, but I think bear repeating. First, install door closers on all the doors so you don’t have doors banging closed at all hours (this seems like a detail that the contractor forgot on renovation, but it is a serious oversight). Second, put draft stoppers under the doors to hopefully improve soundproofing, but also block the very intense light coming in under the doors.",
      "rate": 3.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Death trap",
      "text": "Terrible customer service Scratchy sheets NoWater ! They wouldn’t pick up the phone Just a horrible experienceIn asked for a manager and he wouldn’t speak to me Low class approach all aroundThe toilet and shower are on top of one and other Going somewhere cheaper and easier to deal with",
      "rate": 1.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Not worth the money W coupled with attitude.",
      "text": "Would recommend this property at all.  Not a great W experience.   They only have one restaurant for dinner and its fully booked up.  So only room service.  The rooms are ok, but there was an electrical problem in my room.  The lights that hand on other side of the bed constantly flicker.  There are no USBC power adapters (the hotel is new, so why just USB?).  The beds face the door, and the doors don’t go away the way to the floor, so at night the noise from the hallway comes right at you and the bright light from the hallway comes in.  You end up having to put a towel in front of it.   The air conditioning didn’t really work and the wall mount every 5 minutes lit up at night in the room.  So had to figure out a towel over it.  It was crazy.  Went to the GYM.  It was pretty amazing, but several of the treadmills were down (its a new hotel).  The maintenance person was working the closet, I guess trying to figure something out and turned off all the power to the other treadmills that myself and 2 other guests were on.  So we all got jolted as the treadmills instantly halted.  He then was going to do it again until we told him to stop.  Went to check out and wanted a copy of my bill.  No one at check out.  There were two managers off to the side.  They said someone would be back to help.  No one came back.  I waited and waited.  They couldn’t have cared less and so had to leave without it.  The staff were mostly snobby.  So not worth $750 for the stay.  Rooms are loud.  If you are in the hallway you can hear every conversation in the rooms as you walk buy.  So that isn’t great either from a privacy standpoint.  It was a Marriott before the Reno to W.  So I think that doesn’t help.   Better to stay at the Four Seasons which is near by.  Better value for the money.",
      "rate": 1.0,
      "tripDate": " September 2022"
    },
    {
      "title": "The Trendy W.",
      "text": "Projecting 11 stories in the trendy Trinity district of Yorkville, sits the W Toronto. The hulkish front exterior is softened by a conglomerate of led lighting accompanied by an opaque tangerine lift. Guests can feel like your are inside an orange as this mini elevator scoots them up to the rooftop bar and restaurant. A prime spot, the W is surrounded by cosmopolitan shopping, upper class dining, night life that rocks and is privy  to such cultural attractions as the Royal Ontario Museum, U of Toronto, the Public Library and a host of others. The hotel has stamped it's brand on it's signature 5000 sq. ft. lobby/lounge on the 6th floor and embraces the 'Welcome Desk' and 'Living Room'. This space houses a communal fire pit, a radius bar and access to the 'Yard', an outdoor terrace.......all quite impressive.The W has a roster of 254 guestrooms, including 30 suites of which 2 are 'Wow Extreme' (Presidential) for a 'Wow Extreme' price tag. My room embraced a spacious environment and was also heavy on the wallet. The room vibe was motivated by the Toronto Theatre district as the room amenities included a curved lounging banquette, dressing-room styled vanity mirrors, record-like tables and a fully equipped cocktail bar and for a bit of funkiness,....... mushroom shaped accent lights. The 'piece de resistance', however, was the bed whose headboard snuggled into a large bay window ornated with a sapphire velvet curtain with computerized open/close capability. The room is generally open. even the bathroom is not wall and peers in the room space proper (the better to see you with my dear),,,,this configuration may not be everyone's  piece of cake.The W has noteworthy food options; 3 venues dubbed: the Public School, the Living Room and the Skylight....no appetite is left behind. The Public School is billed as a ground floor coffee house, kitchen and bar that is heralded by funky, inventive cocktails. The Living Room menu features Toronto tapas......light, sharable bites like Fogo Island Cod Cheeks and others that are meant to depict the city's diverse neighborhoods. The Skylight rooftop bar and restaurant (my favorite) sports signature cocktails and Mediterranean cuisine all to the tune of spectacular views. From the grill, I enjoyed charred octopus with a Saffron Sultana Rice side, a delectable pairing. I was captivated by the Quicksand cocktail which comes inside a glass terrarium adorned with real plants. A work of art, I didn't know whether to stare at it or drink it...I eventually drank it. For dessert, I selected the Blood Orange Creme Brulee....great fruit flavor.Adding to the W's arsenal of amenities  are the Sound Studio, the brands signature recording studio experience, an elaborate 3300 sq. ft. gym and an encompassing, nearly 5000 sq. ft, of event space spread over 5 locations.So if you crave accommodations with an abundance of flare, a multiplicity of F & B venues, a comprehensive gym and smack dab in the pulse of Toronto....then try the .........The W Toronto.......the Trendy W.",
      "rate": 4.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Sorry, we will not be returning",
      "text": "My wife and I were not happy here. If you like complete privacy for all your bathroom needs, do not stay at this hotel. The configuration of our room was as follows: tiny frosted-glass-doored-unlockable cubicle for toilet; somewhat larger separate frosted-glass-doored-unlockable cubicle for shower. And where was the sink and counter? Out in the open, A THIRD OF THE WAY INTO THE ROOM. I have to suspect the designer of the room was an avant-garde European with artistic pretensions totally divorced from considerations of comfort and privacy.  What's more? In order to turn the lights off in the room (unnecessarily all shining when you enter), you must first locate and then decipher a hieroglyphic panel near the entrance door. Maddening! I am taking the time to write this review because I feel the hotel must be admonished for allowing such a design to be implemented.",
      "rate": 2.0,
      "tripDate": " June 2024"
    },
    {
      "title": "Roche & Fareba were Incredible!",
      "text": "First time to Toronto and a Canadian friend suggested that I book the W Toronto.  WOW.  It's not just 'staying at a hotel'--- the W Toronto makes it an entire beautiful experience.  I have had great experiences at W's before in the US, but this was above and beyond.  The hotel is gorgeous.  Sit around the fire in the lobby at night with snow falling just outside the floor-to-ceiling windows, or sit around the swanky bar with bartenders who are incredibly welcoming, diverse, and cool.  I booked a standard room and it felt like a piece of art--  highly creative, thoughtfully designed and gorgeous.  We hit Skylight, the lounge at the top of the W, twice throughout our trip and even brought new Canadian friends back with us there and they loved it.  While the entire staff was great, I want to give a special shoutout (and thank you) to 2 staff members in particular:  Roche, one of the lobby bartenders was the first person we met after check-in.  Roche was exceptionally kind, undeniably personable, and just made our evenings around the bar an incredible time.  Me and my friends looked forward to having drinks there before dinner just because he made it such a warm and friendly environment.  Thanks R!   And the cleaning attendant on our 11th floor: Fareba.  Each day as we would come out of our rooms Fareba would ask us how we slept and see if there was anything she could do to make our stay better.  I have literally never had this kind of kindness and attention from any hotel cleaning staff anywhere in the world besides Disney Cruises.  Some days she put extra waters in our rooms just because.  My coworker who stayed in a room across the hall had the exact same experience with her.  Fareba took such pride in her work and it truly made our mornings just a little brighter each time we saw her.  Thank you!",
      "rate": 5.0,
      "tripDate": " March 2024"
    },
    {
      "title": "Great Location",
      "text": "Great location, next to Metro. New clean and nice rooms. Friendly stuff. Fridge in the room with bad cooling. Water power in the shower is insufficient. But rooms are new and beautiful, good beds.",
      "rate": 4.0,
      "tripDate": " April 2024"
    },
    {
      "title": "Funky new hotel",
      "text": "Interesting hotel, right by the subway line. Lots of retail stores and eateries along YongeXBloor.  Looks like it could be the happening place once things fall into place and things settle.  Check in staff were pleasant and helpful, provided us with a cool drink upon check in, which hits the spot on a hot Toronto day.We enjoyed staying at a new hotel.  Room was pretty modernized, bar set up on left bed straight ahead, bathroom, sink on right.  Touchpad to turn on/off lights and blinds.  The negatives would be that there was massive amounts of crumbs under the sofa/chaise lounger and hair on the towels.Nevertheless, would probably stay here again.",
      "rate": 4.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Nice Hotel and Nice People!",
      "text": "The W used to be the Yorkville Marriott, but without this prior knowledge I would never have noticed because the transition was absolutely remarkable. Everything was brought up a couple notches and the added W touches definitely made the best of this older building. That being said, the team here definitely was a highlight to me, especially Kurtis and the W Insider team, who went above and beyond for our special occasion. Thank you Kurtis for everything and we'll definitely come back and say hi again!",
      "rate": 5.0,
      "tripDate": " October 2023"
    },
    {
      "title": "Modern and friendly with a less private bathroom",
      "text": "This is a modern hotel with friendly and helpful staff. A word of warning on the bathroom, you enter your room via the bathroom with an open plan, the shower and toilet being in frosted glass cubicles and the basin in view of the room. Less private when sharing.",
      "rate": 4.0,
      "tripDate": " May 2023"
    },
    {
      "title": "Don’t choose this hotel unless you have no choice",
      "text": "The room was small and decorated like a 3 star hotel. Bathroom and toilets are tiny as well. Service was generally bad, except for one staff who was kind enough to give me all the amenities needed (I didn’t ask for her name but I wish I did coz she’s the only nice one)  Very rigid about check out time. Fire alarm during our stay, had to walk down.  All this for cost of almost CAD500 per night. Unless you value the location, I would say stay away from the hotel. You can get better ones nearby.",
      "rate": 1.0,
      "tripDate": " May 2024"
    },
    {
      "title": "Prosecco as a welcome drink is always great! ",
      "text": "Beautiful hotel with great staff. We went there for a night with my wife and her sister, the room was beautiful and we were greeted with Prosecco as a welcome drink. This was a very nice arrival experience. The service at their restaurant and bar was also very nice! Great stay overall!",
      "rate": 5.0,
      "tripDate": " February 2023"
    },
    {
      "title": "Groovy hotel…great location",
      "text": "Well despite a couple of so so reviews we stayed at this beautifully located hotel…first the area is spectacular with loads of shopping and restaurants and near the ROM.Checkin was easy and the staff very friendly.  Our room was smallish but fantastic with an amazing view.  Breakfast was terrific and again the staff very friendly.  But the roof top on a nice evening was absolutely the topper.  Yes give this a try!,,",
      "rate": 5.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Great stay in the heart of downtown Toronto",
      "text": "In the heart of downtown Toronto,  wonderful hotel. Loved the experience at the W - we were made to feel very special and welcome by all. Service was top notch, valet parking is available. The hotel smells incredible and looks even better. Only downside is it’s above a subway station, so even on the 7th floor, we could hear the trains running. You get used to it after a while though. Would definitely recommend!",
      "rate": 5.0,
      "tripDate": " October 2022"
    },
    {
      "title": "Chic hotel ! Trendy hotel.",
      "text": "Extremely modern hotel that has everything!Best amenities of great quality. Actually the hotel IS quality. Most comfortable bed!Fab pillows! We were lucky and had a lovely balcony which was so nice to sit. Not at winter obviously. Close to lovely restaurants but the hotel has quite a few as well. A rooftop bar, and a lovely place for cocktails as well. The staff are amazing!  The lady cleaning my room was so lovely and polite. Totally recommend this chic hotel.",
      "rate": 5.0,
      "tripDate": " August 2023"
    },
    {
      "title": "Excellent modern hotel",
      "text": "Excellent location in the heart of downtown Toronto. The design is modern and trendy, the room is spacious, and the customer service is top notch. The only issue I had is with the washroom situation: the toilet and shower are separated from each other, and the sink is in the common room. This leaves minimal privacy. Other than that, my stay was exceptional!",
      "rate": 4.0,
      "tripDate": " October 2022"
    },
    {
      "title": "Overall it was a good stay.",
      "text": "Room was nice and so is location, but the check in and check out staff need more training. Safe was not working, there were no slippers yet. They ran my credit card 3 times for a total of over $3k usd dollars when my two night stay was on only $1440 Canadian. I called and they couldn't answer me and told me they would call back. My stay included a $50cad dining credit that does not show credited on my bill and I had to call to get it sorted out. Checkout took  a while.  Bar was really good the cocktail were some of the best I've had.",
      "rate": 4.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Want to be treated like a VIP?  Stay here!",
      "text": "Booked the W for one night as a part of my friend's 50th Birthday celebration.  I wanted to stay somewhere special and the reviews made this feel like a good pick...boy are they right.  From the moment Andre spotted us on the street, whisked us in with bags carried...escorted us to the lobby on the 6th floor (we never would have found it) and got us complimentary welcome glasses of prosecco...we felt like VIPs.  Upon sharing why we were there, reception and Andre went over and above, they delivered another bottle of champaign, personalized birthday treats, AND a bouquet of helium balloons.  The room was wonderful, we slept so comfortably, but the service and notably Andre was worth every penny and more!  Thank you team W!",
      "rate": 5.0,
      "tripDate": " June 2023"
    },
    {
      "title": "Modern hotel in the heart of Toronto.",
      "text": "This is a bright, modern and newly renovated hotel with a fresh, funky feel.The rooms are large, the beds comfortable and the decor modern. The fittings nearly require a degree to operate - the curtains, lights and other fittings all require electronic control, which is not all that easy to operate. The bathroom is modern but be warned that the doors are frosted glass and do not completely provide privacy. This is still a great, comfortable hotel in the CBD of Toronto that I would highly recommend.",
      "rate": 4.0,
      "tripDate": " May 2023"
    },
    {
      "title": "Great location",
      "text": "The W Hotel is ideally located and easily walkable to most everything except the Theatre District. The room was beautiful and high tech. Unfortunately, the heat couldn't be controlled and it was so hot we couldn't sleep either of the two nights we stayed. The front desk staff were very friendly and helpful but, despite reporting the heat situation three times, nothing could be done to lower the heat. Hopefully that problem has been fixed by now. The included breakfast was fabulous and the wait staff very friendly.  I have to say I prefer the Marriott, Eaton Centre for more amenities.",
      "rate": 4.0,
      "tripDate": " December 2022"
    },
    {
      "title": "Awkward room for a girls trip",
      "text": "Strange entrance to hotel, and a lobby which is hard to find if you walk in off Bloor st (the actual address of hotel).  The staff are super friendly, helpful.  Room had great fluffy towels, robes, nice beds… but, the bathroom has no door, is kind of just part of the room and the toilet and shower are behind frosted glass.  I was sharing room with a friend for a girls’ weekend, so if you’re not in a room with your partner you had better not be shy, because privacy is not possible.  And because the doors are frosted if someone has to use bathroom in the night they either have to fumble around in the dark or turn on the light which lights up the whole room.  It’s not well thought out in my opinion. “Smart panels” for blinds/lights just seem complicated to me, and each thing not individual so maybe we want the lights off but blinds open and it takes a lot of trial and error to make that happen.  Sometimes conventional is conventional for a reason - it just makes sense.",
      "rate": 3.0,
      "tripDate": " September 2022"
    },
    {
      "title": "Great service at the Skylight at the W Toronto",
      "text": "We had a great visit for 5 days at the W in Toronto; very central location to ground transportation and to walk to museums and restaurants. The lobby bar is great. The Skylight restaurant is wonderful. The view is inspiring. Our server Cyril knew the menu well and helped us order an amazing mezza. He was terrific and we recommend asking for him if you are lucky enough that he is working while you are there. The manager Connie made sure we had a great time. We loved it, down to the great dinner wear! Very thoughtfully designed restaurant. Spectacular setting but comfortable and intimate as well.",
      "rate": 5.0,
      "tripDate": " October 2022"
    },
    {
      "title": "Fantastic Service",
      "text": "The service here was some of the best I have experienced at a hotel in years. Check-in experience was great. Concierge came over and introduced herself during check-in to see if I needed any assistance with anything at all such as dinner reservations. Restaurant food was quite good as well. Would stay here again for sure. Excellent recognition of Elite status. Staff very friendly throughout hotel at all times.",
      "rate": 5.0,
      "tripDate": " October 2023"
    },
    {
      "title": "W Toronto - Wonderful Experience and Fantastic Service!!",
      "text": "Loved the W Toronto.  Fantastic service and such a warm welcome from Kurtis!  Yunice at the Front Desk was so friendly and a pleasure to chat with.Our suite was spacious and inviting.  Comfy bed, huge shower, black out roll down blinds and one touch lighting was a nice touch!Drinks and tapas at the W Living Room with George helping us ... such a pleasant experience.  Breakfast was delish with lattes, bennies and raspberry toast, shout out to Dong.Shopping and dining literally outside the door, what more could one ask for!We will definitely return to the W Toronto, when the weather is warmer.  Thank You for a wonderful stay!!",
      "rate": 5.0,
      "tripDate": " November 2022"
    },
    {
      "title": "The W Toronto",
      "text": "The hotel and the staff are amazing. The experience begins with the valets who were quick to help and always smiling. The check in was seamless.  As for the rooms they were modern and sleek.  The hotel is centrally located to downtown with many cute places to grab a meal.  There is even an Eataly down block!  For us the highlight was dinner at the hotel restaurant on the 9th floor.  The executive chef, Michael Hawryluk, created a wonderful and delightfully delicious menu.  The setting was upscale casual and comfy and romantic.   I would highly recommend having dinner there.  Also, Michael came out to see how we were enjoying the meal and it made us feel like we were old friends.",
      "rate": 5.0,
      "tripDate": " December 2023"
    },
    {
      "title": "W Toronto is great",
      "text": "Amazing stay. Room tiny but perfect, didn't lack any gadget, shower can lift any body up.Food at the RoofTop is great, Music and vibe upstairs is excellent. Maybe too loud to maintain a proper conversation but anyways you enjoy it.Quite expensive though, prepare the wallet unless you use the Bonvoy points.",
      "rate": 5.0,
      "tripDate": " February 2023"
    }
  ]
}