{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Waterfront Boutique Suites",
    "url": "/Hotel_Review-g155019-d26999863-Reviews-Waterfront_Boutique_Suites-Toronto_Ontario.html",
    "priceRange": "$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "1.0",
      "reviewCount": 6
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "21 Iceboat Terr",
      "addressLocality": "Toronto",
      "postalCode": "M5V 4A9",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2b/57/f2/7b/caption.jpg?w=500&h=400&s=1"
  },
  "description": null,
  "featues": [],
  "reviews": [
    {
      "title": "Terrible!",
      "text": "Absolutely terrible! Place was dirty, dishes were dirty, old dirty sponge was left with no back up, old bag of used freezer burned ice was left in freezer and fridge was dirty. TV didn't work, stovetop didn't work and when we requested help we were ignored. We were left 1.5 rolls of toilet paper for 2 people for 4 days on the last night ran out. No one ever brought more despite being told we didn't have enough the day we arrived and no one ever came to fix anything despite reaching out daily. On final day called and was avoided and passed off for 1 week before they offered us a PITIFUL $50 refund and 20% off next stay - as if I would ever stay again. Now they have still not sent the credit to me despite me sending my e transfer information and are back to ghosting my texts and calls. Amenities were out of order, which we didn't find out until the day we arrived and they tried to charge us an additional 59$/ day for parking if you couldn't find street parking!Stay at your own risk! customer service is non existent and they will not provide you with the most basic amenities.",
      "rate": 1.0,
      "tripDate": " April 2024"
    },
    {
      "title": "Don’t even bother with it.",
      "text": "Terrible check in process. Do not take any chances with this property. Not transparent on details of check in until you book your non-refundable room. Very deceptive to get your money without any way of getting it back. Ask to speak to somebody there and all they tell you somebody will be in touch. It’s been over a week. Pay a little more and know what you are actually getting.",
      "rate": 1.0,
      "tripDate": " June 2024"
    },
    {
      "title": "Book at your own risk!!!!",
      "text": "Terrible experience!! Very dirty and  terrible service from staff!!! Book at your own risk… owner or management team are only looking for money no help whatsoever. Sad that they are such bad humans. I will never book there again they were rude to me and my family of 6 the whole time and a bunch of extra charges for things we didn’t use…",
      "rate": 1.0,
      "tripDate": " August 2023"
    },
    {
      "title": "Horrible",
      "text": "Worst experience ever, horrible client service, nobody at the place to contact, only by phone or texto. This is an airbnb apartment, not a hotel. Filthy, dirty, no A/C, got skin rushes after one night. Gave up and left. No refund. Run away and select a hotel, even though you pay more.",
      "rate": 1.0,
      "tripDate": " May 2024"
    },
    {
      "title": "Filthy and disgusting!!!",
      "text": "DO NOT book at the Waterfront Boutique Suites!!! It's not a hotel, but people's apartments rented out!!! Ours had half eaten food in the cupboards, clothes in the closet, and wet laundry in the dryer.... which is where our towels were!!! It was HORRIBLE!!! Smelled bad and was literally dirty!!!! Carpets and walls were filthy!!!!Overcharged me and then wouldn't refund because I posted a negative review. Told me I could have my $120 back when I removed the review. HORRIBLE experience!!!!",
      "rate": 1.0,
      "tripDate": " January 2024"
    },
    {
      "title": "Orribile  experience  see the picture please….",
      "text": "Stay away from this property dirty like crazy nothing works and no body helps for the situation orribile orribile experience STAY AWAY PLEASE…….see the picture 💩💩💩 please see the picture before booking this b&b inside the apartment so cold terrible smell stay away",
      "rate": 1.0,
      "tripDate": " January 2024"
    }
  ]
}