{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "West Queen West Hotel",
    "url": "/Hotel_Review-g155019-d9766165-Reviews-West_Queen_West_Hotel-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "2.0",
      "reviewCount": 100
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "1521 Queen St W",
      "addressLocality": "Toronto",
      "postalCode": "M6R 1A5",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/12/eb/8d/33/photo3jpg.jpg?w=500&h=400&s=1"
  },
  "description": null,
  "featues": [
    "Parking",
    "Free High Speed Internet (WiFi)",
    "Internet",
    "Baggage storage",
    "Room service",
    "Complimentary toiletries"
  ],
  "reviews": [
    {
      "title": "Do not book here",
      "text": "worst experience ever at a hotel (if you can even call this a hotel). This place should be shut down. No door handles, stained sheets, what looks like mold in bathroom and overall unkept and very dirty!",
      "rate": 1.0,
      "tripDate": " June 2023"
    },
    {
      "title": "Horrific",
      "text": "Booked this hotel through the recommendation of booking.com...don't ever stay at this hotel ..myself and family feared for our lives from other guests ..actually had to threaten calling the police ...when we explained our concerns to the front desk and checked out they would not refund our money so we had to pay for this horrible place then pay another place to stay ...I never post reviews of hotels or hotel booking sites but I'm so mortified I feel I need to share with others .. I do not recommend this hotel at all and I also do not use booking.com",
      "rate": 1.0,
      "tripDate": " May 2017"
    },
    {
      "title": "Horrible!",
      "text": "Stayed here for one night. To begin with the reception was next door to the hotel (which was locked) and there was no sign that this was the recetion, I accidentally walked in next door and there it was. The guy in the reception was going to charge me for the stay but I said I have already been charged online so he wanted me to check my account and then he walked off. Anyway So finally in my room there is a bed and a chest of drawers, thats it. Feels dirty and filthy, the pillows are so gross I couldn't even put my head on them, the bed is full of hair. Weird people here, at one point som guy (room service he said) who seemed like he was on drugs knocked on my door and asked for my name as he said they didn't have my booking card downstairs. I didnt get a private washroom so had to share. Im used to sharing washrooms as I often stay at hostels but this one was gross! The walls were paper thin and people were loud and seemed kinda weird, like on drugs... this place just weirded me out! Will never stay here again!",
      "rate": 1.0,
      "tripDate": " March 2017"
    },
    {
      "title": "Fantastic",
      "text": "I stayed at the queens west hotel for three nights recently. I was not sure what to expect when i booked besides the price being very affordable . As soon as a checked in, the front desk was very accommodating and also explained in detail where i could dine in the area. I was very impressed at the cleanliness and safety of the queens west. Highly recommend this hotel.",
      "rate": 5.0,
      "tripDate": " April 2023"
    },
    {
      "title": "Worst place ever!",
      "text": "Reserved a doubled with a private batroom the \"manager\" try to send us to a small room with the private bathroom outside in the corridor. Changed with an another room very minimal it seems to be ok and solved because we are here just to visit the city. What a surprise when we came back from our visit. You cannot stop aircondition. Cold air and noise came up the bad. There are no sheets on the bad. Immagine what it means. No towels. No commodities at all. No security at all. The lobby does not exist. The back door is always open neither assurance of the manager that told us that during the night it stay closed and it was available just for us to take the luggage. I checked twice last night that door is always opened. Near the \"hotel\" around the street there are a lot of junkies. It is not a safe place. I tryed to call the 'manager' a lot of times but he seem available just for check in and for take the money. No answer at all. At the bottom floor just a step away the \"roncey studio artist\" practicing drum till evening late. It seems they are in our room. Impossible to sleep. At the moment it is 22:17 they still hit their 'instruments'. Bad experience at all!!! Avoid this place. I want my money back!!!",
      "rate": 1.0,
      "tripDate": " August 2016"
    },
    {
      "title": "Don’t book with this hotel !!! So disgusting !!!!",
      "text": "It’s a waste of time and money booking with them. Hotel owners were rude themselves. Place overall is so disgusting that I was afraid of catching a disease. Not cleaned, black mold all over inside shower, no outlet covers, curtain rod falling out of wall. WHAT A JOKE OF A HOTEL !! And how are they even in business or operating for that matter!!! So many health and safety issues wrong with the place !! And then the owners trying to get away with not reimbursing my mother for not staying there. Couldn’t stay there because it was that disgusting !!!",
      "rate": 1.0,
      "tripDate": " August 2019"
    },
    {
      "title": "Disgusting dump😡😡",
      "text": "We arrived in Toronto so excited about our visit to Canada & Hawaii.  Our friend Darren put a lot of work into booking hotels, a meal at the CN Tower etc. After a long day travelling from the UK, we arrived at West Queen West Hotel.  Our first impression was disbelief!  We were told to go next door and up the stairs with 4 heavy suitcases.  We went into the bedrooms and we were horrified.  This place is not a hotel.  Its a filthy and disgusting hovel and we would never ever recommend it.  Not only were we shocked at how dirty and really run down the rooms were but the front door did not lock and the bedroom door locks were flimsy as were the doors.  We spoke to the staff and they tried to fob us off with excuses.  Our first and only night was ruined due to not feeling safe, dirty bedding and rooms but feeling like things were crawling on you in the dark.  The bed was like a board and far too uncomfortable to sleep on.  We were told that breakfast was included.  We had no.intention of eating anything but went to have a look out of curiosity.  It was appalling, the milk was thick and off and people were waiting for the receptionist who was extremely busy to go and get supplies.  We explained to her how we felt and asked for a refund which she gave us.  To our knowledge, there were 6 other people who complained and left for the same reasons. It's a horrible run down cesspit.",
      "rate": 2.0,
      "tripDate": " August 2018"
    },
    {
      "title": "welcoming and friendly environment",
      "text": "The staff at reception is wery welcoming and friendly, the grooms are spacious, clean, and simplified. i highly reccomend this hotel for your short stays its so worth it , the location is great close to the water and easy downtoen access",
      "rate": 5.0,
      "tripDate": " June 2018"
    },
    {
      "title": "solid place, will consider again",
      "text": "Wow, don’t let the reviews scare you.I’ve travelled to a few places around the world and I’ve seen worse.ProsHost Michael at the entrance is A+Parking on site, few steps awaySeveral restaurants to buy food from steps awayLocation is few minutes from many key tourist attractionsConsWalls are thin you can hear people talk. I can sleep like a baby even if a tank rolled into the building, so no issue for me.",
      "rate": 5.0,
      "tripDate": " May 2018"
    },
    {
      "title": "Not realy sure if this is a hotel?",
      "text": "We reached the hotel and I had to wait for an hour for someone since there wasnt even a number posted where we could call.The area was very seedy with a lot of homeless people around and the hotel was more like a shop front with dirty sofas strewn around and no security at all. VERY different from the pictures posted.I had pre-paid my first nights stay here ( we were supposed to stay for a week), but as soon as someone come in, I cancelled the rest of my stay and booked another hotel (at 300% the cost) just to get out of there.I obviously did not get a refund!",
      "rate": 1.0,
      "tripDate": " November 2017"
    },
    {
      "title": "Ufff...a terrible place. avoid",
      "text": "dirty miserable little room, stained dirty sheets and pillows. pathetic stinking bathroom, shared by 5 rooms in each corridor. doesn't resemble a hotel at all. when we reached reception was locked. one girl came after a few minutes, checked us in and asked for a deposit over and above the price we had paid on online booking. had to drag my heavy suitcases over 20 steps to reach the entrance. noise throughout the night. the worst ever thing I booked in a hurry on the net (on reaching I saw the asking price was less), as I wanted to be close to downtown. It was a total disaster and both me and my wife spent a miserable night.only good thing was a decent breakfast spread in the morning.",
      "rate": 1.0,
      "tripDate": " August 2018"
    },
    {
      "title": "Nightmare ",
      "text": "Dirty bedlinen, blocked toilets, no window in the rooms (!?!), people smocking (not only cigarettes...) in the corridors and rooms...Music session next door until 2:30 am.Absolutely no phonic insulation...What else to say?",
      "rate": 1.0,
      "tripDate": " August 2018"
    },
    {
      "title": "Just noooo",
      "text": "It is more of a hostel than a hotel. For the money we paid I’ve stayed in a hell of a lot better of HOSTELS. I’ve travelled across the world and for $40 got better than this. Let’s begin. For starters it does not look like a hotel at all, it looks like a store front. You go in to this area where you check-in and then have to walk back outside and go through a side door to get up to the rooms. It smelled gross in there. We were also told we got a complimentary drink at the bar next door by the staff at front desk- when we went over the bartender looked astounded, got extremely upset and went back next door to rip a poster down in the front of the hotel saying newcomers received one. Obviously it was not true and they were advertising this freely. Our room was not worth what we paid. No amenities other than a tiny toilet sink and shower that was basically shoved in a 4x4 closet. There was dried blood on our blanket, I’m a nurse so I can tell you that yes it was blood. There was white stuff on the headboard that looked like it had been “sprayed” there if you catch my drift. We were easily able to wipe it away with toilet paper... the entire place smelled of smoke although no smoking signs were posted everywhere. You can hear everything through the walls in this place. I would never stay here again. We were here quickly to just sleep after a concert at echo beach but we could have put our money to use somewhere else. It is disgusting. Also- don’t pay the $10 the staff quote you for parking, there is overnight parking in a green p across the street for $4.00, another deception from the staff. Honestly, The only good thing was the pizza place across the street ! We got out of there as quick as possible. You’ve been warned.",
      "rate": 1.0,
      "tripDate": " June 2018"
    },
    {
      "title": "Wonderful place to stay",
      "text": "Probably one of the best hotel of Toronto located next to all the shops you might need. Wonderful and warm host from the owners. Quiet room with good bed and nice bathroom. Don't look forward, this is probably the place you need. Hope to come again soon to your place. Cheers",
      "rate": 5.0,
      "tripDate": " March 2018"
    },
    {
      "title": "Would not recommend!!",
      "text": "Me and my boyfriend booked here very last minute. We were lucky that we checked in around 3pm because from 8pm onwards there was no check in, no management to be found and on several different nights people were left stranded literally on the street outside, one young girl was travelling alone and had nowhere to go. There was no reception. Both in the area and building I felt unsafe. We stayed there for two weeks and not one night did I sleep there was constantly physical fighting on the street shouting and also on Monday and Wednesday's a drum class in the building below that went on until 10.30pm! We had a shared bathroom and the whole time we were there there was water dripping from the roof and there was a constant puddle travelling up the hall from it. There were no towels, soap. The bin was never emptied, sheets never changed! It's 100% not a hotel and it wouldn't even be great for a hostel! There were no facilities literally just a bed and some drawers! The wifi did not work at all. The only good things were you are close to the beach and lakeshore, Boardwalk which is lovely and the buritto boyz and egg smart at the bottom of the street are lovely also! And the woman that donw the cleaning was also very nice",
      "rate": 1.0,
      "tripDate": " July 2016"
    },
    {
      "title": "Staff No Show!",
      "text": "We booked because of the affordable price and reasonable location. Spend the whole day trying to contact someone. Once we arrived at the hotel, no one was there and no one answered the phone number that we were told to call. Decided to book a different hotel.",
      "rate": 1.0,
      "tripDate": " July 2016"
    },
    {
      "title": "Sketchy as heck!!!",
      "text": "It was the worst experience ever. This place is sketchy as heck!! It’s shouldn’t be allowed to call this a hotel! The lady who “helped” is was super rude and incredibly unfriendly. She hung up in the middle of a phone call. The information that is on the site is incorrect and than she makes you pay for stuff. DONT WASTE YOUR MONEY ON THIS PLACE! Even the neighborhood is very bad. This hotel should not be on business.",
      "rate": 1.0,
      "tripDate": " July 2022"
    },
    {
      "title": "Nasty",
      "text": "The West Queen West Hotel is a trade misdescription. This is not a hotel! It’s a hostel at best. The nasty rooms are so unhygienic, dated and depressing. No private bathroom in one room, lock on main door wasn’t secure. Window looked on to a dumpster where the junkies hang out and get wasted at night. Im genuinely appalled at the state of cleanliness and felt unsafe staying in the room or leaving my things in the room, when I went out. I had to get out of there. It’s like that Hotel Cecil! Dirty, smelly, rude staff, cramped, dated, unsafe, depressing, only thing going for it is the WiFi This place needs one thing….A wrecking Ball!",
      "rate": 1.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Please don't book this place no matter what.",
      "text": "People were doing drugs with the needles on the stairs when I was returning from dinner. I have to walk around them, and I am not very good in this situation, so later on when I was trying to sleep, and somebody starts shaking with the door a freakout and left the hotel in middle of the night, my room was smelly and super hot, you can not open the window, and you don't want open the door, bathroom very simple and not very clean, the guy who was there the time I was checking was nice even though I can smell marijuana from him, don't know how this place can be approved as hotel",
      "rate": 1.0,
      "tripDate": " January 2020"
    },
    {
      "title": "DON'T EVEN CALL THERE,YOU CAN SMELL THE PLACE OVER THE PHONE",
      "text": "don't even call there,you can smell the stinking fumes over the phone.the receptionist was nasty,the place was nasty.nothing is clean.i won't put my dog there .I am trying to get my money back,when i asked for a refund i was told good luch",
      "rate": 1.0,
      "tripDate": " April 2019"
    },
    {
      "title": "this is a HOSTEL not a hotel",
      "text": "We only needed a room for after a concert that night and figured we were clever to economize.   Big mistake. Our room was quite small and contained only a bed, chair and dresser. Which was fine, but there was no window (only a small skylight) and the bathroom was shared with 4 or 5 other rooms. The bed was made up with a fitted sheet, two throw pillows and a bedspread, no top sheet to sleep under.We should have read our confirmation email more closely as it clearly stated that the bathroom would be shared. Not only was it not private, it was not equipped with any linens (these were brought to our room along with a couple of bars of soap) and it had obviously been quite a while  since it had been cleaned. Breakfast was included in our stay, but as we made our selections from the grocery store pastries (if they hadn't been store bought, we wouldn't have bothered) another guest checking out talked about the cockroach they found in the shower. END OF BREAKFASTFront desk clerk was pleasant, but we won't be taking her up on the offer of 'the bigger room' 'next time we stay there'.NOPE",
      "rate": 1.0,
      "tripDate": " August 2017"
    },
    {
      "title": "Speechless, not in a good way.",
      "text": "This establishment should it no way, shape or form be classed as a 'hotel'. I should of read more reviews before I stayed there as I just went off the ones on booking.com. I had a room with a private bathroom 'thank god'! It was noisy, aircon didn't work, blinds broken, floorboards missing or broken, no toilet paper in my bathroom or the shared bathroom. Some very questionable people staying and working there. Such a shame it was the only accommodation I booked in Toronto because it definitely took away from the enjoyment of my stay.All in all, I don't know how this place is open.",
      "rate": 1.0,
      "tripDate": " June 2017"
    },
    {
      "title": "Don't be fooled!",
      "text": "There are cities from Berlin to Warsaw to Chicago to NYC where many neighborhoods are transitioning from downscale to hip. This is not one of them!!!The photos and write-up for this hotel are frankly misleading and to call it 3-Star brings into question what kind of rating system is used. This is a dump: broken blinds on the windows, one folding chair in the room, no desk or table to eat or work on, no airconditioning, back view/access to a parking lot and waste area. Not worth the price. Look elsewhere! this is not some charming, wonderfully renovated place.",
      "rate": 1.0,
      "tripDate": " June 2017"
    },
    {
      "title": "Worst Place Imaginable",
      "text": "I don't even know where to begin with this \"hotel\" We had booked for two weeks and we get to the door and it says to check in call this number... so we called and no answer for about 20 mins and then all of a sudden the manager came and let us in to the place. Once though the door we paid for our full two weeks say which for the facilities was overpriced by about half! But it was really shady he took my credit card and put it though a card reader on his phone so he could swipe it.It wasn't busy and I could tell why. The second night we were there they had organised a RAVE in the building below! and when I say it was loud I mean loud, it had knocked my drink off the table from the vibrations! that carried on until 5:30am. The cleaning lady was nice when she was about, although we never got a sheet change in two whole weeks. the bed was like sleeping of the floor (broken and spiny) I couldn't recommend staying somewhere less than here. Plus the area is next to a homeless center.The aircon was temperamental but this didn't matter much as the window wasn't attached to the frame and came completely off! Seriously don't even stay for a night. much better places in downtown. This place is like a hostel but hostels are nice compared!",
      "rate": 1.0,
      "tripDate": " October 2016"
    },
    {
      "title": "Worst Hotel I ever experienced",
      "text": "Horrible Check-In! You can only check in between 15:00-20:00h and you have to call a phone number. If you are lucky somebody picks up the phone. I had to wait 2h until I was able to Check-In. NO FRONT DESK! The Hotelmanager gives you a key, that's it! I also had to pay cash because his credit card machine did not work!! Way too much money to have cash and also way to much money for that lousy hotel! We had NO WIFI, NO TOWELS! We were promised both! The bed was horrible, my girlfriend had a backache every morning! The room was very dirty and the AC really loud! The building is really keen-eared so you can hear your neighbors and everything is going on in the hallway! All in all too much money for nothing! DON'T TRY THIS HOTEL!",
      "rate": 1.0,
      "tripDate": " September 2016"
    },
    {
      "title": "Worst experience ever.",
      "text": "3 people DIED during my stay at this hotel. DO NOT STAY HERE. FIND SOMEWHERE SAFE.Scared, and scarred for my life. This is not a hotel, this is a hostel. You need to read this whole review.Washrooms are shared with 3 other guests staying in the same corridor as you, however the rooms are \"private.\"A room with a private washroom will ring up to about $105 - may as well stay somewhere more luxurious after the $40 deposit. $145 down the drain.Every couple weekends, there would be no-wifi, as if they're not ontop of the bills. One time for a period of 4 days we had no water in the room, and another time no power in the room for 3 days. Refunds were never given, however we did pay a discounted rate for the long term stay. They dont offer this anymore.Myself and my partner unfortunately stayed here during their off-season when less tourists come around, from February, however we had extended all the way to June, because of toronto's crazy Rental Market.Three deaths at the hotel, one each month. According to management, 2 overdoses and a suicide. Sure does make me feel safe. I wonder to this day if those were just cover-ups, especially as one night, after the hotels office hours, a man, 5'8, black and never seen before unlocked our hotel room in the middle of the night and somehow had a hold of the key, but we startled him, and he ran off.From this day forward we barricaded the door with the bed, and dresser so the door absolutely could not open. This was the most terrifying experience I've ever lived. DO NOT STAY HERE. FIND SOMEWHERE SAFE.",
      "rate": 1.0,
      "tripDate": " June 2019"
    },
    {
      "title": "Worst hotel I have ever seen",
      "text": "It is dirty and falling apart.  The first room we had the toilet didn't work and was disgusting so we had to move.  The second was not much better, we put our cases against the door as the lock did not work properly.  In the morning we had to step over a druggie on the stairs to get out of the hotel.  All in all I felt very vulnerable so we only stayed 1 night and not the 3 we booked, it was worth losing money just to get out of there.",
      "rate": 1.0,
      "tripDate": " July 2019"
    },
    {
      "title": "Fire trap! Fire trap! Save your life! Go down the street.",
      "text": "No fire doors! No working fire rated doors!Ours had a hole in the door!Burnt out exit lights! Doors don’t even close! Place is full of drug addicts! How this place is still in business makes me shack my head! Toronto is a world class city but some how the death trap is allowed to do business. Better to sleep on a bench for the night.",
      "rate": 1.0,
      "tripDate": " January 2019"
    },
    {
      "title": "Hotel to stay in, just sleep and go to the city",
      "text": "Helpful and nice staff. Good location - easy to get to the city centre. Reasonable price.On the other hand, the room was not clean, especially the bathroom. Hotel is very old and definitely needs some investments.",
      "rate": 2.0,
      "tripDate": " February 2018"
    },
    {
      "title": "HORRIBLE !! STAY AWAY",
      "text": "DO NOT BOOK THIS HOTEL!!!The hotel smells of mold and cigarette even though there are signs up saying not to smoke!! During my stay my room was DISGUSTING !! The bed sheets had dried blood stain, there was a syringe in my room but most of all I came back from downtown toronto to find A PILE OF CAT POOP ON MY BED AND MY CLOTHES (100$ WORTH) RUINED BY CAT URINE !! DO NOT BOOK !!",
      "rate": 1.0,
      "tripDate": " September 2018"
    }
  ]
}