{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Windsor Arms Hotel",
    "url": "/Hotel_Review-g155019-d183097-Reviews-Windsor_Arms_Hotel-Toronto_Ontario.html",
    "priceRange": "$$$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "4.5",
      "reviewCount": 450
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "18 Saint Thomas St",
      "addressLocality": "Toronto",
      "postalCode": "M5S 3E7",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/10/c0/8f/7e/photo0jpg.jpg?w=500&h=-1&s=1"
  },
  "description": "Consecutively voted the #1 hotel in Toronto by Conde Nast Traveler Magazine, the Windsor Arms Hotel is nestled on a quiet street ideally located just steps away from Yorkville, the heart of Toronto's most fashionable shopping and entertainment district. An aura of warmth, discreet luxury, and the latest technology combined with our exceptional level of service makes Windsor Arms Toronto's most luxurious boutique hotel. Behind our century-old portals are 28 new luxury suites with 24-hour butler service. The Windsor Arms is host to the Courtyard Cafe - open for Sunday brunch and special events; Prime Steakhouse -open for breakfast, lunch and dinner and a full Vegan menu; the Tea Room for Afternoon Tea and Lounge twenty-two for tapas and cocktails. The Spa offers fully serviced individual treatment rooms, swimming pool and exercise facilities.",
  "featues": [
    "Parking",
    "Free High Speed Internet (WiFi)",
    "Fitness Center with Gym / Workout Room",
    "Pool",
    "Bar / lounge",
    "Nightclub / DJ",
    "Business Center with Internet Access",
    "Conference facilities",
    "Wifi",
    "Hot tub",
    "Indoor pool",
    "Heated pool",
    "Restaurant",
    "Breakfast available",
    "Breakfast buffet",
    "Banquet room",
    "Meeting rooms",
    "Spa",
    "Concierge",
    "Non-smoking hotel",
    "Butler service",
    "Dry cleaning",
    "Laundry service",
    "Air conditioning",
    "Room service",
    "Minibar",
    "Flatscreen TV",
    "Non-smoking rooms",
    "Suites"
  ],
  "reviews": [
    {
      "title": "Great food and service",
      "text": "We went for the lunch Summerlicious menu at Gatsby. The venue is quaint and charming. The music selection is perfect for background.I ordered the crisp calamari, I tried one and it was so chewy and my husband tried it and agreed, so I sent it back. Both servers came back and said they had tried it too and it was way overcooked. I was asked if I would like it grilled instead. I was astonished by this offering and very pleased. It came out grilled and delicious. That they could pivot like this impressed me.The servers were pleasant and very efficient. I had the steak, a very generous portion (the server kindly wrapped the remainder for me) and my husband had the mussels which he enjoyed immensely. The pavlova was to die for!",
      "rate": 5.0,
      "tripDate": " July 2024"
    },
    {
      "title": "Wonderful old world charm and friendly staff.",
      "text": "A stunning historic hotel with bags of exquisite charm and quirkiness. Food good and plentiful in the restaurant, and from a design and furnishings point of view this is one of the most eclectic and stylish hotels I have come across. Spa treatment ( massage) was one of the best I’ve ever had and I’m fussy. It feels like this hotel is revving it’s engine ready to come back with a vengeance after the struggles in the hotel industry linked to Covid. Naturally a lot of the staff are new and learning as they go,  but whatever small niggles they are working through right now will be ironed out without doubt and I can’t wait to come back to give this charming place and its welcoming and friendly staff a well deserved 5.",
      "rate": 4.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Windsor Arms",
      "text": "Class and Service.  This hotel is a throw back to more polite and \"gentile\" times.  The room was luxurious . clean, piped in music, lights with dimmers. expresso machine.  Beautiful decorations and photos of past famous patrons.  If you can get a room here don't miss this UNIQUE hotel.  Few of these wonderful old world hotels still exist.",
      "rate": 5.0,
      "tripDate": " September 2021"
    },
    {
      "title": "Underwear nightmare",
      "text": "At over $500 a room per night one would expect not to find dirty underwear from previous visitors left over in your hotel room!To mine and my friends dismay, upon searching for creamer for coffee in the morning after one nights stay my friend found herself manhandling someone else’s dirty underwear! When my friend reached into the top drawer of a unit housing the coffee maker and pulled out a bra we were both horrified to discover that this, along with socks and a soiled pair of men’s underwear were overlooked by the cleaners. We immediately brought this to the attention of the concierge who sent an attendant to remove the dirty items. He himself took pictures. My concern is, if an entire drawer containing dirty undergarments was missed, how much other attention to sanitization may have been missed? What’s more upsetting is when we attempted to have the nightmare of my friend having handled the undergarments, thinking it was mine that I might be leaving behind, rectified in some way, the manager “was not available” and the person we spoke to said the most they could do was comp a water bottle from the mini bar and over night parking! $50 total compensation for an over $700 stay as we told them we were also staying for high tea, which they refused to comp. Horrible customer service for a place that prides itself on giving a great experience to it’s patrons. Emailed the manager who was of no further assistance. VERY disappointing for a $500 a night stay. And a $700 experience. Just gross!Then as if that were not bad enough, they failed to verify our luggage and sent us out with someone else’s personal belongings! A backpack containing who know what because we are honest people and even after Having been treated the way we were, returned the bag immediately.Never again. No thanks George (manager)!",
      "rate": 1.0,
      "tripDate": " March 2020"
    },
    {
      "title": "Disappointed beyond words",
      "text": "My husband surprised me for my birthday with a trip to the city, and a night at this landmark. Hotel has an old world charm, though could use some TLC and clearly in need of repairs. We had a nice dinner at Gatsby restaurant, food & service were good. We retired to our lovely room and we’re asleep by 10. We were woken up shortly before 1am to a dripping noise, which soon turned in to a steady stream of water coming out of a pot light (!) in the bathroom, splashing in to tub, and running along ceiling, down wall and pooling on floor. We called the front desk  and they came up, but by the time they arrived it had slowed to drip again. They offered to switch our room (at this time it was nearly 1:30am), which we had no desire to pack up everything and move in our pyjamas! My husband had booked a massage and rock climbing in the morning and we woke very late after the eventful night, rushing to get ready for bookings. As we rushed out front door the same manager who’d been up in the night asked if we wanted breakfast, but we were clearly in a hurry and racing out the door. We arrived back at 11 for check out, and a massage. My husband went to speak to the manager about the nights events and hoped they would compensate us in some manner for an awful night. He was told by same gentleman that he had no authorization to do so (despite being the manager) (!?), and had offered us a room move and breakfast, which we declined. My husband was shocked by the lack of dust service, explaining that moving rooms at 1:30am was in no way desirable, and we had reservations in the morning, and offering us breakfast on the spot as we were rushing out the door didn’t fit in to our plans. He told us there is nothing more he could do. We are completely understanding that it was likely another guests’ error of leaving water running that caused the issue - yes these things do happen, and we understand. What we can’t comprehend is the complete disregard demonstrated to us as customers as we spent well over $1000 at hotel on our room, dining, and massage, with scarcely and apology. So disappointed that this lovely historic landmark has fallen in to such standards.",
      "rate": 1.0,
      "tripDate": " April 2022"
    },
    {
      "title": "Do not stay at this hotel",
      "text": "Everything should be perfect for the price at this hotel. It was not. One on the wash clothes in the bathroom was dirty. The rooms furniture looked as if a cat was scratching on it. We reserved the pull out couch for an extra guest but it was not made up. The person at the front desk was very rude when we brought this up and said that we did not reserve the couch. I have an email to show that i did. There is no convenient stairway to the second floor where our room was and the only washrooms for the ballroom. This is a fire hazard. Breakfast was very expensive. My order was wrong and took for ever to get even though there was only 1 other couple in the room. The music from the wedding was so loud that I could not get to sleep until after 12 midnight. The ballroom is not sound insulated. The hotel gives the appearance that it is going out of business.",
      "rate": 1.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Worst Hotel I Have Ever Stayed At",
      "text": "First, we had originally tried to cancel our reservation a few days before and were not allowed to. We were very much looking forward to our stay but we had something come up so accommodating our request would have been appreciated. We decided to go as it was a lot of money, so we moved things around to make it work. We were still very excited to come stay at the hotel as we had heard great things about it and the photos we had seen online made it look amazing.When we arrived at the hotel we were informed that our room wasn't ready and we needed to wait for it. We were slightly early so we didn't mind. We went out for a bit and then came back for a couple drinks at the hotel bar. We were very disappointed to see some of the staff were very relaxed with their mask wearing, either pulling it down under their chin or nose. Also, customers were walking around without masks and the staff did nothing about it. This made us feel unsafe, and wondered what other details were being missed if something as big as COVID regulations were being ignored.When we got to our room we were let down. It was very small. Everything felt old and dirty. There was an odd smell in the room. The carpet was old and bunched up in areas. The TVs were at least 10-15 years old. The bed was horrible, it had massive sunken areas. We went out for an early dinner with friends and came back around 8. We laid down and tried to rest, and it was a very uncomfortable experience. That's when we decided to leave.We packed up and went downstairs, and met the person at the desk, who had his mask also pulled down. I said we were leaving and he said ok and went and caught our car. He did not ask once about why we were leaving. You would think that if a customer was leaving at 8:30pm instead of staying the night you would inquire about why they are leaving to see if there was something wrong.Before coming to this hotel we had stayed 2 nights at the Four Points in Niagara Falls. It is a basic hotel. That experience was so much better than what this hotel offered, and for a fraction of the cost. The Windsor Arms is supposed to provide a 5-star experience and what we experienced was one of the worst we have ever had at any hotel.",
      "rate": 1.0,
      "tripDate": " November 2021"
    },
    {
      "title": "High tea",
      "text": "We went for high tea for our friend birthday, it was 6 of us .We were seated  in a small table, we had to be super careful, pouring our tea, or serving our scones. The table was no more then a meter long, by 50, a wrong movement and will have  been a disaster The bathroom, had an awful smell, that you can smell though the mask.For the price that we pay ($432.00)  was NOT worth it, Tipping it’s up to the client,  and NOT a 18 % tip on your bill 15% would have been more then plenty, under the circumstanceTeresa C.",
      "rate": 2.0,
      "tripDate": " November 2021"
    },
    {
      "title": "Windsor Arms Hotel Safety",
      "text": "So, here’s my story. A few weeks ago, my wife and I decided to take a few days off and explore Toronto (We live in upstate NY). We decided to stay at the charming Windsor Arms Hotel, which boasted a storied history and an English tea service. Upon arriving, my wife asked to use the bathroom as I registered. She was told the only way to get to the second floor, where the bathroom was located, was to use the one elevator in operation. Furthermore, they added that the stairs to the upstairs floors were locked and were only unlocked in case of an emergency, such as a fire. This would not be done electronically or from the front desk, but rather by a hotel employee who could go from floor to floor unlocking the doors. Upon returning my wife asked what we both thought was a quite logical and legitimate question: how could they be sure that an employee would potentially risk his life, going from floor to floor to unlock all the doors if a fire erupted. We all remember that people died in the attack on the World Trade Center when they got locked in stairwells. As I recall, some people jumped out of windows because they were locked out of the stairs.) “How,” I asked, “could you even test this emergency system, since they only real test would be if there was an actual fire.” One can pretend all you want but who knows who people ack in an emergency, right. And, by the way, there was no outside fire escape that could be used as an escape route. \tAfter talking this over with my wife that evening, we decided that we did not feel safe in the Windsor Arms Hotel and wanted to go elsewhere. Ah, but here was our mistake: we had made one of those bookings that was no refundable through a third party. And, the manager refused to refund any of the money we had already paid for the entire week. We tried to get the third party to intercede for us, but their efforts were quite useless. We tried to get our credit card company to intercede with the same result. Knowing we had made a mistake booking a non-fundable room, but still feeling unsafe, we offered to come to some compromise with the  hotel manager. Again, she would not even consider it.  So, we left and lost a significant amount of money. \tSome of you reading this will say it is our fault for making this type of reservation. I will NEVER do that again. Also, since the aid of the third party was quite useless, I will endeavor to make my future reservations with the hotel itself. The price are really not all the cheaper all the time. But, all that said and taking responsibility for my own failures, I still believe  that the hotel could have made some sort of accommodation, perhaps in the interest of understanding the situation or just old fashion good relations. I will let you decide if that would be reasonable or not.",
      "rate": 1.0,
      "tripDate": " October 2022"
    },
    {
      "title": "Not a “5 Star” Property!",
      "text": "We stayed here for a staycation experience. We wanted to treat ourselves and stay somewhere luxurious. Based on the photos on the website and the 5 star rating we were quite excited for our stay.When we arrived, the staff were not that friendly and seemed indifferent about us being there.When we got to our room, the first thing we noticed was an odd musty smell. There was a large stain on the carpet in the entrance way, likely from water damage. The bed was made very sloppily, with the sheets that are supposed to be under the comforter touching the floor and wrinkled. The pillows appear if they were just tossed onto the bed. The television uses a very old cable box, and kept cutting in and out, making it difficult to watch any shows. There were also stains on the desk, as if it wasn’t wiped at all from the last guest. 5 star hotels usually pay attention to every detail, and Windsor Arms seems to overlook everything. We have stayed at Ritz Carlton, Shangri La and the Royal York and they are far superior. Windsor Arms needs to step up their game if they even want to be in the same league as those properties. I would not recommend staying here, there are far better hotels out there.",
      "rate": 1.0,
      "tripDate": " February 2022"
    },
    {
      "title": "Wretched guest relations and insulting desk manager. Deletes comments on social media.",
      "text": "Oh, where to begin... First, let me say that this is my third attempt to get the Windsor Arms to acknowledge their bad behavior. The first being asking to speak with a manager live, and being told there is none. The second begin commenting my issues on their Instagram, which they promptly deleted. Good call, guys. It's 2019. You think deleting Instagram comments is the way to go?Now down to the issues... My mother is a Torontonian who has since moved away and we come back often. We typically stay at the Park Hyatt but it's now under renovations. Back in the day the Windsor Arms had a great reputation as the place to see and be seen. Well, today, not so much.I'll break it down -- keep in mind this is a 5 star hotel in the poshest neighborhood in Toronto and there are not that many rooms OR guests, which I guess should've been a sign.1) The hotel needs a cosmetic revamp. Other than the lobby, which is attractive, the hallways are dank and the elevators are run down. But this is the least of it. 2) There was very inconsistent attentiveness to servicing the room -- we went out for the day and came back to dirty dishes still in the dumbwaiter. Random pillowcases on the chair. When we asked for fresh glasses, they told us it \"might be faster for us to get room service\". Are you serious?3) The coffee maker is so loud it could wake someone in Montreal. I woke up every morning to my mother making coffee, which wasn't her fault, but a coffee maker not made in 1897 would be ideal.4) The TV needs a tutorial (literally, the guy told us he'd come up to teach us how to use it). Same goes with lighting. You'd think they'd have someone escort you to the room and teach you how to use all of these things so you don't have to be frustrated with 2 remotes and lamps not turning off at midnight.4) The kicker now. My mother asks for extra sets of towels in every hotel room she ever goes to. At the Park Hyatt, they expected it and would have them ready for her each day. At the Windsor Arms, they simply couldn't handle this request. My mother is extremely patient and kind and simply asked to have them delivered to the room. The first day it took some time, but she got a couple. Not exactly what she had asked for, but fine. The next day, it took longer and she also didn't get exactly what she needed. No complaints, fine. The third day, we asked on our way out for the day to have them in the room when we got back, knowing we'd be showering then. We come back to no towels. She calls again. The surly desk manager (white guy, gray beard, short - he was obnoxious to someone on the phone as we were checking in - also a bizarre way to welcome guests - so none of this was a huge surprise) told my mother the towels would come with the turndown service. Um, what? It was 5pm and we wanted to shower and needed extra towels. Why did we have to wait til turndown? She nicely explained we didn't want a turndown service but did want the towels to shower now. He then had the nerve to ask, \"Why exactly do you need these towels?\" I'm sorry, WHAT? You think you have the right to question a guest who is paying $400+ a night and who asked you for these towels HOURS ago about WHY she needs them? My mother told him she was offended by his question and that she did not owe him an explanation. He said they keep tallies on the towels, to which she said, great, tally the extra towels I'm asking for. He never apologized, despite her calling him back AGAIN to ask to speak to a manager, to which he replied there wasn't one.I'm sorry but how do you run a hotel without a point of escalation when your surly desk manager offends your guests? The butlers also had no idea how to contact anyone. And on top of all of this, it still took another hour to get the towels we requested at noon that day and they were still missing a set. Now the best part of all -- since we had no way of contacting a manager at the Windsor Arms after we left -- I left a comment on their Instagram explaining the above issues. What did they do? DELETED IT. Within 5 minutes. It's interesting that in 2019 they think the best approach to customer service in social media is to delete comments. As if that won't just make someone go to literally every other outlet to let every potential guest know about their experience.It's 2019, Windsor Arms. I'd advise you to spend less time deleting comments on social media and more time improving your guest relations and your staff attitude. We're not infrequent travelers to this city and we know it well. It was a mistake to not rectify this situation when the opportunity was given to you.",
      "rate": 1.0,
      "tripDate": " August 2019"
    },
    {
      "title": "Bad Experience",
      "text": "My husband and I had planned to stay at the hotel for 3 nights after we had heard such wonderful things about the hotel.  The arrival was welcoming, lunch was good the room was great.  However on our return to the hotel on the first night they had a very large party going on in the lobby which was loud and continued until after 2am.  We were on the 4th floor and could hear the DJ as if he was next door.  The management was non-responsive and actually when we complained about the noise at 1am we were told by the night manager \"I can make it louder if you want to.\"  Not the atmosphere one would expect from a SLH.",
      "rate": 1.0,
      "tripDate": " October 2013"
    },
    {
      "title": "Should have read the reviews first",
      "text": "I should have read the reviews first before allowing my travel agent to book me in at this hotel. It was the worst stay I have ever experienced in my life. It started upon my arrival with no doorman and having to bring my own bags in. There was three people standing at the front desk and no one offered to help, further more upon check-in the three people seemed more like a comedy act than a front desk. I was not escorted to my room nor asked if i would like to be escorted or needed help with my luggage.Upon entering my room I noticed a pungent smell. The room appeared clean but was soon to find this was far from the truth. There was fresh lipstick on the duvet.I strongly recommend that would be travellers rethink their stay at this particular hotel. I have informed my travel agent of my disapproval so she does not make the same mistake twice.Another thing to note is this hotel says it is a four star, it is not, it has a three star rating, which is still too high of a rating.",
      "rate": 2.0,
      "tripDate": " July 2007"
    },
    {
      "title": "Not even a 3-1/2 star",
      "text": "It’s sad when such a beautiful building and classic Torontonian landmark goes downhill. Most of us have at least dined it attended a luncheon or reception at the Windsor Arms Hotel. I’ve attended dinners, weddings, receptions and business functions, dating back to the 1980’s but never stayed here.We decided on a staycation and to experience the spa the next day. My spa review will come later but here is the hotel short and sweet:1/ If you’re expecting a 5-star. Don’t.2/ If you want a large room with a living area and an ample spaces bathroom. Yes.3/ Room service— awful. The staff are not knowledgeable and they simply don’t know how to prepare a table. The jam and butter were served in espresso cups and the jam, which looked like ketchup, was a basically a strawberry smoothie— watery, not sweet— it wasn’t jam. Over easy eggs were over hard... you get the picture.4/ If you play a harp, you will be very happy because the junior suite had one. Not sure if it was tuned or not.5/ Bathroom dinner had two settings- on and off. Not much of an attenuator.6/ No double lock on the door or a way to notify staff that you didn’t want to be bothered.7/ If you’re a vegetarian— be sure to check what includes meat because the “eggs Florentine with spinach” sit on a thick slab of pea meal bacon. I certainly hope that Windsor Arms will pick up its game. Toronto has so few true 5-star hotels and while the hard product in this hotel could be easily brought up to a 5-star standard with some quick fixes, it seems that it’s the soft product that usually suffers the most at so-called 5-star hotels in Toronto.",
      "rate": 2.0,
      "tripDate": " December 2018"
    },
    {
      "title": "Afternoon tea at the Windsor Arms Hotel",
      "text": "As a Brit in Canada, I was looking forward to a traditional afternoon tea experience, fine finger sandwiches, scones and a wide selection of teas. What we had was exactly that. The decor was beautiful, although my tea pot had at least 3 rather large chips in it. I don't mean to sound like a snob however, if you're selling Afternoon tea at the price they are, I wouldn't expect a tea pot with chips.The food was delicious, 2 scones per person (one plain, one raisin), 3 different sandwiches with each person having 2 (chicken, smoked salmon and caviar, vegetable pate) and 4 petit fours. The service was rather disappointing, we had extreme difficulty catching the eye of our waiter to get more hot water for our tea and cream for our scones (which never arrived). When we askes for a clean knife so we were using the same knife for andwiches as we were for cream he looked thoroughly perplexed. We had the complete tea which included a glass of sherry - a very nice touch, although with the total price at just over $100 fo the 2 of us I did think that this was a price a little too high for the overall experience. I think this experience would be best if you're trying to impress people with a cultural experience.I've marked the overall experience as very good as the quality of the food and tea selection made up for the other down points.",
      "rate": 4.0,
      "tripDate": " November 2011"
    },
    {
      "title": "Where did all the FRETTE go?????",
      "text": "Here is my take on up-scale hotels in Canada........When they first start off, they impress guests with nothing but the finest - from FRETTE Linen to Reynaud French China.Once they build up a reputation, they go and look for cheap imitations, hoping guests will not notice that they have started to compromise on quality.5 years back, I stayed at the Windsor Arms for the first time. My wife and I couldn't get over the fact that they had luxurious FRETTE bathrobes, towels, and bed sheets. Stepping out of the shower and wrapping yourself in the luxurious feel of a FRETTE bathrobe is an experience one simply cannot forget. Curling up in bed to sip your morning coffee with the feel of those smooth silky feel sheets is paradise.But now look at the Windsor Arms - shame on them - where do they source their linen from??? Looks like it is made in some sweat shop in a back-water.Please please please management - please listen to the feedback from your clients. The standard has gone down so much in the last year. I don't think that we would ever stay at the Windsor Arms again, till they raise their standard.",
      "rate": 1.0,
      "tripDate": " November 2010"
    },
    {
      "title": "Perfect Location, terrible hotel and service",
      "text": "I booked the romance package at $700 for our 15 year anniversary. For that price had high expectations. What a disappointment. The staff were shabbily dressed and generally inattentive. The spa host was unfriendly, but the spa staff were excellent and we did have a terrific couples massage. Out room was nice, but definitely underwhelming, for the price. The package included champagne, but it was just a glass each. I would have overlooked this mediocre, nickle and dine hotel experience if not for the breakfast. All we were offered during the breakfast were some muffins, danishes and croissants by a very unfriendly waitress. I cannot believe that there any sane management personnel would allow someone like this to work at their so called high end establishment. When my wife asked for a croissant, she was told they were out. For $700, how can you be out? No apologies, nothing. Then I asked if I needed to sign anything when we were ready to leave, to which she responded with a shake of here head  and walked off. talk about the royal treatment. Not!!!Furthermore, I booked the Windsor Arms because the website says they have a piano bar, which is open on Wednesday Thursday nights, I believe. It includes a tapas menu as well. We were very much looking forward to attending. However they replaced the piano bar with a tea room over a year ago, but the web site still have not been changed to reflect that change. Unbelievable to say the least. When I brought it up with the hotel, they just blew me off. I would never have booked if I have known there was no piano bar. I would have instead booked the Park Hyatt. Talk about regret.Trust me. Do not go to this horrible join. We ended up checking out and going to Jack Astors for lunch. The service was outstanding from start to finish and the bill was $23.  Hmmm.",
      "rate": 1.0,
      "tripDate": " August 2010"
    },
    {
      "title": "Never again!!!!!!!!!!!!!",
      "text": "NEVER AGAIN will I stay at this over-rated hotel.The room prices are atrocious for a so-called 5-star hotel.Greeting at the door was nice. Front desk amicable.Very ghostly feeling with no punch to this hotel.The setting dull, old. Looks like they have let the Arms go.When my wife and I went into the steak restaurant we were greeted with an abrupt 'we are not open'. Not an inviting atmosphere.Staff were hospitable but felt as if they were not entirely FOR the hotel.I would never ever go back.Again the room prices do NOT justify the stay.",
      "rate": 1.0,
      "tripDate": " June 2008"
    },
    {
      "title": "A felt like a true VIP",
      "text": "I visit Toronto at least once a month and usually stay at the Four Seasons. On my last visit the Windsor Arms was recommended to me by a resturant in the area - I am extremely glad they shared this \"Gem\" with me. From the moment I arrived to the moment I left I was treated as though I was the most important person in the world - and I am  - to me.I cannot imagine staying anywhere elsenow.The rates are higher than most hotels but you pay for what you get. I loved the personal attention I got from all the staff and found them to be personable and responsive to my needs.I highly recommend the hotel",
      "rate": 5.0,
      "tripDate": " May 2006"
    },
    {
      "title": "A beautiful boutique hotel",
      "text": "The spa at the hotel is magnificent. The service is quiet and polite, and the rooms are extremely good, if a bit small. One is placed in a very good location, quiet, and near everything and the hotel is recovering its glittering reputation from the 1970s and 1980s for the stars. In terms of technology, decoration, linens, and all that, the place is superb.A curiosity is the main dining room.  Empty most all the time, and not a place to see or be seen as it once was as the Courtyard Cafe. For some odd reason - perhaps the heavy decoration and the bizarrely massive winelist - which no-one orders from and makes no sense other than putting a burden on hotel's owners for no reason - there is a lack of imagination in bringing in the best of Toronto's society and visitors and generating the kind of energy which was once in this place. After eight o'clock the room is occupied scarcely by two or three couples, and the room is designed for seclusion rather than entertainment.  One wishes that Wolfgang Puck or the chap at Claridges would come here and put some energy into the place.  Bring in some bespoke wines and add some glamorous parties or events, and bring back chatter and great impressive desserts and a crowd. There should be far more numerous social occasions here, and more grand events and parties.  Sad to see a grand dining room empty!The hotel is interesting in that above it were the first condominium residences in the city that were priced over $15 million - so there is a sense that this place should be more talked about than it is.Toronto is a beautiful city, and the hotel is within a five minute walk of the finest shopping area in Canada - Bloor Street and Yorkville. Taxis are available within seconds, the concierge service is swift.",
      "rate": 5.0,
      "tripDate": null
    },
    {
      "title": "Wonderful Again",
      "text": "Just stayed for one evening on back to back Saturday nights. Have also stayed a few times prior. Location is fantastic, staff is friendly and we love the old world charm and size of the property. Keep up the good work.",
      "rate": 5.0,
      "tripDate": " September 2020"
    },
    {
      "title": "High tea",
      "text": "Went there for a lovely girls pre wedding get together The high tea food and presentation was great. The hotel it’s self is lovely with beautiful old decor. It feels like you are going back in time. All of us girls/ladies had a great afternoon.",
      "rate": 5.0,
      "tripDate": " February 2020"
    },
    {
      "title": "They don't make ear plugs big enough",
      "text": "Needs to decide whether it is a luxury hotel or a night club. Despite their protestations, we cannot have been the first to complain about the thumping base on party nights - all the way to the top floor - nowhere to hide. I do not believe they do not know so must assume that they simply do not care. Lots of \"we'll turn it down\" but they didn't and definitely put the needs of the zillions of wedding guests before their room guests. Also, on private party nights, key facilities - the bar and the dining room - are closed. Not that anyone mentioned that when I phoned in advance to make a dinner reservation. \"You don't need to reserve if you're a guest\" they said - the real reason is that there was no room at the inn. And corridors packed with drunken boars, shouting in time to the thumping bass is not really what I pay top rate room prices to enjoy. Just don't.",
      "rate": 1.0,
      "tripDate": " April 2005"
    },
    {
      "title": "Stiff and cheesy",
      "text": "The hotel itself is acceptable. The rooms are large, if a bit conservative (they would have been cutting edge 80 years ago when art deco was just emerging). The bathroom was very nice, but again, it left me feeling a bit cold. The overall feeling is of a hotel that was embalmed. The cause of this may be that they are stretching to make the hotel fee older than it is. The reality is that the original Windsor Arms was torn down: this is a copy of the original except for one fireplace that was retained. They talk about entering through \"our century old portals\" which are really about 10 years old. This effort leads to some laughably cheesy moments: the elevators are done up as a library. But of course there is not any room for books. Instead, they have cut the spines off of a bunch of old books and glued them to the walls. They then covered the spines with glass doors and locked them (to keep us for stealing the spines no doubt). Beyond this, I had the feeling that they see their guests as resources to be mined for every possible dollar. Regardless of how much money one has, no one wants to feel this way. As an example, I called down and asked for two wine glasses to be brought to the room. When I checked out, I noticed that I had been charged $9.32 plus tax for this honour. I was outraged. I stay in luxury hotels all the time, and I have never been charged for the use of a glass. I expressed my indignation politely to the front desk staff and he simply looked at me, without saying a word. I waited for a few seconds, expecting something. When I realized that he was just going to stand there and look at me, I signed the invoice. I now regret this decision. I should have taken a stand against this petty exploitation. I would far rather stay in the four seasons, Hyatt or the Germain (a truly innovative hotel experience).",
      "rate": 2.0,
      "tripDate": " November 2005"
    },
    {
      "title": "Thieves",
      "text": "Do NOT stay here.  They billed my credit card an extra night despite my cancelling in accordance with their policy.  Not only would they not rectify the situation, they would not even return my calls.  Awful service.",
      "rate": 1.0,
      "tripDate": " December 2005"
    },
    {
      "title": "very disappointed",
      "text": "Again the noise is a real problem here - much worse is the patronizing attitude of the owner when you have had a night ruined because of the bass from a private party which ran long into the night, and the half-truths from the staff about how long the noise would go on, as well as numerous other glitches in the service which you shouldn't suffer in a relatively expensive 'boutique' hotel.  Perhaps the priority of the management should be with the guests staying at the hotel, but this doesn't appear to be the case. I couldn't wait to leave.",
      "rate": 2.0,
      "tripDate": " April 2005"
    },
    {
      "title": "Avoid booking wedding here",
      "text": "Unfortunately, I have to include my stressful experience of booking a wedding ceremony and reception here. I now understand why the Windsor Arms is not exactly known for weddings. Kitchen messed up 2 out of 3 entrees at the reception (the fish and vegetarian dishes) by substituting cheaper ingredients. We had this in our contact and also sampled what was supposed to be served at the tasting. 2 days before the event they asked for more money for alcohol claiming they would stop serving alcohol at the event if we didn't pay. The original agreement was a consumption bar, with us paying the extra if we went over our estimate. We paid the extra $2000 up front and they were supposed refund us the extra back whatever was left over. They have not provided us an account of what was consumed and ignored emails/phone calls for the past 2 months. The staff we have dealt with have been very passive-agressive, I can't believe the business practices of a hotel held in such high regard. We dealt with no fewer than 4 catering managers from the time we booked until the day of the wedding, with no continuity whatsoever. Many complimentary things which were agreed upon at the beginning were not honoured, such a room to get hair/makeup done in, use of the hall for a rehearsal, tasting for 4, and tealights at each table. I ended up having to book an expensive suite for the night before just to ensure I would have a hassle-free place to have getting ready photos done. We couldn't use the hall for a rehearsal as they kept putting us off and then booked a high school prom the night before. They told us the tasting was only for 2 people and any additional guests would have to pay $100 each. I would say the hotel is fine for dinners/hotel stays/spa, but avoid booking any type of event here unless you don't care about money or people honouring commitments.",
      "rate": 2.0,
      "tripDate": " June 2014"
    },
    {
      "title": "Poorly maintained; rude owner/manager; outstanding location but there are other hotels",
      "text": "This \"boutique\" hotel has one thing going for it: It is in an excellent location. That's it. On the downside, the hotel is not maintained well, the common areas including the hallways are dusty and in need of paint, as are the guest rooms. The air conditioning is not reliable, and the staff is neither helpful, nor accommodating. The owner, George Friedman, who is also  the \"manager\" is downright rude to guests. We arrived on a Sunday and checked-in. The small lobby was packed with guests waiting to enter a wedding in the ballroom which is entered from the lobby.  Within a few hours there was loud music blasting through the entire property. In our suite on the 3d floor you could hear the party and the pulsating bass beat.  I went to the lobby to inquire as to whether they could address the noise and how long it would continue for. The desk clerk said that there was a wedding going on and there was nothing that could be done about it. The noise would continue until midnight.  When the reservation was made, no one told us that this event would be happening at the same time. We were offered another suite on the 4th (highest) floor. We looked at it, but the sound was the same.  I went to the front desk and asked to speak to the manager. The clerk put me on the phone with someone, but that person could not hear me because the music was too loud. I was told that I would receive a call back on my cell phone after I stepped out of the hotel where it was quiet!  A clerk called and said that a credit would be applied to the room for half the nightly rate for that night.  I said that this was not acceptable, and asked again for the manager.  When Mr. Friedman called me back, he told me he was not doing anything more and that \"you did not rent the lobby, so you have no right to complain about the noise\". I told him that the noise pervaded the entire property and I did not appreciate his rude behavior toward me, the customer. He simply did not care and told me it would quiet down, he is doing nothing more, and hung up on me. When we returned after dinner the air conditioning was not working in the suite. I called the desk and asked for help. The desk clerk came up and told me that the thermostat needed to be lowered. It was set to 72 and he set it to 60. He said it would work in a few minutes. It did not. I called back and asked for an engineer. I was told there was none. When I complained the following morning to the desk, I was told that the air was actually out in multiple rooms and someone would be fixing it later that day. The air was repaired. The suite came with a \"continental breakfast\" which was of very poor quality and choice. On the second morning of our stay there was a mix-up and the same waiter who had attended to us the prior morning set out menus and we placed orders. He then charged us for the same, telling us it was our fault, and that only the continental breakfast was included with the suite. The price of the continental breakfast was the same as the items ordered. I went to the front desk again, and asked for the charge to be removed. The waiter came to the front desk and told the clerk that it was our fault! Eventually, the charge was removed.  The service in the dining room at breakfast was poor, and there were also complaints from the other guests present the following morning.The gym in the hotel has a fair amount of equipment, but is cramped and the air conditioning was not on in the gym at 5 pm in the afternoon.  No one was present in the adjacent \"spa\" at that time.This hotel apparently enjoyed a good reputation in the past and it was recommended to us by friends. However, it's heyday has clearly ended and the rude owner/manger insured that the experience was not the least bit welcoming.",
      "rate": 1.0,
      "tripDate": " September 2019"
    },
    {
      "title": "Horrible Hotel-Avoid it",
      "text": "I don't know where to start.  I normally stay at the Four Seasons, but this time I decided to try out this hotel. Big mistake.This hotel is expensive and is an aweful place to get a good night's rest. The noise coming from the bar is so loud, that I couldn't sleep. The front desk couldn't move me to another room, so I found myself walking around Yorkville at 11:30PM, getting almost no sleep that I so badly needed for an important  meeting I had the next morning.Room service was bad. The food showed up 40 minutes later and it was cold. Also, I found this hotel lacks maintenance and is very dirty. There was dust everywhere in the lobby and the carpets were old and had stains all over. My room was nothing special, for over $400 a night, you would expect much better.The staff was ok, I guess they had to work with what they had.Do yourself a favour and don't go to the Windsor Arms. Next time I'm in Toronto, without a doubt,  I will stay at the Four Seasons.",
      "rate": 1.0,
      "tripDate": " January 2007"
    },
    {
      "title": "Very disappointed in this hotel",
      "text": "My companion and I were put into a room directly above the dance floor and band, which band ran loud and long. Registered complaint, but all we got was a sneering smile and a shrug.. Since my companion and I usually stay at the Four Seasons, we found here (on a trial basis) a (relatively) poor choice of properties. Suggest that if one is bound on staying in this property, so stipulate that they NOT ACCEPT A ROOM ON THE SECOND FLOOR ABOVE THEIR DANCE FLOOR.",
      "rate": 2.0,
      "tripDate": null
    },
    {
      "title": "Family High Tea Ruined",
      "text": "Lovely high tea today, spoiled by the fact that they increased their prices over 50% without advising anyone.  So not worth the money for pasty  sandwiches.We booked in October, advised of an amount, they confirmed our booking in an email.  They then increased their prices Nov 1,  increased again for a \"holiday price\". Nothing mentioned in the menu outlining the $30pp increase.  Very disappointed that no one had the courtesy to advise when we were seated of the 'revised price'. When speaking to the manager, she basically said 'too bad'.  Disgusting.  We were looking forward to this treat for months and it was completely ruined. #windsorarmshoteltoronto #scammed #thanksfor thechristmastea #sorryaboutyourtip",
      "rate": 1.0,
      "tripDate": " December 2021"
    },
    {
      "title": "Mothers Day Scam",
      "text": "Came for Mother’s Day brunch for 135 per person. It was extremely underwhelming and seemed like zero thought was put into presentation or service. Very casually dressed Managers just stood by waiting for your payment never inquiring how the service or food was. I’m pretty sure the valet man was smoking directly outside the front doors of the hotel as well. Charging what they did for this brunch is embarrassing. You could tell other tables were unhappy as well. Also in this day in age with allergies your labels on food should have whether or not it has gluten, dairy, nuts, alcohol. Etc. I have seen better buffet set ups at 3 star hotels that offer complimentary breakfast.",
      "rate": 1.0,
      "tripDate": " May 2023"
    },
    {
      "title": "Avoid this over-priced throw-back to the grand old 1980's",
      "text": "We celebrated our wedding at the hotel 20 years ago and it was fine at the time but visited recently for our anniversary to enjoy a visit to the spa and lunch afterwards and were sadly disappointed. Ever since they added the private residences, the rest of the hotel has gone downhill - big time. The spa hasn't kept up with the times and is wildly over-priced; ditto for the restaurant, which features the same decor from 20 years ago. There are so many much better options in the Yorkville area now - avoid this tired old pile of crap; no one should pay top dollar for such a lousy environment.",
      "rate": 1.0,
      "tripDate": " October 2021"
    },
    {
      "title": "Tired old lady in very trendy handy location",
      "text": "This hotel is classified as 5 star but that is a stretch. I was in a deluxe one bedroom suite. It’s a very old historic building which does offer some charm but the odd hat stand in the entrance is very tired looking. The checkin took a long time and getting a key seemed time consuming. There was an absence of baggage help. After taking a very old musty elevator to the 3rd floor I entered into a dank dark corridor. At that stage I was thinking of leaving. I was therefore relieved when opening the door to see a nice room with a rather better smell than the corridor. These rooms are traditional and spacious. Bed was quite old a think. Bathroom was quite good. Furniture in the lounge area was aging as was the carpets. Room was very clean. There are only two elevators that staff and guests use. It was adequate but definitely not worth the +700$Hotel is well located right off Bloor st with easy access to transport and high end shopping.",
      "rate": 3.0,
      "tripDate": " September 2022"
    },
    {
      "title": "A beauty no more!!",
      "text": "Had to be the dirtiest hotel I have ever stayed in. There was a distinctive odour upon entering the hotel that followed you up into the room. The room itself was completely disappointing starting with the horrendously stained rug as we entered the room. The rug was so old it was rippling throughout. The furniture was dated and poorly maintained. Chipped and threadbare. The bathroom was the worst the sink surround was so dusty and dirty but the tipping point was the bandaid, used bandaid in the bathtub. They offered to clean the room but there is no cleaning possible that would erase the memory of this absolute disappointment. Disgusting",
      "rate": 1.0,
      "tripDate": " February 2023"
    },
    {
      "title": "High Tea disappointing",
      "text": "Save your money for High Tea, we were thinking we were going to have a English High Tea, no clotted cream, or any real cream, no butter, wraps with some questionable fillings. Very disappointed. The cakes, were less than exciting. I have experienced High Tea all over the world, this was probably the worst. Not a good Birthday experience.",
      "rate": 1.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Never again!!!",
      "text": "Horrible experience, I went there for the high tea experience for my birthday. Some items from the savoury menu were missing. My friend found a hair in her egg sandwich, they took away her plate for like 20 minutes only to come back with tomatoes and lettuce sandwiches. The sweets and pastries were not fresh. The service was horrible, at the 2 hour mark, as we got ready to wrap up, the waiter rushed us to leave although the place was dead empty. They were in a hurry to close. I will never go back and we didn’t even get compensation or a sorry for the hair in the sandwich!!! Total disaster.",
      "rate": 1.0,
      "tripDate": " October 2023"
    },
    {
      "title": "Not a 5 star hotel",
      "text": "Our carpet was dirty.  The toilet paper roll holder was broken.  The bathtub was cracked and chipped.  The bathroom sink drain was broken.  The hot and cold in the shower were reversed (but nobody told us).  Staff were indifferent bordering on rude.  Not a 5 star hotel or experience.  It may have been grand in it's day, but that day is long, long gone.  Bedding was nice.",
      "rate": 2.0,
      "tripDate": " October 2023"
    },
    {
      "title": "disappointing",
      "text": "stayed here for 1 night as a luxury.   The room is beautiful but the shower needed to be run for 20 minutes to get any hot water.  The TV didn't work and there was a flashing light in the window all night.Covid or no covid this is not acceptable.",
      "rate": 2.0,
      "tripDate": " July 2020"
    },
    {
      "title": "High tea in style",
      "text": "Great staff with smiles and positive attitude. high tea was great and what was even better was that they accommodated us with private section! Thanks so much for making it happen with so much ease. Overall 5/5.",
      "rate": 5.0,
      "tripDate": " October 2019"
    }
  ]
}