{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Woodbine Hotel & Suites",
    "url": "/Hotel_Review-g155019-d946772-Reviews-Woodbine_Hotel_Suites-Toronto_Ontario.html",
    "priceRange": "$ (Based on Average Nightly Rates for a Standard Room from our Partners)",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "3.0",
      "reviewCount": 359
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "30 Vice Regent Blvd",
      "addressLocality": "Toronto",
      "postalCode": "M9W 7A4",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-s/01/19/bb/02/etobicoke.jpg?w=500&h=-1&s=1"
  },
  "description": null,
  "featues": [
    "Free parking",
    "Free High Speed Internet (WiFi)",
    "Free breakfast",
    "Business Center with Internet Access",
    "Conference facilities",
    "Newspaper",
    "Non-smoking hotel",
    "24-hour front desk",
    "Parking",
    "Wifi",
    "Breakfast buffet",
    "Banquet room",
    "Meeting rooms",
    "ATM on site",
    "Express check-in / check-out",
    "Air conditioning",
    "Housekeeping",
    "Safe",
    "Microwave",
    "Refrigerator",
    "Flatscreen TV",
    "Non-smoking rooms",
    "Suites"
  ],
  "reviews": [
    {
      "title": "No POOL, would do in a pinch if you need a place",
      "text": "When I booked this it clearly said POOL There was no pool needs to be taken off the website.  Room was clean, not enough towels for 4 people. There were only 2. I did not see a problem with breakfast, it was pretty much hot breaky.  Sat morning there were home fries, scrambled eggs, bacon ( which needed to be cooked more so I didn't eat it ) There is a machine to make your own waffles, bread for toast and I believe hot dogs ?  Muffins ( They were blueberry that is why they looked the way they did, they were not moldy ) juice, coffee, tea.  There was no fresh fruit which was disappointing.  1st night wedding was awakened at 2am by the wedding party good thing they went to their rooms and settled down. 2nd night another wedding was at their venue never heard a peep.  When we did come back on the Sat around 7 our room keys didn't work.  Person at the front desk was apologetic and gave us new ones. Also asked for decafe and he delivered 4 pkgs to our room since there was none at breaky.",
      "rate": 3.0,
      "tripDate": " September 2022"
    },
    {
      "title": "They Don't Provide Suttle Service",
      "text": "I have stayed at this hotel on many occasions when I needed overnight accommodation near Pearson Airport.This time I found that the facilities lived up to my expectations as regards the helpfulness of staff, cleanliness of facilities, and adequacy of breakfast options.My one complaint concerns their falsely advertising shuttle service from/to the airport; when I called on my arrival at Pearson, I was told they don't offer such service any more (although they still advertise it on Agoda for an additional cost), and the only way I could make the transfer was by taxi, which cost $40 each way, including tip.For this reason I cannot recommend this hotel if you are relying on shuttle service, especially when others in the area offer it for free.  If you have your own transport to the hotel, it is a good bargain for those who don't require 5-star accommodations.",
      "rate": 4.0,
      "tripDate": " April 2024"
    },
    {
      "title": "Very rude Front desk officers",
      "text": "The front desk officers are very impatient on the phone, they drop the phone on you abruptly, not friendly at all, and use rude comments like: what else do you want? The other house keeping staff are occasionally rude too. Sort of, I found most of their comments to be disrespectful. No one offers you options, or care about your comfort, Its all about their job, and giving you the rules.The rods in the bathtub are rusty, I found insects in my bathtub on check in. The dresser drawers were not clean, with dirt in them. In general, the house-keeping was not thorough. My bed was not made, but covered up with nice sheets.",
      "rate": 2.0,
      "tripDate": " February 2020"
    },
    {
      "title": "Very rude front desk service and unclean",
      "text": "I ask for a different room. The room I had, I was only in the room for maybe 2 hours, and the heater was not working. So I asked if I could get a different room because I was cold. The front desk would not give me a new room right away. The person checked the heater and still it was not working, I said this does not satisfy me so can I get new room. At first, front desk person would not agree to give me a new room, until I said that I would like my money because I wanted to stay somewhere else. Then he finally agreed to give me a new room. As he leaving he makes the comment, \"you couldn't survive in the cold.\" The front desk person's name was Hivam.",
      "rate": 1.0,
      "tripDate": " November 2021"
    },
    {
      "title": "STAY AWAY!",
      "text": "Room was dirty, filthy carpets. Water leakages from roof in the hallways. Receptionists rude without any concept of service. I payed the room rate through Expedia. Receptionist made me swipe my credit card for 150CAD for a security deposit that was to be cancelled upon check out. Five days later my balance showed that they charged my card 117CAD - they actually charged the room rate a second time. I called them and complained. They acknowledged the mistake and promised a refund. They never paid me back. Now I must use energy following up this case via my credit card provider. Total dishonest staff and management. STAY AWAY.",
      "rate": 1.0,
      "tripDate": " November 2022"
    },
    {
      "title": "WORST HOTEL EVER!!!",
      "text": "I stayed in this hotel with my friends. They gave me an occupied room for the second night…It was indeed a DOUBLE CHECK-in  scenario and I was really disappointed and decided not to get my room and requested for full refund I was trying to reach out with the manager to talk about the issues however the manager is always not around whenever I call them, whether in the morning, afternoon and night time. It seems he’s hiding to the customer and afraid to settle any issues and complaints. After 5 days, I learned that they still charging me as No-show because I didn’t get my room despite of their negligence giving me the occupied room. Really SUCKS experience in this hotel!!!!!",
      "rate": 1.0,
      "tripDate": " September 2023"
    },
    {
      "title": "I liked it especially at the price",
      "text": "Luckily I read quite a few of the very low rated reviews of this place after our stay. This was the third hotel we stayed in during this trip. It was by far the best and similar in price to the worst of the 3. The main thing I noticed was that the room was cool enough with an AC that was very quiet. The breakfast was okay, and I traded the cost of a breakfast for two for there not being a shuttle. I had a rental car to drop off on Rexdale and it was a quick walk back to the hotel. A funny thing is the view from our room was of the breakfast room. But I noticed I seldom look out the window of a place and usually keep the curtains closed. The room came with a king bed which was a plus over the last two places we stayed. I stayed a number of times to the southwest of the airport at a place with a shuttle but I think this will be my new hotel of choice when needing to fly.",
      "rate": 5.0,
      "tripDate": " July 2023"
    },
    {
      "title": "Truly Horrible Hotel",
      "text": "Literally the only time I've ever felt strongly enough to leave a review. Worst hotel I've ever stayed at. First, we get to our room and it reeks of cigarettes despite more no smoking signs I've seen in any hotel. Second, when we ask to get a new room they didn't have another with two beds, one of us had to sleep on the pullout sofa (fine, but not what we paid for). Third, the sheets had stains, the pillows were horribly lumpy, and no hot water in the sink. Forth, when we went to breakfast all the tables had a line of WET PAINT! Are you kidding me? One of us had a sweater stained and when we brought it to staffs attention he did not care, all he said was there are renovations (cool, I don't care and that doesn't fix anything but sure is a fun fact). He told us he would get the manager and never came back. We had to go back to him at the front desk and all we got was the managers phone number. Save your money and go literally anywhere else.",
      "rate": 1.0,
      "tripDate": " March 2023"
    },
    {
      "title": "Beware room 124",
      "text": "By no means take room 124.. your view out the window is a door to outside so window has to be closed the whole time. Lamp shades are super dirty and gross. Blankets on the bed are super thin. NEVER AGAIN!",
      "rate": 1.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Zero service",
      "text": "If there's a mistake on your reservation don't expect any help or consideration from this hotel.  After Booking.com screwed up the date I was to stay here - they said the hotel could take care of making the change to the proper date.The hotel did nothing, and proceeded to put through the $161 charge for a room I could not use.Zero customer service.  I'll never again consider a stay here.",
      "rate": 1.0,
      "tripDate": " November 2023"
    },
    {
      "title": "Scary",
      "text": "I entered the parking lot & immediately felt uncomfortable - the signs outside weren't even lit - it was like a ghost town - Entered the lobby to an off the street dressed person (jeans & sweatshirt) wanting to check me in. I asked for a room facing the outside but told that was impossible. My room faced an interior banquet room (under construction) which is strange. There were several sketchy people hanging and just sitting in the lobby area watching TV and checking out the check in's. I immediately felt that this wasn't right- then I went to go to my room and some homeless looking man was following me to my room & location....I entered the room - I could hear every word being spoke from the room above & beside me. No privacy at all....As a single traveler I did not feel safe at all....under no circumstances would I stay there all night!!!! I immediately contacted the booking group---they were fabulous and corrected my reservation and had me moved...the second place was pot notch.......don't .DONT go to this location - stick to a chain with standards.",
      "rate": 1.0,
      "tripDate": " January 2015"
    },
    {
      "title": "Contaminated water supply and no hot water!!!",
      "text": "Booked a three night stay starting on Friday. On Saturday, the toilet stopped flushing and brownish smelly cold water coming from hot water taps. Complained to front desk and was informed system was being worked on. Met repairman and he checked the toilet and said nothing was wrong and I shouldn't be drinking tap water anyway and when I asked about brushing teeth, I received no answer. When back to front desk and demanded another room, which I got but was informed that whole hotel had no hot water and they were changing the pipes???? Checked during the night and in the morning I ran the hot water supply in the tub and sink. The water was dirty and left black sandy substance in sink and tub! Went to the front desk and the clerk came to the room and took pics and said she would get hold of manager. About an hour later, I checked and no answer. I asked the clerk if she would shower or drink the water and she said NO! I called the Health Dept. and was shuffled to various sites as government doesn't work weekends and unless someone got sick and went to hospital, then nothing could be done???? I called Hotwire to let them know the situation and they offered to move me to another hotel but weather was poor and I declined. They offered $25. off next stay and I declined that also. I am going to see if I charge back on my credit card and will not use Hotwire again. WHO knows what was in the water and if they installed a used and dirty boiler to replace broken one. BEWARE of this place and do NOT drink the water.",
      "rate": 1.0,
      "tripDate": " January 2015"
    },
    {
      "title": "Ripped off",
      "text": "Guest beware.  I booked this hotel through Expedia.  When I arrived at the hotel, they ran my credit card for incidentals.  When I was checking out the front desk, said I had a $ 0 balance and verified it had been paid through Expedia.  Well they did run my credit card in September and again yesterday 10/12/12.  So far, I have paid over 1,243.36 on this room.  $ 750.00 of it is unauthorized.  My credit card company tried twice today to conference call the manager.  He wasn't there on the first attempt so we called back and they said he was in a meeting and would call us back.  We tried again after 3 hours and he was gone for the day.  We were told to call back tomorrow.  I paid for this room 3 times, no call back and no Manager on Duty?  What hotel doesn't have a Manager on Duty and when he is on duty only there for 3 hours?  Sketchy.  I have canceled my credit card.  What a hassle right?",
      "rate": 1.0,
      "tripDate": " September 2012"
    },
    {
      "title": "Disappointed",
      "text": "Trip Advisor reviewers, you mislead me!  You all gave this a \"very good\" rating; no way.   I am so disappointed with the quality of this hotel.  The hotel feels and looks old, worn and dated.  I will list the multitude of things that are wrong with my room: the sheets are very thin (120 thread count at best), the furniture is chipped, there are stains on the carpet, a cob wed is in the corner by the door, no safety latch on the door, and stains on the wallpaper.  Also, the hotel hallways have no placards on the walls to indicate the direction of hotel rooms.  Unfortunately, this hotel was booked / prepaid for on hotwire so I am stuck in this hotel for the next few days.  The avg rate per was for us was $100.  It's worth $50.00 / night.",
      "rate": 2.0,
      "tripDate": " September 2012"
    },
    {
      "title": "Great Hotel, Great Price, Lovely Staff!",
      "text": "I stayed here with my partner for 13 nights from the 13th June 2012-26th June 2012 as we were in Toronto visiting family. I'd read reviews on here saying that the hotel was very clean and there haven't been any negative reviews - and rightly so as I don't know what this hotel could be criticised on other than the parking situation when there are functions on. There are three big halls on the property that are owned by Woodbine Hotel and Suites and are obviously very popular as there was an event (either a prom or a wedding) on every single night. Luckily the hotel rooms are not above these halls so you're not disturbed by the constant partying however the car park does get very full so if you hire a car you may struggle to park when there are events on. The hotel staff said that there is a plan in place to segregate the car park so there is an area of the car park for guests staying in the hotel only but they didn't say when this would happen. The rooms are very clean and very nice - we had a king sized bed in ours and the room was really spacious and the bed was really comfy. What confused us was the size of the pillows - they are square and rather small but we were later told that you have to punch them to get them into an oblong shape! The rooms were cleaned thoroughly and made up on everyday of our stay and 2 new bottles of water were put in our room everyday. Our room faced outwards and was at the back of the hotel which meant that it was not noisy unlike the front of the hotel whch faces the busy highway. There are rooms that face into the banqueting hall with the big chandelier where you eat breakfast but I can only imagine these are noisy especially when there are children running around in the hall early in the morning at breakfast time plus there would be no natural light and little privacy so I'd keep your curtains closed! For the english people who love tea there is no kettle in the room nor can you ask for one from reception however in the dining area there is free tea and coffee all day and night which you just help yourself to and take it back to your room. This isn't too bad when you're on the ground floor but is a bit of a palava when you're on the floor above and have to come all the way downstairs to get a cup of tea. We had bought our own tea bags and we boiled water in the microwave instead. The breakfast included in the price was better than we were expecting as for a continental breakfast we weren't expecting any hot food but there was sausages and scrambled egg, toast and cereals and fresh cut up melon was put out every day. After 13 days of eating the same thing it got a bit boring but most people only stay at this hotel for a couple of nights so for them it's perfect. But don't get expecting the finest china as we only ever saw polystyrene plates and plastic knifes and forks to eat your breakfast with. Still we can't complain as it didn't cost us anything and it did the job. There's not really much to do around the hotel, it's situated on the busy 6 lane Highway 27 and is a 10 minute walk away from the Woodbine Shopping Centre and across the road from the Woodbine Racetrack and Casino. We ventured over to the Woodbine shopping centre which has a cinema inside on one evening and also walked to Fortinos Supermarket for snacks for the room which is just a little further than the Woodbine Shopping Centre on the opposite side of the highway. Regarding eating, there is a Tim Hortons (which sells coffee, lovely smoothies, bagels, doughnuts etc) less than a 2 minute walk away from the hotel and other than that the nearest place to eat which is worth going to is The Mandarin. This is on the opposite side of the road to the Woodbine Shopping Centre and next to Fortino's Supermarket. It's an all you can eat buffet offering Roast Beef Dinner, Chinese, Pizza, Seafood, Salad Chips and lots more. There's something for everyone and they have great desserts. There are the usual fast food eatery's in the food court of the Woodbine Shopping Centre such as KFC. If you want to go anywhere else you'll need a car as the other restaurants are about a 5 minute drive away on the Rexdale Boulevard such as Swiss Chalet, McDonalds, KFC and Pizza Hut. In terms of being close to the airport it's not as close as I was expecting. It cost us $28 in a taxi each way to and from the airport and if you want to go into Downtown Toronto to the CN Tower it's about a 40 minute drive. We also went to Wild Water Kingdom which is Canada's Biggest Water Park and is about a 10 minute drive away from the hotel by taxi and this cost us $18 each way. Overall we had a great holiday and this was made better by staying in a lovely hotel. The staff were always helpful and being a disabled person the hotel is very accessible although I did request a walk in shower and not a shower over a bath but I was given a shower over a bath. The sides of the bath were not too high though which meant that with a little help I could step over the side and I didn't want the hassle of moving rooms. There is free Wifi and a safe in the room which is big enough to store your laptop in but there is also a computer in the lobby for guests to use although there is no printer so don't leave it until then to print your flight tickets off! It's a no frills hotel and is perfect if you're visiting family in the area or for an overnight layover but not if you're planning you whole holiday from there as it's not really near anything and you would need to hire a car. There was some building work at the back of the hotel while we were there and the staff told us that they are building a pool and a gym but did not say when this would be open. If you have any questions about the Woodbine Hotel and Suites just comment on my review and I will get back to you. But I'd say not to hesitate when booking this hotel as it's a great little hotel and you get a lot for your money. Finally it seems that the hotel's website keeps back some rooms for the events that they host and it is most busy on Saturdays which meant it was showing that they didn't have any availability for the two Saturdays that we wanted to stay, but if you try booking through expedia you'll usually find the availability that you want. I spoke to a few people staying in the hotel who had said that they had gone through expedia as there was no availability on Woodbine's own website. Thanks for reading and I hope it's been helpful to you.",
      "rate": 5.0,
      "tripDate": " June 2012"
    },
    {
      "title": "Mixed Feelings",
      "text": "Pros: 1) On the website it states continental breakfast, but it's actually a full breakfast, which was good. 2) There is a bus that comes to pick you at the hotel if you want to take the Niagara Fall Day and Night Tour 3) It's maybe 20 minutes from everything and the drive isn't bad. 4) Near the Airport Cons: 1) They have bedbugs. My arms and legs have bumps everywhere 2) If they give you room 228, ask for another one. You are above the cleaning station and the dryer goes off in the middle of the night and your room shakes 3) Every night, my key card needed to be reset. 4) Every night, there was a wedding. It's good for hotel business, but sucks when you're trying to find a parking spot after a long day 5) The cleaning staff kept asking us if we are checking out and they complained all day. 6) Breakfast is over at 10am and at 10am everything is shut down. 7) The rooms are really, REALLY small. 8) No one knew how to take other transportation other than driving and using the GPS",
      "rate": 3.0,
      "tripDate": " August 2018"
    },
    {
      "title": "Stay away... far, far away",
      "text": "This is a worn out property that is poorly maintained, dirty and managed by crooks. I booked this dump through Expedia. And I paid for it through Expedia. When I checked in at the hotel I was a bit put off by the dirty appearance of the lobby and outside areas and there were a lot of men hanging around outside smoking and it seemed a little creepy. So I asked to see the room before signing in. It was tiny so I asked for an upgrade since I planned to stay a week on business and needed space. I agreed to an upgraded room and paying the difference on top of what I already had paid Expedia. That would have been around $11. per night or $77. for the week. When I checked out they handed me a bill of $700. When I said I already paid Expedia they said to take it up with that company, which I did.  It's now been well over a month and Expedia says they have not been able to contact the hotel manager to get a refund. Obviously they (the hotel) are avoiding the issue. The place was a pit. A once grand property that is now dirty and worn out with smelly carpets, moldy bath area and worn out furniture. And operated by crooks. I was double charged and have nothing but legal recourse now since Expedia seems unable or unwilling to deal with the problem, which is a second learning from this experience - Expedia makes almost no effort to address consumer issues like this. Buyer beware! Stay away.",
      "rate": 1.0,
      "tripDate": " July 2017"
    },
    {
      "title": "Worst service ever !!!",
      "text": "When picked up from airport, driver was pulled over at airport for not having proper licensing. Could not even produce a drivers licence. When the driver was able to pull away, the van died. I decided at that point to just get a cab to the hotel, as I was no longer confident in the service of the shuttle. When I arrived at the hotel, I explained the situation to the desk clerk and asked for a refund on the cab fare, as there was a cost for the shuttle service. They refused and were not very cooperative, so I took my business elsewhere.Will never come here again !!!",
      "rate": 1.0,
      "tripDate": " July 2015"
    },
    {
      "title": "Very good value for the money for short stays",
      "text": "Located slightly outside the city and closer to the airport, this hotel's amenities are well above what you'd expect to receive for this much money.The hotel feels grandiose, although a little tired in some areas. The rooms can have a distinct odour of age, but otherwise, it is clean and tidy. The room was one of the largest we've seen in a while, and features pretty much everything you'd need.The breakfast is a little limited, but there's something for everyone. Don't be put off with other people's reviews of \"strange looking people hanging outside the hotel;\" the hotel is close to a race track and gambling sites, so there will be plenty of gamblers staying at the hotel. They may \"look strange\" (whatever that means) but that's about it; they don't bother anyone and don't speak to anyone.Overall, a good choice for short stays in Toronto or Mississauga.",
      "rate": 4.0,
      "tripDate": " May 2015"
    },
    {
      "title": "Great customer service",
      "text": "The staff were very professional, rooms and entire hotel clean and well kept. Very quiet. The hot breakfast was very enjoyable, was able to walk to a near by Jamaican restaurant for other meals. Wish there was a bar or a lounge that we could relax and have some drinks with friends. Also additional help is needed at the front desk when checking in a large group.",
      "rate": 5.0,
      "tripDate": " May 2015"
    },
    {
      "title": "Poor choice for overnight stay",
      "text": "Unfortunately my stay at this hotel was less than satisfying- and I wish I would have read the reviews prior to booking. I was compelled to rate as terrible if it wasn't for the friendly breakfast lady that had a very nice singing voice that I enjoyed listening to (and reasonable breakfast), and improved room cleaning after the first night.At arrival into my room, and the stoic checkin, the first thing I noticed was hair and an unclean bathroom countertop- followed by a musty smell. What made this even worse when I opened my window shade to find out that it looked into the dining room and hallway- not outside. The room temperature seemed uncontrollable, certain channels (like the CBC) did not work, bed and pillows were uncomfortable- and there was no fan in the bathroom to air out steam from the shower or circulate the air (instead there was a fan in the room). I would spend a few extra dollars and trying another hotel and do not recommend this hotel to travelers.",
      "rate": 2.0,
      "tripDate": " March 2016"
    },
    {
      "title": "Horrible",
      "text": "If you like taking ice cold showers, sleeping in rooms where walls almost touch the beds and paper thin walls, then this place is for you! Otherwise, PLEASE do NOT stay here!!! They did nothing about the cold water therefore I could not shower.",
      "rate": 1.0,
      "tripDate": " April 2015"
    },
    {
      "title": "A little too ‘cozy’",
      "text": "My spouse and I decided to head to Toronto and do some shopping for spring clothes for the kids, this hotel was affordable for an impulsive trip and we decided to go ahead and book there.  We didn’t need anything fancy as we were not planning on being at the hotel, except for sleeping.The pros: The room was VERY clean! I travel a lot for work and even in higher end hotel rooms, I don’t usually see such clean bathrooms.  The staff was friendly and, even though I’ve seen a complaint about the fragrance when you enter the building, we personally loved it. To each their own, I suppose! Free breakfast and no fee for parking, that’s nice too.The cons: The very clean room was also very small.  Plenty of storage which is nice, but the room is very small.  It was not well soundproofed and we could hear people above us, beside us and everyone who walked past.  Also, our room shared a large window with the breakfast area so sleeping in wasn’t really an option if you were looking forward to the quiet.  If you’re on a budget and only need a room to sleep in, this hotel isn’t bad! The staff are truly so friendly that it was a pleasure walking in each day.",
      "rate": 3.0,
      "tripDate": " March 2018"
    },
    {
      "title": "NEVER EVER STAY HERE!",
      "text": "THIS PLACE WAS BY FAR THE WORST EXPERIENCE EVER!!! Never ever go here. The rooms are extremely small, and dirty, after sleeping in the beds we were itchy and left with bug bites. The service is terrible and doesn't meet your needs. After travelling all day we were ready to settle down in our hotel, little did they make it aware there was going to be a party downstairs when we booked. Wanting to sleep after being exhausted after a long day we were kept up by the extremely loud floor shaking noise until 2am and when we complained and asked for a refund they refused and said it was not their problem. If I could rate this any less than a 1 I would. If you go here you will regret every second of it.",
      "rate": 1.0,
      "tripDate": " October 2017"
    },
    {
      "title": "NEVER STAY HERE",
      "text": "Terrible experience here. Dont even have it on their website, even though they lied to my face and said they did...that a security deposit of $100 is needed. Further to that they lied to my face about other things and were very rude.I was staying over night from 8pm-6am to write an exam near by. I bought the room on Hotwire because I am low on funds and the rating from hotwire seemed fine. WAS IT EVER WRONG.Not to mention the flooring and walls are cracking. The curtains dont close so you only have those thin white curtains to stop the parking lot lights from coming in which dont work. The \"clean towel\" I unfolded had blood on it!!!!!!! the bathmat was covered in black mould. the toilet plugged and they had \"not staff\" at night to bring a plunger. what about people who need something like an extra mattress or pillow?The owner's son was the manager I spoke with and told me to cancel my reservation and go to another hotel because i did not have enough money to pay for the security deposit even though i paid for the room. they finally let me pay $50 off my debit which was for a bill and so my bill bounced and i was charged $48 NSF. thanks for treating students like trash who are on tight budgets.owner's son was beligerent and rude and would do nothing to accomodate me. i even suggested they take my credit card info down or my license. i am a non smoker and i dont destory things.he said the security deposit was on the website. i just checked it is not. i stayed in the hotel not even 2 days ago. The sheet she made me sign says \"you will be charged 150 if hotel suit is dirty or smoke) and this is also stated on the mirror in the room. the owner's son/manager and the receptionist both tried to tell me this was notice of security deposit. i said no that is notice that i would be charged should those things occur. they continued to say it was notice of the security deposit. i said where does it say \"security deposit\" - no where - it says you will be charged if dirty. They asked about my confirmation print out and it had nohting about a security deposit.i asked how would i get my security deposit back in the morning? does someone even check? she said yes someone goes up and checks the room. THIS NEVER HAPPENED when i checked out the next morning. so they held my money hostage and made a bill bounce for NO REASON!what a shady hotel!!!!!and dont book your function here. the hall is open from the elevator so guests can see your function and ur function like a wedding can see guests and all their luggage going up the elevator in the middle of your event!!!!!! not to mention the disgusting state of the room and linens.the door to the room didnt even touch the floor so you would get light and sound from the hallway. I could hear the neighboring room guests laughing. and hear others having showers. the lock on the door did not look like it worked so i put something in front of the door to feel safe.there were hairs on the wall of the shower.the morning reception didnt know how to return my money onto debit so after trying twice gave me cash.I WILL NEVER STAY HERE EVER AGAIN and i will be reporting them to the Better Business Bureau.",
      "rate": 1.0,
      "tripDate": " February 2016"
    },
    {
      "title": "Good, moderate hotel",
      "text": "We arrived at the hotel in the evening and were greeted by a professional, but not overly warm clerk. Check-in was smooth and we were quickly off to our room.Once inside, I noticed instead of facing the outside, it faced in toward the unused banquet room. I was too tired to care and just made sure to tightly close the blinds. I suppose if they were hosting a function the hotel could get quite loud. The room appeared clean and well maintained, but was cold. Despite my best efforts, I never quite figured out the heating and air conditioning unit. The wifi was easy to use and moved at an average speed for my computer. It was spotty in the room for phone calls over wifi.I give credit to the hotel for trying to serve a hearty breakfast, but the quality isn't there. The eggs didn't appear fresh (possibly powdered?) and the bacon didn't look thoroughly cooked. I decided to stick with the sausage, but my girlfriend had the bacon without complaint. Everything needed reheating despite being over burners. The man running the food didn't appear to care too much.The woman working check-out was fantastic. She was patient and clearly knew her way around the city. I appreciated she came from behind the desk to point out money-saving coupons on the wall for attractions we were interested in.Woodbine offers a great value and as long as you set expectations on a moderate-level hotel, you won't be disappointed.",
      "rate": 4.0,
      "tripDate": " October 2014"
    },
    {
      "title": "DONT DO IT!!!!!",
      "text": "I just stayed at this hotel and had the worst experience of my life. We got to our destination early and were told we would need to pay $10 per hour to check in early. Desk staff range from disinterested to down right rude! They didn't have our reservation from Hotwire and although I had my confirmation refused to help. There is nothing at this hotel for children at all to do. The only good thing I could say is that it was clean. There are several banquet halls,all of them having function the day we stayed, it was very loud and every time someone entered their room in the hall you could hear it loudly in your own room. At one point I left to get a coffee and when I came back there parking lot was full at first the desk staff wasn't helpful but then agreed to let us park in the fire route as there was no where even close by to park. We did however have to climb out of bed after sleeping almost 2 hours at 11:40 pm to move our car from the fire route now that there was more space. The advertising says they have a business center yet the rooms don't have the ability to make long distance calls.... You need to drive if you need anything!!!! I would have been better off making the 3 hour drive home. The desk staff flat out lies to your face assuming nobody who stays there has ever done their job before. Breakfast had a decent selection but hot items were cold. Never again.",
      "rate": 1.0,
      "tripDate": " February 2014"
    },
    {
      "title": "DO NOT STAY HERE",
      "text": "The most disgusting hotel room I have ever stayed in to date. Yellow stains on the bed sheets. Got switched to another room which had even MORE stains on sheets. Horrific customer service that ignored us and gave us attitude once we mentioned the stains. Just a completely awful hotel. Please do yourself a favor and avoid this nightmare of a place.",
      "rate": 1.0,
      "tripDate": " October 2015"
    },
    {
      "title": "Absolutely horrible",
      "text": "Check in was fine. Was told deposit was $100 but ended up being $150. We got into the room and the room was nice but about 32 degrees. Basically was sweating as soon as entering. The tv did not work at all so we called the lady at front desk to look at it...she tried to say the remote was broken but none of the outlets worked to turn the tv on. She proceeded to ask \"do you want the tv though\"?  I told her yes I am paying for a room I want television. Seemed to be a hassle for her to change our room. We got our room switched, tried to turn the heat down but the heater was broken and you couldn't see the numbers for temperature so I had to guess...later on I asked the front desk for an extra pillow. She said \"we have none but want a blanket\". What hotel doesn't have extra pillows. She was very rude about it. My girlfriend went down about 10 minutes later to the desk and asked a male for an extra pillow. He showed up to our room in two minutes with two pillows. I was very angry at the fact I was lied to at first. The beds were rock hard, tv fuzzy, bathroom tiles were all cracked and chipped. Only good thing about the hotel is how close it is to the casino. I wouldn't recommend it to anyone nor will I stay there again. I would love to have my money returned.",
      "rate": 1.0,
      "tripDate": " March 2016"
    },
    {
      "title": "Great breakfast, bad pillows/beds. But close to airport!",
      "text": "I did get this booking very cheap through Hotwire as a mystery booking, so didnt expect too much!! Which is good, because I didnt get too much!!!The breakfast was quite good though, eggs, sausages, toast, pastries, cereals, juice, tea & coffee... that was about the only good thing at the hotel aside from the friendly front counter people.The pillows are like cushions you find on a couch... dont ask for proper sized pillows either, you wont get them - they told us that housekeeping squish the pillows in to the cushion covers for appearance, you can shake them back to full size - UMM, NO!Bed wasnt very comfortable either, so combined with the pillows, it was pretty ordinary!That said, the small room WAS clean and warm, so at least we didnt have to worry about hygiene.Wifi was very slow also.I wouldnt go back there to be honest.",
      "rate": 3.0,
      "tripDate": " April 2015"
    },
    {
      "title": "YOU GET WHAT YOU PAY FOR",
      "text": "First off, I asked for a room next to the elevator. Oh, I didn’t get that. I had to go down the hall around the corner around the next corner and right at the end. Wow.I love my baths. No bathtub.There’s a nice towel rack in the bathroom and it’s way too high. I could barely reach it. What’s with that?There’s a clock radio on the table. Oh my goodness they didn’t even bother to change it back in daylight savings. It’s still an hour ahead.Then, on the bed, there’s no heavy bed cover just the cotton sheets. The pillows were too soft and the bed was too soft. I woke up with a sore back.Then I got to sleep and 3:30 in the morning I hear a cat in heat meowing. I had to call the front desk to see if they can stop it.The breakfast I admit was pretty good. I did know how to use the weird toaster and had to put toast threw 3 times.  So, when I stay here again, not if it was free",
      "rate": 1.0,
      "tripDate": " November 2022"
    },
    {
      "title": "Inexpensive and you get what you pay for",
      "text": "This was rough.  I had a room near the entrance to the rooms.  1. cleanliness was not the best.  hair left in the tub, sheets were questionable, lack of attention to details.  2. no outlets near the bed as i was on a business trip and would have enjoyed to work from my bed.  3. smelled old4. I thought i would get some sunshine and lo and behold when i opened the curtains i found that my windows led into the dining hall.  Quite amusing actually and closed them really quick.  It was also in the middle of nowhere but i only needed the room for one night.  If you are looking to get in and out then its ok.",
      "rate": 2.0,
      "tripDate": " January 2020"
    },
    {
      "title": "Great accommodations close to airport",
      "text": "Warm, efficient and quick check in. A short Uber ride to the airport, location was perfect for me with a Tim Horton's coffee shop almost next door and a large shopping mall one km away. Room was clean, spacious and great wifi. Refrigerator, microwave and coffee maker was perfect for my three day stay. My room was also quiet. Bed comfy, lots of towels and toiletries in the bathroom.  Staff super friendly and helpful.",
      "rate": 5.0,
      "tripDate": " July 2022"
    },
    {
      "title": "No rooms despite reservation. Sleep in foyer for all they cared",
      "text": "We arrived at check in with my business team at midnight after a long flight only to be told our booked rooms were no longer available. Yep, no room despite pre booking and pre paying. Worse, the guy at reception wasn't interested in finding solutions aside from sending an email to Expedia. Do not stay at this terrible hotel. Guests mean zero to them.",
      "rate": 2.0,
      "tripDate": " June 2022"
    },
    {
      "title": "Decent Hotel",
      "text": "The room was clean overall, but the shower was a little dirty. The AC is right above the bed and is very strong, which made me cold all night. You can hear through the walls as they were very thin. The bed was comfortable and breakfast was average. Overall, for Toronto it is a decent value.",
      "rate": 3.0,
      "tripDate": " September 2023"
    },
    {
      "title": "Terrible stay",
      "text": "It was a pretty hotel but the service sucked and not friendly at all… sliding chairs and tables across the floors at 6 am. Didn’t tell the kids to stop running the halls at 2 am and 5 am. Very loud and noisy place. The washroom was dirty and it was a musty smell in the room. The customer service took the top… it was terrible and not friendly at all",
      "rate": 1.0,
      "tripDate": " August 2022"
    },
    {
      "title": "Expedia led us wrong!!",
      "text": "I would not recommend this Hotel. It did not have a good feeling.After a long travel day we arrived and did not notice our bed and simply dropped our things off and went to dinner.Upon returning we unfolded the bedding and noticed several spots and a hair under the sheets along with what appeared to be lipstick on the top.Trying to get help to exchange the bedding took a better part of an hour only to be handed 1 fitted sheet. This place is clearly unorganized understaffed and very tired and I would say not the cleanest!!!In fact I’m sure I bed was never changed out from previous guests!!And we cannot get a refund!! Never ever again!!",
      "rate": 1.0,
      "tripDate": " August 2023"
    },
    {
      "title": "Not what expected. ",
      "text": "Not a good feeling at all. Some of the front desk staff were pretty rude and unfriendly. Craziest thing, we opened our curtain to see that there were people sitting at a table on the other side. We had a leak in our ceiling but the staff did fix it while we were out for the day. Pics when booking were deceiving.",
      "rate": 2.0,
      "tripDate": " October 2023"
    },
    {
      "title": "Terrible stay! Rude staff, wrong room and denied breakfast! Unprofessional.",
      "text": "Do NOT stay at this hotel, I had to write this review because I am still disgusted by the way my family was treated last week by the hotel's staff.My family always stays here when they come to Toronto but this will be their last time. 1. Upon booking the room, an employee promised a particular room and upon arrival denied ever saying that - thank God it was in writing in an email. 2. Was directed to the wrong room which reeked of cigarettes. 3. Finally the took them to the room they were supposed to get, (which they were telling them all along), and they room did not have a pullout like it used to. 3. The children were forced to sleep on a rollaway, they had a terrible trip.4. The breakfast lead, Ms Gloria refused my family food, insulted my niece by saying she was an unfit mother because she didn't grab food for her youngest kids when she was down there hours earlier. Her colleagues ran in and asked what food she had for them and in front of my niece showed them all the warm food she had stored in the back for them to eat. It was foul behaviour and I hope management reprimands their staff and compensates my family for this terrible experience.This establishment is a joke! The General Manager who cannot be reached because he is working on another project in Barrie owns my family a HUGE apology. I have personally stayed at this establishment in the past but after this experience I will never stay here or recommend it to anyone I know. I tried contacting head office but they are independently owned. I really hope the GM or the owner contacts my family to discuss their experience in more detail.",
      "rate": 1.0,
      "tripDate": " April 2015"
    },
    {
      "title": "Horrible, bed bugs, don't go there!!!",
      "text": "We stayed one night and wake up with two bed bugs and blood on the sheet. If that wasn't enough, we had to wait 2 hours for the manager to finally get a 20% off........!!!Worst place I've ever been to, please don't go.",
      "rate": 1.0,
      "tripDate": " July 2016"
    }
  ]
}