{
  "basic_data": {
    "@context": "https://schema.org",
    "@type": "LodgingBusiness",
    "name": "Yonge Palace",
    "url": "/Hotel_Review-g155019-d12449527-Reviews-Yonge_Palace-Toronto_Ontario.html",
    "aggregateRating": {
      "@type": "AggregateRating",
      "ratingValue": "2.5",
      "reviewCount": 15
    },
    "address": {
      "@type": "PostalAddress",
      "streetAddress": "219 Doris Ave",
      "addressLocality": "Toronto",
      "postalCode": "M2N 0K4",
      "addressCountry": {
        "@type": "Country",
        "name": "Canada"
      }
    },
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/15/f4/7d/5d/our-room-the-final-day.jpg?w=500&h=-1&s=1"
  },
  "description": null,
  "featues": [
    "Paid private parking on-site",
    "Free High Speed Internet (WiFi)",
    "Children Activities (Kid / Family Friendly)",
    "Baggage storage",
    "Non-smoking hotel",
    "Air conditioning",
    "Desk",
    "Fireplace",
    "Clothes rack",
    "Wake-up service / alarm clock",
    "Flatscreen TV",
    "Hair dryer"
  ],
  "reviews": [
    {
      "title": "Quite weird experience ",
      "text": "Where to start ... 1. This House Had no indication it was a hotel since there are no signs outside 2. Breakfast was awful. Everyone in dining room was stalked by the owner who didn't speak English, and was breathing on my neck while I was making coffee, as if I was going to break machine. Huge peanut butter containers on the table (like I am going to eat where everyone was dipping forks or knives), huge tubs of cheap margarine to be shared by everyone, no sugar , no tea bags just loose tea, no spoons ! There was box of muesli , but how are you suppose to eat it without spoon or a bawl ? Seriously ? ... there were plastic forks, silverware knives , some random mugs... one bag of bread was moldy ... and in the same area there was a toilet cleaning brush on the floor by the couch. It was so weird ...3. Owner asked my child not to run, but he was very well behaved. 4. You had to take off shoes and walk around in some slippers 5. Upon arrival there was no soap or shampoo in the bathroom, no plug in the tub, there was also black hair in the tubI got tired of writing negatives , trust me there is more ... but the room was spacious and we slept well ... not returning since the owner was quite rude. i think they are in wrong line of business",
      "rate": 2.0,
      "tripDate": " July 2017"
    },
    {
      "title": "It’s not a hotel! It’s only a large house in good location!",
      "text": "I spent there six night and I cant say that all part of my experience was good. At first there was not a sign of hotel. I reserved an room for one person room was spacious, but the size of bed was not suitable for 2 person.The rest of experience was not good . They did not clean our room and also they did not even take the garbage.’breakfast was good , which it was home made, but unstable one day there was no coffee there.Location was great.",
      "rate": 2.0,
      "tripDate": " June 2019"
    },
    {
      "title": "Good location but...",
      "text": "This small hotel is conveniently situated on major bus route from airport and close to subway. The exterior appearance is attractive, but the interior less so with quite a few \"short cut\" renovations apparent (roughly cut, crooked wall-to-wall carpet in room)  Notices/signs posted throughout hotel listed offenses (including fines)  and other \"rules\" in unwelcoming manner including clogging toilet or leaving window open longer than one hour. And it was very hot!! (in winter). Worst of all, room was unclean (large smear on bedside table, dirt on back of toilet, dirty shower glass and garbage under bed and bedside table (water bottles,wrappers).",
      "rate": 3.0,
      "tripDate": " November 2018"
    },
    {
      "title": "Disappointed",
      "text": "This tiny hotel was hard to find. I was completely lost. I had to ask several people on the street where this place was. No one seemed to know. I even got help from a security guard from the building across the way. He even let me borrow is cell to call the place, which no one answered or is there an answering machine. I finally found the place, there is no reception or front desk. I finally found the owner after searching upstairs , down the hall and down stairs. He barely speaks a word of English. Things there was so disorganize and the cleanliest of the place was horrible. The room didn't look like any of their pictures they have online. There was no hot water, the bed didn't look like it was clean and the sheets look awful. I left and no was at reception again. The guy whom i spoke with was no where to be found. I wasn't going to stay at a hotel that looked insecure. DO NOT GO HERE",
      "rate": 1.0,
      "tripDate": " March 2019"
    },
    {
      "title": "Worst Night ",
      "text": "We arrived very late as our flight arrived at Pearson around 10.  They were aware of our late arrival.  Upon entering the building we were struck by the vintage of the building and how well it had been cared for.  Very clean.  Right to the point of our having to remove our shoes...they supplied slippers.  On entering our room we found it to be small for a delux suit but clean.  They to our horror we discovered we were actually going to sleep on a box spring.  Have no idea were the matress went.  The bathroom while on first look seemed upgraded and nice was in fact falling apart.  Ceiling had dry wall falling down.  Shower door was held in place by tape.  Sign in room stated that if we plugged the toilet we would be charged 100.00.   It was the worst night sleep we have ever had.  Now looking for a Chiropractor.  We paid top dollar for a basement room in what could have been a really nice quaint hotel suit.  Would not suggest anyone stay.",
      "rate": 1.0,
      "tripDate": " November 2017"
    },
    {
      "title": "clean, good location, but not a comfortable stay",
      "text": "Very clean, small (12 room), good location setting, but room had very poor insulation, we heard noise from adjoining or upstairs room, when people were taking showers, we could hear the pipes as if it was in your own room, no drawers to put away clothes (only closet with hangers), spotty internet connection, no mirror in the room, extra charge for parking, no advance notice to bring slippers, as shoes are not allowed (they offer slippers, but I would have preferred to have my own), room was very warm and there was no thermostat to control it, breakfast very spare, would not recommend it and would not return.",
      "rate": 2.0,
      "tripDate": " November 2017"
    },
    {
      "title": "NOT A HOTEL, COULD BE A NICE B AND B IF UPGRADED AND ACCOMMODATIONS FOR THE ELDERLY AND HANDICAP!!!!!!",
      "text": "Why would the website  booking.com ,,,have this place listed ?  It is poorly staffed with people  who don't speak English nor understand.    They take your money and then service you poorly.  Action should be taken to remove this place from advertising and deceiving people about it being a hotel  It could be a very nice B and B with upgrades, ammenties and people who care about people with respect. And  also speak a language that is understandable.  Please read reviews people before your  make reservations.",
      "rate": 1.0,
      "tripDate": " August 2019"
    },
    {
      "title": "Dissapointed",
      "text": "This is not a Hotel. Maybe a cross between a B&B and and hostel. The house is nice enough and clean enough but it looks like the renovations were done by two different people and one of them was really on a budget. The carpets, the lawn, the lack of a reception, the makeshift parking lot, are all detrimental to the quality of the stay, but nothing like the ineptitude of the owners, who barely speak english, and make very little effort to make themselves understood. Thats something that normally wouldnt bother me if I could spot even a smidgen of charisma, but hospitality is definitely not their strong suit. I felt rushed in, rushed out; unwelcome. Upon checkout they made a huge fuss because we wanted to pay half cash half debit since we were 2 people and in our conversation (that we had with a translating device) he borderline insulted me a couple times. I could give him the benefit of the doubt and say the machine mistranslated, but his body language said otherwise. Its a damn shame this place is run by people who clearly know nothing aboutthe hospitality business because the house has a lot of potential. Not worth the 95 bucks per person we spent. Take your money, pay a bit more and stay somewhere else if you want a hotel experience; this is far from it.",
      "rate": 2.0,
      "tripDate": " July 2019"
    },
    {
      "title": "Great price, with a lot of 'character'",
      "text": "This establishment is best described as a cross between a B&B and a large Airbnb.Have your driver license and the credit card that you have booked with at check in with you.Our hostess was very friendly and accommodating and helped us to get settled in.The rooms lack door handles and are accessed by an electronic door pad. The tile flooring is covered with a somewhat ill shaped piece of carpet. Our king size bed had clean sheets and duvet, more pillows and an extra duvet was delivered on request, and the mattress, while hard, was very comfortable. Two chairs, a small commode and a small ottoman furnished the room.A small coffee maker with a selection of tea and coffee is provided.Our basement room also had a small walk in closet, in which, during our stay, a double bed frame was being stored.The bathroom was well lit and clean, with a spacious walk in shower unit, that came supplied with shampoo, conditioner and soap.While there is no mini fridge, there is a large communal fridge/freezer upstairs available to use by guests.The main lounge/breakfast area is located on the main floor. A  breakfast of a variety of cereals, muffins, donuts, sliced artisanal bread, hard boiled eggs, bananas is served here from 7.30-9.00. Coffee, tea, milk, cream and margarine is also available. Three large dining tables and a couple of lounge sofas provide plenty of space to eat and socialize.After 09.00 you will be charged for breakfast!Checkout is at 12.00 and as there are no keys or key cards one just simply walks away.Parking is free of charge, however, there is limited space and those with large trucks might have an issue.North York centre is only a five minute walk away, providing access to just about every shopping need, a movie theater and the TTC.This is not a luxury accommodation but rather a very affordable, about half the price of a standard Toronto Hotel room,, clean, well run, if somewhat quirky, place to spend a few nights while visiting the city.Come with an open mind, respect the house rules and you will not be disappointed.",
      "rate": 5.0,
      "tripDate": " April 2019"
    },
    {
      "title": "Not Luxury At All, But Nice For Family",
      "text": "This boutique hotel has organized by a good and gentle chinese man. He demonstrated his hospitality although his english language was not good at all. This facility has lots of rooms which are well organized and so clean and almost well-equipped except fridge/mini bar. You also can not find any safe box inside the room. Of course I have doubt you need it! Immediately after entrance, you feel yourself at a clean home, you ought to put your shoes off and put them in a prepared cabinet, so you may find several slippers with your size for indoor area. There is a breakfast area on the left and a round beautiful staircase to the second floor which our room was there. There is no more servants or service staff and it seems the landlord is responsible for everything!Foe example he carried one of our baggages to the room at 2nd. floor by himself. Thanks to him! In Ground floor, there is a small fridge and microwave oven for public use. If you have any leftover or other types of food/fruits/drinks, you can put them during your stay. Our room (9003) , was so clean and equipped with routine stuff for Bedroom, bathroom and toilet. The room has a smart TV with almost 25-6 public channels, not special or paid one. There is free WiFi at the room and hotel area. He gave us a sheet of paper with all laws and regulations during staying at hotel. The door of every room has a 4 digit code for opening which is told to everyone. The most important thing/regulation at this hotel is : Not allowed any noise or disturbance during 11 pm - 7 am. So behave your noisy walking! I myself think it is a good law. The breakfast menu is not so wide, so your choices does could not have so variety.You can park your car in front of hotel in a private area. The position of hotel is so nice and quiet. If you need something urgent, you can easily access to Metro supermarket in 5 min walk. Overall, we were staying 3 night there and satisfy. The price for 3 night was about 400 CAD comparing with minimum 700 CAD for an ordinary hotel near that area (North York). It is recommendable.",
      "rate": 4.0,
      "tripDate": " December 2018"
    },
    {
      "title": "A Different Experience!",
      "text": "If you are a traveler needing to be catered to, this is not for you. If you would be a guest respecting your hosts customs, it could be a novel experience. Sandals are provided to replace your shoes given up on entry. A beautiful stone building hidden behind tall pines. Rooms converted to hotellery in quirky ways, but with new fixtures, marble, hardwoods, and crown molding. Housekeeping not included, but new towels provided on request. Why spend $300 per night downtown, when a $3 subway ride takes you within a block of the Yonge Palace!! Clean - Safe - Affordable.",
      "rate": 4.0,
      "tripDate": " September 2017"
    },
    {
      "title": "Very good, clean.",
      "text": "The hotel was very well located  for north Toronto with beautiful side streets.Close to subway, Empress Walk which provided some shops and places to eat, Mel Lastman Square and the Gibson House.Also, if you are a music fan, not far away approximately a 2 minute walk you will find the Lee Lifeson Park, which was commemorated and named after  the Canadian group Rush.The hotel is very clean and the staff friendly and helpful.A few minor things: the breakfast could of added some juice, room could be cold due to central air conditioning, tv has not many channels.Otherwise excellent, Thank You Yonge Palace.",
      "rate": 4.0,
      "tripDate": " August 2017"
    },
    {
      "title": "clean but costly",
      "text": "The place is small (very small, I guess 6 rooms overall), but clean. Anyway, there are some disadvantages. a) the breakfast is really poor: there was tea, but in leaves (no way to filter them away), there was not even a juice or room temperature water (just tap water), the danish pastry (indeed the only pastry available) seemed outdated (at least dated) and the only thing that could be added to the bread was one (1) strawberry jam.b) the water drops of the shower of the nearby room seems inside the room (indeed I thought my shower was left open...) c) the bed was probably the hardest I have ever slept ind) there is no privacy at all (our room had 3 large windows directly on the street, so the curtain could not be opened)",
      "rate": 2.0,
      "tripDate": " August 2017"
    }
  ]
}